{"url": "https://www.baaa-acro.com/crash/crash-antonov-12bk-lviv-5-killed", "date": "Oct 4, 2019 at 0648 LT", "type": "Antonov AN-12", "operator": "UAA-Ukraine-Air-Alliance", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Vigo - Lviv - Bursa", "msn": "8345604", "yom": 1968, "flight_number": "UKL4050", "city": "Lviv-Danylo Halytskyi", "zone": "Lviv Oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 6750, "captain_hours_type": 6570, "copilot_hours": 14670, "copilot_hours_type": 9620, "aircraft_hours": 12922, "circumstances": "On 03.10.2019, the crew of An-12BK UR-CAH aircraft operated by PJSC «AIRLINE «UKRAINE-AIR ALLIANCE», consisting of flight crew members and two aircraft technicians, performed flight UKL4010 en-route Toronto (Canada) - Toulouse (France) and at 06:15 UTC, it landed at the Toulouse aerodrome (France). The plane delivered 1537 kg cargo to the Toulouse aerodrome (France). After the completion of post-flight procedures, the flight crew went to rest at the hotel, while the technicians remained on the aircraft to perform technical works. The next flight was scheduled from Toulouse to Birmingham airport (Great Britain). However, during the day, at the initiative of the operator, it was decided to change the route and perform the flight en-route Toulouse - Vigo (Spain) - Istanbul (Turkey). At the Toulouse aerodrome, the plane was filled with 6,000 liters of fuel. Also in Toulouse, a flight engineer was replaced. At 16:16 UTC, the plane took off from Toulouse to Vigo without cargo. Landing at the Vigo aerodrome (Spain) was performed on 03.10.2020 at 18:20 UTC. At the Vigo aerodrome, the plane was loaded with vehicle spare parts with a total weight of probably 14078 kg. From the Vigo aerodrome (Spain), the plane took off on 03.10.2019 at 22:20, flight UKL4050, with a delay of 2 h 20 minutes. On 04.10.2020, at 03:17:29 UTC, the plane approached the airspace border of the Lviv control area. The crew contacted the controller of the Lviv ACC of LVE + LVW sector and reported about the approach to waypoint MALBE at FL250. The controller informed the crew about the establishment of the radar identification of the aircraft and instructed to wait for the procedure for radar guidance to RW-31 using the ILS system. At 03:20:27, under instruction the ACC controller, the crew listened to the ATIS \"Romeo\" information as follows: “Lviv, ATIS “Romeo” for 03:20. The ILS approach at the aerodrome uses low visibility procedures. Runway in use is RW-31. Runway surface condition known at 19:53 - wet, clear. The measured friction coefficient is 0.55. Estimated surface friction assessed as good. Transition level - 110. Warning: large flocks of birds in the aerodrome area and on the landing final. There is no wind. Visibility - 150 meters; visibility range on the runway at the touchdown point - 550 meters, in the middle of the runway - 550 meters, at the end of the runway - 550 meters, fog. Vertical visibility - 50 meters. Temperature + 3ºС, dew point + 3ºС. Atmospheric pressure QNH - 1013 hectopascals, QFE - 974 hectopascals. Weather forecast for TREND landing: visibility sometimes is 400 meters, fog; vertical visibility - 60 meters. Attention: the frequency \"Lviv-taxiing\" does not work, while taxiing, get in touch with the \"LvivTower\" at a frequency of 128.0 MHz. Please acknowledge receipt of Romeo's information.\" ATIS information was transmitted in English. At 03:22:14, the crew informed the controller about the completion of listening to ATIS information and received clearance to descend to FL120. At 03:22:40, the aircraft began its descent from FL250 and at 03:28:35 switched to the frequency of the ACC controller of the LVT sector. After contacting the controller of the ACC of the LVT sector, the crew reported a descend to FL120 to KOKUP point. At 03:29:08, the ACC controller of the LVT sector instructed the crew to continue descending to an altitude of 10,000 feet at atmospheric pressure QNH-1013 hPa, reported the transition level, and instructed to wait for radar guidance for ILS approach on RW-31. The crew confirmed the instruction to descent to 10,000 feet, QNH, transition level and reported expectation for radar guidance. At 03:30:14, LVT sector ACC controller began radar guidance. At 03:32:49, the controller instructed the crew to descend to 4,000 feet. At 03:35:33, LVT sector ATC controller instructed to descend to an altitude of 3200 feet, taking into account the temperature correction. The procedure for temperature correction at  determination of flight levels by an air traffic controller during the radar vectoring was published in the Aeronautical Information Publication of Ukraine, UKLL AD 2.24.7-1 dated 12.09.2019. At 03:38:33, the ATC controller of the LVT sector provided the crew with information about its location of 27 km from VOR/DME LIV, instructed by the left turn to take a 340º heading, cleared the ILS landing approach to runway 31 and gave the control instruction to inform of “the localizer beam capture.” At 03:40:01 (the height above the runway was 1170 m, descent rate: -4 ... -4.5 m/s, speed 352 km/h, distance from the runway threshold: 15.7 km), the crew reported of the localizer beam capture. At 03:40:09, ATC controller of LVT sector instructed the crew to continue the ILS approach to RWY 31. At 03:40:26, the controller informed the crew about the weather conditions at the aerodrome: RW-31 runway visual range (RVR) in the touchdown zone – 800 meters, in the middle of the runway – 800 meters, at the end of the runway – 750 meters, vertical visibility – 60 meters, fog. The crew confirmed receipt of the information. At 03:41:22, the ATC controller of LVT sector instructed to switch the communication to the ATC Lviv controller at a frequency of 128.0 MHz. There were no irregularities in air traffic servicing of the An-12 aircraft, flight UKL4050, during the flight in the area of responsibility of the TMA Lviv \"LVT\" sector. To enter the glide path, the PIC increased the vertical descent rate. At 03:41:47, the crew established communication with the Tower controller. The distance from the threshold was 11.3 km, the elevation over the glide path was 70 m, the vertical rate of descent was -5.5 ... -6 m/s. After communication with the air traffic controller, the crew reported an ILS approach to RW-31 and the atmospheric pressure QNH setting of 1013 hPa. At 03:41:58, the Tower controller informed the crew about the absence of wind on the surface of RW-31 and gave clearance to land. The crew confirmed the landing clearance. According to the recorders, at this time the distance to the touchdown point was 7.58 km, the plane was 11 m below the glide path, the vertical descent rate was -4.5-5.5 m/s, and the speed was 290 km/h, the flight heading – 315º. At a distance of 5.0 km to the touchdown point, the plane was 25 m below the glide path. At a distance of 3 km from the touchdown, the plane descended to an altitude of 105 meters and continued the flight with the constant descent. At an altitude of 60 meters, an audible alarm was triggered on board the aircraft, when the decision height had been reached, to which none of the crew members responded. At a distance of 1348 meters from the threshold of the RW-31, at an altitude of 5-7 meters, the aircraft collided with trees, fell to the ground and came to rest at a distance of 1117 meters from the runway threshold. All three passengers were seriously injured and all five crew members were killed. ", "probable_cause": "The most probable cause of the accident, collision of a serviceable aircraft with the ground during the landing approach in a dense fog, was the crew’s failure to perform the flight in the instrument conditions due to the probable physical excessive fatigue, which led to an unconscious descent of the aircraft below the glide path and ground impact (controlled flight into terrain).\r\nContributing Factors:\r\nProbable exceeding the aircraft takeoff weight during departure from the Vigo Airport, which could result in increase in consumption of the fuel, the remainder of which did not allow to perform the flight to the alternate Boryspil aerodrome."}