{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-oklahoma-city-0", "date": "Dec 21, 2012 at 1000 LT", "type": "Cessna 550 Citation II", "operator": "US%20Customs", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Oklahoma City - Oklahoma City", "msn": "550-0109", "yom": 1980, "flight_number": null, "city": "Oklahoma City-Will Rogers", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5097, "captain_hours_type": 420, "copilot_hours": 357, "copilot_hours_type": 357, "aircraft_hours": 13506, "circumstances": "While on the right downwind leg, the flight crew advised the air traffic control tower controller that they would make a full stop landing. The tower controller acknowledged, told them to extend their downwind, and stated that he would call their base turn. The controller then called out the landing traffic on final, which was an Airbus A300-600 heavy airplane. The flight crew replied that they had the traffic in sight, and the controller cleared the flight to land behind the Airbus, and to be cautious of wake turbulence. The flight crew observed the Airbus abeam their current position and estimated that they made their base turn about 3 miles from the runway. Before turning onto final approach, the flight crew discussed wake turbulence avoidance procedures and planned to make a steeper approach and land beyond the Airbus's touchdown point. They also added 10 to 15 knots to the Vref speed as an additional precaution against a wake turbulence encounter. The reported wind provided by the tower controller was 180 degrees at 4 knots. The flight crew observed tire smoke from the Airbus as it touched down and discussed touching down beyond that touchdown point. The tower controller advised the flight crew to be prepared for a go-around if the Airbus did not clear the runway in time, which the flight crew acknowledged. The flight crew estimated that the Airbus had turned off the runway when their airplane was about 1,000 feet from the threshold and about 200 feet above ground level (agl). The flight crew reported having a stabilized approach to their planned landing point. When the airplane was about 150 feet agl and established on the runway centerline, the airplane experienced an uncommanded left roll. The heading swung to the left and the nose dropped. The crew reported that the airplane was buffeting heavily. Immediately, they set full power, and the flying pilot used both hands on the control wheel in an attempt to roll the airplane level and recover the pitch. He managed to get the airplane nearly back to level when the right main gear struck the ground short of the threshold and left of the runway. The airplane collided with a small drainage ditch and a dirt service road, causing the right main gear and the nose gear to collapse. Videos from cameras at the airport recorded the accident sequence, and the accident airplane was about 51 seconds behind the Airbus. A wake vortex study indicated that the accident airplane encountered the Airbus's right vortex, and the airplane's direction of left roll was consistent with the counter-clockwise rotation of the right vortex.", "probable_cause": "The flight crew's decision to fly close behind a heavy airplane, which did not ensure there was adequate distance and time in order to avoid a wake turbulence encounter with the preceding heavy airplane's wake vortex, which resulted in a loss of airplane control during final approach."}