{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-2m9-rio-branco", "date": "Jan 26, 2003 at 1415 LT", "type": "Boeing 737-200", "operator": "Vasp", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Belém – Manaus – Rio Branco", "msn": "21236", "yom": 1976, "flight_number": null, "city": "Rio Branco-Plácido de Castro", "zone": "Acre", "country": "Brazil", "region": "South America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 89, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7120, "captain_hours_type": 5271, "copilot_hours": 1348, "copilot_hours_type": 310, "aircraft_hours": 54989, "circumstances": "Following an uneventful flight from Manaus, the crew started the descent to Rio Branco-Presidente Médici Airport runway 06 in marginal weather conditions with limited visibility due to fog. After passing the MDA at 1,150 feet, the crew continued the approach with an excessive rate of descent of 1,222 feet per minute. At a height of 57 feet, the aircraft struck trees located 360 metres short of runway 06 threshold. The engines lost power, the aircraft lost speed and height then struck the ground about 100 metres short of runway. Upon impact, the undercarriage were torn off and the aircraft slid on a distance of 600 metres before coming to rest. All 95 occupants escaped uninjured while the aircraft was destroyed.  ", "probable_cause": "Poor approach configuration on part of the flying crew who continued the approach after passing the MDA at 1,150 feet while the aircraft was not stabilized and the crew did not establish a visual contact with the obstacles on short final. The following contributing factors were identified:\r\n- Following the first impact with trees, branches and pieces of wood entered the engines, causing a loss of power followed by a loss of speed and altitude,\r\n- Complacency on the part of the crew,\r\n- Pressure and stress,\r\n- Visual perception issues, \r\n- Violation of the standard operating procedures, \r\n- Loss of situational awareness, \r\n- Lack of crew resources management,\r\n- Poor approach and landing planning, \r\n- Poor weather conditions, \r\n- Relative low experience of the copilot. "}