{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-62-new-york", "date": "Sep 15, 1970 at 1321 LT", "type": "Douglas DC-8", "operator": "Alitalia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rome - New York", "msn": "46026/452", "yom": 1969, "flight_number": "AZ618", "city": "New York-JFK", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 146, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13310, "captain_hours_type": 1362, "copilot_hours": 8114, "copilot_hours_type": 247, "aircraft_hours": null, "circumstances": "Alitalia Flight 618 departed Rome at 10:22 local time for a non-stop flight to New York. The en route and descent were normal. After having descended to 6000 feet, the crew listed to the ATIS: \"The seventeen hundred zulu weather Kennedy six hundred scattered measured ceiling eight hundred overcast four miles fog the winds are two one zero degrees at three and the altimeter three zero one five temperature seventy three expect ILS four right approach landing runway four right. Notice to Airmen glide slope out of service.\". About this point in the flight, the first officer, at the request of the captain, took over the flight controls. He disengaged the autopilot and proceeded to comply with the various vectors provided by the approach controller. At 13:07 the controller instructed the flight to increase airspeed from 210 knots to 250 knots. Five minutes later the flight was instructed to reduce the speed to 200 knots. At 13:18:05, the flight was advised, \"Alitalia six eighteen you’re three and a half from the marker, turn right zero two zero, cleared ILS four right approach.\" The DC-8 broke through the clouds at about 600 feet. The runway was in sight, but the plane appeared to be high and slightly on the right. The captain decided to perform a steep approach and took over the controls. He put the four engines at idle-reverse, then selected reverse thrust on Nos. 2 and 3 engines, deciding to select forward thrust when on the proper slope. too busy in rotating the aircraft, the captain could not leave the controls to regain forward thrust. The plane touched down very hard started to yaw to the left. It ground looped and came to rest with the fuselage split open aft of the wing and three out of four engines separated.", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was the use of reverse thrust in flight, contrary to published procedures, with a resultant uncorrectable high sink rate. The captain's decision to use reverse thrust and not to execute a missed approach was a reaction under stress occasioned at least in part, by Air Traffic Control (ATC) instructions which led to positioning the aircraft too high and too close to the runway. ATC vectored the aircraft to the final approach path under IFR conditions and in the absence of an operating ILS glide slope."}