{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-32-la-planche-68-killed", "date": "Mar 5, 1973 at 1352 LT", "type": "Douglas DC-9", "operator": "Iberia-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Palma de Majorca - London", "msn": "47077/148", "yom": 1967, "flight_number": "IB504", "city": "La Planche", "zone": "Loire-Atlantique", "country": "France", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 61, "pax_fatalities": 61, "other_fatalities": 0, "total_fatalities": 68, "captain_hours": 6612, "captain_hours_type": 823, "copilot_hours": 3378, "copilot_hours_type": 2278, "aircraft_hours": 10852, "circumstances": "Iberia Flight 504, a DC-9, departed Palma de Majorca at 11:24 for a flight to London. At 12:19 the crew contacted Marina Control and reported at FL310, estimating at Nantes VOR at 12:52. At 12:36 the crew were told to contact Menhir Control and descend to FL290. At the same time a Spantax Convair CV-990, flight BX400 heading for London, was flying towards the Nantes VOR on the same altitude, but on a different airway. Because of this, the Convair crew were instructed arrive at the VOR at 13:00. Because the Convair was already quite close to the VOR the crew asked for confirmation of these instructions. At 12:40 the controller told them to 'Stand by' and replied two minutes later. Because the aircraft was at the ATC sector boundary the crew could barely hear the Marina controller who instructed them to contact Menhir control. The pilot erroneously thought he had to contact Menhir control when passing the Nantes VOR. In order to delay their arrival at the VOR the Spantax crew twice tried to request permission to carry out a 360-degree turn. When they did not get any answer from Marina, they initiated the turn without clearance. While in the midst of an overcast, the Convair collided with the DC-9. The CV-990 lost an outboard portion of its left wing and managed to carry out an emergency landing at Cognac-Châteaubernard Air Base (CNG). The DC-9 lost control and crashed. The air traffic control system had been taken over that day by military personnel because of a strike of the civilian controllers. The wreckage of the DC-9 was found in La Planche, about 25 km southeast of Nantes. All 68 occupants have been killed. ", "probable_cause": "The Clement Marot Plan, the military contingency system to replace the civil air traffic services units in the event of a strike, by the very reason of its exceptional nature implied the use of rigorous planning traffic limitation per sector on the basis of control capacity and particularly strict compliance with the special regulations of the RAC-7 plan. The assignment of the same flight level by the control to the two aircraft IB 504 and BX 400, due to arrive at Nantes at the same time, created a source of conflict. The solution chosen by Menhir to resolve the conflict was based on separation in time. This solution, because of the reduction in normal separation, necessitated either particularly precise navigation by the crew of BX 400 or complete radar coverage and, in both cases, trouble-free communication facilities, conditions which were not realized. The continuing progress of the flight was affected by delays attributable in part to the control, in part to the crew and also to difficulty in air/ground radio communications resulting in complete failure of the crew and the control to understand one another. At the critical juncture, the crew, unmindful of their exact position, commenced a turn in order to lose time, without having been able to obtain the agreement of the control, as a result of which the aircraft interesected the adjacent route. The unidentified aircraft whose return appeared on the radar scope of one of the Menhir sub-sectors was' not identified by Menhir control as BX 400."}