{"url": "https://www.baaa-acro.com/crash/crash-vickers-806-viscount-johannesburg", "date": "Oct 20, 1957 at 1100 LT", "type": "Vickers Viscount", "operator": "Vickers", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Johannesburg - Johannesburg", "msn": "255", "yom": 1957, "flight_number": null, "city": "Johannesburg-Oliver Reginald Tambo (Jan Smuts)", "zone": "Gauteng", "country": "South Africa", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was temporarily based at the Jan Smuts Airport where the manufacturers were conducting experimental flights which included measured takeoff s and landings. The data had to be obtained for incorporation in the Aircraft Flight Manual to be associated with the certification for public transport operation. The aircraft was being operated in the special categories Research or Experimental and Demonstration. The captain was cleared to use runway 03, the main instrument runway, and took off at 1040 hours on an experimental flight. After completing a circuit, the captain was cleared to land back on runway 03. He approached the runway, holding at 300 - 400 feet until he passed over the threshold. At this point the angle of descent increased to about 45°. The descent continued until the aircraft was about 70 feet above the surface of the runway where it leveled out, but the path of descent appeared to remain fixed at about 45° until touchdown where upon the main bogies appeared to move rearwards and inwards with the starboard side moving rearwards somewhat further than the port side. After this the aircraft bounced a few feet before settling down further along the runway. At this stage heavy smoke was emitted from both bogies as the aircraft continued forward. It finally swung to the right and off the runway and came to rest on a heading of 180° M at a point approximately 1,590 yards from the threshold. No one was killed or injured, but the aircraft was substantially damaged.", "probable_cause": "The misjudged roundout resulted in a heavy landing which caused the star- board undercarriage to collapse. "}