{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-36a-marquise-santa-barbara-4-killed", "date": "Jun 28, 1991 at 2314 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Jones Air Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Santa Monica - Santa Barbara", "msn": "726", "yom": 1978, "flight_number": null, "city": "Santa Barbara", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1730, "captain_hours_type": 230, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After departing Santa Monica at night, Mitsubishi MU-2 pilot contacted tracon for clearance thru TCA at 6,500 feet. Tracon tried to get automated VFR handoff to ARTCC, but was unable. Radar service was terminated and pilot contacted (non-radar equipped) Santa Barbara FSS (home airport). He was advised weather was 500 feet scattered, 2,700 feet broken, 4,000 feet overcast, visibility 6 miles with fog. Pilot had not filed flight plan and began a VOR runway 25 approach without obtaining clearance. As he continued inbound, MU-2 descended thru clouds and converged with Fairchild SA227 that was on IFR approach to airport. ARTCC controller, who had been controlling SA227, advised FSS specialist of situation. Pilots of both aircraft were advised of other aircraft's position. MU-2 pilot did not respond when asked if he was in IMC. MU-2 plt reported 7 or 8 miles out on VOR approach. He was told again of SA227 on final approach and to phone ARTCC after landing. No further radio calls were received from MU-2 pilot. Radar data showed MU-2 converged with 400 feet of SA227. Pilot began left turn over shoreline as if to circle for spacing, but MU-2 entered descent and crashed in ocean. Examination of light bulbs indicated master caution and battery over temp lights were illuminated during impact. All four occupants were killed. ", "probable_cause": "The pilot's failure to maintain directional control of the airplane after becoming spatially disoriented. Factors related to the accident were: darkness, low overcast cloud condition, the pilot's decision to continue VFR flight into instrument meteorological conditions (IMC), which resulted in a near collision with another aircraft, his self induced pressure and diversion of attention, while coping with the situation that he had encountered."}