{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-powell-river-1-killed", "date": "Mar 8, 2006 at 1639 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Orca%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Vancouver – Powell River", "msn": "31-8052095", "yom": 1980, "flight_number": null, "city": "Powell River", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1200, "captain_hours_type": null, "copilot_hours": 500, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed from its home base at Vancouver, British Columbia, with two crew members on board. The aircraft was being repositioned to Powell River (a 30-minute flight) to commence a freight collection route. On arriving at Powell River, the crew joined the circuit straight-in to a right downwind for a visual approach to Runway 09. A weather system was passing through the area at the same time and the actual local winds were shifting from light southwesterly to gusty conditions (11 to 37 knots) from the northwest. The aircraft was lower and faster than normal during final approach, and it was not aligned with the runway. The crew completed an overshoot and set up for a second approach to the same runway. On the second approach, at about 1639 Pacific standard time, the aircraft touched down at least halfway down the wet runway and began to hydroplane. At some point after the touchdown, engine power was added in an unsuccessful attempt to abort the landing and carry out an overshoot. The aircraft overran the end of the runway and crashed into an unprepared area within the airport property. The pilot-in-command suffered serious injuries and the first officer was fatally injured. A local resident called 911 and reported the accident shortly after it occurred. The pilot-in-command was attended by paramedics and eventually removed from the wreckage with the assistance of local firefighters. The aircraft was destroyed, but there was no fire. The ELT (emergency locator transmitter) was automatically activated, but the signal was weak and was not detected by the search and rescue satellite. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The downwind condition on approach contributed to the aircraft landing long and with a high ground speed. This, in combination with hydroplaning, prevented the crew from stopping the aircraft in the runway length remaining. \r\n2. When the decision to abort the landing was made, there was insufficient distance remaining for the aircraft to accelerate to a sufficient airspeed to lift off. \r\n3. The overrun area for Runway 09 complied with regulatory standards, but the obstacles and terrain contour beyond the overrun area contributed to the fatality, the severity of injuries, and damage to the aircraft.\r\nFinding as to Risk:\r\n1. Alert Service Bulletin A25-1124A (dated 01 June 2000), which recommended replacing the inertia reel aluminum shaft with a steel shaft, was not completed, thus resulting in the risk of failure increasing over time. \r\nOther Findings:\r\n1. The weather station at the Powell River Airport does not have any air–ground communication capability with which to pass the flight crew timely wind updates.\r\n2. The decision to make a second approach was consistent with normal industry practice, in that the crew could continue with the intent to land while maintaining the option to break off the approach if they assessed that the conditions were becoming unsafe. "}