{"url": "https://www.baaa-acro.com/crash/crash-canadair-c-4m2-north-star-mt-slesse-62-killed", "date": "Dec 9, 1956 at 1910 LT", "type": "Canadair C-4 North Star", "operator": "TCA", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Vancouver – Calgary – Toronto – Montreal", "msn": "128", "yom": 1948, "flight_number": "TCA810", "city": "Mt Slesse", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 59, "pax_fatalities": 59, "other_fatalities": 0, "total_fatalities": 62, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Flight 810-9 was a scheduled flight from Vancouver to Toronto. It carried a crew of 3 and 59 passagers. A cruising altitude of 19,000 feet was selected. The aircraft departed Vancouver at 1810 hours Pacific standard time on 9 December 1956 and was cleared by Air Traffic Control to Calgary Airport via Mud Bay, Abbotsford and Cultus Lake (Red 75 and Red 44). The flight made the normal position reports giving altitude and reported icing beginning at 16 000 feet, moderate turbulence 16 000 feet to 18 000 feet, heavy jolts at 19 000 feet and at 1848 requested clearance to 21 000 feet. At 1852, 810 reported a fire in No. 2 engine, that this engine had been shut down and that the aircraft was returning to Vancouver via Cultus and Abbotsford. Shortly afterwards the flight reported difficulty in maintaining height and requested clearance to descend on Green 1. The last altitude reported by Flight 810 was just above 15 000 feet which would be maintained if possible. At 191 0 hours Flight 810 reported passing Hope, the altitude was not given but clearance to descend to 10 000 feet was requested. ATC cleared 810 to cross the Vancouver range at 8 000 feet or above. Flight 810 acknowledged and this was the last radio contact. All through this latter part of the flight the tone of the voice in the radio transmission, as recorded on TCA tape, did not suggest undue concern by the crew of 810. Nothing more was heard of the aircraft until a part was dis- covered by mountaineers on 12 May 1957, when they .were climbing Mt Slesse, at approximately the 7 600-foot level, adjacent to the third highest peak.", "probable_cause": "The cause for the aircraft being at an altitude low enough to strike Mount Slesse is undetermined, but there is a high probability that the aircraft, while flying on 3 engines, encountered either severe icing, turbulence, subsidence, or a combination of all three, or suffered some other difficulty of such a sudden or dire nature that the crew were unable to communicate with any agency or control the aircraft. For undetermined reasons the aircraft was not on Green Airway No. 1 to which it had been cleared by Air Traffic Control. The following factors contributed to the accident: \r\n- Loss of engine power No. 2 engine shut-down, fire suspected,\r\n- Existence in the area of known subsidence, severe turbulence, and moderate to severe icing probably in the lower levels. "}