{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-3w0-kunming", "date": "Jul 20, 1994 at 2226 LT", "type": "Boeing 737-300", "operator": "China%20Yunnan%20Airlines2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "27139", "yom": 1992, "flight_number": null, "city": "Kunming-Wujiaba", "zone": "Yunnan", "country": "China", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 140, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The approach to Kunming-Wujiaba Airport runway 03 was completed in poor weather conditions with heavy rain falls. Following a wrong approach configuration, the crew landed at an excessive speed of 170 knots and the aircraft touched down 2,500 feet past the runway threshold. On a wet runway surface, the aircraft was unable to stop within the remaining distance, overran, struck approach lights and the ILS antenna, lost its nose gear and came to rest. All 148 occupants were rescued, among them 15 passengers were slightly injured. The aircraft was damaged beyond repair. ", "probable_cause": "Wrong approach configuration on part of the crew who completed the approach while too high on the glide. The following contributing factors were reported: \r\n- Poor crew coordination, \r\n- The crew failed to follow the approach and landing checklist, \r\n- The crew failed to check instruments while on approach, \r\n- The aircraft was unstable on approach,\r\n- Poor weather conditions, \r\n- The runway surface was wet and the braking action was reduced, \r\n- The approach and landing speed was excessive (50 knots above standard speed),\r\n- The aircraft landed too far down the runway (2,500 feet past the runway threshold), reducing the landing distance, \r\n- The crew failed to initiate a go-around procedure. "}