{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-382g-51c-hercules-piacenza-3-killed", "date": "Aug 13, 2006 at 2015 LT", "type": "Lockheed C-130 Hercules", "operator": "Air%20Alg%C3%A9rie", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Algiers - Frankfurt", "msn": "4880", "yom": 1981, "flight_number": "AH2208", "city": "Piacenza", "zone": "Emilia-Romagna", "country": "Italy", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 8200, "captain_hours_type": null, "copilot_hours": 22800, "copilot_hours_type": null, "aircraft_hours": 31889, "circumstances": "The four engine aircraft departed Algiers-Houari Boumédiène Airport at 1705LT on a cargo flight to Frankfurt with a crew of three on board. While cruising at an altitude of 25,000 feet over north Italy, the copilot informed ATC about the failure of the automatic pilot system. Less than a minute later, the aircraft entered an uncontrolled descent during which the overspeed alarm sounded in the cockpit. In a nose down angle of 45-50° and at a speed of 850/900 km/h, the aircraft crashed in an open field located southwest of Piacenza. The aircraft totally disintegrated on impact and all three crew members were killed. A large crater was found at the point of impact and debris were found till 800 metres around. ", "probable_cause": "The very high state of fragmentation of the wreck and the substantial absence/utilisation of FDR data made the safety investigation very difficult and therefore could not acquire some indisputable certainties on certain aspects. The indications resulting from the examination of the acquired evidence and from the many technical analyses carried out lead to believe that the accident occurred because of the loss sudden control of the aircraft, induced, reasonably speaking, by a technical problem in the flight control system, which the pilots were unable to counter/manage and which the safety investigation could not detect with absolute certainty."}