{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-90-dl-near-elk-city-10-killed", "date": "Jun 11, 1979 at 0945 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "US%20Forest%20Service", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Grangeville - Moose Creek", "msn": "20422", "yom": 1944, "flight_number": null, "city": "Elk City", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 10, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Forest Service owned and operated Douglas C-47, N148Z, was dispatched from Grangeville, ID to transport personnel and gear to the Moose Creek Ranger Station up the Selway River, a distance of about 60 miles. On board the aircraft were 11 Forest Service employees (which included the pilot and copilot), one volunteer, 3,100 pounds of cargo, and two canines. The aircraft had been configured for smokejumper missions and consequently all of the passengers were sitting on the port side of the aircraft facing the cargo on the other side. The cargo was held in place with retaining straps. The flight took off at 09:28 hours. The pilots began to fly the normal route, over the river, and to the Ranger Station. It was determined that the left engine failed (or was shut down) in flight, about 20 minutes after takeoff from the airport. Presumably this was the result of rising temperature of nose case components and lubricating oil and low oil pressure. The left propeller was apparently feathered immediately after the engine failed (or was shut down) in flight. The right engine \"blew a jug\" on cylinder number eight and burst into flame within perhaps 10 to 30 seconds from the time the left engine stopped. The right engine separated from the wing with an explosive sound within perhaps 10 to 30 seconds from the time it burst into flame. The aircraft continued approximately three and one half miles upstream in a narrow canyon in powerless glide after the right engine fell off. The pilots evidently attempted to land in the river. During this maneuver, the aircraft hit a tree and nosed into the river. Upon impact, the aircraft broke up approximately ten miles downriver from the Ranger Station. The location was a steep, timbered, rocky-river canyon at an elevation of 2,000 feet mean sea level (MSL). Three passengers survived the mishap; however, one of these survivors succumbed to his injuries before he could be transported to the hospital.\r\nSource: ASN", "probable_cause": null}