{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-gv-west-palm-beach", "date": "Feb 14, 2002 at 0649 LT", "type": "Gulfstream GV", "operator": "BB Five Inc.", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "West Palm Beach - Teterboro", "msn": "508", "yom": 1996, "flight_number": null, "city": "West Palm Beach", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13280, "captain_hours_type": 1227, "copilot_hours": 18477, "copilot_hours_type": 450, "aircraft_hours": 1945, "circumstances": "After a normal taxi and takeoff, the airplane's landing gear would not retract after liftoff. After unsuccessfully attempting to raise the landing gear manually, the flight crew elected to return to the airport. During the landing flare, the ground spoilers deployed when the throttles were brought to idle. The airplane descended rapidly and landed hard, and the right main landing gear collapsed. The investigation determined that a mechanic had wedged wooden sticks into the airplane's weight-on-wheels (WOW) switches to force them into the ground mode while the airplane was on jacks during maintenance. The mechanic said that he used the sticks to disable the WOW switches to gain access to the maintenance data acquisition unit, which was necessary to troubleshoot an overspeed alert discrepancy. After the maintenance was performed, the sticks were not removed, and the airplane was returned to service. No notation about the disabled WOW switches was entered in the work logs. Postaccident ground testing of the accident airplane's cockpit crew alerting system and examination of flight data recorder (FDR) data determined that the system was functioning properly and that it produced a blue WOW fault message, an amber WOW fault message, and a red GND SPOILER warning message when the accident flight conditions were recreated. The messages produced were consistent with FDR and cockpit voice recorder (CVR) information. Ground spoilers will deploy when the throttles are brought to idle if the spoilers are armed and the WOW switches are in the ground mode. The G-V Quick Reference Handbook (QRH) cautions flight crews not to move thrust reverser levers and to switch the GND SPOILER armed to off following an amber WOW FAULT message. A red GND SPOILER message calls for the flight crew to disarm the ground spoilers and pull the circuit breakers to make sure the spoilers are not rearmed inadvertently. Based on CVR information, there was no indication that the flight crew followed checklist procedures contained in the G-V's QRH that referenced WOW faults or GND SPOILER faults. Preflight checklist procedures also called for the flight crew to conduct a visual inspection of the WOW switches.", "probable_cause": "The flight crew's failure to follow preflight inspection/checklist procedures, which resulted in their failure to detect wooden sticks in the landing gear weight-on-wheel switches and their failure in flight to respond to crew alert messages to disarm the ground spoilers, which deployed when the crew moved the throttles to idle during the landing flare, causing the airplane to land hard. Contributing to the accident was maintenance personnel's failure to remove the sticks from the weight-on-wheels switches after maintenance was completed. "}