{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-marau-5-killed", "date": "Nov 14, 2019 at 1417 LT", "type": "Cessna 550 Citation II", "operator": "José João Abdalla Filho", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jundiaí – Maraú", "msn": "550-0225", "yom": 1981, "flight_number": null, "city": "Maraú-Barra Grande", "zone": "Bahia", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 8000, "captain_hours_type": 2500, "copilot_hours": 350, "copilot_hours_type": 25, "aircraft_hours": 6978, "circumstances": "The aircraft took off from the Comandante Rolim Adolfo Amaro Aerodrome (SBJD), Jundiaí - SP, to the Barra Grande Aerodrome (SIRI), Maraú - BA, at about 1458 (UTC), in order to carry out a private flight, with two pilots and eight passengers on board. Upon arriving at the destination Aerodrome, at 1717 (UTC), the aircraft made an undershoot landing on runway 11, causing the main and auxiliary landing gear to burst. The airplane moved along the runway, dragging the lower fuselage and the lower wing, leaving the runway by its left side, and stopping with the heading lagged, approximately, 210º in relation to the landing trajectory. Afterwards, there was a fire that consumed most of the aircraft. The aircraft was destroyed. One crewmember and four passengers suffered fatal injuries and the other crewmember and four passengers suffered serious injuries.\n", "probable_cause": "Contributing factors.\r\n- Control skills – a contributor\r\nThe inadequate performance of the controls led the aircraft to make a ramp that was lower than the ideal. This condition had the consequence of touching the ground before the runway’s threshold.\r\n- Attention – undetermined\r\nDuring the approach for landing, the commander divided his attention between the supervision of the copilot's activities and the performance of the aircraft's controls. Such circumstances may have impaired the flight management and limited the reaction time to correct the approach ramp.\r\n- Attitude – undetermined\r\nThe report that the commander took two photographs of the runway and of the Aerodrome with his cell phone, during the wind leg, reflected an inadequate and complacent posture in relation to his primary tasks at that stage of the flight, which may have contributed to this occurrence.\r\n- Communication – undetermined\r\nAs reported by the commander, the low tone and intensity of voice used by the copilot during the conduct of callouts, associated with the lack of use of the head phones, limited his ability to receive information, which may have affected his performance in management of the flight.\r\n- Crew Resource Management – a contributor\r\nThe lack of proper use of CRM techniques, through the management of tasks on board, compromised the use of human resources available for the operation of the aircraft, to the point of preventing the adoption of an attitude (go-around procedure) that would avoid the accident, from the moment when the recommended parameters for a stabilized VFR approach are no longer present.\r\n- Illusions – undetermined\r\nIt is possible that the width of the runway, narrower than the normal for the pilots involved in the accident, caused the illusion that the aircraft was higher than expected, for that distance from the thrashold 11 of SIRI, to the point of influence the judgment of the approach ramp. In addition, the fact that the pilot was surprised by the geography of the terrain (existence of dunes) and the coloring of the runway (asphalt and concrete), may have led to a false visual interpretation, which reflected in the evaluation of the parameters related to the approach ramp.\r\n- Piloting judgment – a contributor\r\nThe commander's inadequate assessment of the aircraft's position in relation to the final approach ramp and landing runway contributed to the aircraft touching the ground before the thrashold.\r\n- Perception – undetermined\r\nIt is possible that a decrease in the crew's situational awareness level resulted in a delayed perception that the approach to landing was destabilized and made it impossible to correct the flight parameters in a timely manner to avoid touching the ground before the runway.\r\n- Flight planning – undetermined\r\nIt is possible that, during the preparation work for the flight, the pilots did not take into account the impossibility of using the perception and alarm system of proximity to the ground that equipped the aircraft, and the inexistence of a visual indicator system of approach ramp at the Aerodrome.\r\n- Other / Physical sensory limitations – undetermined\r\nThe impairment of the hearing ability of the aircraft commander, coupled with the lack of the use of head phones, may have interfered with the internal communication of the flight cabin, in the critical phase of the flight."}