{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh104-dove-1-ixopo-12-killed", "date": "Jan 12, 1951 at 1450 LT", "type": "De Havilland DH.104 Dove", "operator": "United Airways - South Africa", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Margate – Ladysmith – Johannesburg", "msn": "04017", "yom": 1947, "flight_number": null, "city": "Ixopo", "zone": "KwaZulu-Natal", "country": "South Africa", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 1430 hours the aircraft with 10 passengers and a crew of 2 took off from Margate to fly to the Rand Airport, Germiston, via Ladysmith. The weather at the time of take-off was overcast with intermittent drizzle - cloud base about 1,000 feet above the airfield which is near sea level - wind southerly, strength 20 - 25 knots - the weather inland in the direction of flight appeared to be dark rain clouds. The pilot did not receive a meteorological report for the flight before take-off. On this particular flight a call-sign from the aircraft was received by the operator at Durban Airfield at 1444 hours, but the signal was weak and because of another aircraft in the circuit area, wireless contact was lost altogether. At about 1450 hours, people on the ground near Ixopo saw pieces of aircraft fall from cloud. The aircraft had disintegrated in the air (on course and at a place 49 miles from Margate) and all the occupants were fatally injured.", "probable_cause": "The probable cause of the accident was: \r\nEither: \r\na) i) Whilst flying in substantially level flight, but momentarily port wing down, the aircraft was subjected to a very severe gust, As a result the weakened engine mounting structure in the port wing gave way, the engine momentarily moving by its inertia towards the right (inwards) relative to the aircraft, It then swung over to the outside and in doing so the propeller cut into the port wing causing severe damage. This damage associated with the conditions at the time caused the wing to collapse.\r\nii) The aircraft whipped violently over to the left and down- wards resulting in the almost immediate collapse of the tail structure and causing the starboard engine to come out. The propeller of this engine damaged the starboard wing duping its motion away from the aircraft. \r\niii) The rear end of the fuselage broke away during the violent twisting motion resulting from the failure of the port wing.\r\nOr: \r\nb) Although there would appear to be no very fundamental arguments against the foregoing conception of the cause of the accident, certain members of the Board consider that it does not explain, without somewhat conjectural assumptions, the distribution of the aircraft parts as found on the ground. It also neglects evidence which tends to show that the aeroplane broke up during recovery from a dive. They consider it more probable that it did so, since, it explains more naturally and directly the ground distribution of the aircraft parts. The effect of coming out of a dive would cause both engines to swing to starboard, and tend to cause the whole aircraft to do likewise. If, as a result of this as verified by its ground position, the starboard engine came out first, the effect of this would be that the starboard wing would rise sharply and the port wing correspondingly fall. Some of the port engine supports, being already fractured and weakened by the initial movement towards the starboard side, would then give way due to the weight of the engine now acting in a direction downwards and outwards along the now steeply dipping port wing, Any resulting impact between engine and wing, such as occurred, would accentuate the effect of the gyroscopic torque induced by dive recovery conditions, tending to cause the port wing to break away as it did."}