{"url": "https://www.baaa-acro.com/crash/crash-cessna-525c-citationjet-cj4-howell", "date": "Jan 16, 2017 at 1159 LT", "type": "Cessna 525 CitationJet CJ4", "operator": "Zeliff Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Batavia – Howell", "msn": "525C-0196", "yom": 2015, "flight_number": null, "city": "Howell", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5800, "captain_hours_type": 320, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 320, "circumstances": "After exiting the clouds during the landing approach at the uncontrolled airport, the private pilot of the small jet canceled his instrument flight plan with air traffic control. He stated that, although there was no precipitation when he exited the clouds, he suspected the runway may be icy due to the weather conditions. The pilot saw an airplane holding short on the taxiway at the end of the runway and assumed it was preparing to takeoff, which he stated led him to believe that the runway condition was good. Although the pilot announced his location and intentions on the airport's common traffic advisory frequency (CTAF), he did not inquire about the runway condition via CTAF/UNICOM. Witnesses reported that the approach looked normal. After touchdown, the pilot applied brakes and realized he had no braking action. He subsequently retracted the speed brakes, spoilers, and flaps, and added takeoff power. The airplane yawed to the left and the pilot reduced engine power to idle while applying rudder to correct the airplane's track. The airplane continued off the runway, where it traveled through a fence and across a road before coming to rest inverted. The pilot and mechanic seated in the airplane that was holding short of the runway during the landing reported that they were only taxiing to a maintenance facility and did not intend to take off. They reported that the taxiways were icy. A witness who assisted the pilot following the accident reported that the roads at the time were covered in ice and \"very slick.\" Recorded data from the airplane showed that the pilot flew a stabilized approach and that the airplane touched down near the approach end of the runway; however, given the icy runway conditions, the airplane's landing distance required exceeded the available runway by more than 8,000 ft. Airport personnel had not issued a NOTAM regarding the icy runway conditions. The airport manager stated he was not at the airport at the time of the accident, and that he was still trying to learn the new digital NOTAM manager system. The employee who was at the airport was authorized to issue NOTAMs, but had not yet been trained on the new system. ", "probable_cause": "The pilot's attempted landing on the ice-covered runway, which resulted in a runway excursion and impact with terrain. Contributing to the accident was airport personnel's lack of training regarding issuance of NOTAMs\n"}