{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-31-fairland-82-killed", "date": "Sep 9, 1969 at 1529 LT", "type": "Douglas DC-9", "operator": "Allegheny-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Boston - Baltimore - Cincinnati - Indianapolis - Saint-Louis", "msn": "47211", "yom": 1968, "flight_number": "AL853", "city": "Fairland", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 78, "pax_fatalities": 78, "other_fatalities": 0, "total_fatalities": 82, "captain_hours": 23813, "captain_hours_type": 900, "copilot_hours": 2980, "copilot_hours_type": 651, "aircraft_hours": 3170, "circumstances": "An Allegheny Airlines DC-9 and a Forth Corporation Piper PA-28-140 Cherokee registered N7374J collided in flight approximately 4 miles northwest of Fairland, Indiana, at approximately 1529 e.d.t., September 9, 1969. All 83 occupants, 78 passengers and four crew members, aboard the DC-9 and the pilot of the PA-28 were fatally injured. Both aircraft were destroyed by the collision and ground impact. Allegheny flight AL853 was wider positive radar control of the Federal Aviation Administration's Indianapolis Approach Control, descending from 6,000 feet to an assigned altitude of 2,530 feet at the time of the collision. N7374J has being flown by a student pilot on a solo cross-country flight in accordance with a Visual Flight Rules (VFR) flight plan. The collision occurred at an altitude of approximately 3,550 feet. The visibility in the area was at least 15 miles, but there was an intervening cloud condition wbich precluded the crew of either aircraft from sighting the other until a few seconds prior to collision.", "probable_cause": "The deficiencies in the collision avoidance capability of the Air Traffic Control (ATC) system of the Federal Aviation Administration in a terminal area wherein there was mixed Instrument Flight Rules (IFR) and Visual Flight Rules (VFR) traffic. The deficiencies included the inadequacy of the see-and-avoid concept under the circumstances of this case; the technical limitations of radar in detecting all aircraft; and the absence of Federal Aviation Regulations which would provide a system of adequate separation of mixed VFR and IFR traffic in terminal areas."}