{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-clecy", "date": "Apr 22, 1999 at 1530 LT", "type": "Let L-410", "operator": "Hélicópteros del Caribe - Hélica", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Linköping - Porto", "msn": "85 15 15", "yom": 1985, "flight_number": null, "city": "Clécy", "zone": "Calvados", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was ferried from Sweden to its new operator in Venezuela and departed Linköping Airport for Porto, carrying one passenger and two pilots. The aircraft was equipped with 13 metal cans containing fuel secured in the cabin and the fuel transfer to the structural tanks was completed via an electrical pump. While flying over France at an altitude of 5,500 feet, the right engine failed, followed shortly by the left engine. The crew reduced his altitude and attempted an emergency landing in an open field. The aircraft rolled for about 400 metres and eventually collided with trees. All three occupants were injured and the aircraft was destroyed. ", "probable_cause": "It was determined that both engines failed due to fuel starvation and because the fuel was not properly transferred from the cans installed in the cabin. Prior to departure, the crew calculated the hourly consumption to be 170 litres while the correct consumption was in fact 360 litres per hour. \r\nThe following contributing factors were reported:\r\n- Poor flight preparation, \r\n- Wrong calculation of the fuel consumption,\r\n- Poor fuel management, \r\n- Insufficient knowledge of the aircraft performances,\r\n- The installation of the cans had not been approved by the Authority prior to this delivery flight. "}