{"url": "https://www.baaa-acro.com/crash/crash-avro-rj100-zurich-24-killed", "date": "Nov 24, 2001 at 2207 LT", "type": "Avro RJ100", "operator": "Crossair.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Berlin - Zurich", "msn": "E3291", "yom": 1996, "flight_number": "LX3597", "city": "Zurich-Kloten", "zone": "Zurich", "country": "Switzerland", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 3, "pax_on_board": 28, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": 19555, "captain_hours_type": 287, "copilot_hours": 490, "copilot_hours_type": 348, "aircraft_hours": 13194, "circumstances": "On 24 November 2001 at 20:01 UTC the aircraft AVRO 146 RJ 100, registered as HB-IXM of the Crossair airline company took off in darkness from runway 26L at Berlin-Tegel airport as scheduled flight CRX3597 to Zurich. At 20:58:50 UTC, after an uneventful flight, the aircraft received the clearance for a standard VOR/DME approach 28 at Zurich airport.Ahead of the aircraft involved in the accident, an Embraer EMB 145, flight CRX3891, landed on runway 28 at Zurich airport. The crew informed the control tower that the weather was close to the minimum for this runway. At 21:05:21 UTC flight CRX3597 reported on the aerodrome control frequency. When the aircraft reached the minimum descent altitude (MDA) of 2,390 feet QNH at 21:06:10, the commander mentioned to the copilot that he had certain visual ground contact and continued the descent. At 21:06:36 UTC the aircraft collided with treetops and subsequently crashed into the ground. The aircraft caught fire on impact. Twenty-one passengers and three crew members died from their injuries at the site of the accident; seven passengers and two crew members survived the accident. The wreckage was found in the Geissbühl forest, 4,050 metres short of runway 28. ", "probable_cause": "The accident is attributable to the fact that on the final approach, in own navigation, of the standard VOR/DME approach 28 the aircraft flew controlled into a wooded range of hills (controlled flight into terrain – CFIT), because the flight crew deliberately continued the descent under instrument flight conditions below the minimum altitude for the approach without having the necessary prerequisites. The flight crew initiated the go around too late.\r\nThe investigation has determined the following causal factors in relation to the accident:\r\n• The commander deliberately descended below the minimum descent altitude (MDA) of the standard VOR/DME approach 28 without having the required visual contact to the approach lights or the runway.\r\n• The copilot made no attempt to prevent the continuation of the flight below the minimum descent altitude.\r\nThe following factors contributed to the accident:\r\n• In the approach sector of runway 28 at Zurich airport there was no system available which triggers an alarm if a minimum safe altitude is violated (minimum safe altitude warning – MSAW).\r\n• Over a long period of time, the responsible persons of the airline did not make correct assessments of the commander’s flying performance. Where weaknesses were perceptible, they did not take appropriate measures. \r\n• The commander’s ability to concentrate and take appropriate decisions as well as his ability to analyse complex processes were adversely affected by fatigue.\r\n• Task-sharing between the flight crew during the approach was not appropriate and did not correspond to the required procedures by the airline.\r\n• The range of hills which the aircraft came into contact with was not marked on the approach chart used by the flight crew.\r\n• The means of determining the meteorological visibility at the airport was not representative for the approach sector runway 28, because it did not correspond to the actual visibility.\r\n• The valid visual minimums at the time of the accident were inappropriate for a decision to use the standard VOR/DME approach 28."}