{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-point-lay", "date": "Dec 3, 1998 at 1038 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Cape%20Smythe%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kotzebue - Point Lay", "msn": "31-7952233", "yom": 1979, "flight_number": null, "city": "Point Lay", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3069, "captain_hours_type": 311, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15638, "circumstances": "A witness observed the airplane circle to land at the completion of an NDB approach. The nighttime meteorological conditions were an 800 feet ceiling, 1 mile visibility in blowing snow, and 26 knot winds. The surrounding terrain was essentially flat, snow covered, and featureless. The witness saw the airplane on final approach misaligned for the runway, and then disappear below an 18 feet msl bluff. He transmitted on the radio to 'get out of there,' and heard no response. About 10 minutes later the accident pilot walked up to the witness' airplane. The pilot told the investigator-in-charge that he was 'beat around by the winds, ...it was snowing pretty hard, I always had the lights, and I was concentrating on the runway. The next thing I knew I was on the ground short of the runway.' The pilot's previous experience to this airport was during daytime, and during visual conditions. The airport, which was being transferred from the Air Force to the North Slope Borough, has medium intensity runway lights (MIRL), and runway end identifier lights (REILS). It does not have visual approach slope indicator (VASI) lights. ", "probable_cause": "Failure of the pilot to maintain a proper glidepath. Factors associated with this accident were the airport not having a VASI system installed, and the lack of visual perception for the pilot. "}