{"url": "https://www.baaa-acro.com/crash/crash-bae-125-400a-churchill-falls-8-killed", "date": "Dec 9, 1977 at 1955 LT", "type": "BAe 125", "operator": "Churchill%20Falls%20Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Montreal - Churchill Falls", "msn": "25213", "yom": 1970, "flight_number": null, "city": "Churchill Falls", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 11000, "captain_hours_type": 3100, "copilot_hours": 15000, "copilot_hours_type": 2600, "aircraft_hours": null, "circumstances": "The corporate jet HS-125 aircraft departed Montreal at 2123 (GMT), 9 December 1977 with Churchill Falls as destination. The estimated time en route was 1 hour 45 minutes. The flight proceeded normally and was in contact with Air Traffic Services en route. When in range of Churchill Falls the flight received a clearance for the approach from Moncton ATC. At 2228Z the pilot acknowledged the clearance to the Churchill Falls airport and received the latest weather. The aircraft left cruising altitude shortly thereafter; the descent was normal to the minimum initial altitude for the instrument approach. The flight reported outbound to Churchill Falls advisory at approximately 2252Z. The final transmission from the crew was that they were two miles back on final with a confirmation that they could see the strobe lights and the VASIS. Moncton Centre was alerted shortly after 2300Z when it was evident that the aircraft had not landed. A local search was initiated with two helicopters from the airport but because of deteriorating weather, the search had to be discontinued and the aircraft was not found that night. Search and Rescue were alerted at 2314Z. Near blizzard conditions occurred that night and the next day, December 10. It wasn't until 11 December that the air search was resumed and the aircraft was located two miles short of the threshold of runway 14. There was no sign of life.", "probable_cause": "It was determined that the accident was the consequence of the combination of the following findings:\r\n- Cockpit discipline was inadequate as the approach entered the final phase,\r\n- Distractions in the cockpit degraded crew performance,\r\n- The pilots deprived themselves of essential altitude information by not effectively monitoring the flight instruments during the final approach,\r\n- The Captain, by relying on visual cues from the runway environment lighting in conditions where those cues were degraded, became exposed to visual illusions,\r\n- The pilots permitted the aircraft to deviate below the safe approach profile until it struck the terrain,\r\n- On the assumptions that there had been at least one serviceable ELT on board, that it had been activated as a result of the impact or by other means, and that there was the capability at Churchill Falls of homing to the point of origin of the ELT signal, the rescue activity may have been expedited."}