{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-82-surakarta-25-killed", "date": "Nov 30, 2004 at 1815 LT", "type": "McDonnell Douglas MD-82", "operator": "Lion%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jakarta – Surakarta", "msn": "49189", "yom": 1984, "flight_number": "JT583", "city": "Surakarta-Adisumarmo", "zone": "Central Java", "country": "Indonesia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 2, "pax_on_board": 156, "pax_fatalities": 23, "other_fatalities": 0, "total_fatalities": 25, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 56674, "circumstances": "While descending to Surakarta-Adisumarmo Airport, the crew was informed about stormy conditions at destination with cumulonimbus and heavy rain falls over the airport with a ceiling at 1,500 feet. The approach was continued and after touchdown on runway 26, the crew started the braking procedure and activated the thrust reverser systems. ON a wet runway, the aircraft was unable to stop within the remaining distance. It overran, lost its undercarriage and slid for few dozen metres, collided with equipments of the localizer antenna, a fence and came to rest in a cemetery. Both pilots and 23 passengers were killed while 70 other occupants were injured. 68 occupants escaped unhurt. The aircraft was destroyed. ", "probable_cause": "The following findings were identified:\r\n- About 3 mm of water was stagnating on the runway surface, reducing the braking action, \r\n- The crew completed the landing procedure with a 13 knots tailwind component, \r\n- Airbrakes deployed after touchdown but retracted few seconds later due to wrong position of the power levers, \r\n- Power levers were not in idle position after touchdown but slightly forward, so the flight computer increased power,\r\n- Heavy rain falls, \r\n- The crew failed to initiate a go-around procedure. "}