{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61p-aerostar-ted-smith-601-nacogdoches-5-killed", "date": "Nov 8, 1990 at 1805 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "G. T. Contractors", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cordele - Nacogdoches", "msn": "61-0854-8163451", "yom": 1981, "flight_number": null, "city": "Nacogdoches-A. L. Mangham Jr.", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 3500, "captain_hours_type": 3200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At about 1744 cst, before reaching his destination, the pilot reported that during the flight, he had encountered head winds and had only 50 minutes of fuel remaining. He was provided preferential handling, but another flight was also low on fuel. The pilot was cleared for an NDB runway 15 approach. At 1756:49, he acknowledged clearance for the approach. At approximately 1800, unicom advised the current weather was: 700 feet broken, sky obscured with heavy rain, wind variable from 090° to 240° at 24 gusting 29 knots. The pilot did not acknowledge the weather, except to saying a calm voice, 'I hope you have your lights on.' The FBO heard several clicks on the unicom (as if to activate the runway lights), then there was no further radio contact with the aircraft. The aircraft hit trees and crashed about 6 miles west-northwest of the airport. Witnesses reported it was at low altitude and had reversed course before crashing on a southerly heading. The main wreckage came to rest about 380 feet from the initial impact point with trees. No preimpact part failure/malfunction was found. About 42 miles south-southeast at Lufkin, the 1751 cst weather was in part: 200 feet overcast, visibility 3/4 mile with thunderstorms, heavy rw and fog, wind from 020° at 12 knots. Approach minimums: 600 feet cig and 1 mile visibility. All five occupants were killed.  ", "probable_cause": "Failure of the pilot to follow IFR procedures and maintain the proper altitude. Factors related to the accident were: the adverse weather conditions, dark night, low fuel state of the aircraft, and trees at the accident site."}