{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-yuzhno-sakhalinsk-26-killed", "date": "Aug 26, 1954 at 1050 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Khabarovsk – Yuzhno-Sakhalinsk", "msn": "68 03", "yom": 1949, "flight_number": "SU971", "city": "Yuzhno-Sakhalinsk", "zone": "Sakhalin oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 22, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 26, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4219, "circumstances": "The crew started the approach to Yuzhno-Sakhalisnk from the southeast in marginal weather conditions due to low clouds. At an altitude of 400 meters, the aircraft hit tree tops and crashed inverted in a wooded area located on the slope of Mt Komissarskaya (714 meters high) located 13,5 km southeast of the airport. The wreckage was found a day later and a passenger was found alive but seriously injured while all 26 other occupants were killed. The aircraft was totally destroyed upon impact. \r\nCrew:\r\nVasily Trofimovich Degtyarenko, pilot,\r\nVladimir Parkhomenko, copilot,\r\nVyacheslav Fedorovitch Eliseikina, mechanic, \r\nDaniel Epifanovich Raznotsvete, mechanic, \r\nPiotr D. Novikov , radio navigator.", "probable_cause": "The radio navigator mistook two outer markers when the crew started the approach to Yuzhno-Sakhalinsk Airport, and referred to the outer marker of the Korsakov Airbase (frequency 684 kHz) instead of the outer marker of the civil airport of Yuzhno-Sakhalinsk-Bolchaya Yelan (frequency 670 kHz). Investigations reported that these two outer markers were too close from each other (13,5 km) with close frequency as well, which contributed to the mistake. The following factors were also pointed out: lack of visibility caused by low clouds (the crew failed to distinguish the mountain); the crew failed to use the radio altimeter and an abnormal action on part of the crew regarding the direction finder unit. "}