{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c99-airliner-anniston-3-killed", "date": "Jun 8, 1992 at 0853 LT", "type": "Beechcraft 99 Airliner", "operator": "GP-Express%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Atlanta - Anniston - Tuscaloosa", "msn": "U-185", "yom": 1982, "flight_number": "8G861", "city": "Anniston", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1700, "captain_hours_type": 24, "copilot_hours": null, "copilot_hours_type": 90, "aircraft_hours": 9725, "circumstances": "This was the first day on duty in the southern region operation for both pilots. In addition, they had never flown together. During the flight, the flight crew lost awareness of their airplane's position, erroneously believed that the flight was receiving radar services from ATC, and commenced the approach from an excessive altitude and at a cruise airspeed without accomplishing the published procedure specified on the approach chart. The crew believed that the airplane was south of the airport, and turned toward the north to execute the ILS runway 05 approach. In actuality, the airplane had intercepted the back course localizer signal, and the airplane continued a controlled descent until it impacted terrain. The captain and two passengers were killed while the copilot and two other passengers were seriously injured. ", "probable_cause": "The failure of senior management of GP Express to provide adequate training and operational support for the startup of the southern operation, which resulted in the assignment of an inadequately prepared captain with a relatively inexperienced first officer in revenue passenger service, and the failure of the flightcrew to use approved instrument flight procedures, which resulted in a loss of situational awareness and terrain clearance. Contributing to the causes of the accident was GP Express' failure to provide approach charts to each pilot and to establish stabilized approach criteria. Also contributing were the inadequate crew coordination and a role reversal on the part of the captain and first officer. "}