{"url": "https://www.baaa-acro.com/crash/crash-armstrong-whitworth-aw38-whitley-iii-raf-catterick-7-killed", "date": "Oct 18, 1939", "type": "Armstrong Whitworth AW.38 Whitley", "operator": "Royal-Air-Force-4", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Catterick - Wick", "msn": "1449", "yom": 1938, "flight_number": null, "city": "Catterick AFB", "zone": "North Yorkshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 6, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Late in the day the crew of this aircraft were tasked to fly to RAF Catterick and from there ferry a load of ammunition to Wick in Scotland. After loading the stores, six passengers boarded the aircraft. Sergeant Gaut selected the longest available take off run, but when half way across the airfield, the Whitley suddenly rose to about ten feet, followed by a near vertical climb at full throttle. Eye witnesses state that the bomber stalled, below 100 feet, and dived nose first into the ground, exploding on impact. Miraculously, two of the six passengers survived.\r\nCrew (102nd Squadron):\r\nSgt Herbert John Gaut, pilot, †\r\nP/O Reginald Arthur Morton Luckman, pilot and navigator, †\r\nAC2 Charles Paterson, wireless operator and air gunner, †\r\nPassengers: \r\nAC1 John Baker, †\r\nSgt Arthur Vincent, †\r\nSgt Albert Harris, †\r\nAC1 Horace Jones, †\r\nSgt Donald E Gibbs, \r\nCpl W. Jenkinson.\n\r\nSource: W. R. Chorley.", "probable_cause": "Equipment was stowed from the rear almost up to the main spar, resulting in the aircraft being severely tail heavy. The crash investigation stated that as there were effectively three pilots on board it understand why they should allow the aircrafts load to be away from its centre of gravity. It also concluded that operational squadron's should not be used by other units as transport aircraft. It stated that the use of this Whitley was a mis-use of the aircraft. "}