{"url": "https://www.baaa-acro.com/crash/crash-cessna-421a-golden-eagle-i-league-city-1-killed", "date": "Mar 19, 1997 at 2333 LT", "type": "Cessna 421A Golden Eagle I", "operator": "MTK Jet", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "San Diego - Galveston", "msn": "421A-0050", "yom": 1967, "flight_number": null, "city": "League City", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 536, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine airplane had been cleared for a night instrument approach to Galveston, Texas, after flying non-stop from San Diego, California, when the pilot reported that he had lost the right engine and did not have much fuel left. The controller vectored the airplane toward the closest airport, and the airplane was approximately 1 mile northeast of that airport when radar contact was lost. A witness observed the airplane enter a spin, descend in a nose down attitude, and impact near the center of a lake. When the pilot filed his flight plan for the cross country flight, he indicated the airplane carried enough fuel to fly for 7 hours and 30 minutes. At the time radar contact was lost, 7 hours and 32 minutes had elapsed since the airplane departed San Diego. Examination of the airplane revealed no evidence of any preimpact mechanical discrepancies. The landing gear was down, the flaps were extended to about 15 degrees, and neither propeller was feathered. The single engine approach procedure in the airplane owner's manual indicated that the landing gear should be extended when within gliding distance of the field and the flaps placed down only after landing is assured. ", "probable_cause": "The pilot's failure to refuel the airplane which resulted in the loss of power to the right engine due to fuel exhaustion, and the pilot's failure to maintain airspeed during the single engine landing approach which resulted in a stall/spin. "}