{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-i-fazenda-matary", "date": "Feb 4, 1996 at 1628 LT", "type": "Cessna 500 Citation", "operator": "Taxi%20Aereo%20Weston", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Recife – Imperatriz – Fazenda Matary", "msn": "500-0181", "yom": 1974, "flight_number": null, "city": "Fazenda Matary", "zone": "Maranhão", "country": "Brazil", "region": "South America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9006, "captain_hours_type": 2752, "copilot_hours": 4424, "copilot_hours_type": 6, "aircraft_hours": null, "circumstances": "En route from Imperatriz to Fazenda Matary, the captain informed the copilot he would perform training upon arrival as there are no passengers on board. On descent, he informed ATC he would perform a touch-and-go manoeuvre. With the flaps down at 15°, the aircraft landed at a speed of 125 knots, about 10 knots above the speed reference of 116 knots. After touchdown, the captain changed his mind and decided to perform a complete stop without informing the copilot. The copilot noted that the speed was dropping so he decided to increase engine power to takeoff. Shortly later, the captain reduced power and initiated a braking procedure. Unable to stop within the remaining distance, the aircraft overran and came to rest few dozen metres further, bursting into flames. All three occupants escaped uninjured while the aircraft was destroyed by a post crash fire. ", "probable_cause": "The following findings were reported: \r\n- There was overconfidence, coupled with an impulsive attitude on the part of the instructor, making him convinced that he could land without problems, even changing the procedure already established and not communicating his decision to the copilot/student.\r\n- The instructor did not properly plan the landing procedure that he decided to carry out, contrary to the briefing.\r\n- There was an error in the instructor's judgment, due to the inadequate assessment of normal landing with 15º flap configuration and speed about 10kt above the predicted, contrary to previous briefing.\r\n- The instructor did not inform the student of his decision to complete the landing, without rush, as well as not responding to the request to start the rush. The student accelerated the engines without the instructor's authorization."}