{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-baranikovskiy-1-killed", "date": "Aug 28, 2011 at 0854 LT", "type": "PZL-Mielec AN-2", "operator": "Pilot", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Baranikovskiy - Baranikovskiy", "msn": "1G239-50", "yom": 1991, "flight_number": null, "city": "Baranikovskiy", "zone": "Krasnodar Krai", "country": "Russia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1208, "circumstances": "The single engine aircraft was dispatched in Baranikovskiy to perform a crop spraying mission on rice paddy field. Before flight, the tank was refueled with 250 litres of E95 fuel. The technician told the pilot the fuel was abnormally yellow but the pilot decided to proceed with the flight. Prior to take off, he asked the copilot to stay on ground and replaced him by the owner of the zone to be treated which is against the published procedures. During the takeoff roll, the aircraft did not accelerate as expected but the pilot continued. After liftoff, at a height of about 30 metres, the pilot initiated a 90° left turn when the engine lost power. He started to drop the load of chemicals then attempted an emergency landing when the aircraft impacted ground. It continued for about 134 metres then struck an irrigation drain, nosed over and came to rest, bursting into flames. The pilot was killed and the passenger was seriously injured.", "probable_cause": "The accident was caused by a loss of engine power because the aircraft has been refueled with fuel dedicated to automobile. \r\nThe following contributing factors were identified: \r\n- The pilot's lack of knowledge about the flight area and the layout of cultivated fields,\r\n- The pilot failed to brake properly during the emergency landing, \r\n- The absence of a copilot on board,\r\n- The Operator certificat was revoked 3 days prior to the accident. "}