{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47-dl-tonopah", "date": "Aug 19, 1964 at 2005 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Hawthorne%20Nevada%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Burbank – Hawthorne", "msn": "4535", "yom": 1942, "flight_number": "HNA707", "city": "Tonopah", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 32, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8209, "circumstances": "The DC-3 was cruising at FL115 between Burbank and Hawthorne when a no. 2 engine failure forced the crew to shut the engine down and feathered the propeller. At 20:50 EDT the crew radioed Tonopah, NV and said they wanted to make an emergency landing there. At 20:58 EDT the no. 1 engine lost power. The propeller couldn't be feathered and an emergency glide was initiated towards Mud Lake airfield. A 2000 feet/min rate of descent was necessary to maintain a 110 knots airspeed. All electrical and hydraulic power was lost during the descent. The DC-3 struck the ground in a 10-20 degree nose down attitude during the flareout and overturned. It appeared that there were numerous maintenance irregularities, a.o. improperly adjusted valve clearances, improperly adjusted voltage regulators and improperly installed cylinders. The plane was equipped with 2 28V dc generators and one 12V battery. All electrical components other than the starters were designed for 12V dc operation. It also appeared that all maintenance was performed by companies other than the operator. In many instances inadequate and incomplete records failed to reflect work accomplished.", "probable_cause": "In flight failure of both engines caused by a fatigue failure on the right engine No.12 cylinder and failure of the left front master rod bearing, necessitating a night emergency landing on unlighted terrain. Inadequate maintenance and inspection."}