{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-5-dk-facatativa-28-killed", "date": "Mar 8, 1964 at 1845 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Taxader", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Pereira – Bogotá", "msn": "12374", "yom": 1944, "flight_number": null, "city": "Facatativá", "zone": "Cundinamarca", "country": "Colombia", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 25, "pax_fatalities": 25, "other_fatalities": 0, "total_fatalities": 28, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The DC-3 took off from Pereira at 17:24 for a flight to Bogotá, via reporting points El Paso, Girardot and La Esperanza. The aircraft arrived overhear La Esperanza at 18:18 and was instructed to hold there at FL130. The flight was cleared to leave the intersection at 18:33 to the Bogotá VOR. The crew estimated to arrive over the Bogotá VOR at 18:44 and were then instructed to descend to FL120 for an ADF approach to Bogotá Airport, reporting at the Bogotá VOR at FL120 and over the outer marker at 9800 feet. The plane arrived abeam the Bogotá VOR ahead of schedule, at 18:41, and was instructed to maintain FL120 until 18:44. At 18:42 the flight crew reported seeing another aircraft in their vicinity. They thought it to be a DC-4, but was actually a Curtiss C-46 which had been cleared for final approach. The DC-3 crew took evasive action, losing control of the aircraft. The DC-3 crashed near Facatativá.", "probable_cause": "The pilot of the aircraft in observing the presence of another aircraft abruptly initiated a right turn which ended in an abnormal 'nose below the horizon' attitude, which he was unable to rectify in time. The following factors were considered as contributing:\r\n- Error of other personnel: The pilot of the other aircraft initiated the instrument descent from 12,000 feet after 2 min 55 sec, when the normal time would have been 1 min 15 or 20 sec, in accordance with the procedures laid down in the Bogotá approach-to-land chart and the Manual of Colombian Air Routes approved by the Administrative Directorate of Civil Aeronautics, thereby creating a risk of collision in the air;\r\n- The pilot of the subject aircraft had been flying on DC-4s and C-46s as well as DC-3s. The psychological reaction of the pilot at a critical moment was certainly affected by habits acquired on DC-4 and C-46 aircraft.\r\n- Possible failure of equipment (faulty distribution of flight instruments in the cockpit): This is a design effect, since the artificial horizon in the subject type of aircraft was hidden behind the pilot's control column, which made it more difficult to control the flight posture of the machine."}