{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-100-samedan-2-killed", "date": "Feb 12, 2009 at 1612 LT", "type": "Dassault Falcon 10", "operator": "Laret Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Vienna - Samedan", "msn": "210", "yom": 1987, "flight_number": null, "city": "Samedan", "zone": "Graubünden", "country": "Switzerland", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 17269, "captain_hours_type": 739, "copilot_hours": 2591, "copilot_hours_type": 119, "aircraft_hours": 6386, "circumstances": "On 12 February 2009, the Marcel Dassault/Bréguet Aviation Falcon 10 aircraft, registration VP-BAF, took off at 14:06 UTC from Vienna (LOWW) on a private flight under instrument flight rules (IFR) and an ATC flight plan Y, to Samedan (LSZS). Two crew members and one passenger were on board. After an uneventful flight, the IFR flight plan was cancelled at 14:56:32 UTC and the flight continued under visual flight rules (VFR). Over Samedan the crew were informed by the Samedan airport flight information service officer (FISO) that snow clearance work would be taking place on the runway and that they should expect a ten-minute delay. After approximately 15 minutes the crew initiated the approach. On landing, the aircraft made first contact with the ground by scraping the right wing on the left half of the runway and subsequently touched down with the right, and then the left main landing gear. It then drifted to the left and the left wing tip scraped a bank of snow running parallel to the runway. As a result it rotated anti-clockwise around its vertical axis and crashed into a frozen bank of snow about four metres high. The aircraft broke into two pieces as a result of the force of the impact. The two pilots suffered fatal injuries on the impact. The passenger was seriously injured. The aircraft was destroyed. Fire did not break out.", "probable_cause": "The accident is attributable to the fact that the crew wanted to make a landing with inadequate visual references from an unfavorable initial position and as a result, after touchdown the aircraft collided with a snowbank running along the runway.\r\nThe following factors contributed to the accident:\r\n• The rapidly changing weather conditions on the mountain aerodrome of Samedan were misjudged by the crew.\r\n• A coordinated crew working method in terms of crew resource manage-ment was missing.\r\n• The deactivation of the EGPWS, which meant that acoustic messages con-cerning the aircraft’s height above ground and bank angle were no longer available in the final phase of the approach up to the first contact with the runway.\r\n• A snowbank up to four metres high ran along the edge of the runway."}