{"url": "https://www.baaa-acro.com/crash/ground-fire-douglas-dc-10-10cf-newburgh", "date": "Sep 5, 1996 at 0554 LT", "type": "Douglas DC-10", "operator": "FedEx", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Memphis - Boston", "msn": "47809", "yom": 1975, "flight_number": "FDX1406", "city": "Newburgh-Stewart", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12344, "captain_hours_type": 2504, "copilot_hours": 6535, "copilot_hours_type": 1101, "aircraft_hours": 38271, "circumstances": "The airplane was at FL 330 when the flightcrew determined that there was smoke in the cabin cargo compartment. An emergency was declared and the flight diverted to Newburgh/Stewart International Airport and landed. The airplane was destroyed by fire after landing. The fire had burned for about 4 hours after after smoke was first detected. Investigation revealed that the deepest and most severe heat and fire damage occurred in and around container 06R, which contained a DNA synthesizer containing flammable liquids. More of 06R's structure was consumed than of any other container, and it was the only container that exhibited severe floor damage. Further, 06R was the only container to exhibit heat damage on its bottom surface, and the area below container 06R showed the most extensive evidence of scorching of the composite flooring material. However, there was insufficient reliable evidence to reach a conclusion as to where the fire originated. The presence of flammable chemicals in the DNA synthesizer was wholly unintended and unknown to the preparer of the package and shipper. The captain did not adequately manage his crew resources when he failed to call for checklists or to monitor and facilitate the accomplishment of required checklist items. The Department of Transportation hazardous materials regulations do not adequately address the need for hazardous materials information on file at a carrier to be quickly retrievable in a format useful to emergency responders. ", "probable_cause": "An in-flight cargo fire of undetermined origin."}