{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1245-westphalia-2-killed", "date": "Sep 14, 2002 at 1555 LT", "type": "Pilatus PC-12", "operator": "Pilatus Partners", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Lake Ozark – South Bend", "msn": "425", "yom": 2001, "flight_number": null, "city": "Westphalia", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1645, "captain_hours_type": 58, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 505, "circumstances": "The turbo-prop airplane departed controlled flight after initiating an ATC directed turn during cruise climb. The airplane subsequently entered a rapidly descending spiral turn, impacting the terrain and exploding. A witness reported hearing an \"unusually loud\" engine sound prior to seeing the airplane in a nose-low descent. The witness stated the airplane was \"heading straight down, and did between a quarter and half of turn, but was not spinning wildly.\" The witness reported the airplane disappeared behind a nearby ridgeline and was followed by a \"loud sound, and an immediate large cloud of black smoke.\" Aircraft radar track data showed the airplane heading to the northeast, while climbing to a maximum altitude of 13,800 feet msl. The airplane then entered an increasingly tighter, right descending turn. The calculated descent rate was 7,000 feet/min. Instrument flight rules (IFR) conditions prevailed at altitude and marginal visual flight rules (MVFR) conditions prevailed at the accident site. The instrument-rated pilot received a weather briefing prior to departure. During the briefing the pilot was told of building thunderstorm activity near the departure airport and along the route of flight. The pilot told the briefer he was going to depart shortly to keep ahead of the approaching weather. A witness at the departure airport reported that the passenger was concerned about flying in \"bad weather\" and the pilot told the passenger that the weather was only going to get worse and that they \"needed to go to get ahead of it.\" A two-dimensional reconstruction determined that all primary airframe structural components, flight control surfaces, powerplant components, and propeller blades were present. Flight control continuity could not be established due to the extensive damage to all components. Inspection of the recovered flight control components did not exhibit any evidence of pre-impact malfunction. The standby attitude indicator gyro and its case showed evidence of rotational damage, consistent with the gyro rotating at the time of impact. Both solid-state Attitude & Heading Reference System (AHRS) units were destroyed during the accident, and as a result no information was available.", "probable_cause": "The pilot's spatial disorientation while turning in a cruise climb in instrument meteorological conditions, which resulted in the pilot's loss of aircraft control, and his failure to recover from a resultant tight descending spiral."}