{"url": "https://www.baaa-acro.com/crash/crash-farman-f60-goliath-east-malling-1-killed", "date": "Aug 27, 1923 at 1730 LT", "type": "Farman F.60 Goliath", "operator": "Air-Union-France-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Paris - Berck-sur-Mer - Croydon", "msn": "16", "yom": 1922, "flight_number": null, "city": "East Malling", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 800, "captain_hours_type": 380, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Paris-Le Bourget at 1245LT and landed at Berck-sur-Mer a little over an hour later in order to take 3 passengers on board, the journey being continued at 1445LT. Shortly after passing Lympne, the port engine commenced to overheat and on this account the pilot turned back and landed on the aerodrome. It was then found that the port radiator was leaking. After the mechanic had executed a temporary repair and refilled the radiator, the pilot left Lympne at 1647LT with both engines running satisfactorily. When the aeroplane was a few miles to the south of Maidstone, flying at a height of about 1,500 feet, the starboard engine failed suddenly and completely, the propeller coming to a standstill. The pilot, while looking for a suitable landing ground and keeping the port engine running under full power, made a wide circuit to the left and at a height of about 500 feet he resumed his original course with the intention of landing in a large field on East Malling. (This field was known to the pilot, as he had on a previous occasion made a forced landing not far from it). While the pilot was making the circuit to the left the mechanic reported the engine failure to Croydon by W/T and moved two suitcases from his gangway to the rear of the passengers' cabin. Acting on an order from the pilot, he then instructed the four passengers in the nose of the Goliath to move into the after portion of the cabin. Two of the passengers took up a position at the rear end of the cabin and one stood by the second seat. The fourth passenger in the nose of the machine, (killed) who at that time was suffering from air sickness, refused to leave his seat. On nearing the ground and when the aeroplane was heading in a N.N.W. direction with the field on its port bow, the pilot throttled down the port engine and prepared to turn into wind for the landing. As soon as the engine was throttled down the tail of the machine commenced to drop and the pilot was unable to correct the movement, the controls becoming inoperative. The aeroplane then turned with increasing bank to starboard and finally nose-dived to the ground. The pilot was slightly injured in the crash, his mechanic was hurt quite seriously.\r\nCrew:\r\nJean-Jacques Denneulin, pilot,\r\nJean Morin, mechanic.\r\nPassengers:\r\nMr. L. E. A. Gunther (killed)\r\nMr. S. Bertish (seriously injured)\r\nMr. M.Oliver (seriously injured)\r\nMr. M. Strieseman (seriously injured)\r\nMr. Centeswall (seriously injured)\r\nMr. A.M. Austin (injured)\r\nMr. D. Smith (injured)\r\nMrs Smith (injured)\r\nMr. Murat (unhurt).\n\r\nSource: Kent & Sussex History Forum", "probable_cause": "Engine failure.\n"}