{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-near-cochenour", "date": "Jun 16, 1996 at 1914 LT", "type": "De Havilland DHC-3 Otter", "operator": "Wildcountry Airways", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Cochenour - Thunder Bay", "msn": "222", "yom": 1957, "flight_number": null, "city": "Cochenour", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The float-equipped DHC-3 (Otter), carrying the pilot and six passengers, departed the company's water base at Cochenour, Ontario, on a charter flight to Sandy Beach Lodge, located on Trout Lake approximately 25 miles to the east. The pilot levelled the aircraft and configured it for cruise flight at approximately 2,500 feet above sea level (asl). Shortly after level-off, the pilot heard a popping sound and noted a slight loss of engine power, and wisps of whitish-grey smoke entered the cabin. The aircraft instruments indicated normal engine operation, and the fire warning system did not activate. The pilot suspected that the engine had suffered a cylinder failure and turned to return to Cochenour. A passenger seated in the right front crew seat reported flames near the floor at the front, right corner of the cockpit. The pilot radioed the Thunder Bay Flight Service Station to advise of the emergency, had the passenger vacate the crew seat, and attempted to suppress the fire with a hand-held extinguisher. Thick, black smoke billowed into the cabin, restricting visibility and causing respiratory distress for all of the occupants. The pilot opened the left crew door in order to see ahead and landed the aircraft, still on fire, on McNeely Bay, the first available landing site. The aircraft landed hard but remained upright on the floats. The occupants left by the main door, with their life jackets, and were picked up almost immediately by nearby boats. The aircraft was consumed by fire within minutes after landing. The pilot suffered second degree burns to his face and right forearm, and the passenger in the right crew seat suffered burns to his right leg. The remaining five passengers escaped serious injury.", "probable_cause": "Continued operation of the engine following an exhaust valve failure on the n°2 cylinder resulted in a flaming gas path near the right side of the firewall, an exhaust system overheat, and a subsequent cabin fire. "}