{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-walker-1-killed", "date": "Jan 17, 1998 at 1230 LT", "type": "Cessna 402", "operator": "Redding%20Aero%20Entreprises", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Reno - Columbia", "msn": "402C-0085", "yom": 1979, "flight_number": null, "city": "Walker", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3942, "captain_hours_type": 722, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16731, "circumstances": "The aircraft collided with trees and mountainous terrain about 9,500 feet msl. The wreckage was spread across the lee side of a mountain, in a grassy meadow surrounded by high mountainous terrain on all sides. The area, about 100 feet in front of the aircraft, was a rocky embankment which sloped upward approximately 30 degrees. About 100 feet from the tail of the aircraft, the terrain dropped off into a steep cliff, which sloped down about 65 degrees. At the base of the cliff was a valley, which was about 1/4 mile wide. The farthest piece of debris was found 410 feet away from the main wreckage site in a grove of trees. Fifteen tree disturbances were noted in the grove. The first disturbance began near the tops of the trees and continued in a descending path. Much of the airframe exhibited semicircular impressions consistent with the trunk diameters of the disturbed trees at the accident site. Organic material transfer was evident in the impressions. An analysis of the meteorological data showed that a clear or scattered cloud condition was likely in the accident area, and visibility was probably unrestricted. It also showed that an extended north-northwestward/south-southeastward cloud band was located over the Sierra Nevada Mountains about 9 to 10 miles southwest through west of the accident location around the time of the accident. The analysis estimated that the winds aloft at 10,000 to 12,000 feet msl in the mountains were from approximately 270 degrees at 40 to 45 knots. Further, moderate or greater turbulence and strong updrafts and downdrafts were reported along the pilot's route of flight. No mechanical discrepancies were found with the airframe or either engine during the postaccident examination. ", "probable_cause": "The pilot's encounter with a downdraft while approaching high terrain at an altitude insufficient to ensure adequate terrain or obstacle clearance. "}