{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-south-lake-tahoe-4-killed", "date": "Jul 17, 1987 at 1930 LT", "type": "Beechcraft 200 Super King Air", "operator": "Skywater Lodge", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Hayward - South Lake Tahoe", "msn": "BB-1106", "yom": 1983, "flight_number": null, "city": "South Lake Tahoe", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3995, "captain_hours_type": 381, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 478, "circumstances": "While on an instrument flight plan in IMC, the flight was cleared for an instrument approach to the South Lake Tahoe Airport, the intended destination. The aircraft departed the initial approach fix on the published transition to the final approach course. Radar contact was lost at 11,400 feet. Afterward, the aircraft was observed descending out of clouds and maneuvering erratically in VMC until it impacted terrain with no apparent attempt to recover. Medical records revealed pilot had a history of hypertension, hyperlipidemia, and recent loss of 41 pounds on a rigid weight loss program. The autopsy revealed severe arteriosclerosis. Medical records indicated the pilot had been taking diazide intermittently for several years. Post-accident tox results were negative. The circumstances of the accident, in combination with the pilot's severe diet, medical history, and postmortem examination results support the conclusion that the pilot became incapacitated in flight. All four occupants were killed. ", "probable_cause": "Occurrence #1: loss of control - in flight\r\nPhase of operation: approach - iaf to faf/outer marker (ifr)\r\nFindings\r\n1. (c) incapacitation(other cardiovascular) - pilot in command"}