{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b60-duke-asheville-4-killed", "date": "Oct 27, 2004 at 1050 LT", "type": "Beechcraft 60 Duke", "operator": "Jorge Campillo", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "City", "schedule": "Asheville – Greensboro", "msn": "P-496", "yom": 1979, "flight_number": null, "city": "Asheville", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 13400, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2144, "circumstances": "At about the 3,000-foot marker on the 8,000-foot long runway witnesses saw the airplane at about 100 to 150-feet above the ground with the landing gear retracted when they heard a loud \"bang\". They said the airplane made no attempt to land on the remaining 5,000 feet of runway after the noise. The airplane continued climbing and seemed to gain a little altitude before passing the end of the runway. At that point the airplane began a right descending turn and was in a 60 to 80 degree right bank, nose low attitude when they lost sight of it. The airplane collided with the ground about 8/10 of a mile from the departure end of runway 34 in a residential area. Examination of the critical left engine found no pre-impact mechanical malfunction. Examination of the right engine found galling on all of the connecting rods. Dirt and particular contaminants were found embedded on all of the bearings, and spalling was observed on all of the cam followers. The oil suction screen was found clean, The oil filter was found contaminated with ferrous and non-ferrous small particles. The number 3 cylinder connecting rod yoke was broken on one side of the rod cap and separated into two pieces. Heavy secondary damage was noted with no signs of heat distress. Examination of the engine logbooks revealed that both engine's had been overhauled in 1986. In 1992, the airplane was registered in the Dominican Republic and the last maintenance entry indicated that the left and right engines underwent an inspection 754.3 hours since major overhaul. There were no other maintenance entries in the logbooks until the airplane was sold and moved to the United States in 2002. All three blades of the right propeller were found in the low pitch position, confirming that the pilot did not feather the right propeller as outlined in the pilot's operating handbook, under emergency procedures following a loss of engine power during takeoff.", "probable_cause": "The pilot's failure to follow emergency procedures and to maintain airspeed following a loss of engine power during takeoff, which resulted in an inadvertent stall/spin and subsequent uncontrolled impact with terrain. Contributing to the cause was inadequate maintenance which resulted in oil contamination."}