{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-naples-3-killed", "date": "Jun 19, 2002 at 0958 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Cavin Robert Councilor", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Naples – Saint Petersburg", "msn": "46-08102", "yom": 1987, "flight_number": null, "city": "Naples", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4643, "circumstances": "An annual inspection had been completed on the airplane the same day, and on its first flight after the annual inspection, as the airplane was departing from runway 05, at Naples Municipal Airport, witnesses said the engine ceased operating. They also said that the propeller was rotating either slowly or had stopped, and they then observed the airplane enter a steep turn, followed by an abrupt and uncontrolled nose-low descent and subsequent impact with the ground. The airplane came to rest in a nose-low, near vertical position, suspended at its tail section by a fence and some trees along the eastern perimeter of the airport. It had incurred substantial damage and the pilot and two passengers who were onboard the airplane were fatally injured. Postaccident examination of the airframe, flight controls and the engine did not reveal any mechanical failure or malfunction. The flaps were found to have been set to 10 degrees, and the propeller showed little or no evidence of rotation at impact. The FAA Toxicology Laboratory, Oklahoma City, Oklahoma, performed toxicological studies on specimens obtained from the pilot and the results showed that diphenhydramine was found to be present in urine, and 0.139 (ug/ml, ug/g) diphenhydramine was detected in blood. Diphenhydramine, commonly known by the trade name Benadryl, is an over-the-counter antihistamine with sedative side effects, and is commonly used to treat allergy symptoms. Published research (Weiler et. al. Effects of Fexofenadine, Diphenhydramine, and Alcohol on Driving Performance. Annals of Internal Medicine 2000; 132:354-363), has noted the effect of a maximal over the counter dose of diphenhydramine to be worse than the effect of a 0.10% blood alcohol level on certain measures of simulated driving performance. The level of diphenydramine in the blood of the pilot was consistent with recent use of more than a typical maximum single over-the-counter dose of the medication.", "probable_cause": "The pilot's failure to maintain airspeed above the stall speed while maneuvering to land after the engine ceased operating for undetermined reasons, which resulted in a stall/spin, an uncontrolled descent, and an impact with the ground."}