{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-chub-cay", "date": "Dec 20, 2007 at 1700 LT", "type": "Cessna 208B Grand Caravan", "operator": "Agape%20Flights-2", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "La Isabela - West Palm Beach", "msn": "208B-0556", "yom": 1996, "flight_number": null, "city": "Chub Cay", "zone": "Berry Islands", "country": "Bahamas", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7390, "circumstances": "On December 20, 2007 at approximately 1630EST, N954PA a Cessna 208B Caravan aircraft, owned and operated by Agape Flight Inc [United States FAR Part 91 Operator] enroute from Santo Domingo, Dominican Republic to West Palm Beach, Florida incurred sudden engine stoppage. At the time N954PA was flying at 12,000 ft. The aircraft was diverted to the nearest airport but was unable to glide the required distance and landed 30 nautical miles (NM) West North West (WNW) of Chub Cay. There were 2 crew members on board the aircraft. No injuries were reported by the crew. The aircraft is submerged in approximately eighteen to twenty feet of water, with the aircraft tail being visible at low tide. Both crews were qualified in accordance with the United States Code of Federal Regulations.", "probable_cause": "The engine power loss was caused by a loss of fuel pressure resulting from a loss of drive to the fuel pump. The drive loss was caused by worn and cracked splines on the drive shaft. The damage to the splines of the fuel pump drive shaft was likely caused by cracking below the chrome plating covering the splines, which deteriorated into spalling and wear leading to decouple between the\r\naccessories gearbox and fuel pump. The remaining engine damage was caused by exposure to salt water. \r\nContributing factors:\r\nMaintenance changed the fuel control unit and coupling shaft on July 17, 2007 due to original FCU failing emergency power checks. However there is no record to show whether or not the splines of fuel pump drive shaft inspection as per P&WC’s applicable Maintenance Manual has been accomplished."}