{"url": "https://www.baaa-acro.com/crash/crash-sud-aviation-se-210-caravelle-vi-n-cordoba", "date": "Jul 3, 1963 at 1906 LT", "type": "Sud-Aviation SE-210 Caravelle", "operator": "Aerolineas-Argentinas-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Mendoza – Córdoba – Buenos Aires", "msn": "127", "yom": 1962, "flight_number": "AR527", "city": "Córdoba-Ambrosio Taravella (Pajas Blancas)", "zone": "Córdoba", "country": "Argentina", "region": "South America", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 63, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16835, "captain_hours_type": 513, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Flight AR-527/03 was a scheduled domestic flight from Mendoza to Buenos Aires Aeroparque, Argentina, via Pajas Blancas Airport. The flight plan for the trip was prepared in Mendoza by the airline's dispatcher and was approved by the chief of the Operations Office as well as by the Northwest Regional Control Area. The aircraft was cleared to fly at 8700 m with reporting points along the airway at Chanar-Pampa Salinas and at the entrance to the Terminal Area. The aircraft took off from Mendoza at 1750 hours and made its first contact by radio with Pajas Blancas Airport control tower at 1840 hours. Six minutes later it was cleared for an instrument approach to runway 17. The approach was initiated at a height of 1500 m which was contrary to the regulation height of 3300 m prescribed for jet aircraft. A magnetic heading of 400 was flown on the outbound track and the aircraft was above the cloud layer at a height of 1054 m above the ground. After the time prescribed in the airline's approach chart had elapsed, a left hand turn was initiated, to intercept QDM 200 degrees. During the turn the height was maintained with landing gear extended, flaps at 20° and an indicated airspeed of 140 kt. On completion of the turn a magnetic heading of 200° was flown towards the beacon, and the aircraft resumed its descent until intercepting VOR radial 168. At this point the pilot thought he was 250 m above the ground and, still flying on instruments, he intercepted the VOR and changed course to 170 degrees. When he did not make visual contact with the runway at a height of 150 m he started a go-around, climbing on a magnetic heading of 105 degrees. He then initiated a right-hand turn to intercept the radio beacon again and asked for another clearance from the tower to come in again. He flew over the beacon at a height of 1050 m, then followed a magnetic heading of 40° during about 2 min 30 sec and, while still descending, initiated a left-hand turn until he obtained QDM 200. The landing gear was extended and locked, flap setting 20°, and a normal descent at 500 ft/min. was maintained. He intercepted VOR radial 168, announced that he was at 160 m and then initiated a turn to align himself with runway 17. Shortly thereafter the aircraft's port wing struck some trees five meters high and the port landing gear came into contact with the ground. The pilot-in-command reduced power and pushed the control column forward. After having traveled during approximately 60 m on its port landing gear, the aircraft rolled on its whole undercarriage another 700 m. At 390 m from initial impact the port wing struck some other trees, the fuel tanks burst out and fire broke out. The aircraft then came into contact with the General Belgrano Railway tracks, broke its undercarriage, tearing away 25 m of railway rails and finally came to rest 280 m before the threshold of runway 17.", "probable_cause": "Striking the ground during final approach, when the pilot failed to execute the approved instrument entry procedure."}