{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-ocala-1-killed", "date": "Jan 27, 2012 at 1227 LT", "type": "Cessna 340", "operator": "Flying G Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Macon - Ocala", "msn": "340A-0624", "yom": 1978, "flight_number": null, "city": "Ocala", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1048, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5057, "circumstances": "The pilot entered the left downwind leg of the traffic pattern to land to the north. A surface wind from the west prevailed with gusts to 15 knots. Radar data revealed that the airplane was on final approach, about 1.16 miles from the runway and about 210 feet above the ground. The airplane then crashed in a pasture south of the airport, in a slight left-wing-low attitude, and came to rest upright. The cockpit and cabin were consumed in a postcrash fire. The pilot's wife, who was in the aft cabin and survived the accident, recalled that it was choppy and that they descended quickly. She recalled hearing two distinct warning horns in the cockpit prior to the crash. The airplane was equipped with two aural warning systems in the cockpit: a landing gear warning horn and a stall warning horn. The pilot likely allowed the airspeed to decay while aligning the airplane on final approach and allowed the airplane to descend below a normal glide path. Examination of the wreckage revealed that the landing gear were in transit toward the retracted position at impact, indicating that the pilot was attempting to execute a go-around before the accident. The pilot made no distress calls to air traffic controllers before the crash. The pilot did not possess a current flight review at the time of the accident. Examination of the wreckage, including a test run of both engines, revealed no evidence of a pre-existing mechanical malfunction or failure that would have precluded normal operation of the airplane.", "probable_cause": "The pilot's failure to maintain adequate airspeed and altitude on final approach, resulting in an impact with terrain short of the airport."}