{"url": "https://www.baaa-acro.com/crash/crash-airbus-a310-vienna-austria", "date": "Jul 12, 2000 at 1334 LT", "type": "Airbus A310", "operator": "Hapag-Lloyd.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hania - Hanover", "msn": "0528", "yom": 1990, "flight_number": "HF3378", "city": "Vienna-Schwechat", "zone": "Vienna", "country": "Austria", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 143, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 23400, "captain_hours_type": null, "copilot_hours": 2850, "copilot_hours_type": null, "aircraft_hours": 41307, "circumstances": "After takeoff from Chania-Souda Airport, the crew reported technical problems with the right main gear that could not be raised properly in its wheel well. The captain decided to continue to Munich in a gear down configuration but the fuel consumption increased. En route, the crew realized he could not make it to Munich so diverted to Vienna-Schwechat Airport. At a distance of about 12 NM from the airport, at an altitude of 4,000 feet, both engines failed due to fuel exhaustion. One of the engine could be restarted for a short period of time but on short final, the aircraft stalled and struck the ground (a grassy area) about 500 metres short of runway 34. The left main gear broke off, the aircraft slid for some 600 metres then veered to the left and came to rest on its left wing. All 151 occupants were rescued, among them 26 passengers were slightly injured. The aircraft was damaged beyond repair. ", "probable_cause": "Continuation of the flight with a landing gear problem until the engines failed due to fuel exhaustion.\r\nThe following findings were identified:\r\nCrew:\r\n- Failure to comply with the company's rules on fuel reserves, caused by several human factors, with extreme workload and stress being the important factor (loss of situational awareness).\r\n- Determination of the fuel reserves using only the FMS, which, due to its characteristics did not take into account the additional fuel consumption.\r\n- Failure to develop alternative strategies to curb the fuel problem.\r\n- Failure to comply with a fuel warning (low fuel level warning) and decision to continue the flight to Vienna International Airport, although the plane was in the immediate vicinity of Zagreb Airport.\r\nManufacturer:\r\n- Inadequate and misleading documentation (FMS scheme, altitude, terms) for this specific case, particularly in relation to the restriction of FMS.\r\nOperator:\r\n- Inadequate documentation for \"abnormal landing gear up indication\" of the abnormal checklist.\r\n- Lack of review of the fuel needs by the Operations Division.\r\nContributing factors:\r\n- Missing or inadequate preventive measures by manufacturers, approving authority and airlines following the previous publications of ICAO and EU DG VII about problems which, with the introduction of aircraft equipped with modern technologies, occurred and had been identified.\r\n- Anthropo-technical construction deficiencies, which favour a misinterpretation of the FMS EFOB display."}