{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-horn-island", "date": "Oct 21, 1998 at 0940 LT", "type": "Rockwell Shrike Commander 500", "operator": "Coral Sea Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Boigu Island - Horn Island", "msn": "500-3089", "yom": 1970, "flight_number": null, "city": "Horn Island", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2045, "captain_hours_type": 79, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Shrike Commander departed Horn Island on a charter flight to Saibai and Boigu Islands in accordance with the visual flight rules (VFR). The flight to Saibai took 32 minutes, and a further 13 minutes to Boigu Island. The aircraft then departed Boigu to return to Horn Island with an expected flight time of 35 minutes. The pilot reported that he had maintained 5,500 ft until commencing descent at 35 NM from Horn Island. He tracked to join final approach to runway 14 by 5 NM, reducing power at 1,500 ft. At 5 NM from the runway, the pilot extended the landing gear and approach flap and commenced a long final approach. When the aircraft was approximately 3 NM from the runway both engines commenced to surge, with the aircraft initially yawing to the right. The pilot commenced engine failure procedures and retracted the flaps. He tried a number of times to determine which engine was losing power by retarding the throttle for each engine, before deciding that the right engine was failing. The pilot shut down that engine and feathered the propeller. A short time later, when the aircraft was approximately 200 ft above the water, the left engine also lost power. The pilot established the aircraft in a glide, advised the passengers to prepare for a ditching, and transmitted a MAYDAY report on the flight service frequency before the aircraft contacted the sea. The aircraft quickly filled with water and settled on the seabed. All five occupants were able to escape and make their way ashore.", "probable_cause": "The following findings were identified:\r\n- The pilot was correctly licensed and qualified to operate the flight as a VFR charter operation.\r\n- The aircraft was dispatched with an unusable fuel quantity indicator.\r\n- The right engine fuel control unit was worn and allowed additional fuel through the system, increasing fuel consumption by approximately 6 L/hr. \r\n- Inappropriate fuel consumption rates were used for flight planning.\r\n- The aircraft fuel log contained inaccuracies that resulted in a substantial underestimation of the total fuel used.\r\n- At the time of the occurrence, there was no useable fuel in the aircraft fuel system.\r\n- Although the pilot met the Civil Aviation Safety Authority criteria to fulfil his role as chief pilot, he did not have the expertise to effectively ensure the safety of company flight operations."}