{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-snb-5-navigator-santa-ana-mountains-4-killed", "date": "Nov 18, 1950", "type": "Beechcraft AT-7 Navigator", "operator": "US%20Navy", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Mountains", "schedule": null, "msn": "7825", "yom": 1944, "flight_number": null, "city": "Santa Ana Mountain (Orange County)", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Tucson, Arizona, with a stop in El Centro, California, on a routine training flight bound for MCAS El Toro in Orange County, CA with four men on board. The weather in Southern California included heavy overcast with rain and strong winds in the vicinity of the El Toro base. The pilot was initially cleared to make an instrument approach, but was then directed into a holding pattern because of a technical problem with the GCA landing system. After a few minutes the El Toro controller cleared 29649 to land, as the GCA problem had been fixed, but the pilot of the SNB-5 did not respond. It was then recognized that the aircraft had crashed and search & rescue protocols were initiated. Three days later, the wreckage was spotted by a Civil Air Patrol pilot on the west flank of the Santa Ana Mountains at 4,000 feet MSL, the altitude the pilot had been directed to hold by the controller prior to being cleared to land. Weather and technical problems contributed to this tragic accident. The crew, flying in the clouds did not see the mountain and died instantaneously upon impact.\nCrew:\nM/Sgt William H. Follmer, pilot,\n1st Lt Willard M. Grubbs, pilot,\nT/Sgt Keith M. Ferguson, copilot,\nSgt Milton E. Johanson.\nSource & photo:\nhttp://www.aircraftwrecks.com/monuments/snb-5.htm", "probable_cause": null}