{"url": "https://www.baaa-acro.com/crash/crash-bristol-142-blenheim-iv-north-crawley-3-killed", "date": "Aug 7, 1940 at 2235 LT", "type": "Bristol 142 Blenheim", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Upwood - Upwood", "msn": "9384", "yom": 1939, "flight_number": null, "city": "North Crawley", "zone": "Buckinghamshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot’s instructions were to fly from Upwood to Bicester 53 miles, Bicester to Northampton, 25 miles and back to base 33 ½ miles. At a time when the aeroplane should have been near Northampton it was seen flying in an easterly direction 20 miles SE of the scheduled course and close to Cranfield Aerodrome where night flying was taking place. When opposite the wireless telegraphy station the machine was seen to stagger. Five seconds later at about 1500 feet and while still in flying position it lost speed and spun to the ground. The aeroplane struck the ground at a moderate speed and came to a stop pointing east, the engines were not at the time. From its position and the proximity of trees immediately behind it could be judged to have been flattening out, probably in a left hand spin. Fire occurred immediately and destroyed all the centre of the machine. All safety belts were burnt. One body was found in the navigator’s compartment and one in the gunner’s cockpit. The third, that of the pilot, was lying face down 72 yards east of the wreckage and he had evidently fallen from a considerable height. His parachute was unopened and was on the ground 4 feet away; the harness was free. The rip- cord had not been pulled. No parts broken or otherwise were found to show the circumstances under which he left the machine. The engines were extensively damaged by fire were stripped but appeared to have been in good order at the time of the accident. Examination of the pilot’s parachute harness showed that the release ring had not been turned and while in the locked position had been driven back by direct impact on the front. This had forced the spin- loaded plunger out through the aluminium casing and had released the catches and then the harness. From this it may be seen that the harness was in position on the pilot’s striking the ground. \r\nSource:\r\nhttp://www.rafupwood.co.uk/17otulosses.html \r\nhttp://www.mackz.net/cm_samplearticles.htm#local%20hero", "probable_cause": "The investigation concluded that the pilot may have lost his way, was trying to identify Cranfield aerodrome and on suddenly becoming aware of the risk of collision with the night flying machines stalled the aeroplane while climbing. Alternatively it was thought possible that on loosing sight of the aerodrome flares he lost control in the 'black-out'.\n"}