{"url": "https://www.baaa-acro.com/crash/crash-airbus-a310-324-moroni-152-killed", "date": "Jun 30, 2009 at 0154 LT", "type": "Airbus A310", "operator": "Yemenia.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Sanaa - Moroni", "msn": "535", "yom": 1990, "flight_number": "IY626", "city": "Moroni-Prince Saïd Ibrahim (ex Hahaya)", "zone": "All Comoros Islands", "country": "Comoros Islands", "region": "Africa", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 142, "pax_fatalities": 141, "other_fatalities": 0, "total_fatalities": 152, "captain_hours": 7936, "captain_hours_type": 5314, "copilot_hours": 3641, "copilot_hours_type": 3076, "aircraft_hours": 53587, "circumstances": "Following an uneventful flight from Sana'a, the crew started a night approach to Moroni-Prince Saïd Ibrahim Airport runway 02. Weather conditions were considered as good with a 10 km visibility, an OAT of 24° C. and a wind from 180° gusting to 25 knots for runway 20. For unknown reasons, the crew initiated a go-around procedure when the aircraft entered an uncontrolled descent and crashed in the sea about 6 km from the airport. A young girl aged 12 was found alive few hours later while 152 other occupants were killed. Both CVR and DFDR were found almost two months later at a depth of 1,200 metres. The final report was published in June 2013. ", "probable_cause": "The accident was caused by inappropriate actions on part of the crew on flight controls which brought the aircraft into a stall that could not be recovered. These actions were successive to an unstabilized visual approach during which several alarms related to the proximity of the ground, the aircraft configuration and approach to stall sounded. Crew's attention was focused on the management of the path of the aircraft and the location of the runway, and they probably did not have enough mental resources available in this stressful situation, to respond adequately to these different alarms.\r\nContributing to the accident were the following factors:\r\n- Weather conditions at the airport with winds gusting to 30 knots,\r\n- Lack of training or pre-flight briefing of the crew in accordance with the Yemenia company operations manual, given the reluctance of the pilot to execute the MVI [Visual Maneuvering with Prescribed track] (none of the documents submitted in the investigation shows this training), \r\n- The non-execution of the MVI maneuver by the crew (the plane left the LOC axis after the published point which is 5.2 NM), implying that the crew delayed the turn to reach the right hand downwind leg.\r\n- The non-application by the crew of the procedure following the PULL UP-alarm."}