{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3c-copenhagen-22-killed", "date": "Jan 26, 1947 at 1532 LT", "type": "Douglas DC-3", "operator": "KLM-21", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Amsterdam – Copenhagen – Stockholm", "msn": "14034/25479", "yom": 1944, "flight_number": null, "city": "Copenhagen-Kastrup", "zone": "Hovedstaden", "country": "Denmark", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 16, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 22, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1686, "circumstances": "Less than one minute after takeoff from Kastrup Airport, while climbing to a height of 200 feet with a 40 km/h wind from the northeast, the aircraft nosed down and crashed in a huge explosion in a snow covered field located 1,000 meters from the airport. The aircraft was destroyed by impact forces and a post crash fire and all 22 occupants were killed, among them Prince Gustaf Adolf of Sweden, grandson of the King Gustaf V, and the US singer Grace Moore. \r\nCrew:\r\nG. J. Geysendorffer, pilot,\r\nG. J. Rietman, copilot, \r\nS. M. A. Pijnenburg, radio operator, \r\nW. Brandenburg, radio operator, \r\nW. A. van Bommel, flight engineer, \r\nH. Hoek, steward.", "probable_cause": "It was determined that the loss of control during initial climb was caused by stabilizers blocked by a wooded lock pin. During the stopover in Copenhagen-Kastrup, a ground technician decided to put a wooded lock pin in the rudder and the stabilizer as well to avoid unnecessary movements that could cause damages as there were moderate winds in Copenhagen at that time. Before takeoff, one technician removed the wooded lock pin on the rudder but did remove the one on the stabilizer as this wooded lock pin was put by another ground technician and he was not aware of this. Furthermore, none of the crew member proceeded to a walk around check before departure and the pilots failed to check the stabilizers prior to takeoff. "}