{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-i-santiago-de-compostela-2-killed", "date": "Aug 2, 2012 at 0618 LT", "type": "Cessna 500 Citation", "operator": "Airnor", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Oviedo - Santiago de Compostella", "msn": "500-0178", "yom": 1974, "flight_number": null, "city": "Santiago de Compostela", "zone": "Galicia", "country": "Spain", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3600, "captain_hours_type": 500, "copilot_hours": 678, "copilot_hours_type": 412, "aircraft_hours": 9460, "circumstances": "Based on the information available, at 20:40 the ONT (National Transplant Organization) informed the Santiago Airport (LEST) that they were going to make a “hospital flight”. The aircraft was refueled at the Santiago Airport with 1062 liters of fuel. According to communications, the crew of aircraft EC-IBA contacted the Santiago tower at 21:46 to request permission to start up and information on the weather and the runway in use at Asturias. At 21:54 they were cleared to take off. According to the airport operations office, the aircraft landed in Asturias (LEAS) at 22:27. The hospital flight service commenced at 22:15. The RFFS accompanied the ambulance to the aircraft at 22:30 and at 22:44 the aircraft took off en route to Porto. The aircraft was transferred from Madrid control to Santiago approach at 22:52 at flight level 200 and cleared straight to Porto (LPPR). Based on the information provided by Porto Airport, the aircraft landed at 23:40. While waiting for the medical team to return, the crew remained in the airport’s facilities. According to some of the personnel there, the crew made some comments regarding the bad weather. There was fog, especially on the arrival route. At 01:34 and again at 02:01 the crew was supplied with the flight plan information, information from the ARO-LPPR office and updated weather data. The aircraft was refueled at the Porto Airport with 1,000 l of fuel and took off at 02:34. At 02:44 the aircraft contacted approach control at Santiago to report its position. Four minutes later the crew contacted the Santiago tower directly to ask about the weather conditions at the field (see Appendix C). The aircraft landed once more in Asturias at 03:28. At 03:26 the RFFS was again activated to escort the ambulance to the aircraft. The service was deactivated at 04:00. The crew requested updated weather information from the tower, which provided the information from the 03:00 METAR. According to the flight plan filed, the estimated off-block time (EOBT) for departing from the Asturias Airport was 03:45, with an estimated flight time to Santiago of 40 minutes. The alternate destination airport was Vitoria (LEVT). The aircraft took off from Asturias at 03:38. At 03:56 the crew established contact with Santiago approach control, which provided the crew with the latest METAR from 03:30, which informed that the runway in use was 17, winds were calm, visibility was 4,000 m with mist, few clouds at 600 ft, temperature and dew point of 13° and QNH of 1,019. The aircraft was then cleared to conduct an ILS approach to runway 17 at the Santiago Airport. At 04:15 the crew contacted the tower controller, who reported calm winds and cleared them to land on runway 17. At 04:18 the COSPAS-SARSAT system detected the activation of an ELT. The system estimated the position for the beacon as being in the vicinity of the LEST airport. At 04:38 the tower controller informed airport operations of a call he had received from SAR that a beacon was active in the vicinity of the airport, and requested that a marshaller go to the airport where  the  airplane  normally parked to see if it was there. At 04:44 the marshaller confirmed that the aircraft was not in its hangar  and  the  emergency procedure was activated, with the various parties involved in the search  for  the  airplane  being notified. At 05:10 the control tower called the airport to initiate the preliminary phase (Phase I) before activating the LVP. At 05:15 the RFFS reported that the aircraft had been found in the vicinity of the VOR. At 05:30 the LVP was initiated (Phase II). At 07:51 the LVP was terminated. The last flight to arrive at the Santiago  Airport  before the accident had landed at 23:33, and the next flight to arrive following the accident landed at 05:25.", "probable_cause": "The ultimate cause of the accident could not be determined. In light of the hypothesis considered in the analysis, the most likely scenario is that the crew made a non-standard precision approach in manual based primarily on distances. The ILS frequency set incorrectly in the first officer’s equipment and the faulty position indicated on the DME switch would have resulted in the distance being shown on the captain’s HSI as corresponding to the VOR and not to the runway threshold. The crew shortened the approach maneuver and proceeded to a point by which the aircraft should already have been established on the localizer, thus increasing the crew’s workload. The crew then probably lost visual contact with the ground when the aircraft entered a fog bank in the valleys near the airport and did not realize they were making an approach to the VOR and not to the runway.\r\nThe contributing factors were:\r\n- The lack of operational procedures of an aircraft authorized to be operated by a single pilot operated by a crew with two members.\r\n- The overall condition of the aircraft and the instruments and the crew’s mistrust of the onboard instruments.\r\n- The fatigue built up over the course of working at a time when they should have been sleeping after an unplanned duty period.\r\n- The concern with having to divert to the alternate without sufficient fuel combined with the complacency arising from finally reaching their destination."}