{"url": "https://www.baaa-acro.com/crash/crash-antonov-70-omsk", "date": "Jan 27, 2001", "type": "Antonov AN-70", "operator": "Antonov%20Design%20Bureau", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Omsk - Yakutsk", "msn": "77 01 02", "yom": 1997, "flight_number": null, "city": "Omsk-Intl", "zone": "Omsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 11, "crew_fatalities": 0, "pax_on_board": 22, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Omsk Airport on a test flight to Yakutsk, carrying 22 passengers and a crew of 11 in order to perform a test flight in low-temperature flight conditions, as part of the Ukrainian manufacturer's certification program. During initial climb, at a height of 20 metres, the engine n°3 lost power. The crew increased power on all three other engines and continued to climb. Less than 25 seconds laters, at a height of about 60 metres, the engine n°1 failed. The captain attempted an emergency landing in a snow covered terrain located 660 metres past the runway end. The aircraft belly landed and came to rest with severe damages to the fuselage (almost broke in two at wings level) and engines. All 33 occupants were rescued, among them four were injured, two seriously.", "probable_cause": "The loss of power on engine n°3 was the result of the rupture of a hydraulic line located near the rotor. This failure caused a reduction of the blades' rotation on both propellers (counter-rotating system), creating severe vibrations. The crew increased power on all three remaining engines when a technical malfunction occurred on an electric sensor coupled to the turbine of the engine n°1, causing the automatic control unit to fail and the engine n°1 to stop."}