{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-200-tegucigalpa-127-killed", "date": "Oct 21, 1989 at 0753 LT", "type": "Boeing 727-200", "operator": "TAN%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San José - Managua - Tegucigalpa - Houston", "msn": "19514", "yom": 1968, "flight_number": "SH414", "city": "Tegucigalpa-Toncontin", "zone": "Francisco Morazán", "country": "Honduras", "region": "Central America", "crew_on_board": 8, "crew_fatalities": 4, "pax_on_board": 138, "pax_fatalities": 127, "other_fatalities": 0, "total_fatalities": 131, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Managua, the crew started a night descent to Tegucigalpa-Toncontin Airport. The standard approach to runway 01 consisted of a three-steps descent from the initial approach fix altitude of 7,500 feet. For unknown reasons, the crew failed to follow this procedure and started the descent prematurely and with a constant descent profile from a distance of 11 nm from the airport. This caused the aircraft to descend below the glide when, at an altitude of 4,000 feet, it struck the slope of Cerro de Hula (4,800 feet high) located 7,7 km short of runway 01. The aircraft disintegrated on impact and 15 people, including four crew members, were rescued while 131 other occupants were killed. ", "probable_cause": "It was determined that the crew failed to follow the approach procedures and initiated a premature descent, causing the aircraft to follow a wrong approach profile. \r\nThe following contributing factors were reported: \r\n- The crew experience was insufficient, \r\n- Negligences on part of the crew, \r\n- Poor crew coordination, \r\n- The crew failed to take appropriate actions when the GPWS alarm sounded, \r\n- Lack of visibility caused by night and marginal weather conditions,\r\n- Absence of visual reference points on the ground. "}