{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-2-brasilia-1-killed", "date": "Dec 22, 1962 at 0100 LT", "type": "Convair CV-240", "operator": "Varig.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rio de Janeiro – Belo Horizonte – Brasília", "msn": "103", "yom": 1948, "flight_number": null, "city": "Brasília", "zone": "Distrito Federal", "country": "Brazil", "region": "South America", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 35, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7165, "captain_hours_type": 2392, "copilot_hours": 3395, "copilot_hours_type": 178, "aircraft_hours": 21728, "circumstances": "At 0054LT, the crew reported on approach to Brasília Airport at an altitude of 1,800 meters. He was instructed to report when inbound for runway 28 and was given the latest weather conditions. Initial approach was begun at 0056. At 0059 the flight reported it as on final approach. The tower gave it thelatest wind conditions, 330°, velocity 8-10 kt, and the aircraft was cleared to land. The message was acknowledged. Nothing further was heard from the flight. The tower controller saw a flash of light in the direction from which the aircraft was expected, however, he did not think anything abnormal had occurred. After a few unsuccessful calls, search and rescue services were alerted. The aircraft had struck trees and the ground 8,400 meters from the runway and continued over uneven ground for 300 meters. As the aircraft fell on its side, only the side exit facing upward would be used for evacuation. Because of the failure of normal lights and the fact that no flashlights were available, it was difficult to find the emergency exit. The captain was killed while the copilot was seriously injured. ", "probable_cause": "The aircraft descended below the prescribed altitude for undetermined reasons."}