{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-thompson", "date": "Nov 2, 2017 at 1920 LT", "type": "Swearingen SA227 Metro III", "operator": "Perimeter%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Gods River – Thompson", "msn": "AC-756", "yom": 1990, "flight_number": "PAG959", "city": "Thompson", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1400, "captain_hours_type": 1000, "copilot_hours": 950, "copilot_hours_type": 700, "aircraft_hours": 24672, "circumstances": "On 02 November 2017, a Perimeter Aviation LP Fairchild SA227-AC Metro III (serial number AC-756B, registration C-FLRY) was operating as flight 959 (PAG959) from Gods River Airport, Manitoba, to Thompson Airport, Manitoba, with 2 flight crew members on board. When the aircraft was approximately 40 nautical miles southeast of Thompson Airport, the crew informed air traffic control that they had received a low oil pressure indication on the left engine that might require the engine to be shut down. The crew did not declare an emergency, but aircraft rescue and firefighting services were put on standby. After touchdown on Runway 24 with both engines operating, the aircraft suddenly veered to the right and exited the runway. The aircraft came to rest in snow north of the runway. The captain and first officer exited the aircraft through the left side over-wing emergency exit and were taken to hospital with minor injuries. The aircraft was substantially damaged. The 406-MHz emergency locator transmitter did not activate. The occurrence took place during the hours of darkness, at 1920 Central Daylight Time.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. The left engine low oil pressure indications during the previous and the occurrence flights were likely the result of a steady oil leak past the rear turbine air-oil seal assembly.\r\n2. The loss of engine oil pressure resulted in a loss of propeller control authority on landing and the upset of the aircraft.\r\n3. After consultation with maintenance, the crew considered the risks associated with landing single engine and without hydraulic pressure for the nose-wheel steering, and decided to continue the flight with both engines running, even though this was not consistent with the QRH procedures for low oil pressure indications.\r\n4. Carbon deposits that accumulated within the inside diameter of the bellows convolutions interfered with the bellows’ ability to expand and to provide a positive seal against the rotor seal.\n\r\nFindings as to risk:\r\n1. If Canadian Aviation Regulations (CARs) subparts 703 and 704 operators do not provide initial or recurrent crew resource management training to pilots, these pilots may not be prepared to avoid, trap, or mitigate crew errors encountered during flight.\r\n2. If operators of the SA227-AC Metro III aircraft rely solely on the emergency procedures listed in the aircraft flight manual, continued engine operation with low oil pressure may result in loss of control of the aircraft.\r\n3. If an engine is not allowed to sufficiently cool down prior to shutdown, oil that remains trapped within hot areas of the engine may heat up to a point where the oil decomposes, creating a carbon deposit.\r\n4. If flight data, voice, and video recordings are not available to an investigation, the identification and communication of safety deficiencies to advance transportation safety may be precluded.\n\r\nOther findings:\r\n1. The investigation was unable to determine the length of cooldown periods for the occurrence aircraft. However, a random sampling of engine shutdowns for similar company aircraft showed that 50% had not completed the full 3-minute cooldown period.\r\n2. Despite having received limited crew resource management (CRM)."}