{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-5d-buffalo-calgary", "date": "Jul 17, 1990 at 1640 LT", "type": "De Havilland DHC-5 Buffalo", "operator": "Fuerza%20Aerea%20Ecuatoriana", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Quito – Billings – Calgary", "msn": "64", "yom": 1976, "flight_number": null, "city": "Calgary", "zone": "Alberta", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft suffered an incident in Ecuador few days prior to this accident and damages were reported to the undercarriage. A ferry flight to Calgary was arranged so the aircraft could be repaired by technicians by De Havilland Canada. The flight from Quito to Calgary was completed with the undercarriage down. Upon touchdown on runway 28 at Calgary Airport, the nose gear collapsed. The airplane slid on its nose and came rest, bursting into flames. In a hurry, both pilots escaped the cabin and did not stop both engines. Hydraulic fluids ignited and the aircraft was totally destroyed by fire. Both pilots were uninjured. Dual registration FAE064 and HC-BFH.", "probable_cause": "It was concluded that the self-centering mechanism could be forced off centre because of a system malfunction caused by the previous accident or by intentional nosewheel steering input, which would cause enough pressure to shear the pins. The internal damage to the controlcam mechanism allowed the wheels to be off centre at touchdown. Marks on the adjacent sides of the pulleys showed that the cable had been lodged in the space between the two pulleys. Although the extent of this damage was limited, it was representative of damage caused by the previous jungle accident and would have caused the sluggish response to nosewheel commands experienced earlier by the crew. When the weight of the aircraft settled on the misaligned nosewheel, the temporary ferry repairs failed in overload and the nosewheel collapsed."}