{"url": "https://www.baaa-acro.com/crash/crash-boeing-sb-29-70-bw-superfortress-stephenville-10-killed", "date": "Mar 18, 1953 at 1951 LT", "type": "Boeing B-29 Superfortress", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Stephenville - Stephenville", "msn": "10814", "yom": 1944, "flight_number": null, "city": "Stephenville", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Captain Francis Quinn and 1st Lt Robert Errico and a crew of eight took off in SB-29-70BW, 44-69982 from Ernest Harmon Air Force Base, Newfoundland at 12:10 on the morning of March 18, 1953 to search for Convair RB-36H-25, 51-13721. 44-69982 was assigned to the 52nd Air Rescue Squadron of the 6th Air Rescue Group. The SB-29 was modified for the search and rescue role. It carried a 40 ft.aluminum boat under the bomb bay. The boat could be dropped by parachute. It had a 4-cylinder engine and rations for a number of days. It had an inflatable shelter at each end, and a tarpaulin could be zipped into place between the shelters to completely cover any occupants. A search radar was installed in place of the lower forward gun turret. The SB-29 scouted the location of the RB-36H crash and determined that there were no survivors. It returned to Harmon AFB at 7:45 P.M.  There were broken clouds at 2,700 feet and and a solid overcast at 5,000 feet. Harmon tower advised Captain Quinn to turn to a heading of 180 degrees and handed him over to GCA. T Sgt. Robert Burgoon was the GCA operator on duty that evening. Captain Quinn reported that he was reading the GCA radio \"five-by-five\". T Sgt. Burgoon instructed him to descend from 4,000 feet to 3,000 feet and maintain a heading of 180 degrees. T Sgt. Burgoon read off the emergency procedure and current weather to Captain Quinn. Quinn acknowledged those transmissions, but when Burgoon read off the standard rate of turn, a different SB-29 crew member responded over the radio. When the SB-29 appeared on the GCA radar scope about seven miles from Harmon AFB, it was flying on a heading of 220 degrees. T Sgt. Burgoon instructed Captain Quinn to turn right to a heading of 30 degrees to avoid losing the Superfortress' radar return in the ground clutter during a left-hand turn. Quinn read back the heading as 300 degrees. Burgoon repeated that the proper heading was 30 degrees. Quinn read back something that Burgoon was not able to understand, so he reiterated his command to turn right to a heading of 30 degrees yet again. Quinn stated that he was initiating a left turn to 30 degrees, and Burgoon repeated that the turn was to be made to the right. Captain Quinn started his right turn and the SB-29 disappeared into the blind spot of the GCA radar. When the Superfortress appeared on radar again about 11 miles from the base, it was inbound on the proper heading of 30 degrees. T Sgt. Burgoon read off the runway condition, landing runway, and braking action to Captain Quinn, but received no reply. He requested acknowledgement of his transmission twice with no response from Quinn. Burgoon commanded Quinn to turn to a heading of 300 degrees to determine whether he was still receiving the GCA transmissions. Burgoon repeated the command twice but received no response from the Superfortress, and it continued on a heading of 30 degrees. The SB-29 was over St. George's Bay about ten miles from the base on a bearing of 240 degrees when it disappeared from the radar scope at 7:51 P.M. It did not get lost in ground clutter. It just disappeared from a location where it should have continued to be visible. On one pass the blip was there, on the next pass it was gone. T Sgt. Burgoon made several calls to the SB-29 in the blind, but no further transmissions were received from it. Pilot Captain Francis Quinn, Co-pilot 1st Lt Robert Errico, Navigator Captain William Roy, Navigator 1st Lt Rodger Null, A/3c James Coggins, A/3c Sammy Jones, A/2c Michael Kerr, S/Sgt David Kimbrough, A/1c David Rash, A/1c Robert Montgomery were lost in the crash. At 8:15, an Air Force rescue vessel was dispatched to the area where the radar return had disappeared. De Havilland of Canada L-20 Beaver, 51-16490 took off at 8:44 to search for any signs of survivors at the crash site. Sikorsky H-5G Dragonfly helicopter, 48-553 took off to conduct a search at 8:46. It was going on midnight when three more vessels joined the search. An oxygen tank from the SB-29 was spotted floating in St. George's Bay at 5:09 the next morning. Search teams found fuel cells, the radio operator's table, air scoop dust covers, hydraulic fluid, an oxygen tank, the navigator's brief case, a partially inflated six-man life raft, and other small debris from the SB-29. The few pieces of structure that were recovered showed evidence that the SB-29 had suffered major damage when it impacted the water. A total of fifty-three pieces of debris were recovered during the first day of searching. A buoy was placed at the oil slick where the debris was found. Two L-20 Beavers searched the bay all day on March 19th. The local countryside was scoured for witnesses. The H-5 Dragonfly was used to visit residences along the shoreline of the bay that were otherwise inaccessible. Civilian John Walters of Kings Head reported that he heard a loud explosion and saw a bright flash, \"kinda like a red flame\" about two to three miles offshore about 7:45 that evening. His was considered to be the most reliable eyewitness account. The Dragonfly was flown to the location where the SB-29 had disappeared from radar. It made a series of descents and ascents. It was noted that it disappeared from the radar as it descended through about 800 feet. Dragging and diving operations began on March 20. Forty square miles of ocean floor were dragged. Divers made sixty-one dives with negative results. The divers and dragging gear were unable to search below a depth of 200 feet. The U.S.S. Salvager was dispatched from Norfolk, Virginia to search the bay with SONAR equipment. It arrived at the station on March 27, but it did not have suitable gear for locating the wreckage. UOL equipment and personnel arrived on April 5 and started searching for the SB-29 wreck on April 6. The UOL equipment was disabled by contact with rocks on the bottom of the bay on April 9. The main wreckage of SB-29, 44-69982 and the bodies of her crew were never found.\r\nSource:\r\nhttp://www.air-and-space.com/b-36 wrecks.htm#51-13721", "probable_cause": null}