{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-mt-huayra-pungo-9-killed", "date": "May 24, 1981 at 1400 LT", "type": "Beechcraft 200 Super King Air", "operator": "Fuerza%20Aerea%20Ecuatoriana", "flight_phase": "Flight", "flight_type": "Government", "survivors": "No", "site": "Mountains", "schedule": "Quito - Macará", "msn": "BB-723", "yom": 1980, "flight_number": null, "city": "Mt Huayra Pungo", "zone": "Loja", "country": "Ecuador", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine airplane departed Quito-Mariscal Sucre Airport around noon on a flight to Macará, carrying six passengers and three crew members, among them Jaime Roldós Aguilera, President of the Republic of Ecuador who was making an official visit of the south region of Ecuador. While cruising at an altitude of 7,700 feet in marginal weather conditions, the airplane struck the slope of Mt Huayra Pungo located 40 km north of Macará. The airplane was destroyed by impact forces and a post crash fire and all nine occupants were killed. The airplane had dual registration HC-BHG and FAE001A.\r\nCrew:\r\nCol Marco Andrade Buitrón, pilot,\r\nLt Galo Romo Altamirano, copilot,\r\nMaría Soledad Zapata, stewardess.\r\nPassengers:\r\nMr. Jaime Roldós Aguilera, President of the Republic of Ecuador, \r\nMrs. Martha Bucaram, President's spouse, \r\nMr. Marco Aurelio Subía Martinez, Minister of Defense, \r\nMrs. Gladys Irlanda Sarango; Mr. Martinez's spouse, \r\nMr. Armando Arsenio Navarrete, \r\nCol Héctor Alfredo Torres Velázques.", "probable_cause": "The exact cause of the accident could not be determined with certainty as the airplane was not equipped with any recording equipment. Nevertheless, Ecuadorian Air Force attributed the accident to a controlled flight into terrain caused by a navigational error on part of the flying crew while flying in limited visibility due to marginal weather conditions. "}