{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-lancaster", "date": "Dec 27, 2005 at 1446 LT", "type": "Socata TBM-700", "operator": "Clay Nordman", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Camarillo - Lancaster", "msn": "138", "yom": 1998, "flight_number": null, "city": "Lancaster-General William J. Fox", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6296, "captain_hours_type": 2921, "copilot_hours": 1126, "copilot_hours_type": 15, "aircraft_hours": 1603, "circumstances": "The airplane stalled on short final approach, and it impacted the ground. The purpose of the flight was for the student to receive dual flight instruction to become more acquainted with the airplane's handling characteristics. The student met with his certified flight instructor and received a briefing regarding the upcoming lesson involving, in part, takeoff and landing practice. The instructor directed his student to perform a simulated engine out approach, and engine power was reduced as the airplane glided toward the airport. The student entered a close in downwind approach and, at the direction of the instructor, then performed a left circling turn onto the base and final approach legs. The landing gear was lowered, and the student questioned the instructor regarding whether they could glide all the way to the runway. The instructor advised his student to maintain 90 knots airspeed. During the descent, as the airplane turned from the close in base leg onto the final approach leg, the instructor told his student \"don't bank.\" The student rolled the wings level. Immediately thereafter, the left bank began a second time and the instructor again said, \"Don't bank.\" The student replied, \"I'm not.\" The instructor applied engine power and right rudder to reduce the left bank. The airplane stopped rolling left, and then rolled into a right bank, whereupon the right wing impacted the ground. At no time did the instructor direct his student to release the airplane's flight controls.", "probable_cause": "The student's failure to maintain adequate airspeed, and the instructor's inadequate supervision and delayed remedial action, which resulted in a stall/mush. "}