{"url": "https://www.baaa-acro.com/crash/crash-ddouglas-c-47a-5-dl-elko-20-killed", "date": "Sep 5, 1946 at 0132 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Trans-Luxury Airlines - TLA", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Cheyenne – Elko – San Francisco", "msn": "9214", "yom": 1943, "flight_number": null, "city": "Elko", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 18, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": 2944, "captain_hours_type": null, "copilot_hours": 1339, "copilot_hours_type": null, "aircraft_hours": 2137, "circumstances": "The aircraft was reported over Elko, Nevada, at 0121 and the pilot stated to the Aircraft Communicator at Elko that he had the field n and that he anticipated no difficulty in landing. The latest weather information was transmitted to the pilot and acknowledged by him: Ceiling measured 200 feet, thin overcast; lower thin scattered clouds at 100 visibility 7 miles; wind ENE at 6 mph; altimeter setting 30.14. No further transmission was received from the flight. Elko radio made several attempts to contact Aircraft 850 without success and, at approximately 0133, notified Airway Traffic control that radio contact was no longer being maintained with the flight. Salt Lake City Air Traffic Control requested Battle Mountain radio to attempt to contact the aircraft in the event the pilot had elected to continue to his alternate. However, although several attempts were made, no contact was established with the flight. United Air Lines' Flight 16, of September 4, 1946, en route to Salt Lake City on Airway Green 3, was called by the United Air Lines station at Salt Lake City and requested to check the vicinity of Elko for any sign of fire or other indications of an aircraft accident. The time of this contact was 0200, at which time Flight 16 was approximately 5 miles east of Elko Range Station. The Caption of Flight 16 returned to Elko and scanned the area in the vicinity of the airport. On approaching the airport the flight crew of the United Air Lines' DC-3 observed an intense fire approximately 2 miles west and almost directly in line with Runway 23 of the Elko Airport. This information was transmitted to the United Air Lines' ground station at Elko, Nevada, and Salt Lake City, Utah. The fire warden at Elko was immediately notified of the location of the fire and was requested to proceed to the scene of the fire. Personnel from the C. A. Communications Station at Elko arrived at the scene of the fire at approximately 0230 and found that the aircraft had crashed near the top of a ridge, the elevation of which was approximately 11' feet above that of the field, and at a point approximately 2 1/2 miles west of the west and of Runway 23 at Elko Airport. At this time the wreckage was found to be burned severely and, with the exception of two passengers, one of whom died shortly afterward, all occupants had been fatally injured in the aircraft.", "probable_cause": "On the basis of the above findings, the Board determines that the probable cause of this accident was the pilot's action in continuing a landing approach after having lost visual contact with the airport under conditions of dense ground fog. A contributing factor was the pilot's unfamiliarity with the terrain in the immediate vicinity of the airport."}