{"url": "https://www.baaa-acro.com/crash/crash-cessna-441-conquest-ii-saint-louis-2-killed", "date": "Nov 22, 1994 at 2203 LT", "type": "Cessna 441 Conquest", "operator": "Superior%20Aviation", "flight_phase": "Taxiing", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Saint Louis - Iron Mountain", "msn": "441-0196", "yom": 1981, "flight_number": null, "city": "Saint Louis-Lambert", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7940, "captain_hours_type": 2060, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During the takeoff roll on runway 30R, the MD-82, N954U, collided with the Cessna 441, N441KM, which was positioned on the runway waiting for takeoff clearance. The pilot of the Cessna acted on an apparently preconceived idea that he would use his arrival runway, runway 30R, for departure. After receiving taxi clearance to back-taxi into position and hold on runway 31, the pilot taxied into a position at an intersection on runway 30R, which was the assigned departure runway for the MD-82. The ATIS current at the time the Cessna pilot was operating in the Lambert-St. Louis area listed runways 30R and 30L as the active runways for arrivals and departures; there was no mention of the occasional use of runway 31. Air traffic control personnel were not able to maintain visual contact with the Cessna after it taxied from the well lighted ramp area into the runway/taxiway environment of the northeast portion of the airport. An operational ASDE-3,  particularly ASDE-3 enhanced with AMASS, could be used to supplement visual scan of the northeast portion of the airport. ", "probable_cause": "The Cessna 441 pilot's mistaken belief that his assigned departure runway was runway 30R, which resulted in his undetected entrance onto runway 30R, which was being used by the MD82 for its departure. Contributing to the accident was the lack of Automatic Terminal Information Service and other air traffic control (ATC) information regarding the occasional use of runway 31 for departure. The installation and utilization of Airport Surface Detection Equipment (ASDE-3), and particularly ASDE-3 enhanced with the Airport Movement Area Safety System (AMASS), could have prevented this accident. "}