{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6-ronkonkoma-3-killed", "date": "Apr 4, 1955 at 1555 LT", "type": "Douglas DC-6", "operator": "United-Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "New York-Idlewild – Ronkonkoma – LaGuardia", "msn": "43001", "yom": 1947, "flight_number": null, "city": "Ronkonkoma-Long Island-McArthur Field", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 9763, "captain_hours_type": 549, "copilot_hours": 9018, "copilot_hours_type": 1156, "aircraft_hours": 22068, "circumstances": "N37512, under the command of Captain S. C. Hoyt, UAL New York area flight manager, departed New York International Airport at 1428 on a Visual Flight Rules flight plan for an estimated two-hour flight in the vicinity of MacArthur Field, Islip. The aircraft was properly dispatched on a routine check flight, and Captains V. H. Webb and H. M. Dozier were aboard for the purpose of receiving their periodic instrument proficiency check. Upon completion of the checks, the flight was scheduled to return to LaGuardia Airport. At 1501 the flight reported to the company by radio that they were “doing air work around Hempstead.” Another message was received by the company at 1527 reporting that the flight was going to make an ILS (Instrument Landing System) approach at Islip (MacArthur Field). Shortly thereafter, the flight contacted the MacArthur tower, requesting approval for an ILS approach and landing. Permission was granted by the tower, and a normal landing was made on runway 32. The aircraft was taxied to the intersection of runways 28 and 32 and the crew prepared for takeoff. The 1532 MacArthur weather observation showed scattered clouds at 20,000 feet, broken clouds at 25,000; visibility over 15 miles; temperature 53; dew-point 30; wind NNW at 20 knots, gusts to 30 knots. When the flight departed New York International Airport, weather was approximately the same and the forecast for the New York area indicated that it would be similar over the area for the duration of the flight. At 1548, the MacArthur controller cleared the flight to take position on runway 32 and take off. The aircraft took position on the runway but did not immediately take off, hence a second takeoff clearance was transmitted at 1550. The gross weight of the aircraft at takeoff from MacArthur Field was approximately 61,050 pounds, which was well below the maximum allowable. The load was correctly distributed with respect to center of gravity limits. The aircraft became airborne approximately, 1,500 to 1,800 feet down the runway. The takeoff appeared normal, as did the initial portion of the climb, and the aircraft remained on the runway heading. When about 50 feet high, the right wing lowered and the aircraft started turning to the right, at which time the landing gear was retracting. The aircraft continued a climbing turn and the degree of bank increased to approximately vertical by the time the heading changed about 90 degrees and the aircraft had attained an estimated altitude of 150 feet. The nose dropped sharply and the aircraft dived into the ground, striking on the right wing and nose. It then cartwheeled and came to rest right side up. An intense fire started and consumed a large portion of the wreckage in spite of the prompt arrival of fire fighting equipment on the field.", "probable_cause": "The Board determines that the probable cause of this accident was unintentional movement of No. 4 throttle into the reverse range just before breaking ground, with the other three engines operating at high power output, which resulted in the aircraft very quickly becoming uncontrollable once airborne. The following findings were reported:\r\n- No evidence of failure or malfunctioning of the structure powerplants, propellers, or electrical system was found,\r\n- In reducing power to zero thrust during an instrument takeoff with a simulated engine out, No. 4 propeller was unintentionally reversed before the aircraft became airborne,\r\n- Evidence indicated that No. 4 throttle was moved out of reverse by the pilot into the forward position in an attempt to unreverse, but the reverse warning flag was not lifted, resulting in increased reverse thrust,\r\n- An outboard propeller on a DC-6 reversing as the aircraft becomes airborne, in conjunction with high power output of the other three engines, at takeoff configuration and airspeed causes the aircraft to become almost immediately uncontrollable,\r\n- There was insufficient time and altitude for any pilot corrective measures to become effective."}