{"url": "https://www.baaa-acro.com/crash/crash-vickers-610-viking-1b-london-heathrow-28-killed", "date": "Oct 31, 1950 at 1954 LT", "type": "Vickers Viking", "operator": "BEA", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris – Northolt", "msn": "155", "yom": 1947, "flight_number": null, "city": "London-Heathrow", "zone": "London Metropolis", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 26, "pax_fatalities": 25, "other_fatalities": 0, "total_fatalities": 28, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft left Paris-Le Bourget Airport at 1839LT bound for Northolt. While descending to Northolt at an altitude of 4,500 feet, the crew was informed by ATC that fog had reduced the visibility at Northolt to 50 yards. On receiving this information, the pilot announced that he would attempt to land at London-Heathrow. Although visibility at Heathrow was 40 yards only, it had the facilities for a Ground Controlled Approach (GCA). The pilot told ATC that if he could not safely land at London Airport, he would divert to Blackbushe Airport in Hampshire or Manston Airport in Kent. The aircraft carried out what appeared to be a normal GCA, reaching the decision height of 140 feet at about 400 yards short of runway threshold. As the pilot was unable to locate the runway, he decided to go around, increased power and raised the landing gear. Few seconds later, the aircraft struck the runway surface and skidded for about 140 feet before regaining the air. With both propellers damaged by the initial contact with the ground, it stalled and crashed approximately 3,000 feet past the runway threshold. The starboard wing being torn off and the aircraft bursting into flames as it came to rest next to a store of drain-pipes. The thick fog hindered rescue attempts and it took the fire and rescue teams 16 to 17 minutes to find the crashed aircraft. Of the 30 people on board there were only two survivors, a stewardess and a passenger, both had been seated near the tail. ", "probable_cause": "Although it cannot be established with certainty, the probable explanation of the known facts may be that the captain deliberately came down below break-off point and then at 100 feet or less came into fog which abruptly reduced the visibility of the runway lights and that then and not till then he started overshoot procedure with fatal results."}