{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-sii-big-bear-lake", "date": "Aug 13, 2002 at 1120 LT", "type": "Cessna 550 Citation II", "operator": "Corporate Flight International", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Las Vegas – Big Bear Lake", "msn": "550-0031", "yom": 1985, "flight_number": "CFI850", "city": "Big Bear Lake", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3900, "captain_hours_type": 800, "copilot_hours": 2800, "copilot_hours_type": null, "aircraft_hours": 5776, "circumstances": "On a final approach to runway 26 the flight crew was advised by a flight instructor in the traffic pattern that a wind shear condition existed about one-quarter of the way down the approach end of the runway, which the flight crew acknowledged. On a three mile final approach the flight crew was advised by the instructor that the automated weather observation system (AWOS) was reporting the winds were 060 degrees at 8 knots, and that he was changing runways to runway 08. The flight crew did not acknowledge this transmission. The captain said that after landing smoothly in the touchdown zone on Runway 26, he applied normal braking without any response. He maintained brake pedal pressure and activated the engine thrust reversers without any response. The copilot said he considered the approach normal and that the captain did all he could to stop the airplane, first applying the brakes and then pulling up on the thrust reversers twice, with no sensation of slowing at all. Considering the double malfunction and the mountainous terrain surrounding the airport, the captain elected not to go around. The aircraft subsequently overran the end of the 5,860 foot runway (5,260 feet usable due to the 600 displaced threshold), went through the airport boundary fence, across the perimeter road, and came to rest upright in a dry lakebed approximately 400 feet from the departure end of the runway. With the aircraft on fire, the five passengers and two crew members safely egressed the aircraft without injuries before it was consumed. Witnesses to the landing reported the aircraft touched down at midfield, was too fast, porpoised, and was bouncing trying to get the gear on the runway. Passengers recalled a very hard landing, being thrown about the cabin, and that the speed was excessive. One passenger stated there was a hard bang and a series of smaller bangs during the landing. Federal Aviation Regulations allowed 3,150 feet of runway for a full stop landing. Under the weather conditions reported just after the mishap, and using the anticipated landing weight from the load manifest (12,172.5 pounds), the FAA approved Cessna Flight Manual does not provide landing distance information. Post-accident examination and testing of various wheel brake and antiskid/power brake components revealed no anomalies which would have precluded normal operations.", "probable_cause": "The pilot's failure to obtain the proper touchdown point which resulted in an overrun. Contributing factors were the pilot's improper in-flight planning, improper use of performance data, the tailwind condition, failure to perform a go-around, and the pilot-induced porpoising condition."}