{"url": "https://www.baaa-acro.com/crash/crash-vickers-668-varsity-t1-marchington-11-killed", "date": "Aug 18, 1984 at 1008 LT", "type": "Vickers Varsity", "operator": "Leicester Aircraft Preservation Society", "flight_phase": "Flight", "flight_type": "Demonstration", "survivors": "Yes", "site": "Plain, Valley", "schedule": "East Midlands - Liverpool", "msn": "620", "yom": 1952, "flight_number": null, "city": "Marchington", "zone": "Staffordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 12, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 7760, "captain_hours_type": 63, "copilot_hours": 793, "copilot_hours_type": 21, "aircraft_hours": 6682, "circumstances": "The Varsity aircraft was a twin engined training aircraft used by the Royal Air Force until 1974 when it was sold into private ownership. It was currently owned and operated by an aircraft preservation group who maintained the aircraft to its service specification. For this reason it carried the military designation \"WJ897\" on the fuselage and wings although it was registered as G-BDFT. The aircraft had been granted a Permit to Fly and was restricted to display and demonstration flying and the practising for such displays. Thirteen members of the society had boarded the aircraft earlier that morning at RAF Syerston in Nottinghamshire, where the aircraft was hangared, for the short flight to East Midlands Airport (EMA). This flight was uneventful and, after landing, the aircraft was refuelled with 436 imperial gallons of aviation gasoline (Avgas 100 LL) increasing the total fuel on board to 510 imp gals. It was intended to fly to Liverpool Airport (LPL) to take part in an air display that afternoon. It was arranged that aerial photographs of the Varsity would be taken during the flight to Liverpool using a Cessna 180. This aircraft was to rendezvous with the Varsity at 3000 feet amsl in the area of Blithfield Reservoir some 20 miles to the west of East Midlands Airport. The Varsity engines were normally started using a ground electrical supply. On this occasion, the left engine was reluctant to start and after it initially fired, it faltered and stopped, emitting smoke from the exhaust. For fear of exhausting the batteries with repeated attempts to start, the right engine was started first. The left engine was then motored over before another start attempt was made, this time successfully. The passengers on the Varsity were told that the left engine had been over primed on the first attempt to start. The Varsity took off at 09:32 and the approach controller at East Midlands Airport provided bearing and range information to the Varsity pilot to help him locate the Cessna 180 and, at 09:47 hrs, both aircraft changed to a discrete radio frequency. The Varsity was then flown in formation on the right hand side of the Cessna in a series of wide orbits of the Blithfield Reservoir. During this time, the left engine of the Varsity was seen to emit occasional puffs of smoke accompanied by loud bangs. When the photographer requested that the Varsity climb slightly above the Cessna and lower its undercarriage, the Varsity pilot reported that he was having trouble with the right engine. The Cessna pilot replied that it looked to him as if the problem was in fact with the left engine, as he could see puffs of smoke as if the engine were running too rich. When the Varsity pilot replied that it might be engine icing, the Cessna pilot noted that his intake temperature was indicating in the range where there was no risk of intake icing on his engine. The undercarriage of the Varsity was lowered briefly before being retracted again with the pilot's comment that he \"could not accept the drag and might have to abort the photography\". Towards the end of the photographic flying, the right engine started to backfire as well. At 10:05, the Varsity pilot called East Midlands Airport on the approach frequency requesting a direct return to the airport because he had some engine problems and might have to declare an emergency. In reply the approach controller passed the Varsity a course to steer to East Midlands and asked whether the Varsity could maintain height. The pilot answered that \"at the present we are able to but it's with some difficulty\". The Varsity steadily losing height and, at 10:07, the pilot informed the controller that the left engine of the Varsity had stopped. Thirty seconds later the Varsity co-pilot radioed \"we're going to have to put it down in the nearest field, we're down to 400 feet and losing power on both engines so we are going into the...\". The undercarriage of the Varsity was lowered and, at a very low height, the left wing was then seen to drop and the aircraft rolled over, the nose dropped and it crashed inverted. Just before impact the left mainplane severed 11,000 volt electricity supply wires. As the aircraft broke-up on impact, the rear part of the fuselage together with the empennage fell into a drainage ditch some 10 feet deep. The three survivors were seated in rearward facing seats in this part of the fuselage. Two were able to escape from the fuselage but the third was hampered by a broken leg and received severe burns when a wire fence prevented him from leaving the accident area.", "probable_cause": "The accident was caused by a loss of control when the aircraft stalled at low altitude while the pilot was attempting a forced landing following a progressive loss of power on both engines. The loss of power on the left engine resulted from an excessive rich fuel/air mixture caused by a split diaphragm within the engine driven fuel pump. It was not possible to determine the cause of the loss of power on the right engine but it possibly resulted from ignition failure due to ignition coil breakdown at high engine boost settings. "}