{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-lyon-2-killed", "date": "May 2, 2000 at 1439 LT", "type": "Learjet 35", "operator": "Northern Executive Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Farnborough - Nice", "msn": "35-646", "yom": 1988, "flight_number": "NEX4B", "city": "Lyon-Saint Exupéry (ex Satolas)", "zone": "Rhône", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4954, "captain_hours_type": 2113, "copilot_hours": 1068, "copilot_hours_type": 850, "aircraft_hours": 4291, "circumstances": "The aircraft departed Farnborough Airport at 11h22 on a charter flight to Nice with two pilots and three passengers on board, among them the F1 driver David Coulthard. At 12h22, cruising at FL390, the left engine of the aircraft suffered a failure. The crew shut down and began to descend. They declared an emergency and asked to fly to the nearest aerodrome with a runway longer than one thousand six hundred metres. Lyon-Satolas Airport, located about 62 NM away left abeam of the aircraft, was proposed. The descent with one engine shut down towards Lyon-Satolas was undertaken under radar guidance, at a high speed and with a high rate of descent. At 12h35, the pilot stabilised the aircraft at 3,000 feet, intercepted the runway 36L ILS and was cleared to land. The final was started at 233 knots according to radar data and the slow down progressive. At 12h36 min 45 s, the flaps were extended to 8°. According to the radar data, the aircraft was then at 2,400 feet, 4,4 NM from the runway threshold and at a speed of 184 knots. At 12h36 min 58 s, the landing gear was extended. At 12h37 in 03 s, the flaps were set to 20°. According to the radar data, the aircraft was then at 2,100 feet, 3,5 NM from the runway threshold at a speed of 180 knots. No malfunctions or additional problems were announced to the ATC by the crew during the final approach. At 12h38 min 08 s, the copilot told the captain that the aircraft was a little low. According to the radar data, the aircraft was then at 1,100 feet, 0,9 NM from the runway threshold at a speed of 155 knots. At 12h38 min 17 s, he repeated his warning and announced a speed 10 knots above the approach reference speed. At 12h38 min 22 s, the copilot again stated that the aircraft was a little low on the approach path and immediately afterwards asked the captain to increase the thrust. According to the radar data, the aircraft was then at 900 feet, 0,1 NM from the runway threshold at a speed of 150 knots. At 12h38 min 24 s, the captain indicated that he was losing control of the aircraft. The aircraft, over the runway threshold, banked sharply to the left, touched the ground with its wing, crashed and caught fire. Both pilots were killed while all three passengers evacuated with minor injuries. ", "probable_cause": "The accident resulted from a loss of yaw and then roll control which appears to be due to a failure of monitor flight symmetry at the time of the thrust increase on the right engine. The hastiness exhibited by the captain, and his difficulty in coping with the stress following the engine failure, contributed to this situation. "}