{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-76md-kabul-9-killed", "date": "Mar 27, 1990 at 1130 LT", "type": "Ilyushin II-76", "operator": "Soviet%20Union%20Air%20Force.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tashkent - Kokand - Kabul", "msn": "00834 89670", "yom": 1988, "flight_number": "3501", "city": "Kabul", "zone": "Kabul", "country": "Afghanistan", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1228, "circumstances": "The aircraft was completing a cargo flight from Tashkent to Kabul with an intermediate stop in Kokand, Uzbekistan, carrying a load of fuel drums. While descending to Kabul Airport, the crew was instructed by ATC to maintain FL190 as an Afghan Antonov AN-32 was passing just below at FL180. Shortly later, the aircraft entered an uncontrolled descent and crashed in a huge explosion 7,6 km east of Kabul-Khwaja Rawash Airport. All nine occupants were killed. ", "probable_cause": "The accident was the consequence of the combination of the following factors:\r\n- Crew failure to maintain flight speed modes recommended by IL-76 for various airplane configurations, which reduced the available margin of angle of attack to critical modes;\r\n- Insufficient control of crew members over the determining flight parameters, which led to a violation of the established restrictions on the permissible angle of attack and the minimum flight speed;\r\n- Lack of piloting skills at high angles of attack, due to the imperfection of the training system for crews in special flight situations;\r\n- The pilots were unable to recognize the exit to critical angles of attack and implement the IL-76 recommendations to prevent stall;\r\n- The need for maneuvering according to the descent scheme in combat conditions at close to flight restriction conditions and the presence of three aircraft flying in clouds at short intervals without appropriate radar control created a difficult situation for the crew, which was aggravated after the controller informed about the need to temporarily stop the descent in connection with the take-off of the An-32 aircraft, which led to a change in the prevailing stereotype of crew actions."}