{"url": "https://www.baaa-acro.com/crash/crash-embraer-erj-190-100ar-cuenca", "date": "Apr 28, 2016 at 0751 LT", "type": "Embraer ERJ-190", "operator": "TAME", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Quito – Cuenca", "msn": "190-00372", "yom": 2010, "flight_number": "EQ173", "city": "Cuenca-Mariscal La Mar", "zone": "Azuay", "country": "Ecuador", "region": "South America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 87, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17523, "captain_hours_type": 2113, "copilot_hours": 3545, "copilot_hours_type": 2077, "aircraft_hours": 11569, "circumstances": "Following en uneventful flight from Quito, the crew initiated the descent to Cuenca-Mariscal La Mar Airport Runway 23. Weather conditions at destination were poor with rain falls and a contaminated runway. The pilot-in-command continued the approach below the glide and the aircraft passed over the runway threshold at a height of 37 feet instead the recommended 50 feet. The airplane landed 277 metres past the runway threshold at a speed of 127 knots and the crew activated the spoilers and the reverse thrust systems. Due to poor braking action, the captain activated the autobrake system, without success. As the aircraft could not be stopped within the remaining distance, the captain intentionally turn to the right when the aircraft ground looped, overran and came to rest in a grassy area. All 93 occupants were rescued, among them two passengers were slightly injured. The aircraft was damaged beyond repair.  ", "probable_cause": "The following findings were identified:\r\n- The condition of the runway at Cuenca airport, which at the time of the plane's landing was contaminated with water and slippery.\r\n- The landing was made after a non-stabilized approach with a tailwind.\r\n- During seven seconds, the crew continued the approach with an excessive rate of descent of 1,186 feet, 186 feet above the limit of 1,000 feet.\r\n- The non-application of the Maximum Performance Landing procedure recommended by the aircraft manufacturer for landing on contaminated runways.\r\n- The dispatch of the flight with 1,500 kg of fuel more than the amount of fuel usually used for this flight.\r\n- Omission of the runway length calculation necessary to perform the landing using the braking efficiency information.\r\n- The crew's decision to make the final approach with three red and one white lights, using the PAPI system, induced by the information in the Terminal Information document issued by the company, which authorized this procedure.\r\n- The use of confusing terminology in the Terminal Information document, which used terms applicable to the Airbus fleet, instead of Embraer's.\r\n- The crew's decision not to perform the thwarted approach maneuver after the maximum allowable vertical speed was exceeded and visibility was apparently limited after the minima were exceeded.\r\n- Incorrect use of aircraft braking aids, in this case reverse braking aids\r\n- The application of the emergency brake that inhibits the antiskid system.\r\n- Lack of implementation of adequate management of crew resources, particularly within the cockpit.\r\n- Lack of training in the use of tables for track distance calculation.\r\n- In reference to landing conditions, the aircraft needed a runway length of 2,122 metres while the available distance was 1,900 metres. "}