{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3c-san-juan-0", "date": "Oct 31, 1996 at 0330 LT", "type": "Douglas DC-3", "operator": "Flamenco Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Juan - San Juan", "msn": "4430", "yom": 1942, "flight_number": null, "city": "San Juan-Isla Grande (Fernando Luis Ribas Dominicci)", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4242, "captain_hours_type": 1256, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16179, "circumstances": "After takeoff from runway 09, a climbing left turn was made. At about 1,000 feet, the #2 (right) engine backfired, emitted flames, and lost power. The captain instructed the copilot to feather the #2 propeller, which the copilot initiated with the feathering button. When the captain requested gear and flap extension, the copilot released the feathering button which did not remain engaged, contrary to system design. The airplane had arrived on a left downwind abeam the landing area at 500 feet and 95 to 100 knots. The captain turned toward the runway, then he ordered the gear and flaps to be retracted and initiated a go-around by increasing the left throttle without increasing propeller speed. A right turn was then made, and the airplane eventually crashed about 3 miles from the runway. During a postaccident examination, the propellers were found unfeathered, and the right engine fuel selector was in the main tank position. The emergency procedure listed the best single engine speed as 85 knots. The procedure for engine fire/failure was to feather the propeller and to move the respective fuel selector to 'OFF.' Examination revealed the number 11 cylinder on the right engine was cracked. There was evidence of fire, adjacent to the cylinder on the cowling, which consisted of scorching, sooting, and a burned through area of the underside of the right engine cowling. The copilot indicated a previous problem with the feathering system, but maintenance records did not contain any previous discrepancies regarding this anomaly. ", "probable_cause": "failure of the #11 cylinder on the right (#2) engine, which resulted in an in-flight fire and loss of power in that engine; and a malfunction/failure of the #2  feathering system, which led to a subsequent forced landing before the flight crew could return to the airport. A factor related to the accident was failure of the flight crew to increase the left (#1) engine rpm (in accordance with emergency procedures) after loss of power in the #2 engine. "}