{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-casa-grande-2-killed", "date": "Feb 6, 2013 at 1135 LT", "type": "Beechcraft 90 King Air", "operator": "Sauo Aero Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Marana - Casa Grande", "msn": "LW-248", "yom": 1977, "flight_number": null, "city": "Casa Grande", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1079, "captain_hours_type": 112, "copilot_hours": 8552, "copilot_hours_type": 325, "aircraft_hours": 8345, "circumstances": "The lineman who spoke with the pilot/owner of the accident airplane before its departure reported that the pilot stated that he and the flight instructor were going out to practice for about an hour. The flight instructor had given the pilot/owner his initial instruction in the airplane and flew with the pilot/owner regularly. The flight instructor had also given the pilot/owner about 58 hours of dual instruction in the accident airplane. The pilot/owner had accumulated about 51 hours of pilot-in-command time in the airplane make and model. It is likely that the pilot/owner was the pilot flying. Several witnesses reported observing the accident sequence. One witness reported seeing the airplane pull up into vertical flight, bank left, rotate nose down, and then impact the ground. One witness reported observing the airplane go from east to west, turn sharply, and then go north of the runway. He subsequently saw the airplane hit the ground. One witness, who was a pilot, stated that he observed the airplane enter a left bank and then a nose-down attitude of about 75 degrees at an altitude of about 300 feet above ground level, which was too low to recover. It is likely that the pilot was attempting a go-around and pitched up the airplane excessively and subsequently lost control, which resulted in the airplane impacting flat desert terrain about 100 feet north of the active runway at about the midfield point in a steep nose-down, left-wing-low attitude. The airplane was destroyed by postimpact forces and thermal damage. All components necessary for flight were accounted for at the accident site. A postaccident examination of the airframe and both engines revealed no anomalies that would have precluded normal operation. Additionally, an examination of both propellers revealed rotational scoring and twisting of the blades consistent with there being power during the impact sequence. No anomalies were noted with either propeller that would have precluded normal operation. Toxicological testing of the pilot was negative for drugs and alcohol. The flight instructor’s toxicology report revealed the presence of tetrahydrocannabinol (THC). Given the elevated levels of metabolite in the urine and kidney, the absence of quantifiable THC in the urine, and the low level of THC in the kidney and liver, it is likely that the flight instructor most recently used marijuana at least several hours before the accident. However, the effects of marijuana use on the flight instructor’s judgment and performance at the time of the accident could not be determined. A review of the flight instructor’s personal medical records indicated that he had a number of medical conditions that would have been grounds for denying his airman medical certificate. The ongoing treatment of his conditions with more than one sedating benzodiazepine, including oxazepam, simultaneously would also likely not have been allowed. However, none of the prescribed, actively sedating medications were found in the flight instructor’s tissues, and oxazepam was only found in the urine, which suggests that the flight instructor used the medication many hours and possibly several days before the accident. The toxicology findings indicate that the flight instructor likely did not experience any impairment from the benzodiazepine medication itself; however, the cognitive effects from the underlying mood disturbance could not be determined.", "probable_cause": "The pilot’s loss of control of the airplane after pitching it excessively nose up during a go-around, which resulted in a subsequent aerodynamic stall/spin.\n"}