{"url": "https://www.baaa-acro.com/crash/crash-cessna-207a-stationair-7-matinicus-island-1-killed", "date": "Oct 5, 2011 at 1730 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Penobscot%20Island%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Rockland - Matinicus Island", "msn": "207-0552", "yom": 1980, "flight_number": null, "city": "Matinicus Island", "zone": "Maine", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3100, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17106, "circumstances": "About the time of departure, the wind at the departure airport was reported to be from 330 degrees at 13 knots with gusts to 22 knots. The pilot departed with an adequate supply of fuel for the intended 15-minute cargo flight to a nearby island. He entered a left traffic pattern to runway 36 at the destination airport and turned onto final approach with 30 degrees of flaps extended. Witnesses on the island reported that, about this time, a sudden wind gust from the west occurred. A witness (a fisherman by trade) at the airport estimated the wind direction was down the runway at 35 to 40 knots, with slightly higher wind gusts. After the sudden wind gust, he noted the airplane suddenly bank to the right about 80 degrees and begin descending. It impacted trees and powerlines then the ground. The same witness reported the engine sound was steady during the entire approach and at no time did he hear the engine falter. About 30 minutes before the accident, a weather observing station located about 6 nautical miles south-southeast of the accident site indicated the wind from the north-northwest at 24 knots, with gusts to 27 knots. About 30 minutes after the accident, the station indicated the wind from the northwest at 30 knots, with gusts to 37 knots. Postaccident examination of the airplane, its systems, and engine revealed no evidence of preimpact failures or malfunctions that would have precluded normal operation. The evidence is consistent with the airplane’s encounter with a gusty crosswind that led to the airplane’s right bank and the pilot’s loss of control, resulting in an accelerated stall.", "probable_cause": "The pilot’s failure to maintain airplane control during the approach after encountering a gusty crosswind, which resulted in an accelerated stall and uncontrolled descent.\n"}