{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-99-airliner-evora-2-killed", "date": "Aug 14, 2009 at 1908 LT", "type": "Beechcraft 99 Airliner", "operator": "Skydive%20Portugal", "flight_phase": "Landing (descent or approach)", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "City", "schedule": "Évora - Évora", "msn": "U-79", "yom": 1968, "flight_number": null, "city": "Évora", "zone": "Alto Alentejo", "country": "Portugal", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 22993, "circumstances": "The aircraft, a Beechcraft model BE-99, s/n U79, with French registration F-BTME, belonging to the operator “Avioarte Serviços Aéreos, Lda”, was involved all that day, 14th of August, 2009, flying locally, carrying parachutists for skydiving exercises, in the vicinity of Évora aerodrome (LPEV), working for the enterprise “Skydive”. With twelve full equipped parachutists and one pilot on board, the aircraft took-off on runway 01 at 18:47, intending to climb to an altitude of 13000ft (4000m), at which altitude the jumping would take place. When passing about 9500ft (2900m), left engine (#1) flame-out and respective propeller was automatically feathered. The pilot stop climb at around 10500ft (3200m), informed the parachutists that one engine had stopped and they should jump a little lower than it was expected, while he would proceed for landing at same aerodrome, with one engine inoperative. All parachutists left the aircraft, on sequence, but one, who, after being next to the exit, returned to the cockpit and remained on board, with the pilot. The aircraft started a dive, turning around the field, and the pilot contacted the tower on left base leg for runway 01, but said nothing about the inoperative engine or any assistance required. He was told to report on final, which he never did. He continued the approach for runway 01, with landing gear down and flaps at initial setting (13º), but keeping high speed. The aircraft made a low pass, over all runway length, without the wheels touching the ground. Once passing runway end it continued flying, the pilot increased power on right engine (#2) and the aircraft started deviating to the left, with wings levelled and without showing significant climb tendency. Observers, at the aerodrome, lost the sight of the aircraft for some moments and saw it reappearing close to Almeirim residential quarter (in the outskirts of Évora). One testimony, sited at the aerodrome, referred seeing the aircraft executing a sudden manoeuvre, like a left roll, pointing the wheels up to the sky. Moments later a collision sound was heard, the engine became silent and some flames and a black smoke cloud appeared. The aircraft collided with a residential building, in Maria Auxiliadora street, Almeirim residential quarter, sited about 1160m far from runway end, on track 330º. After the collision with the building, the aircraft fell to the ground, upside-down, a fire sparked immediately and the plane was engulfed by flames. Fire brigades from Évora, Viana do Alentejo, Montemor-o-Novo and Arraiolos arrived at the scene, promptly, but it took some time for the fire to be extinguished (after burning all aircraft fuel) and the burned bodies recovered from the wreckage.", "probable_cause": "Primary Cause:\r\nPrimary cause for this accident was pilot inability, as he was not qualified to fly this class of aircraft, to carry a single engine landing or maintain directional control during go-around with one engine inoperative.\r\nContributory Factors:\r\nThe following were considered as Contributory factors:\r\n- The pilot was not qualified to operate multi-engine aircrafts and had no knowledge and training to fly this kind of aircraft;\r\n- Unsuitable fuel monitoring and omission on manufacturer recommended procedures accomplishment;\r\n- Inadequate flying technique, without consideration to the airplane special flying characteristics;\r\n- Inadequate supervision, by the competent authorities, on flying activities carried by pilots and aircrafts with foreign licenses and registrations, inside Portuguese territory. "}