{"url": "https://www.baaa-acro.com/crash/crash-cessna-525-citationjet-cj2-saint-tropez", "date": "Jun 6, 2018 at 1310 LT", "type": "Cessna 525 CitationJet CJ2", "operator": "ProAir", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Figari - Saint-Tropez", "msn": "525A-0514", "yom": 2013, "flight_number": null, "city": "Saint-Tropez-La Môle", "zone": "Var", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2500, "captain_hours_type": 1234, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Figari-Sud-Corse Airport on a positioning flight to Saint-Tropez-La Môle, carrying one passenger and one pilot. Weather conditions at destination were poor with ceiling at 1,800 feet and rain. The pilot contacted Nice Approach and was cleared to descend to 6,000 feet and to report over EM for an approach to La Môle Airport Runway 24. On final approach, the pilot was unable to establish a visual contact with the runway and initiated a go-around procedure. Few minutes later, he completed a second approach and landed the airplane 200 metres past the runway threshold at a speed of 136 knots. Spoilers were deployed but the airplane was unable to stop within the remaining distance. It veered slightly to the left, departed the end of the runway, crossed a river and came to rest against an embankment located about 100 metres past the runway end. The pilot escaped unhurt while the passenger was slighlty injured. The aircraft was damaged beyond repair. ", "probable_cause": "The landing distance of the airplane on a wet runway as defined in the Airplane Flight Manual (AFM) performance tables are not compatible with the length of runway available at La Môle Aaerodrome. When preparing the flight, the pilot used the flight record provided by the operator ProAir to determine landing performance. Landing distance on a wet runway presented in the file increased that on a dry runway by 15%. The 15% increase on a wet runway can only be used in conjunction with the increase of 60% imposed in commercial operation, otherwise it may be inappropriate. The value resulting from the calculation was, in this case, wrong and less than the value indicated in the aircraft flight manual. The pilot probably did not use the EFB application for the calculation of performance or the flight manual to verify this value. The pilot thus undertook the flight on the basis of erroneous performance values, without realizing that he could not land at this aerodrome if the runway was wet. In addition, during the final approach, the speed of the aircraft was greater than the speed approach reference and the approach slope was also greater than the nominal slope, which resulted in an increase in the landing distance. During the landing roll, the aircraft exited the runway longitudinally at a speed of 41 kt. The pilot failed to stop the aircraft until it does not violently collide with obstacles at the end of the track.\r\nContributing factors:\r\n- The operator's use of the same operations manual for two different types of operations;\r\n- The absence in the operations manual of a calculation method, coefficient and safety margin for the calculation of performance in non-commercial transport;\r\n- Lack of knowledge by the pilot and the operator of the method of calculation of landing performance in non-commercial transport;\r\n- The lack of indication in the operations manual that the landing performances at La Môle aerodrome are limiting in case of a wet or contaminated runway."}