{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-83-kandahar", "date": "Jan 24, 2012 at 0828 LT", "type": "McDonnell Douglas MD-83", "operator": "Swiftair", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dubai - Kandahar", "msn": "49793/1656", "yom": 1989, "flight_number": "SWT094", "city": "Kandahar", "zone": "Kandahar", "country": "Afghanistan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 86, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4946, "captain_hours_type": 3228, "copilot_hours": 2881, "copilot_hours_type": 2222, "aircraft_hours": null, "circumstances": "On Tuesday, 24 January 2012, a McDonnell Douglas MD-83, registration EC-JJS and operated by Swiftair, took off from the Dubai Airport (United Arab Emirates) at 02:08 UTC on a scheduled flight to the Kandahar Airport (Afghanistan). Its callsign was SWT094 and there were 86 passengers (one of them a company mechanic), three flight attendants and two cockpit crew onboard. Swiftair, S.A. was operating this regularly scheduled passenger flight under an ACMI arrangement with the South African company Gryphon Airlines. The crew was picked up at its usual hotel in the emirate of Ras al-Khaimah (United Arab  Emirates) at 21:00. The airplane was parked in the Ras al-Khaimah airport and had to  be flown empty to the Dubai Airport. This flight departed at 00:20 UTC en route to  Dubai. Once there, an agent for Gryphon Airlines gave the crew the documentation for  the flight to Kandahar. They went through customs at the Dubai Airport, boarded the passengers and the cargo and refueled the airplane with enough fuel to make the return the flight, a typical practice so as to avoid refueling in Kandahar. The airplane took off from runway 30R at the Dubai Airport at 02:08 on standard instrument departure RIKET2D and climbed to flight level FL290. The first officer was the pilot flying. At 03:42, while over SERKA, they were transferred to Kabul control, which instructed them to descend to FL280. The crew reported its ISAF callsign (ISF39RT) to this ATS station, which allowed the aircraft to fly over Afghan airspace, and entered the new stipulated squawk code. Kabul Control instructed the crew to follow some radar vectors that took them to point SODAS, where they were transferred to Kandahar Control at 03:46. The crew reduced the airspeed to 250 kt above this point. Kandahar Control cleared them for an RNAV (GPS) approach to runway 05, providing a direct vector to point FALOD (the IAF), and to descend to 6,000 ft. The weather information provided on the ATIS “F” broadcast was runway in use 05,  wind from 060º at 17 kt gusting to 24 kt, visibility 1,200 m, scattered clouds at 2,700 ft and broken clouds at 3,000 ft, temperature 1 ºC, dewpoint -7 ºC and QNH 30.06 in Hg (1,018 mbar). This information was practically the same as that radioed to the crew by the Kandahar control tower a few minutes before landing: wind from 060 at 15 kt gusting to 21 kt. They reached point FALOD (IAF) under cloud cover (and thus in IMC conditions). They did not exit the clouds until 1,500 ft before minimums which, for this approach, according to the associated chart, was an altitude of 3,700 ft, or 394 ft AGL. They established visual contact with the runway 500 ft above minimums and noted that they were a little right of the runway centerline. Since the captain had more operational experience at the destination airfield, he decided to take over the controls and fly the last phase of the approach maneuver. The PAPI was out of service, meaning that in final approach they only had visual references to the runway and over the ground. During short final they corrected the deviation from the runway centerline by adjusting their path from right to left. They landed at 03:58. During the flare, the crew noticed the airplane was shifting to the left, threatening to take them off the runway, as a result of which the captain applied a right roll angle. This caused the right wing tip to strike the ground before the wheels made contact with the ground. The captain regarded the maneuver as a hard landing, although the first officer thought they might have struck the runway. The autopilot was engaged until visual contact was established with the runway and the auto-throttle until the landing. On exiting the runway, the airport control tower personnel (who had witnessed the contact with the ground) ordered the crew to stop and informed them of the damage they had seen during the landing. They dispatched the emergency services (firefighters), which forced them to turn off their engines. Once it was confirmed that there was no fuel leak or damage to the wheels or brakes, they allowed the crew to restart the engines and proceed to the stand. The wing made contact with the ground some 20 m prior to the threshold, resulting in five threshold lights being destroyed by the aircraft and in damage to the aircraft’s right wing. According to the crew’s statement, the passengers were not really aware of the contact between the wing and the ground and they were subsequently disembarked normally.", "probable_cause": "The accident was likely caused by the failure to observe the company's operating procedures and not executing a go-around when the approach was clearly not stabilized. Moreover, the operator lacked the authorization (and the crew the training) to carry out the RNAV (GPS) approach maneuver that was conducted at RWY 05 of the Kandahar Airport.\r\nContributing to the accident was:\r\nThe inoperable status of the PAPI at runway 05 of the Kandahar Airport, which was thus unable to aid the crew to establish the aircraft on the correct descent slope."}