{"url": "https://www.baaa-acro.com/crash/crash-short-360-200-sint-maarten-2-killed", "date": "Oct 29, 2014 at 1840 LT", "type": "Short 360", "operator": "SkyWay%20Enterprises", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Sint Maarten - San Juan", "msn": "3702", "yom": 1986, "flight_number": "SKZ7101", "city": "Sint Maarten", "zone": "Dutch Antilles", "country": "Dutch Antilles", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5318, "captain_hours_type": 361, "copilot_hours": 1040, "copilot_hours_type": 510, "aircraft_hours": 25061, "circumstances": "On October 29, 2014, at about 1840 Atlantic Standard Time, a Shorts SD3-60, United States registered N380MQ was destroyed when it crashed into the sea shortly after takeoff from Runway 28 at Princess Juliana International Airport, Sint Maarten, Dutch Antilles, Kingdom of the Netherlands. The two crewmembers on board sustained fatal injuries. The aircraft was operated by SkyWay Enterprises Inc. on a scheduled FedEx contract cargo flight to Luis Munoz Marin International Airport, San Juan, Puerto Rico. At 1839 local, Juliana Tower cleared the aircraft for takeoff Runway 28 - maintain heading 230 until passing 4000 feet. At 1840 local, Tower observed the aircraft descending visually and the radar target and data block disappeared. There were no distress calls. Night conditions and rain prevailed at the time of the accident. Coast Guard search crews discovered aircraft debris close to the shoreline about 1 ½ hours later. The Sint Maarten Civil Aviation Authority initiated an investigation in accordance with ICAO Annex 13. Local investigation authority personnel were joined by Accredited Representatives and advisors from the following states: the USA (NTSB/FAA), United Kingdom (AAIB and Shorts Brothers PLC), and Canada (TSB, TC, PWC). Organization of the investigation included the following groups: Operations, Accident Site and Wreckage, Powerplants, Aircraft Maintenance, Air Traffic Services, Meteorology, and GPS Study. The operator made available personnel for interviews but deferred to participate in the groups. Flight recorders were not installed nor required on this cargo configured aircraft. The original FDR and CVR were removed following conversion to cargo only operations. A handheld GPS recovered from submerged wreckage was successfully downloaded. Data revealed the aircraft past the departure runway threshold on takeoff and attained a maximum GPS recorded altitude of 433 feet at 119 knots groundspeed at 18:39:30. The two remaining data points were over the sea and recorded decreasing altitude and increasing airspeed. The wreckage was recovered from the sea and examined by technical experts. Assessment of the evidence concluded there were no airframe or engine malfunctions that would have affected the airworthiness of the aircraft. The experts concluded that the aircraft struck the sea while under normal engine operation. Operations and human performance investigators evaluated the evidence and analyzed extensive interviews. The investigation concluded that the aircraft departed from the expected flight path in an unusual attitude. The pilot flying most likely experienced a somatographic illusion as a result of a stressful takeoff and acceleration from flap retraction. The pilot’s reaction to pitch down while initiating a required heading change led to an extreme unusual attitude. Circumstances indicate the pilot monitoring did not perceive/respond/intervene to correct the flight path and recover from the unusual attitude. The aircraft exceeded the normal maneuvering parameters, the crew experienced a loss of control, and lacking adequate altitude for recovery, the aircraft crashed into the sea.", "probable_cause": "The investigation believes the PF experienced a loss of control while initiating a turn to the required departure heading after take-off. Flap retraction and its associated acceleration combined to set in motion a somatogravic illusion for the PF. The PF’s reaction to pitch down while initiating a turn most likely led to an extreme unusual attitude and the subsequent crash. PM awareness to the imminent loss of control and any attempt to intervene could not be determined. Evidence show that Crew resource management (CRM) performance was insufficient to avoid the crash. Contributing factors to the loss of control were environmental conditions including departure from an unfamiliar runway with loss of visual references (black hole), night and rain with gusting winds."}