{"url": "https://www.baaa-acro.com/crash/crash-gippsland-ga8-airvan-swindon", "date": "Nov 28, 2010 at 1015 LT", "type": "GippsAero GA8 Airvan", "operator": "The-Boogie-Club", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Swindon - Swindon", "msn": "GA8-05-090", "yom": 2006, "flight_number": null, "city": "Swindon", "zone": "Wiltshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2686, "captain_hours_type": 1057, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot arrived at the aircraft at approximately 0900 hrs to prepare it for a flight to drop parachutists. The aircraft had been outside overnight and there had been a heavy frost. The pilot removed a cover from the windscreen and began his pre-flight check during which he noticed no ice or frost on the upper surface of the wings. He returned to the operations building to complete his pre-flight planning and went back to the aircraft in time to start the engine at 1000 hrs. There was a very light wind from the north-west across the grass Runway 06L, the temperature was -4°C and the QNH was 1004 mb. While the engine was warming up, eight parachutists boarded the aircraft and sat down in the cabin. There were three parachute instructors, who were connected to three students, and two other parachutists with video cameras, one of whom was the jump supervisor. After the pilot judged that the engine had warmed up, he carried out a power check and the before takeoff checks, during which he selected the flaps to TAKEOFF. All indications appeared normal to the pilot and he taxied onto the runway and selected takeoff power, which was 29 inches of Manifold Air Pressure (MAP)and 2,500 rpm. The acceleration seemed, to the pilot, to be normal but, although VR was 60 kt, he delayed the rotation until 65 kt. At about the time the aircraft rotated, the pilot selected the flaps to FULL. As the aircraft crossed the hedge at the upwind end of the runway, the pilot began a left turn, which was the usual noise abatement manoeuvre to avoid flying over buildings situated on the runway’s extended centreline. During the turn, he realised the aircraft was descending and checked the engine instruments, observing that the MAP, fuel pressure and rpm were indicating correctly. He called “BRACE, BRACE, BRACE” and the aircraft hit the ground immediately afterwards in a left wing low attitude. After crossing a ditch, during which the landing gear detached, the aircraft skidded to a halt in the next field. The pilot was able to exit the aircraft through the door on his left but found that he could not stand up because of an injury to his leg. The sliding door on the rear left side of the cabin was jammed and the parachutists were unable to use it to leave the aircraft and so they exited through the same door as the pilot. One parachutist received a whiplash injury but the rest were unhurt. The pilot was subsequently airlifted to hospital.", "probable_cause": "The aircraft was parked outside overnight prior to the accident and the windscreen, which had been covered, was clear of ice and frost when the cover was removed. Four hours after the accident, the windscreen was still clear, which suggested that ice and frost were not actively forming during that period. However, since frost was found on the upper surface of the wing, it was concluded that the frost would have been present prior to and during the takeoff. The maximum engine power was found to be approximately 50 bhp less than the rated value. This was attributed to the state of wear expected of an engine approximately 75% through its normal overhaul life rather than as a result of a failure experienced on this particular takeoff. The distance to lift off, calculated using the manufacturer’s performance information, should have been between 340 m and approximately 368 m and yet the aircraft actually left the ground after approximately 560 m. The extra distance used by the aircraft was probably a combination of two factors: the engine was not producing the power assumed in the performance calculation and the aircraft was rotated approximately three to five knots above VR. It is possible that takeoff performance was reduced due to the effects of frost on the wings but it was not possible to quantify these effects. As the aircraft began its left turn, the flaps were at FULL and yet the flap selector handle and the flaps were found in the TAKEOFF position following the accident. At some point in the turn, therefore, the flaps were raised by one stage. This would have had the effect of increasing the stalling speed by approximately three knots (in the case of an uncontaminated wing). The groundspeed of the aircraft, recorded by the GPS approximately six seconds before impact, was 58 kt. The aircraft was turning into a light wind and so the IAS might have been slightly higher. The stalling speed of the aircraft during the turn, with the flaps in the TAKEOFF position and with an uncontaminated wing, would have been approximately 63 kt. The effect of the frost would have been to increase the stalling speed, in the worst case, to 75 kt. The CAA Safety Sense Leaflet 3 suggests that the maximum reduction of lift might occur with frost that has a surface roughness of course sandpaper, whereas the frost found on G-CDYA was similar to medium sandpaper. Nevertheless, it was clear that the lifting ability of the wing would have been compromised and the stalling speed would have been higher than 63 kt. It seemed probable, therefore, that the aircraft stalled in the turn as a result of frost on the wing. Furthermore, the angle of attack at the stall was probably lower than that required to activate the stall warning horn."}