{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-500-goulburn", "date": "Dec 1, 1984 at 1051 LT", "type": "Rockwell Aero Commander 500", "operator": "Fairburn Aviation Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Canberra – Goulburn", "msn": "500-1253-77", "yom": 1962, "flight_number": null, "city": "Goulburn", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was being used to transport equipment for members of an Aero Club, who were to carry out training at Goulburn. As the pilot was undergoing formation flying training, it was decided that he would lead a formation of two aircraft for the flight. A briefing on the procedures to be followed was carried out. During the flight the pilot of the second aircraft began to suspect the accuracy of his aircraft's airspeed indicator and requested that it be checked against that of the lead aircraft as the aircraft joined the circuit. The pilot of the lead aircraft extended the landing gear and flew the initial leg of the circuit at an indicated airspeed of 96 knots. At the end of this leg the pilot turned the aircraft steeply to the left, the nose dropped slightly and the aircraft flicked into a steep right turn. The aircraft then assumed a steep nose down attitude, however, the pilot was able to level the wings and raise the nose to the level attitude before impact. The impact occurred at a very high rate of sink. The pilot had not previously practiced steep turns at relatively slow airspeed and was not aware of the stalling speed in the given configuration and attitude. The pilot was subsequently unable to recall the reason for attempting a steeper than normal turn. When the aircraft stalled the pilot was unable to effect a full recovery in the height available before impact with the ground. ", "probable_cause": null}