{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-sault-sainte-marie", "date": "Jan 2, 2006 at 0200 LT", "type": "Beechcraft 100 King Air", "operator": "North%20Country%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Traverse City – Sault Sainte Marie", "msn": "B-138", "yom": 1972, "flight_number": null, "city": "Sault Sainte Marie", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7620, "captain_hours_type": 70, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13033, "circumstances": "The airplane, operated as an emergency medical flight, received substantial damage when it veered off the edge of runway 32 (5,235 feet long by 100 foot wide asphalt, slush and snow covered) and impacted a snow bank during landing roll at a non 14 CFR Part 139 airport. Night instrument meteorological conditions prevailed at the time of the accident. The pilot stated that during a non precision approach while two miles from the runway, he observed it to be completely covered in snow and slush. He continued the approach and upon touchdown the airplane decelerated in deep slush and veered to the left after a rollout of 1,200 feet. The pilot reported that prior to accepting the emergency medical flight, he obtained a weather briefing from a flight service station during which time no notices to airman (NOTAMs) existed that pertained to the destination airport. The pilot reported that he knew the airport was getting rain and was expecting the runway to be clear. He was surprised that the runway was covered with heavy slush. The airport manager stated that the runway was covered with wet, slushy snow as there had been periods of wet snow and rain that occurred late the previous day and evening of the accident. The airport weather observation recorded the presence of light snow in a period of approximately 24 hours before the accident. The pilot \"wondered\" why no NOTAM was issued relating to the runway condition. The Airport Facility Directory and the FAA's web site provides a list of 14 CFR Part 139 airports which are inherently required to issue NOTAMs. However, Advisory Circular 150/5200-28C states, the management of a public use airport is expected to make known, as soon as practical, any condition on or in the vicinity of an airport, existing or anticipated, that will prevent, restrict, or present a hazard during the arrival or departure of aircraft. Airport management is responsible for observing and reporting the condition of airport movement areas. Public notification is usually accomplished through the NOTAM system. The Aeronautical Information Manual, states that NOTAM information is information that could affect a pilot's decision to make a flight. It includes information such as airport or primary runway closures, changes in the status of navigational aids, ILS's, radar service availability, and other information essential to planned en route, terminal, or landing operations. ", "probable_cause": "The inadequate in-flight decision to continue the approach to land, directional control not maintained, and the contaminated runway. Contributing factors were flight to destination alternate not performed, a notice to airman not issued by airport personnel relating to snow/slush contamination of the runway, and the snow bank that the airplane impacted during the landing."}