{"url": "https://www.baaa-acro.com/crash/crash-cessna-525a-citationjet-cj1-west-gardiner-2-killed", "date": "Feb 1, 2008 at 1748 LT", "type": "Cessna 525 CitationJet CJ1", "operator": "Jeanette A. Symons", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Augusta - Lincoln", "msn": "525-0433", "yom": 2001, "flight_number": null, "city": "West Gardiner", "zone": "Maine", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3522, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1650, "circumstances": "The instrument-rated private pilot departed on an instrument flight rules (IFR) cross-country flight plan in near-zero visibility with mist, light freezing rain, and moderate mixed and clear icing. After departure, and as the airplane entered a climbing right turn to a track of about 260 degrees, the pilot reported to air traffic control that she was at 1,000 feet, climbing to 10,000 feet. The flight remained on a track of about 260 degrees and continued to accelerate and climb for 38 seconds. The pilot then declared an emergency, stating that she had an attitude indicator failure. At that moment, radar data depicted the airplane at 3,500 feet and 267 knots. Thirteen seconds later, the pilot radioed she wasn't sure which way she was turning. The transmission ended abruptly. Radar data indicated that at the time the transmission ended the airplane was in a steep, rapidly descending left turn. The fragmented airplane wreckage, due to impact and subsequent explosive forces, was located in a wooded area about 6 miles south-southwest of the departure airport. Examination of the accident site revealed a near vertical high-speed impact consistent with an in-flight loss of control. The on-site examination of the airframe remnants did not show evidence of preimpact malfunction. Examination of recovered engine remnants revealed evidence that both engines were producing power at the time of impact and no preimpact malfunctions with the engines were noted. The failure, single or dual, of the attitude indicator is listed as an abnormal event in the manufacturer's Pilot's Abbreviated Emergency/Abnormal Procedures. The airplane was equipped with three different sources of attitude information: one incorporated in the primary flight display unit on the pilot's side, another single instrument on the copilot's side, and the standby attitude indicator. In the event of a dual failure, on both the pilot and copilot sides, aircraft control could be maintained by referencing to the standby attitude indicator, which is in plain view of the pilot. The indicators are powered by separate sources and, during the course of the investigation, no evidence was identified that indicated any systems, including those needed to maintain aircraft control, failed. The pilot called for a weather briefing while en route to the airport 30 minutes prior to departure and acknowledged the deteriorating weather during the briefing. Additionally, the pilot was eager to depart, as indicated by comments that she made before her departure that she was glad to be leaving and that she had to go. Witnesses indicated that as she was departing the airport she failed to activate taxi and runway lights, taxied on grass areas off taxiways, and announced incorrect taxi instructions and runways. Additionally, no Federal Aviation Administration authorization for the pilot to operate an aircraft between 29,000 feet and 41,000 feet could be found; the IFR flight plan was filed with an en route altitude of 38,000 feet. The fact that the airplane was operating at night in instrument meteorological conditions and the departure was an accelerating climbing turn, along with the pilot's demonstrated complacency, created an environment conducive to spatial disorientation.  Given the altitude and speed of the airplane, the pilot would have only had seconds to identify, overcome, and respond to the effects of spatial disorientation.", "probable_cause": "The pilot's spatial disorientation and subsequent failure to maintain airplane control."}