{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b100-king-air-jackson", "date": "Sep 21, 2016 at 1620 LT", "type": "Beechcraft 100 King Air", "operator": "OIA Enterprises", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Memphis – Jackson", "msn": "BE-82", "yom": 1980, "flight_number": null, "city": "Jackson-McKellar Sipes", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11295, "captain_hours_type": 570, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4013, "circumstances": "The commercial pilot reported that he had completed several uneventful flights in the multiengine airplane earlier on the day of the accident. He subsequently took off for a return flight to his home airport. He reported that the en route portion of the flight was uneventful, and on final approach for the traffic pattern for landing, all instruments were indicating normal. He stated that the airplane landed \"firmly,\" that the right wing dropped, and that the right engine propeller blades contacted the runway. He pulled back on the yoke, and the airplane became airborne again momentarily before settling back on the runway. The right main landing gear (MLG) collapsed, and the airplane then veered off the right side of the runway and struck a runway sign and weather antenna. Witness reports corroborated the pilot's report. Postaccident examination revealed that the right MLG actuator was fractured and that the landing gear was inside the wheel well, which likely resulted from the hard landing. The pilot reported that there were no preimpact mechanical failures or malfunctions with the airframe or engine that would have precluded normal operation. Based on the pilot and witness statements and the wreckage examination, it is likely that the pilot improperly flared the airplane, which resulted in the hard landing and the collapse of the MLG. ", "probable_cause": "The pilot's improper landing flare, which resulted in a hard landing."}