{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-880-22-2-chicago", "date": "Dec 20, 1972 at 1800 LT", "type": "Convair CV-880", "operator": "Delta-Airlines", "flight_phase": "Taxiing", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tampa - Chicago", "msn": "22-00-29", "yom": 1960, "flight_number": "DL954", "city": "Chicago-O'Hare", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 86, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5500, "captain_hours_type": 2400, "copilot_hours": 3600, "copilot_hours_type": 500, "aircraft_hours": 37640, "circumstances": "Flight DL954 from Tampa landed uneventfully at Chicago-O'Hare Airport. The crew was cleared to taxi to the gate and to cross runway 27L when the airplane was struck by a North Central Airlines Douglas DC-9-31 registered N954N. En route to Duluth via Madison, the DC-9 was carrying 41 passengers and a crew of four and his pilot just received the clearance to take off from runway 27L. One of the DC-9's wing struck the tail of the Convair that stopped immediately. out of control, the DC-9 veered off runway and came to rest in flames. The Convair was damaged beyond repair and the DC-9 was destroyed by a post crash fire. Among the 93 occupants on board the Convair, 10 were injured. Among the 45 occupants on board the DC-9, 10 were killed and 35 were injured, some of them seriously. ", "probable_cause": "Failure of the air traffic control system to ensure separation of aircraft during a period of restricted visibility. This failure included the following: \r\n- The controller omitted a critical word which made his transmission to the flight crew of the Delta CV-880 ambiguous,\r\n- The controller did not use all the available information to determine the location of the CV-880,\r\n- The CV-880 flight crew did not request clarification of the controller's communications."}