{"url": "https://www.baaa-acro.com/crash/crash-cessna-207-skywagon-near-mcgrath-2-killed", "date": "Aug 13, 2011 at 1940 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Inland%20Aviation%20Services", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "McGrath - Anvik - Aniak", "msn": "207-0073", "yom": 1969, "flight_number": null, "city": "McGrath", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 25000, "captain_hours_type": 10000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 31618, "circumstances": "The commercial pilot departed with five passengers on an on-demand air taxi flight between two remote Alaskan villages separated by mountainous terrain. When the airplane did not reach its destination, the operator reported the airplane overdue. After an extensive search, the airplane's wreckage was discovered in an area of steep, tree-covered terrain, about 1,720 feet msl, along the pilot's anticipated flight path. The flight was conducted under visual flight rules, but weather conditions in the area were reported as low ceilings and reduced visibility due to rain, fog, and mist. There is no record that the pilot obtained a weather briefing before departing. According to a passenger who was seated in the front, right seat, next to the pilot, about 20 minutes after departure, as the flight progressed into mountainous terrain, low clouds, rain and fog restricted the visibility. At one point, the pilot told the passenger, in part: \"This is getting pretty bad.\" The pilot then descended and flew the airplane very close to the ground, then climbed the airplane, and then descended again. Moments later, the airplane entered \"whiteout conditions,\" according to the passenger. The next thing the passenger recalled was looking out the front windscreen and, just before impact, seeing the mountainside suddenly appear out of the fog. A postaccident examination did not reveal any evidence of a mechanical malfunction. A weather study identified instrument meteorological conditions in the area at the time of the accident. Given the lack of mechanical deficiencies with the airplane and the passenger's account of the accident, it is likely that the pilot flew into instrument meteorological conditions while en route to his destination, and subsequently collided with mountainous terrain.", "probable_cause": "The pilot's decision to continue visual flight rules flight into instrument meteorological conditions, which resulted in an in-flight collision with mountainous terrain.\n"}