{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-1009-dublin", "date": "Sep 19, 1961 at 2104 LT", "type": "Douglas DC-4", "operator": "Starways", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tarbes – Dublin", "msn": "10288", "yom": 1944, "flight_number": null, "city": "Dublin", "zone": "Leinster", "country": "Ireland", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 69, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6049, "captain_hours_type": 402, "copilot_hours": 14000, "copilot_hours_type": 4200, "aircraft_hours": 31458, "circumstances": "G-ARJY was flying a chartered non- scheduled trip from Speke Airport, Liverpool to Tarbes Airport, Lourdes where passengers were to embark for Dublin, Ireland, Following a normal flight to Lourdes the aircraft was refuelled. The amount taken on appeared to be sufficient for the flight to Dublin. The aircraft was carrying 4 crew and 69 passengers. Take- off for Dublin was at 1710 hours, and the flight to Dublin Approach was uneventful. At 2035 the aircraft reported to Dublin Air Traffic Control and was informed of the local weather and of the runway in use. Subsequently, at 2058, it was cleared to land on runway 24, and the captain stated that he intended to make a visual approach. Shortly thereafter, at 2104 the flight reported having difficulty and that it was losing power. The captain abandoned the approach, swung the aircraft abruptly to the left and made a successful emergency wheels-up landing away from the airport. There was no fire. Although some occupants were slightly injured and shocked, there were no fatalities or serious injuries.", "probable_cause": "The accident was attributed to incorrect management of the fuel system by the flight crew which resulted in partial Loss of power and control and a forced landing outside the airport."}