{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-328-paris-130-killed", "date": "Jun 3, 1962 at 1234 LT", "type": "Boeing 707", "operator": "Air-France-31", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris – New York – Atlanta – Houston", "msn": "17920", "yom": 1960, "flight_number": "AF007", "city": "Paris-Orly", "zone": "Val-de-Marne", "country": "France", "region": "Europe", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 122, "pax_fatalities": 120, "other_fatalities": 0, "total_fatalities": 130, "captain_hours": 14225, "captain_hours_type": 743, "copilot_hours": 15194, "copilot_hours_type": 1407, "aircraft_hours": 4491, "circumstances": "The Boeing 707 aircraft, named \"Chateau de Sully\", was on a non-scheduled (charter) international flight from Paris (ORY) to Atlanta (ATL) and Houston via New York (JFK). Ten crew and 122 passengers were on the flight when, after a considerable delay to await the arrival of passengers, it was cleared to take off from runway 08 at Orly Airport at 11:32 UTC. It aligned itself for takeoff and waited 6 seconds, which permitted the setting and checking of takeoff parameters on the four engines. Full thrust was applied, and the aircraft accelerated normally. From testimony and flight recorder data, the takeoff was reconstructed as follows. Between 20 to 40 seconds after the start of the roll, the rate of acceleration was steady at 1.80 m/s2. The aircraft rolled along the runway centre line without showing any tendency to veer to either side. V1, determined as 147 kt IAS, was attained after a ground roll of 1500 m. This was followed by VR, 158 kt IAS. Forty-eight seconds after the beginning of the takeoff run and approximately when passing the 1800 m mark, the aircraft reached the rotation speed (VR), and the pilot-in-command initiated the takeoff manoeuvre by pulling backwards on the control column. According to witnesses, the aircraft made an incomplete rotational movement about 2100 m from the threshold. It remained for 4 to 6 seconds with its nose slightly raised. Then the nose dropped when the brakes were applied. Thick smoke streamed from the wheels. The aircraft was 2600 m from its starting point and had reached a maximum speed of 179 kt IAS. It braked for the last 680 m of the runway with an average deceleration of 1.2 to 1.3 m/s After 250 m of braking the aircraft veered slightly to the left, and 50deg of flap were selected. Then after another 250 m the aircraft listed heavily to starboard. Its path then curved right, which suggests a possible attempt to ground loop. However, the aircraft's speed precluded the success of this manoeuvre, and it left the runway while still on the centre line. It rolled for a while on the grass extension of the runway but, because of the unevenness of the terrain and the high speed of the aircraft (160 kt), the port gear broke off 110 m from the end of the runway and was wrenched away. The aircraft pivoted left, and engines No. 1 and 2 scraped the ground. Fire broke out in the port wing at the level of the landing gear. About 300 m beyond the end of the runway the aircraft crossed the encircling road. The starboard gear collapsed, and No. 2 engine broke loose. It then struck the approach lights, which represented a considerable obstacle. It started to disintegrate when reaching the hollow at the end of the runway extension, which descends at a steep angle towards the Seine. The front part of the fuselage struck a house and garage. The nose of the aircraft broke away, and the rest of the fuselage came to a stop 100 m further on. The site of the accident was 550 m beyond the end of runway 08 on its extended centre line, at an elevation of 89 m. The airplane was completely destroyed by a post crash fire. Two stewardess who seated in the rear were slightly injured while all 130 other occupants were killed. \r\nCrew members who were killed:\r\nRoland-Paul Hoche, pilot,\r\nJacques-Marcel Pitoiset, copilot,\r\nRaymond Gautrand, navigator,\r\nRobert-Gaston Barres, mechanic,\r\nMarie-Geneviève Barot, stewardess,\r\nRobert Mancel, cabin chief,\r\nFrançois Gutrupi, steward,\r\nRobert Lugon, steward. ", "probable_cause": "The accident was due to the concurrence of: 1) a considerable out-of-trim condition producing major loads on the control column at VR and VLOF which may have seemed prohibitive to the pilot-in-command; and 2) a failure of the trim servo motor control system which prevented the pilot-in-command from rectifying the faulty setting of the stabilizer and, consequently, from reducing the reaction at the control column. These factors led the pilot-in-command to discontinue take-off, but it was too late to stop the aircraft on the runway or slow it down sufficiently before the end of the runway."}