{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-mackay-29-killed", "date": "Jun 10, 1960 at 2205 LT", "type": "Fokker F27 Friendship", "operator": "Trans%20Australia%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Brisbane – Maryborough – Rockhampton – Mackay", "msn": "10112", "yom": 1959, "flight_number": "TN538", "city": "Mackay", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 25, "pax_fatalities": 25, "other_fatalities": 0, "total_fatalities": 29, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2420, "circumstances": "The Fokker F-27 aircraft was on a regular passenger flight from Brisbane (BNE) to Mackay (MKY) via Maryborough (MBH) and Rockhampton (ROK). The aircraft departed Brisbane at 17:11 and arrived at Maryborough at 17:52. It then took off at 18:12 on the next portion of the trip to Rockhampton where it landed without incident one hour later. Just prior to the landing at Rockhampton, the aircraft was advised of a special weather report which indicated shallow ground fog at Mackay to a height of 20 ft with a visibility of 880 yd, and also that an alternate aerodrome would be required for the rest of the flight. The flight departed Rockhampton at 19:52. On departure the air traffic controller at Mackay was advised that the expected flight time to Mackay was 52 minutes at an altitude of 13000 ft, that Townsville had been selected as the alternate. At 20:17 the aircraft reported at the prescribed reporting point, Charon Point, 80 miles south of Mackay at 130000 ft and gave its estimated time of arrival at Mackay as 20:40. It was advised that Mackay Airport was closed to landings at that time, and the situation remained the same when the aircraft reached the point at which it would normally have commenced its descent to Mackay. The captain indicated that he would continue the flight at 13000 ft and would hold over Mackay at that altitude. At 20:45 the ATC Officer advised the pilot that visibility was fluctuating between 2 and 2-1/2 miles along runway 14/32. The pilot replied that the airport lighting, the city area, and the surrounding country could be clearly seen, but that a belt of fog extending about 10 miles was situated to the southwest of the airport and was moving in a slightly northeasterly direction across the airport. The pilot then requested landing instructions. The aircraft was cleared to make a visual approach with a view to landing on runway 14. He reported on final approach, and at 20:55 the aircraft was cleared to land. As the aircraft approached close to the runway threshold at a height of about 50 feet, the pilot advised that a small patch of fog had suddenly appeared on the approach to the runway. It then flew along the runway at a height of approximately 50 ft and commenced to climb away. The pilot advised that he would look at the approach to runway 32. The ATC Officer next observed the aircraft descending to approach runway 32. It reached a height of approximately 200 ft, but before crossing the threshold it began to climb along the line of the runway, and the pilot requested permission to hold over Mackay at 5000 ft until an improvement in the weather occurred. This procedure was approved. The aircraft continued to hold over Mackay until about 22:00. At approximately 22:02 the ATC Officer noted the conditions improved rapidly and visibility was continually improving. When the aircraft was thus informed, it replied: \"Roger tower, will commence let down to approach on runway 32\". The aircraft was cleared for a visual approach and was given the wind (calm) and QNH (1019 mb) and was asked to report on final approach. Nothing more was heard from the flight. During the approach the airplane contacted the sea and crashed, some 12 km short of the runway.", "probable_cause": "The investigation was not able to determine a probable cause of this accident. No evidence was found of material or structural defects, fire or an explosion on board, or any commotion or unusual act by any person in the aircraft. It is possible that something happened within the last 2-3 minutes as a result of which the pilot was unaware of his actual rate of descent. This could have been either caused by the instruments not accurately recording the altitude, or by the pilot relying on visual observation of his surroundings without paying (sufficient) attention to the instruments. The accident happened at night with very few visual clues."}