{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-300-super-king-air-tucson-2-killed", "date": "Jan 23, 2017 at 1233 LT", "type": "Beechcraft 300 Super King Air", "operator": "KAAZ LLC", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tucson - Hermosillo", "msn": "FA-42", "yom": 1985, "flight_number": null, "city": "Tucson", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 15100, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9962, "circumstances": "The pilot and the passenger departed on a cross-country, personal flight in the airplane that the operator had purchased the day before the accident. Shortly after takeoff from runway 11L, after reaching an altitude of about 100 to 150 ft above the runway in a nose-high pitch attitude, the airplane rolled left to an inverted position as its nose dropped, and it descended to terrain impact on airport property, consistent with an aerodynamic stall. Post-accident examination of the accident site revealed propeller strike marks separated at distances consistent with both propellers rotating at the speed required for takeoff and in a normal blade angle range of operation at impact. Both engines exhibited rotational scoring signatures that indicated the engines were producing symmetrical power and were most likely operating in the mid-to upper-power range at impact. The engines did not display any pre-impact anomalies or distress that would have precluded normal engine operation before impact. No evidence was found of any preexisting mechanical anomalies that would have precluded normal operation of the airplane. Toxicology testing revealed the pilot's use of multiple psychoactive substances including marijuana, venlafaxine, amphetamine, pseudoephedrine, clonazepam, and pheniramine. The wide variety of psychoactive effects of these medications precludes predicting the specific effects of their use in combination. However, it is likely that the pilot was impaired by the effects of the combination of psychoactive substances he was using and that those effects contributed to his loss of control. The investigation was unable to obtain medical records regarding any underlying neuropsychiatric disease(s); therefore, whether these may have contributed to the accident circumstances could not be determined.", "probable_cause": "The pilot's exceedance of the airplane's critical angle of attack during takeoff, which resulted in an aerodynamic stall. Contributing to the accident was the pilot's impairment by the effects of a combination of psychoactive substances."}