{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-8gp-denpasar", "date": "Apr 13, 2013 at 1510 LT", "type": "Boeing 737-800", "operator": "Lion%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Bandung - Denpasar", "msn": "38728/4350", "yom": 2013, "flight_number": "LNI904", "city": "Denpasar-I Gusti Ngurah Rai", "zone": "Bali", "country": "Indonesia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 101, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15000, "captain_hours_type": 6173, "copilot_hours": 1200, "copilot_hours_type": 923, "aircraft_hours": 142, "circumstances": "On 13 April 2013, a Boeing 737-800 aircraft, registered PK-LKS, was being operated by PT. Lion Mentari Airlines (Lion Air) on a scheduled passenger flight as LNI 904. The  aircraft  departed  from  Husein Sastranegara International Airport (WICC) Bandung at 0545 UTC to Ngurah Rai International Airport (WADD), Bali, Indonesia. The flight was the last sector of four legs scheduled for the crew on that day which were Palu (WAML) - Balikpapan (WALL) - Banjarmasin (WAOO) - Bandung (WICC) - Bali (WADD). The aircraft flew at FL 390, while the Second in Command (SIC) was the Pilot Flying (PF) and the Pilot in Command (PIC) was the Pilot Monitoring (PM). There were 2 pilots, 5 flight attendants and 101 passengers comprising 95 adults, 5 children and 1 infant making a total of 108 persons on board. The flight from the departure until start of the approach into Bali was uneventful. At 0648 UTC, the pilot made first communications with the Bali Approach controller (Bali Director) when the aircraft was located 80 Nm from BLI VOR. The pilot received clearance to proceed direct to the TALOT IFR waypoint and descend to 17,000 feet. At 0652 UTC, the Bali Director issued a further clearance for the pilot direct to KUTA point and descent to 8,000 feet. At 0659 UTC, the aircraft was vectored for a VOR DME approach for runway 09 and descent to 3,000 feet. At 0703 UTC, while the aircraft was over KUTA point, the Bali Director transferred communications with the aircraft to Bali Control Tower (Ngurah Tower). At 0704 UTC, the pilot contacted Ngurah Tower controller and advised that the aircraft was leaving KUTA point. The Ngurah Tower controller instructed the pilot to continue the approach and to reduce the aircraft speed to provide sufficient separation distance with another aircraft. At 0707 UTC, the Ngurah Tower issued take-off clearance for a departing aircraft on runway 09. At 0708 UTC, with LKS at approximately 1,600 feet AGL, the Ngurah Tower controller saw the aircraft on final approach and gave a landing clearance with additional information that the wind was from 120° at 05 knots. At 0708:47 UTC, the aircraft Enhance Ground Proximity Warning System (EGPWS) aural alert called “ONE THOUSAND”, the SIC said one thousand, stabilized, continue, prepare for go-around missed approach three thousand. The FDR showed that the pilot flown using LNAV (Lateral Navigation) and VNAV (Vertical Navigation) during the approach until disengagement of the Auto Pilot. The sequence of events during the final approach is based on the recorded CVR and FDR data, and information from crew interviews as follows: At 0708:56 UTC, while the aircraft altitude was approximately 900 feet AGL, the SIC commented that the runway was not in sight, whereas the PIC commented “OK. Approach light in sight, continue”. At 0709:33 UTC, after the EGPWS aural alert “MINIMUM” sounded at an aircraft altitude of approximately 550 feet AGL, the SIC disengaged the autopilot and the auto-throttle and then continued the approach. At 0709:43 UTC, the EGPWS called “THREE HUNDRED”. At 0709:47 UTC, the CVR recorded a sound similar to rain hitting the windshield. At 0709:49 UTC, the EGPWS called “TWO HUNDRED”. At 0709:53 UTC, while the aircraft altitude was approximately 150 feet AGL, the PIC took over control of the aircraft. The SIC handed control to the PIC and stated that he could not see the runway. At 0710:01 UTC, after the EGPWS called “TWENTY”, the PIC commanded for go-around. At 0710:02 UTC, the aircraft impacted the water, short of the runway. The aircraft stopped facing to the north at about 20 meters from the shore or approximately 300 meters south-west of the beginning of runway 09. Between 0724 UTC to 0745 UTC, three other aircraft took-off and six aircraft landed using runway 09. At 0750 UTC, the airport was closed until 0850 UTC. At 0755 UTC, all occupants were completely evacuated, the injured passengers were taken to the nearest hospitals and uninjured occupants to the airport crisis centre.", "probable_cause": "The National Transportation Safety Committee initial findings on the accident flight are as follows: \r\n- The aircraft was airworthy prior to impact and has an item on the DMI (deferred maintenance item) category C (right engine oil filter). \r\n- All crew has valid licenses and medical certificates. \r\n- The Second in Command (SIC) acted as Pilot Flying (PF). \r\n- The flight performed a VOR DME approach runway 09, and the published Minimum Descent Altitude (MDA) was 465 ft AGL. \r\n- The approach configuration used was flap 40. \r\n- At 900 ft AGL the PF did not have the runway in sight. \r\n- Upon reaching the MDA the flight profile indicated a constant path. \r\n- The PIC took over control of the aircraft at about 150 ft radio altitude. \r\n- The SIC handed over control to the PIC at about 150 ft and stated that he could not see the runway. \r\n- The final approach phase of the flight profile was outside the envelope of the EGPWS warning, therefore no EGPWS warning was recorded on the CVR.\r\nThe NTSC concluded in its final report that the accident was caused by the following factors:\r\n- The aircraft flight path became unstable below minimum descends altitude (MDA) with the rate of descend exceeding 1000 feet per minute and this situation was recognized by both pilots.\r\n- The flight crew loss of situational awareness in regards of visual references once the aircraft entered a rain cloud during the final approach below minimum descends altitude (MDA).\r\n- The PIC decision and execution to go-around was conducted at an altitude which was insufficient for the go-around to be executed successfully.\r\n- The pilots of accident aircraft was not provided with timely and accurate weather condition despite the weather around the airport and particularly on final approach to the airport was changing rapidly."}