{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-elfin-cove-1-killed", "date": "Jul 19, 1996 at 1530 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Loken Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Hoonah – Elfin Cove – Juneau", "msn": "724", "yom": 1954, "flight_number": null, "city": "Elfin Cove", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2999, "captain_hours_type": 616, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11047, "circumstances": "The pilot of the air taxi cargo flight departed his base of operations in Juneau, Alaska for a series of flights in southeast Alaska that would ultimately return him to Juneau. On the accident leg of the intended round robin, the pilot was en route from Hoonah to Elfin Cove. The flight would originate and end at sea level, and traverse a mountain pass, with minimum obstruction clearance in the pass estimated at 500 feet msl. The airplane collided with steeply rising terrain at the 1,250-foot level about one mile south of the proposed flight path. The airplane was partially consumed by a post impact fire. The operator initiated a helicopter search within two hours of the time of the accident. The helicopter pilot and his passenger both reported that the area where the accident airplane was eventually located was obscured in low clouds, and that many of the other valleys and mountain sides were covered in clouds. Low clouds persisted in the area of the crash site for the following two days. ", "probable_cause": "The pilot's decision to continue VFR flight into instrument meteorological conditions, and his failure to maintain adequate clearance from rising terrain. Factors associated with the accident were the rising terrain and clouds. "}