{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-la-crosse-1-killed", "date": "Mar 17, 2020 at 0919 LT", "type": "Cessna 208B Grand Caravan", "operator": "Planemasters", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Wichita - Hays", "msn": "208B-0705", "yom": 1998, "flight_number": "PMS1670", "city": "La Crosse", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 9900, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was conducting a Part 135 on-demand cargo flight in instrument meteorological conditions. After executing a second missed approach, he informed air traffic control (ATC) of his intentions to divert to an airport located about 36 miles to the southeast. About 7 minutes after executing the second missed approach, the pilot began making unintelligible radio communications that ATC characterized as very garbled and difficult to understand, “almost hypoxic.” ATC then instructed the pilot to utilize oxygen. About 19 minutes after the second missed approach, ATC informed the pilot that the airplane had descended 1,600 ft, not following assigned course vectors or instructions and asked if everything was alright, to which no response was received. After attempting to relay communications through other airplanes in the area, an unintelligible response was received from the accident airplane. ATC then made numerous transmissions to the accident pilot urging him to utilize oxygen and open a window. No further communications were received from the accident airplane. A witness reported that he saw the airplane descend out of a low overcast cloud layer at a high rate of descent. The airplane then abruptly transitioned into a steep climb before re-entering the clouds. A few seconds later, he heard the airplane impact terrain and responded to the accident site. The sudden change in communications from the pilot indicates a possible impairment. When combined with the ATC data, the witness account, and the lack of any mechanical irregularities or malfunctions with the airplane, it is likely the pilot experienced difficulty controlling the airplane due to impairment. While the pilot was at an increased risk for an acute cardiovascular event, the extremely limited available medical evidence leaves no way to quantify that risk and no evidence regarding whether such an event occurred. As a result, whether the pilot was incapacitated by an acute medical event cannot be determined from the available medical information.", "probable_cause": "An infight loss of control as a result of pilot impairment, the cause of which could not be determined."}