{"url": "https://www.baaa-acro.com/crash/crash-cessna-t303-crusader-batesland", "date": "Apr 24, 2018 at 1000 LT", "type": "Cessna 303 Crusader", "operator": "Aberdeen%20Flying%20Service", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Aberdeen - Pine Ridge", "msn": "303-00210", "yom": 1983, "flight_number": null, "city": "Batesland", "zone": "South Dakota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5655, "captain_hours_type": 4403, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8929, "circumstances": "Before the air taxi flight, the commercial pilot obtained a weather briefing via the company computer system and reviewed the weather information with the company chief pilot. The pilot stated that based on the computer briefing, which did not include icing conditions, he was aware of the forecasted weather conditions along the route of flight and at the intended destination. However, the briefing was incomplete as it did not contain any in-flight weather advisories, which would have alerted the pilot of moderate icing conditions expected over the flight route in the form of AIRMET Zulu. After takeoff and during the climb to 12,000 ft mean sea level (msl), the airplane encountered light rime ice, and the pilot activated the de-ice equipment with no issues noted. After hearing reports of better weather at a lower altitude, the pilot requested a descent to between 5,000 and 6,000 ft. During the descent to 6,000 ft msl and with the airplane clear of ice, the airplane encountered light to moderate icing conditions. The pilot considered turning back to another airport but could not get clearance until the airplane was closer to his destination. Shortly thereafter, the pilot stated that it felt “like a sheet of ice fell on us” as the airplane encountered severe icing conditions. The pilot applied full engine power in an attempt to maintain altitude. The airplane exited the overcast cloud layer about 500 ft above ground level. The pilot chose to execute an off-airport emergency landing because the airplane could not maintain altitude. During the landing, the landing gear separated; the airplane came to rest upright and sustained substantial damage to the wings and fuselage. The pilot reported that there were no preaccident mechanical malfunctions or failures with the airplane that would have precluded normal operation and that the airplane was within its maximum gross weight. Structural icing was observed on the airframe after the landing. Based on the weather information, which indicated the probability of icing between 5,000 and 9,000 ft over the region and a high threat of supercooled large droplets between 5,000 and 7,000 ft, it is likely that the airplane, which was equipped for flight in icing conditions, inadvertently encountered severe icing conditions consistent with supercooled large droplets, which resulted in structural icing that exceeded the airplane’s capabilities to maintain altitude.", "probable_cause": "The airplane’s inadvertent encounter with severe icing conditions during descent, which resulted in structural icing, the pilot’s inability to maintain altitude, and an emergency landing. Contributing to the accident was an incomplete preflight weather briefing.\n"}