{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-victoria-2-killed", "date": "Nov 23, 1998 at 0030 LT", "type": "Cessna 208B Grand Caravan", "operator": "Regency%20Express%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Vancouver - Victoria", "msn": "208-0061", "yom": 1987, "flight_number": "RXX434", "city": "Victoria", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1653, "captain_hours_type": 400, "copilot_hours": 120, "copilot_hours_type": null, "aircraft_hours": 6717, "circumstances": "Regency Express Air Operations Flight 434, a Cessna 208 Caravan (serial number 208B0061), was en route from Vancouver International Airport to Victoria International Airport, British  Columbia, on a night visual flight rules (VFR) flight when it collided with trees on Saltspring Island, about five nautical miles (nm) north of the Victoria International Airport. The aircraft broke apart on impact and a post-crash fire occurred. The two pilots, who were the sole occupants of the aircraft, sustained fatal injuries, and the aircraft was destroyed. The accident occurred at 0030 Pacific standard time (PST).", "probable_cause": "Findings as to Causes and Contributing Factors:\r\nA. Although weather information was available by radio from the Vancouver FSS specialists or from the Victoria Terminal controllers, there is no indication that the pilots requested weather updates from either of these units.\r\nB. The crew of RXX434 would have encountered the lower ceiling in the vicinity of Beaver Point. This lower layer of cloud would have restricted the crew's view of the ground lighting and reduced the ambient lighting available to navigate by visual means.\r\nC. With the loss of ground references, it is unlikely that the crew would have been able to perceive the divergence of the aircraft's flight path away from its intended track by visual means.\r\nD. The crew was unable to maintain separation between the aircraft and the terrain by visual means.\r\nE. The published VFR arrival and departure routes for Victoria were not consistent with obstacle clearance requirements for commercial operators.\r\nF. Regency Express Air Operations' crew manual suggested an en route altitude of 1,500 feet for this particular flight. That route and altitude combination is not consistent with published obstacle clearance requirements.\r\nOther Findings:\r\n1. At the time the crew completed their flight planning, the weather at the departure airport of Vancouver and the arrival airport of Victoria was suitable for a night VFR flight.\r\n2. An amended terminal forecast for Victoria indicating the presence of a temporary ceiling at 2,000 feet asl was issued after the crew had completed their preflight planning activities.\r\n3. The regulation requiring GPWS equipment does not apply to air taxi operations because the aircraft used in those operations do not meet weight or propulsion criteria."}