{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-near-barzas-20-killed", "date": "May 27, 1953 at 1950 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Irkutsk – Krasnoyarsk – Novosibirsk", "msn": "184 290 05", "yom": 30, "flight_number": "SU018", "city": "Barzas", "zone": "Kemerovo oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 16, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3882, "circumstances": "The aircraft left Krasnoyarsk Airport at 1755LT bound for Novosibirsk with an assigned altitude of 2,100 meters. At 1840LT, a second Lisunov LI-2T registered CCCP-A4031 left Novosibirsk Airport bound for Kemerovo with a crew of seven who were involved in an aerial photography mission. While approaching Kemerovo, the captain of the first LI-2 modified his route and flight level without prior permission and passed north of Kemerovo. In excellent weather conditions, while cruising at an altitude of 1,800 meters to a heading of 270° and facing the sun, the first LI-2 was hit on its right wing and right engine by the second LI-2 that was flying from the opposite. Following the collision, both aircraft dove into the ground and crashed in a wooded area located 16,5 km west of Barzas. Debris were found on a greater distance than 600 meters and all 27 occupants on both aircraft were killed. ", "probable_cause": "It was determined that the pilot of the LI-2 registered CCCP-L4534 deliberately decided to modify his flight path and flight level without prior permission from ATC. Doing so, he flew into the flight path of the second aircraft that was flying to a heading of 90°. It was reported that the pilot at fault had been degraded to the co-pilot position in July 1952 due to lack of discipline and loss of direction. He had returned to his captain position last February despite serious shortcomings in piloting techniques. The low position of the sun was considered as a contributory factor. "}