{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-42d-near-trabzon-75-killed", "date": "May 26, 2003 at 0445 LT", "type": "Yakovlev Yak-42", "operator": "UM%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Bishkek - Trabzon - Zaragoza", "msn": "18 11 395", "yom": 1988, "flight_number": "UKM4230", "city": "Trabzon", "zone": "Black Sea Region (Karadeniz Bölgesi)", "country": "Turkey", "region": "Asia", "crew_on_board": 13, "crew_fatalities": 13, "pax_on_board": 62, "pax_fatalities": 62, "other_fatalities": 0, "total_fatalities": 75, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 18739, "circumstances": "Chartered by the Spanish Government, the aircraft was completing a charter flight from Bishkek to Zaragoza with an intermediate stop in Trabzon, carrying 62 Spanish peacekeepers and 13 crew members. The 62 passengers were respectively 41 members of the Land Forces and 21 members of the Air Force who were returning to Spain following a peacekeeping mission in Afghanistan. While descending to Trabzon Airport by night, the crew encountered poor visibility due to foggy conditions. Unable to establish a visual contact with the approach lights and the runway 29, the crew initiated a go-around procedure. Few minutes later, while completing a second approach, the crew failed to realize he was not following the correct pattern for an approach to runway 29 when the aircraft impacted a mountain at an altitude of 4,600 feet. The aircraft disintegrated on impact and all 75 occupants were killed. The wreckage was found 3,5 km east of the village of Maçka, about 23 km southwest of the airport. ", "probable_cause": "The accident was the consequence of a controlled flight into terrain due to the combination of the following factors:\r\n- Loss of situational awareness on part of the flying crew,\r\n- The crew failed to comply with the Standard Operational Procedures published by the operator, \r\n- The crew failed to follow the published approach charts, \r\n- Implementation of a non-precision approach, \r\n- Incorrect use of the automated flight systems, \r\n- Inadequate training (LOFT), \r\n- The crew descended below the MDA in limited visibility."}