{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-40k-near-tikhoretsk", "date": "Oct 31, 1979 at 1950 LT", "type": "Yakovlev Yak-40", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Rostov - Rostov", "msn": "9621245", "yom": 1976, "flight_number": null, "city": "Tikhoretsk", "zone": "Krasnodar Krai", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11329, "captain_hours_type": 3393, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The three engine airplane was engaged in a local training flight at Rostov-on-Don Airport, carrying five crew members, among them one instructor and two pilots who have to be trained to become captain. Following seven successful approaches to Rostov Airport, weather conditions deteriorated and the visibility passed below minimums. In such conditions, the instructor decided to continue the training cession in Krasnodar, about 250 km southwest, and was vectored accordingly. At this time, fuel reserves were estimated for 2 hours and 30 minutes of flight. Nevertheless, en route, the crew lost his orientation and due to poor ATC assistance, was unable to fly to Krasnodar and to know his exact position. About an hour later, all three engines stopped due fuel exhaustion and the crew decided to attempt an emergency landing. The aircraft crash landed in an open field, slid for dozen meters and collided with several trees before coming to rest. The wreckage was found 43 km from Tikhoretsk and all five occupants were rescued. The captain and the instructor were injured while three other occupants were unhurt. The aircraft was damaged beyond repair. ", "probable_cause": "The crew failed to analyze changing weather conditions en route and did not use the radionavigation and integrated navigation equipment with sufficient effectiveness. On their side, ATC based in Rostov and Krasnodar failed to adequately assist the pilots and gave them instructions that were confusing, including reporting points. Despite the fact that the air controller did not know the exact position of the aircraft, he allowed the crew to descend from 5'100 to 1'800 meters for an approach to Krasnodar while the aircraft was actually out of the airport area. The accident was the consequence of an emergency landing made necessary by the fact that the fuel reserves were exhausted. The following factors were considered as contributing:\r\n- Poor flight organization,\r\n- Poor preparation of the training mission,\r\n- Lack of ATC assistance,\r\n- Serious shortcomings in the organization of ATC in the Krasnodar and Rostov control zones."}