{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-100-king-air-kirby-lake-1-killed", "date": "Oct 25, 2010 at 1120 LT", "type": "Beechcraft 100 King Air", "operator": "Kenn%20Borek%20Air-2_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Calgary - Edmonton - Kirby Lake", "msn": "B-42", "yom": 1970, "flight_number": "KBA103", "city": "Kirby Lake", "zone": "Alberta", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on an instrument flight rules flight from the Edmonton City Centre Airport to Kirby Lake, Alberta. At approximately 1114 Mountain Daylight Time, during the approach to Runway 08 at the Kirby Lake Airport, the aircraft struck the ground, 174 feet short of the threshold. The aircraft bounced and came to rest off the edge of the runway. There were 2 flight crew members and 8 passengers on board. The captain sustained fatal injuries. Four occupants, including the co-pilot, sustained serious injuries. The 5 remaining passengers received minor injuries. The aircraft was substantially damaged. A small, post-impact, electrical fire in the cockpit was extinguished by survivors and first responders. The emergency locator transmitter was activated on impact.  All passengers were BP employees. ", "probable_cause": "Findings as to Causes and Contributing Factors:  \r\n1. The conduct of the flight crew members during the instrument approach prevented them from effectively monitoring the performance of the aircraft.  \r\n2. During the descent below the minimum descent altitude, the airspeed reduced to a point where the aircraft experienced an aerodynamic stall and loss of control. There was insufficient altitude to effect recovery prior to ground impact.  \r\n3. For unknown reasons, the stall warning horn did not activate; this may have provided the crew with an opportunity to avoid the impending stall. \r\nFindings as to Risk: \r\n1. The use of company standard weights and a non-current aircraft weight and balance report resulted in the flight departing at an inaccurate weight. This could result in a performance regime that may not be anticipated by the pilot.  \r\n2. Flying an instrument approach using a navigational display that is outside the normal scan of the pilot increases the workload during a critical phase of flight.  \r\n3. Flying an abbreviated approach profile without applying the proper transition altitudes increases the risk of controlled flight into obstacles or terrain. \r\n4. Not applying cold temperature correction values to the approach altitudes decreases the built-in obstacle clearance parameters of an instrument approach."}