{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-baltimore-1-killed", "date": "May 14, 2004 at 0724 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "EPPS", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Philadelphia - Baltimore", "msn": "755", "yom": 1980, "flight_number": "EPS101", "city": "Baltimore", "zone": "Maryland", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6800, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6951, "circumstances": "The pilot was finishing his third round-trip, Part 135 cargo flight. The first round trip began the previous evening, about 2150, and the approach back to the origination airport resulted in a landing on runway 15R at 2305. The second approach back to the origination airport resulted in a landing on runway 28 at 0230. Prior to the third approach back to the airport, the pilot was cleared for, and acknowledged a visual approach to runway 33R twice, at 0720, and at 0721. However, instead of proceeding to the runway, the airplane flew north of it, on a westerly track consistent with a modified downwind to runway 15L. During the westerly track, the airplane descended to 700 feet. Just prior to an abeam position for runway 15L, the airplane made a \"sharp\" left turn back toward the southeast, and descended into the ground. Witnesses reported the airplane's movements as \"swaying motions as if it were going to bank left, then right, and back left again,\" and \"the nose...pointing up more than anything...but doing a corkscrew motion.\" Other witnesses reported the \"wings straight up and down,\" and \"wings vertical.\" Tower controllers also noted the airplane to be \"low and tight,\" and \"in an unusually nose high attitude close to the ground. It then \"banked left and appeared to stall and then crashed.\" A post-flight examination of the wreckage revealed no evidence of mechanical malfunction. The pilot, who reported 6,800 hours of flight time, had also flown multiple round trips the previous two evenings. He had checked into a hotel at 0745, the morning prior to the accident flight, checked out at 1956, the same day, and reported for work about 1 hour before the first flight began.", "probable_cause": "The pilot's failure to maintain airspeed during a sharp turn, which resulted in an inadvertent stall and subsequent impact with terrain. Factors included the pilot's failure to fly to the intended point of landing, and his abrupt course reversal back towards it."}