{"url": "https://www.baaa-acro.com/crash/crash-avro-748-1-101-lympne", "date": "Jul 11, 1965 at 1633 LT", "type": "Avro 748", "operator": "Skyways%20Coach-Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Beauvais – Lympne", "msn": "1536", "yom": 1961, "flight_number": null, "city": "Lympne", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 48, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6799, "captain_hours_type": 1096, "copilot_hours": 980, "copilot_hours_type": 192, "aircraft_hours": 3432, "circumstances": "The aircraft was on a scheduled flight from Beauvais, France to Lympne, England. Before taking off the pilot-in-command obtained a weather report from Lympne as follows: Cloud ceiling : 250 ft . Visibility : 2000 m . Surface wind : 220 degrees at 18 kts. It departed Beauvais at 15:51 hours UTC on an IFR flight plan. As the aircraft passed Abbeville, radio contact was established with Lympne and a weather report was obtained which gave a visibility of 1000 m in drizzle, cloud ceiling of 250 ft and surface wind 220/18 kts gusting to 26 kts. The airline's limits for landing on runway 20 were 1100 m RVR and a cloud ceiling of 200 ft. The pilot-in-command again checked landing conditions at Lympne before commencing an instrument approach and, although conditions had not altered significantly since the previous report, he was informed of a \"slight improvement\" but the wind was still gusting. The final instrument approach to runway 20 using radar began at 4 miles from touchdown; the aircraft was in cloud, flying at 1100 ft, in turbulent conditions. Three and a half miles from touchdown the pilot-in-command began to descend at 350 to 400 ft/min, the equivalent of a 3° glide path in the prevailing conditions. As there was no radar glide path the Lympne radar controller advised the pilots of the height at which the aircraft should have been at each mile before touchdown. When the aircraft was about 5/8 of a mile from touchdown the radar controller gave a final heading correction and at half a mile, when the talkdown finished, he told the pilots that the aircraft was lined up with the right-hand edge of the runway. The rest of the approach was made visually but the radar controller continued to track the aircraft. He observed it deviate further to the right of the extended centre line as it neared the touchdown point. The pilot-in-command stated that he could see the ground from 250 ft, and at 220ft when half a mile from touchdown he could see the far boundary of the aerodrome through heavy drizzle. Height was maintained at 220 ft for 3 or 4 seconds, then the descent was resumed and at a quarter of a mile from touchdown and at 150 to 200 ft, full flap was selected and power reduced to 10600 rpm. At this stage turbulence became severe. The pilot-in-command realized that the aircraft was going to the right of the runway but he decided not to try to regain the centre line as this would require a turn at low altitude. As the aircraft approached the aerodrome boundary the airspeed indicator was fluctuating and an attempt was made to maintain 92 kts the starboard wing was held down slightly to compensate for port drift. The pilot-in-command stated that he began the flare-out 30 to 40 ft above the ground at an IAS of 88 kt but as he closed the throttles the starboard wing went down suddenly. Although he was aware that the aircraft was descending rapidly, he was initially more concerned about restoring lateral level ; only at the last moment did he attempt to check the rate of descent with elevator control but the aircraft struck the ground heavily on its starboard undercarriage. After the impact, the starboard wing, engine nacelle and undercarriage became separated from the main structure, the aircraft rolled over to starboard and slid along the grass inverted, coming to rest after having swung through approximately 180°.", "probable_cause": "A heavy landing following an incomplete flare from a steeper than normal approach."}