{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-g18s-roosevelt-roads-nas-1-killed", "date": "Dec 11, 1996 at 1224 LT", "type": "Beechcraft G18S", "operator": "TolAir", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "San Juan - Kingstown", "msn": "BA-485", "yom": 1959, "flight_number": "TOL353", "city": "Roosevelt Roads NAS (Ceiba)", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 16345, "captain_hours_type": 385, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8203, "circumstances": "At 1136 AST, the twin engine airplane departed San Juan, PR, on a flight to St Vincent. About 1208 AST, the pilot contacted ATC and indicated that he would like to divert to St Thomas. He informed the controller that he had 'feathered' the left engine due to loss of the left engine cowling, but he did not declare an emergency. He requested wind information for St Thomas, then at about 1613 AST, he changed his destination to Roosevelt Roads, PR. At 1120 AST, the pilot reported that the airplane was losing about 300'/min, then about 1 minute later, he said he was going to attempt an engine restart, and that the airplane was getting close to the water. A short time later, he informed ATC that he was not going to make it to shore. The pilot acknowledged info that search and rescue personnel were responding, then there was not further contact with the airplane. The airplane was located about 6 miles east of Roosevelt Roads NAS, but the pilot was not found. Review of weight and balance info revealed the pilot did not follow written procedures, and that the airplane exceeded the maximum authorized gross weight for take off. Flight crews had been informed of a communique from the manufacturer that there was no need to shut down an engine and feather the propeller unless engine performance or a major vibration problem confirmed the need. ", "probable_cause": "The pilot's improper planning/decision concerning separation of the left engine cowling. Factors relating to the accident were: the pilot's failure to perform weight and balance calculations, and/or to ensure the airplane was loaded in accordance with company procedures and the airplane flight manual; loss of the left engine cowling for undetermined reasons; and the pilot's decision not to follow written procedures by intentionally shutting down the left engine and feathering the propeller. "}