{"url": "https://www.baaa-acro.com/crash/crash-sukhoi-superjet-100-95-mt-salak-45-killed", "date": "May 9, 2012 at 1431 LT", "type": "Sukhoi Superjet 100-95", "operator": "Sukhoi", "flight_phase": "Flight", "flight_type": "Demonstration", "survivors": "No", "site": "Mountains", "schedule": "Jakarta - Jakarta", "msn": "95004", "yom": 2009, "flight_number": "RA36801", "city": "Mt Salak", "zone": "West Java", "country": "Indonesia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 41, "pax_fatalities": 41, "other_fatalities": 0, "total_fatalities": 45, "captain_hours": 10347, "captain_hours_type": 1348, "copilot_hours": 3318, "copilot_hours_type": 625, "aircraft_hours": 843, "circumstances": "Aircraft was performing a demo flight and left Jakarta-Halim Perdanakasuma Airport at 1400LT with 41 passengers (potential buyers) on board and a crew of four. About thirty minutes later, while turning around Mount Salak, pilots received the authorization to descend from 10,000 feet to 6,000 feet in low visibility. Aircraft hit the edge of a cliff and crashed few yards further and was totally destroyed by impact and post impact fire. SAR teams arrived on scene 18 hours later and all 45 occupants were killed. At the time of the accident, weather conditions were marginal with clouds shrouding both Mount Salak and Mount Gede. First accident involving a Sukhoi Superjet 100. Present model was manufactured 09AUG2009 and totalized 843 flying hours for 500 cycles. Captain had 10,347 flying hours and was a test pilot by Sukhoi Civil Aircraft Company. ", "probable_cause": "- The flight crew was not aware of the mountainous area in the vicinity of the flight path due to various factors such as available charts, insufficient briefing and statements of the potential customer that resulted in inappropriate response to the TAWS warning. The impact could have been avoided by appropriate action of the pilot up to 24 seconds after the first TAWS warning.\r\n- The Jakarta Radar service had not established the minimum vectoring altitudes and the Jakarta Radar system was not equipped with functioning MSAW for the particular area around Mount Salak.\r\n- Distraction of the flight crew from prolonged conversation not related to the progress of the flight, resulted in the pilot flying not constantly changing the aircraft heading while in orbit. Consequently, the aircraft unintentionally exited the orbit."}