{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hp42e-gulf-oman-8-killed", "date": "Mar 1, 1940 at 1320 LT", "type": "Handley Page H.P.42", "operator": "Imperial%20Airways-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Calcutta – Jask – Sharjah – Alexandria – London", "msn": "HP.42/1", "yom": 1929, "flight_number": "CW197", "city": "Gulf of Oman", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While overflying the Gulf of Oman, the aircraft named 'Hannibal' crashed into the sea in unknown circumstances. SAR operations failed to find any trace of the aircraft nor the crew and were suspended after few days.\r\nCrew:\r\nN. Townsend, pilot,\r\nC. J. Walsh, copilot,\r\nA. H. H. Tidbury, radio operator, \r\nC. A. F. Steventon, steward.\r\nPassengers:\r\nA. T. Pannirselvam,\r\nHarold A. Whistler,\r\nAlf Bryn,\r\nHenry Hutchison.", "probable_cause": "The UK Air Ministry considered as improbable that the crash had resulted from sabotage, hostile action or inflight fire. Also considered improbable was complete fuel exhaustion, although the starvation of the supply of gasoline attributed to improper activation of the corresponding controls could not be ruled out. Other possible causes were a bird strike damaging a propeller and leading to the failure of the engine mounting or even an entire wing; some type of structural failure, especially considering the age of aircraft and the history of vibration experienced with the type, or multiple power plant malfunction, which also could have preceded structural failure. Two months after the disappearance, and in following one of the recommendations made in the investigative report, it was announced by the British government that the HP.42 would no longer be used in passenger operations. It was also recommended that commercial aircraft used in long over-water flights be equipped with personal and group life-saving gear, which would later be standard throughout the industry."}