{"url": "https://www.baaa-acro.com/crash/crash-bristol-170-freighter-21e-cape-paterson-2-killed", "date": "May 10, 1975 at 0218 LT", "type": "Bristol 170 Freighter", "operator": "Air%20Express%20Australia", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Melbourne - Launceston", "msn": "12807", "yom": 1946, "flight_number": null, "city": "Cape Paterson", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 18821, "captain_hours_type": 264, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9526, "circumstances": "The flight departed from Essendon Airport at 0050LT. At 0122 hours the flight reported to the Melbourne Flight Service Unit (FSU) that it was then at the Westgate reporting point cruising at 3,500 feet, and its estimated time of arrival at the West Bass reporting point was 0159 hours. At 0145:44 hours VH-SJQ advised the Melbourne FSU 'we have an engine failure on the port side, we have it feathered and are returning to Melbourne'. In response to a request from the FSU the flight advised it was able to maintain height 'at the moment'. At 0148:54 VH-SJQ confirmed that 'the port engine has failed and is feathered' and shortly thereafter advised an estimated time of arrival at the Primegate reporting point en route to Essendon Airport. The Uncertainty Phase of the search and rescue procedures was declared by the Melbourne Air Traffic Control Unit (ATC). At 0151:58 hours the flight advised the Melbourne FSU 'we are making a slow descent to one five zero zero' and, in answer to a query, reported 'we're unable to maintain our height with our rated power'. The Alert Phase of the search and rescue procedures was declared by Melbourne ATC, and a Bristol 170 Mark 31 aircraft en route from Launceston to Essendon Airport was diverted to intercept VH-SJQ and act as an escort. At 0157:46 hours VH-SJQ reported 'four eight DME Wonthaggi', and shortly thereafter, reported 'tracking one eight three on the Wonthaggi VOR'. At 0203:00 hours VH-SJQ transmitted a distress call and reported 'we're passed fifteen hundred feet and still going down'. The position of the aircraft at 0203:57 hours was reported as 'on the one eight six radial Wonthaggi and we are three seven DME'. The Distress  phase of the search and rescue procedures was declared by Melbourne ATC and a second northbound aircraft was diverted to intercept VH-SJQ. At 0204:32 hours VH-SJQ reported 'we're down to nine hundred feet at the moment'; at 0207:42 hours, 'at six hundred feet at the moment; at 0212:55 hours, 'two two DME'; at 0213:22 hours, altitude was 200 feet; 0214:31 hours, 'we're down to one hundred feet'; and, at 0215:23 hours, 'this is a final MAYDAY call, we are approximately one eight DME and our altimeters registering zero feet'. Melbourne FSU then transmitted a ditching report of moderate seas with a moderate south-westerly swell; this was acknowledged by VH-SJQ. The escort aircraft then heard further transmissions from VH-SJQ which indicated that both altimeters were reading zero; the crew could see the tops of waves; and DME distances of 16, 15 and 14 were transmitted, the latter being the last transmission heard from the aircraft the time being about 0218 hours. Neither of the escort aircraft sighted VH-SJQ. Post analysis of the meteorological information indicates that the weather in the area of the accident was: surface wind from 280 degrees (True) at 15 knots, scattered cumulus cloud base 2,500 feet, scattered stratus cloud base 1,200 feet, patches of sea fog, visibility 40 kilometres reducing to 4,000 metres in rain showers, temperature 12° Celsius. It is probable that the temperatures at 1,500 feet, 2,500 feet, and 3,500 feet were 9.5°, 7° and 5° Celsius respectively. The conditions were not conducive to the formation of airframe or carburettor icing, and search aircraft in the area did not encounter any such icing.\n", "probable_cause": "Due to lack of evidences, it was not possible to determine the exact cause of the accident. Analysis of the information available indicates that the flight profile flown by VH-SJQ is compatible with the aircraft having been flown at an indicated airspeed of 95 knots, and a power output from the starboard engine of 1250 BHP, i.e. 26 per cent less than the normal maximum power available in the conditions which prevailed. The pilot did not indicate in detail the nature of the difficulties he was experiencing, and as the majority of the aircraft wreckage has not been found it has not been possible to determine why he shut down the port engine; whether or not there was a degradation in the power output of the starboard engine; or whether there was some other factor which might have affected the performance of the aircraft. It might be significant, however, that at 0208:33 hours when a crew inter-communication was inadvertently transmitted from VH-SJQ, it was stated 'cylinder head is about three forty, oil pressure is around about eighty, oil temperature is about ah sixty five'. Such an oil pressure and temperature is normal, but the reported cylinder head temperature is 30 degrees Celsius in excess of the permissible emergency maximum."}