{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-tanner-hiller", "date": "Apr 26, 2018 at 1715 LT", "type": "Cessna 402", "operator": "AC Research Inc.", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Keene - Tanner-Hiller", "msn": "402B-1097", "yom": 1976, "flight_number": null, "city": "Tanner-Hiller", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 330, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9193, "circumstances": "The private pilot was conducting a local, personal flight. The pilot reported that he checked the weather conditions at three local airports before the flight but stated that he did not trust the wind reports. He added that he did not get a preflight weather briefing. Once at the destination airport, he conducted two go-arounds due to gusting wind conditions. During the third attempted landing, he made a steep approach at a normal approach speed and flared the airplane about midway down the 3,000-ft-long runway. The airplane floated down the runway for much longer than the pilot expected before touching down. Despite applying maximum braking, there was insufficient remaining runway to stop, and the airplane skidded off the runway, impacted trees, and subsequently caught fire, which resulted in substantial damage to the airframe. The wind conditions reported at an airport located about 13 miles away included a tailwind of 16 knots, gusting to 27 knots. Given the tailwind conditions reported at this airport and the pilot's description of the approach and landing, it is likely that the pilot conducted the approach to the runway in a tailwind that significantly increased the airplane's groundspeed, which resulted in a touchdown with insufficient runway remaining to stop the airplane, even with maximum braking.", "probable_cause": "The pilot's improper decision to land with a tailwind, which resulted in a touchdown with insufficient runway remaining to stop the airplane."}