{"url": "https://www.baaa-acro.com/crash/crash-avro-685-york-c1-stansted-2-killed", "date": "Apr 30, 1956 at 0930 LT", "type": "Avro 685 York", "operator": "Scottish-Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stansted – Luqa – Habbaniya ", "msn": "MW308", "yom": 1946, "flight_number": null, "city": "Stansted", "zone": "Essex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 49, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight was to be via Malta to Habbaniya, Iraq, and was being made on charter by the Air Ministry to carry RAF personnel and their families. On board were 5 crew members, 45 passengers and four babies. The take-off run was begun at approximately 0930 hours Greenwich Mean Time. After travelling some 300 yards along the temporary runway, the aircraft developed a swing to starboard with a consequential skidding movement of the tires so severe that within a further distance of less than 100 yards it left the runway on the starboard side still under the influence of the swing, skidding and travelling at about 45 knots. On reaching a 'French' drain some 25 feet from the runway the undercarriage collapsed, the starboard wheel fell clear and the aircraft settled on its belly and on the port wheel. The aircraft finally came to rest pointing back almost in the direction from which it had begun its run. One aircraftsman and a 4-year old girl were killed and 4 other passengers were seriously injured.", "probable_cause": "An over-correction of the portward course of the aircraft possibly accompanied by some application of the starboard brake caused the aircraft to swing to starboard off the runway and to encounter the \"French\" drain with the resulting failure of the undercarriage. The over-correction by the pilot, whether or not accompanied by some application of the starboard brake, should be termed a grave error of judgment and skill rather than a wrongful act or default. "}