{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-124a-dl-globemaster-ii-mt-gannett-52-killed", "date": "Nov 22, 1952 at 2015 LT", "type": "Douglas C-124 Globemaster II", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Mountains", "schedule": "McChord – Elmendorf", "msn": "43441", "yom": 1951, "flight_number": null, "city": "Mt Gannett", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 41, "pax_fatalities": 41, "other_fatalities": 0, "total_fatalities": 52, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft was completing a flight from McChord AFB to Elmendorf AFB, carrying 41 passengers and a crew of 11. En route, the crew was informed about strong winds gusting up to 40 knots from the west. While cruising by night and marginal weather conditions, the aircraft hit the slope of Mt Gannett (9'650 feet high) located about 53 miles east of Elmendorf. As the airplane failed to arrive, SAR operations were conducted but due to poor weather conditions, first rescuers arrived on scene six days later only, on November 28. The wreckage was found on the Surprise Glacier, about 1,000 feet below the summit. The aircraft disintegrated on impact and all 52 occupants were killed. On June 9, 2012, some debris were found and on June 28, 2012, the wreckage was spotted again. Two years later, on June 18, 2014, the remains of 17 of the victims were identified and returned to their respectives families for burial.", "probable_cause": "It was determined that the information transmitted to the crew regarding the wind component was erroneous as the wind was gusting up to 80 knots at the time of the accident, causing the aircraft to drift off from the prescribed flight path. The crew was unable to establish his real position due to the low visibility caused by night and fog and the absence of ground reference points. It is believed the accident was the result of a controlled flight into terrain. "}