{"url": "https://www.baaa-acro.com/crash/crash-bae-3112-jetstream-31-lloydminster", "date": "Jan 20, 1998 at 1810 LT", "type": "BAe Jetstream 31", "operator": "Alberta%20Citylink", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Calgary - Lloydminster", "msn": "815", "yom": 1988, "flight_number": "ABK933", "city": "Lloydminster", "zone": "Alberta", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 13, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4786, "captain_hours_type": 635, "copilot_hours": 1450, "copilot_hours_type": 151, "aircraft_hours": 16180, "circumstances": "At 1700 MST, Alberta Citylink flight 933, C-FBIE, a British Aerospace Jetstream 31, serial number 815, took off from Calgary, on a scheduled flight to Lloydminster, Alberta. The aircraft carried a two-pilot crew, 13 passengers, and 250 pounds of freight and baggage. A non-precision automatic direction finder (ADF) approach was conducted to runway 25. The first officer was flying the approach, and when the runway environment became visual, the captain took control, requested 35 degrees of flap, and commenced the final descent to the runway. On touchdown, the left main landing gear collapsed and both propellers struck the runway surface. The aircraft slid along the runway on the belly pod for about 1 800 feet, and when the left wing contacted snow on the edge of the runway, the aircraft turned about 160 degrees. The passengers and crew evacuated through the over-wing exit. There was no fire and no injuries. The Board determined that an unstabilized approach resulted in a heavy landing because the captain changed the configuration of the aircraft, and the high rate of descent was not arrested before contact was made with the runway surface. Contributing to the high rate of descent were the reduction of engine power to flight idle, airframe ice, and the time available for the final descent. Contributing to the damage on landing was the left-to-right movement of the aircraft.", "probable_cause": "An unstabilized approach resulted in a heavy landing because the captain changed the configuration of the aircraft, and the high rate of descent that resulted was not arrested before contact was made with the runway surface. Contributing to the high rate of descent were the reduction of engine power to flight idle, airframe ice, and the time available for the final descent. Contributing to the damage on landing was the left to right movement of the aircraft."}