{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-8-402q-jabalpur", "date": "Dec 4, 2015 at 1922 LT", "type": "De Havilland DHC-8-400 (Dash-8)", "operator": "SpiceJet", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Mumbai – Jabalpur", "msn": "4377", "yom": 2011, "flight_number": "SG2458", "city": "Jabalpur", "zone": "Madhya Pradesh", "country": "India", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 49, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7748, "captain_hours_type": 2148, "copilot_hours": 7804, "copilot_hours_type": 137, "aircraft_hours": 11928, "circumstances": "Bombardier Q-400 aircraft VT-SUC belonging to M/s Spice jet Ltd. was involved in wild life strike accident during landing roll at Jabalpur while operating scheduled flight SG2458 from Mumbai to Jabalpur on 04.12.2015. The aircraft was under the command of pilot holding ATPL & duly qualified on type with First Officer also an ATPL holder and qualified on type. There were 49 passengers and 02 cabin crew on board the aircraft. The aircraft VT-SUC took-off from Mumbai for Jabalpur at around 1200 UTC. The enroute flight was uneventful. The aircraft came in contact with ATC Jabalpur at around 1323 UTC. The ATC reported prevailing weather at Jabalpur as surface winds calm, visibility 5000 meters, weather Haze, nonsignificant clouds, and temp 24° C. At 1342 UTC the pilot requested ATC for visual approach runway 06. The ATC cleared VT-SUC for visual approach runway 06 and asked to confirm when runway in sight. At 1347 UTC the pilot confirmed the runway in sight and requested for landing clearance and the same was acknowledged by ATC. The aircraft landed on runway 06 and about 05 to 06 seconds after touch down at around 1350 UTC the aircraft hit wild boars on the runway. The pilot stated that as it was dawn they did not see the wild boars on runway during approach, and saw the wild boars only after touch down and when they were very close to them, also they did not had adequate time to react so as to take any evasive action. Hence, one of the wild boars on runway impacted with LH main landing gear due which the LH Main landing gear got collapsed and the aircraft started drifting towards left. Thereafter LH engine propeller blades came in contact with ground and got sheared off. The aircraft dragged on its belly for around 182 feet and in the process the nose landing gear also collapsed. The aircraft then veered to the left of the center line and subsequently exited the runway onto the left side and came to final halt position in Soft Ground. The pilot then confirmed with first officer about fire and once getting assured that there was no fire gave evacuation call outs. The pilot then contacted ATC for assistance and informed that there were 10 to 11 pigs on the runway and the aircraft had hit the pig and gone off the runway. The Crash Fire Tender (CFT) team along with operational jeep reached the accident site. The pilot shut down the engines. All the passengers were then evacuated safely from the RH side. There was no injury to any of the occupants on board the aircraft and there was no fire.", "probable_cause": "The aircraft during its landing roll had a wild life (Wild Boars) strike on the runway, resulting in collapse of left main landing gear and subsequently the aircraft veered to the left of the runway.\r\nContributory factor:\r\nThe presence of wild life in the operational area and the runway was due to several breaches in the boundary wall. "}