{"url": "https://www.baaa-acro.com/crash/crash-atr42-300-near-oksibil-54-killed", "date": "Aug 16, 2015 at 1455 LT", "type": "ATR42-300", "operator": "Trigana%20Air2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Jayapura - Oksibil", "msn": "102", "yom": 1988, "flight_number": "TGN267", "city": "Oksibil", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 50, "pax_fatalities": 50, "other_fatalities": 0, "total_fatalities": 54, "captain_hours": 25287, "captain_hours_type": 7340, "copilot_hours": 3818, "copilot_hours_type": 2640, "aircraft_hours": 50133, "circumstances": "An ATR 42-300 aircraft registered PK-YRN was being operated by PT Trigana Air Service on 16 August 2015 as scheduled passenger flight with flight number IL267 from Sentani to Oksibil. On board of this flight were 54 persons. This flight was the fifth flight of the day and the second flight from Sentani to Oksibil. The aircraft departed Sentani at 0522 UTC and estimated time of arrival Oksibil was at 0604 UTC. The Second in Command (SIC) acted as Pilot Flying while the Pilot in Command (PIC) acted as Pilot Monitoring. The weather at Oksibil reported that the cloud was broken (more than half area of the sky covered by cloud) and the cloud base was 8,000 feet (4,000 feet above airport elevation) and the visibility was 4 up to 5 km. The area of final approach path was covered by clouds. The flight cruising at 11,500 feet and at 0555 UTC, the pilot made first contact with Oksibil Aerodrome Flight Information Services (AFIS) officer, reported on descent at position Abmisibil and intended to direct left base leg runway 11. At 0600 UTC, Oksibil AFIS officer expected the aircraft would have been on final but the pilot had not reported, the AFIS officer contacted the pilot but did not reply. The AFIS officer informed Trigana in Sentani that they had lost contact with IL267. The aircraft wreckage was found on a ridge of Tanggo Mountain, Okbape District, Oksibil at approximately 8,300 feet AMSL at coordinates of 04°49’17.34” S, 140°29’51.18” E, approximately 10 NM from Oksibil Aerodrome on bearing of 306°. All occupants were fatally injured  and the aircraft was destroyed by impact force and post impact fire. The Flight Data Recorder (FDR) and Cockpit Voice Recorder were recovered and transported to KNKT recorder facility. The recovery of FDR data was unsuccessful while the recovery of CVR data successfully retrieved accident flight data. The CVR did not record any crew briefing, checklist reading not EGPWS warning prior to impact. The CVR also did not record EGPWS altitude call out on two previous flights. The investigation concluded that the EGPWS was probably not functioning.", "probable_cause": "The following findings were identified:\r\n1. The aircraft had valid Certificate of Airworthiness and was operated within the weight and balance envelope.\r\n2. All crew had valid licenses and medical certificates.\r\n3. The flight plan form was filed with intention to fly under Instrument Flight Rule (IFR), at flight level 155, with route from Sentani to MELAM via airways W66 then to Oksibil. The MORA of W66 between Sentani to MELAM was 18,500 feet.\r\n4. The flight was the 5th flight of the day for the crew with the same aircraft and the second flight on the same route of Sentani to Oksibil.\r\n5. The CVR data revealed that the previous flight from Sentani to Oksibil the flight cruised at altitude of 11,500 feet and the approach was conducted by direct to left base runway 11.\r\n6. The CVR data also revealed that on the accident flight, the flight cruised at altitude 11,500 feet and intended to direct left base leg runway 11 which was deviate from the operator visual guidance approach that described the procedure to fly overhead the airport prior to approach to runway 11.\r\n7. The witness stated that most of the time, the flight crew deviated from the operator visual approach guidance. The deviation did not identify by the aircraft operator.\r\n8. The downloading process to retrieve data from the FDR was unsuccessful due to the damage of the FDR unit that most likely did not record data during the accident flight. The repetition problems of the FDR unit showed that the aircraft operator surveillance to the repair station was not effective.\r\n9. The CVR did not record any crew briefing, checklist reading and EGPWS altitude callout prior to land on two previous flights nor the EGPWS caution and warning prior to impact.\r\n10. The spectrum analysis of the CVR determined that both engines were operating prior to the impact.\r\n11. Several pilots, had behavior of pulling the EGPWS CB to eliminate the nuisance of EGPWS warning. The pilots stated that the reason for pulling the EGPWS CB was due to the pilots considered this warning activation was not appropriate for the flight conditions. The correction to this behavior was not performed prior to the accident.\r\n12. The investigation could not determine the actual EGPWS CB position during the accident flight.\r\n13. The installation of EGPWS by the aircraft operator was not conducted according to the Service Bulletin issued by the aircraft manufacturer.\r\n14. The terrain data base installed in the EGPWS of PK-YRN was the version MK_VIII_Worldwide_Ver_471 that was released in 2014. The Oksibil Airport was not included in the high-resolution update in this version of terrain database.\r\n15. The information for Oksibil published in AIP volume IV (Aerodrome for Light Aircraft/ALA) did not include approach guidance. The operator issued visual guidance of circling approach runway 11 for internal use.\r\n16. The visual approach guidance chart stated that the minimum safe altitude was 8,000 feet while the aircraft impacted with terrain at approximately 8,300 feet. This indicated an incorrect information in the chart. The investigation considered that the pattern on the approach guidance chart was not easy to fly, as many altitudes and heading changes.\r\n17. Several maintenance records such as component status installed on the aircraft and installation of EGPWS was not well documented. This indicated that the maintenance management was not well performed. \r\n18. The investigation could not find any regulation that describes the pilot training requirement for any addition or modification of aircraft system which affect to the aircraft operation.\r\n19. There was no information related to the status of ZX NDB published on NOTAM prior to the accident.\r\n20. Several safety issues indicated that the organization oversight of the aircraft operator by the regulator was not well implemented.\r\nContributing Factors:\r\n1. The deviation from the visual approach guidance in visual flight rules without considering the weather and terrain condition, with no or limited visual reference to the terrain resulted in the aircraft flew to terrain.\r\n2. The absence of EGPWS warning to alert the crew of the immediate hazardous situation led to the crew did not aware of the situation."}