{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-rockford", "date": "Dec 5, 2017 at 1802 LT", "type": "Beechcraft 90 King Air", "operator": "Edward B. Noakes III", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kissimmee - Rockford", "msn": "LJ-708", "yom": 1977, "flight_number": null, "city": "Rockford", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9856, "circumstances": "The private pilot departed on a cross-country flight in his high-performance, turbine-powered airplane with full tanks of fuel. He landed and had the airplane serviced with 150 gallons of fuel. He subsequently departed on the return flight. As the airplane approached the destination airport, the pilot asked for priority handling and reported that the airplane \"lost a transfer pump and had a little less fuel than he thought,\" and he did not want to come in with a single engine. When asked if he needed assistance, he replied \"negative.\" The pilot was cleared to perform a visual approach to runway 19 during night conditions. As the airplane approached the airport, the pilot requested the runway lights for runway 25 be turned on and reported that the airplane lost engine power in one engine. The controller advised that the lights on runway 25 were being turned on and issued a landing clearance. The airplane impacted terrain before the threshold for runway 25. During examination of the recovered wreckage, flight control continuity was established. No useable amount of fuel was found in any of the airplane's fuel tanks; however, fuel was observed in the fuel lines. All transfer pumps and boost pumps were operational. The engine-driven fuel pumps on both engines contained fuel in their respective fuel filter bowls. Both pumps were able to rotate when their input shafts were manipulated by hand. Disassembly of both pumps revealed that their inlet filters were free of obstructions. Bearing surfaces in both pumps exhibited pitting consistent with pump operation with inadequate fuel lubrication and fuel not reaching the pump. The examination revealed no evidence of airframe or engine preimpact malfunctions or failures that would have precluded normal operation of the airplane. Performance calculations using a flight planning method described in the airplane flight manual indicated that the airplane could have made the return flight with about 18 gallons (119 lbs) of fuel remaining. However, performance calculations using a fuel burn simulation method developed from the fuel burn and data from the airplane flight manual indicated that the airplane would have run out of fuel on approach. Regulations require that a flight depart with enough fuel to fly to the first point of intended landing and, assuming normal cruising speed, at night, to fly after that for at least 45 minutes. The calculated 45-minute night reserves required about 56 gallons (366 lbs) of fuel using a maximum recommended cruise power setting or about 37.8 gallons (246 lbs) of fuel using a maximum range power setting. Regardless of the flight planning method he could have used, the pilot did not depart on the accident flight with the required fuel reserves and exhausted all useable fuel while on approach to the destination. The airplane was owned by Edward B. Noakes III.", "probable_cause": "The pilot's inadequate preflight planning and his decision to depart without the required fuel reserve, which resulted in fuel exhaustion during a night approach and subsequent loss of engine power."}