{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-17g-30-bo-flying-fortress-windsor-locks-7-killed", "date": "Oct 2, 2019 at 0953 LT", "type": "Boeing B-17 Flying Fortress", "operator": "Collings%20Foundation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Windsor Locks - Windsor Locks", "msn": "7023", "yom": 1942, "flight_number": null, "city": "Windsor Locks-Bradley", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 10, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 14500, "captain_hours_type": 7300, "copilot_hours": 22000, "copilot_hours_type": 23, "aircraft_hours": 11388, "circumstances": "The vintage, former US military bomber airplane was on a tour that allowed members of the public to purchase an excursion aboard the airplane for an LHFE flight. The accident flight was the airplane’s first flight of the day. During the initial climb, one of the pilots retracted the landing gear, and the crew chief/flight engineer (referred to as the loadmaster) left the cockpit to inform the passengers that they could leave their seats and walk around the airplane. One of the pilots reported to air traffic control that the airplane needed to return to the airport because of a rough magneto. At that time, the airplane was at an altitude of about 600 ft above ground level (agl) on the right crosswind leg of the airport traffic pattern for runway 6. The approach controller asked the pilot if he needed any assistance, to which the pilot replied, “negative.” When the loadmaster returned to the cockpit, he realized that the airplane was no longer climbing, and the pilot, realizing the same, instructed the copilot to extend the landing gear, which he did. The loadmaster left the cockpit to instruct the passengers to return to their seats and fasten their seat belts. When the loadmaster returned again to the cockpit, the pilot stated that the No. 4 engine was losing power; the pilot then shut down that engine and feathered the propeller without any further coordination or discussion. When the airplane was at an altitude of about 400 ft agl, it was on a midfield right downwind leg for runway 6. Witness video showed that the landing gear had already been extended by that time, even though the airplane still had about 2.7 nautical miles to fly in the traffic pattern before reaching the runway 6 threshold. During final approach, the airplane struck the runway 6 approach lights in a right-wing-down attitude about 1,000 ft before the runway and then contacted the ground about 500 ft before the runway. After landing short of the runway, the airplane traveled onto the right edge of the runway threshold and continued to veer to the right. The airplane collided with vehicles and a deicing fluid tank before coming to rest upright about 940 ft to the right of the runway. A postcrash fire ensued. Both pilots and five passengers were killed and all six other occupants as well as one people on the ground were injured, five seriously. ", "probable_cause": "The pilot’s failure to properly manage the airplane’s configuration and airspeed after he shut down the No. 4 engine following its partial loss of power during the initial climb. Contributing to the accident was the pilot/maintenance director’s inadequate maintenance while the airplane was on tour, which resulted in the partial loss of power to the Nos. 3 and 4 engines; the Collings Foundation’s ineffective safety management system (SMS), which failed to identify and mitigate safety risks; and the Federal Aviation Administration’s inadequate oversight of the Collings Foundation’s SMS."}