{"url": "https://www.baaa-acro.com/crash/crash-fairchild-hiller-fh-227c-mt-el-tigre-26-killed", "date": "Jan 17, 2002 at 1101 LT", "type": "Fairchild-Hiller FH-227", "operator": "Petroecuador", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Quito – Nueva Loja", "msn": "511", "yom": 1966, "flight_number": null, "city": "Mt El Tigre", "zone": "Nariño", "country": "Colombia", "region": "South America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 21, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 26, "captain_hours": 17709, "captain_hours_type": 8338, "copilot_hours": 12229, "copilot_hours_type": 6066, "aircraft_hours": 29154, "circumstances": "The twin engine aircraft departed Quito-Mariscal Sucre Airport at 1038LT on a charter flight to Nueva Loja-Lago Agrio Airport, carrying 21 oil workers and and five crew members on behalf of the Texaco Oil Company. While cruising under VFR mode at an altitude of 15,500 feet, the crew was instructed by ATC to change heading to 094° in order to descent to Nueva Loja for a landing on runway 23. But the crew failed to comply with this instruction and continued straight ahead. Few minutes later, the crew started the descent in foggy conditions when the aircraft struck the slope of Mt El Tigre located in the south part of Colombia, near the border with Ecuador. The wreckage was found three days later at an altitude of 4,500 metres. The aircraft disintegrated on impact and all 26 occupants were killed.  ", "probable_cause": "The accident was the consequence of a controlled flight into terrain after the crew suffered a loss of situational awareness since their attention was focused on aspects that were not related to the flight being executed and therefore neglecting the primary function of flight which is the control of the aircraft and decision making.\r\nThe following contributing factors were identified:\r\n- The crew failed to maintain a sterile cockpit situation, \r\n- The crew was continuously distracted during the flight,\r\n- Lack of technical documentation in the CIA that supports the operation,\r\n- Lack of crew training about Crew Resources Management, human factors and Control Flight Into Terrain(CFIT), \r\n- The weather conditions at the time of the accident on Mt El Tigre made it impossible for the crew to see the mountain,\r\n- The aircraft was not equipped with a Ground Proximity Warning System (GPWS)."}