{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-taft-1-killed", "date": "Jul 19, 1994 at 1420 LT", "type": "Cessna 414 Chancellor", "operator": "Rogers Helicopters", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Taft - Fresno", "msn": "414-0457", "yom": 1974, "flight_number": null, "city": "Taft", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3739, "circumstances": "The emergency medical service (EMS/medevac) flight was dispatched to transport a patient in response to a medical emergency. During arrival to the destination, the pilot contacted the airport unicom for advisories and was advised to land on runway 25. Runway 25 had a 2.2 percent uphill grade and was restricted to landings only. After landing, the airplane was refueled and the patient was put on board. The pilot back-taxied on runway 25 and proceeded to take off uphill with the airplane near its maximum gross weight. According to ground witnesses, there was a tailwind, which they estimated was between 4 and 15 knots. The temperature was about 100 degrees, and the density altitude was about 3,200 feet. After the airplane became airborne, the pilot started an immediate left turn to avoid rising terrain. However, the left tip tank contacted the ground, and the airplane cartwheeled. It came to rest about 711 feet from the departure end of the runway. The flaps and landing gear were found fully extended; the published configuration for takeoff data in the flight manual was for 'wing flaps - up.' The airport had no signs to indicate runway use restrictions; however, the restrictions were published in the airport facility directory.", "probable_cause": "The pilot's inadequate preflight planning/preparation and selection of the wrong runway for takeoff. Factors related to the accident were: the uphill slope of the runway, tailwind, high density altitude, and failure of the pilot to correctly configure the flaps for takeoff."}