{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-durango-9-killed", "date": "Jan 19, 1988 at 1920 LT", "type": "Swearingen SA227 Metro III", "operator": "Trans-Colorado%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Denver - Durango", "msn": "AC-457", "yom": 1981, "flight_number": "VJ2286", "city": "Durango-La Plata County", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 15, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 4184, "captain_hours_type": 3028, "copilot_hours": 8500, "copilot_hours_type": 305, "aircraft_hours": 11895, "circumstances": "The aircraft was operating as Continental Express flight 2286. During the approach in IFR conditions, the aircraft went below the minimum descent altitude then struck the terrain at 7,180 feet msl. Examination of the aircraft did not disclose any pre-impact failures or system malfunctions. The evidence indicated that the copilot was flying the airplane during the approach. Evaluation of the radar data showed an excessive rate of descent before the collision with terrain. Postmortem toxicological examination showed that the captain had used cocaine prior to this flight. The safety board concluded that this use had adversely affected his ability to monitor the unstabilized approach flown by the copilot. Records of both crewmembers revealed prior traffic violations and accidents, and, in the case of the captain, a previous aircraft accident. Evaluation of the weather conditions indicated that a 10 to 15 knot tailwind condition existed throughout the approach. ", "probable_cause": "The first officer's flying and the captain's ineffective monitoring of an unstabilized approach, which resulted in a descent below the published descent profile. Contributing to the accident was the captain's performance resulting from his use of cocaine before the accident."}