{"url": "https://www.baaa-acro.com/crash/crash-gaf-nomad-n24a-wilmington-2-killed", "date": "May 4, 1990 at 0731 LT", "type": "GAF Nomad N.24", "operator": "Tar%20Heel%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Raleigh - Wilmington", "msn": "89", "yom": 1980, "flight_number": null, "city": "Wilmington-New Hanover County", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2200, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3590, "circumstances": "During arrival, the pilot made an ILS localizer back course approach to runway 16 and was cleared to land. He reported he was initiating a missed approach. Approximately 10 seconds later, he reported the runway in sight and requested a visual approach to land on runway 34. The pilot was cleared to land and the aircraft was observed to maneuver to the right (west of the runway), then turn back left to a final approach. However, it crashed short of runway 34. An exam of the crash site revealed evidence that the aircraft was in a normal upright attitude on a heading of 340°, when it crashed. Initial impact was with the approach lighting system short of runway 34. A King Air pilot, who landed on runway 16 before the accident, estimated the cloud bases were about 400 feet agl. Minimum descent altitude (MDA) for the back course approach was 460 feet msl. MDA for a circling approach to runway 16 was 550 feet msl. The airport elevation was 32 feet. Both occupants were killed.  ", "probable_cause": "The pilot's failure to maintain sufficient altitude during a circling maneuver for landing. Factors related to the accident were: weather conditions below minimums for a circling approach, and failure of the pilot to follow ifr procedures."}