{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-goodwood", "date": "Apr 22, 1985 at 1053 LT", "type": "Beechcraft 90 King Air", "operator": "Cega Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Elstree - Goodwood", "msn": "LW-83", "yom": 1974, "flight_number": null, "city": "Goodwood", "zone": "West Sussex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4900, "captain_hours_type": 1036, "copilot_hours": 15000, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off on the grass runway 06 with the P U/S in the left seat as handling pilot. The visibility was good, with high cloud cover, and wind recorded as from 060° to 080° at 20 to 30 knots, gusting to 35 knots. During the initial climb, PI simulated an engine failure, and after the touch drills and climb out were established, restored power to the 'failed' engine. The climb was continued to 2,500 feet and an engine failure was again simulated before an NDB approach was made to runway 33. P U/S then executed a single engined missed approach on completion of the let down, and entered the runway 06 circuit pattern. When at the downwind position he called 'downwind full stop'. The aircraft continued to the final approach with the simulated failed engine at a zero thrust setting of 120 feet lb torque and 1800 rpm. The P U/S stated that he had some difficulty in stabilising the approach and controlling the airspeed in the gusty conditions. At approximately 300 feet agl he was not satisfied with the approach and initiated a single engined go-around, raising gear and flaps. At some later stage PI took control and pushed the two throttle and rpm levers fully forward. P U/S remembers the aircraft entering a spiral descent to the left, and both pilots remember their evacuation of the aircraft. However, they have to recollection of airspeed, height, which engine was 'failed' on either occasion, or indeed the event which prompted PI to take control. The aircraft was seen to overfly the airfield in a north easterly direction with gear and flaps raised, and at a height variously estimated as between 100 and 300 feet agl. Just outside the airfield boundary the aircraft was seen to roll to the right then roll, or yaw and roll to the left and enter a spiral descent into an open field. The left wing tip struck the ground at an angle of 30° to the surface of the field, the aircraft then yawed left through 90° and slid and rolled a further 45 yards. It came to rest almost inverted and on its right side, with the detached left wing lying alongside the stub of the right wing. Both pilots were seriously injured. ", "probable_cause": "The wreckage of the aircraft was removed to the AIB facility at Farnborough for further examination which included an inspection of controls and control runs, and stripping the engines and propellers. No significant fault or failure was found. The airspeed indicators were also calibrated and found to be accurate. "}