{"url": "https://www.baaa-acro.com/crash/crash-cessna-525-citationjet-cj1-elk-city", "date": "Feb 3, 2014 at 2300 LT", "type": "Cessna 525 CitationJet CJ1", "operator": "Brink", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rapid City – Elk City", "msn": "525-0237", "yom": 1998, "flight_number": null, "city": "Elk City", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 21550, "captain_hours_type": 592, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4798, "circumstances": "The airline transport pilot was conducting a business flight with six passengers on board. Radar data showed that, after crossing the final approach fix for an instrument approach at the  destination airport, the airplane descended below the minimum descent altitude (MDA) of 2,480 ft mean sea level (msl); dark night, instrument meteorological conditions existed at that time. Subsequently, when the airplane was about 2 miles from the airport and about 2,070 ft msl, the airplane impacted a utility pole, which was 10 ft above ground level (agl). After impacting the pole, the pilot executed a missed approach, and about 40 minutes later, he landed the airplane without further incident at another airport. On-scene examination showed that the impact had scattered debris from the separated utility pole for about 200 ft into a snow-covered field. Examination of the airplane revealed that the impact resulted in substantial damage to the nose structure, lower and upper fuselage, and horizontal stabilizer. Further examinations of the airplane, including its static system, both altimeters, both vertical speed indicators, and the radar altimeter system revealed no evidence of preaccident mechanical malfunctions or failures that would have precluded normal operation. The pilot reported that he thought he had leveled the airplane at an altitude above the MDA and that at no time during the descent and approach did the airplane's radar altimeter sound an alert indicating that the airplane was below 400 ft agl radar altitude. He also reported that he never saw the terrain, any obstructions, nor the runway lights or airport environment. Despite the pilot's statement, given the radar data and the impact evidence, it is apparent that he descended the airplane below the MDA, which resulted in the subsequent impact with the utility pole. It could not be determined why the radar altimeter did not alert the pilot that the airplane was only 10 ft above the ground. The pilot's second-class medical certificate, which had been issued more than 20 months before the accident, had expired. The medical certificate limitation section in the expired certificate stated, \"Not valid for night flying or by color signal control.\" There is no evidence that these restrictions contributed to the accident. ", "probable_cause": "The pilot's descent below the published minimum descent altitude for the instrument approach procedure, which resulted in impact with a utility pole."}