{"url": "https://www.baaa-acro.com/crash/crash-cessna-208-caravan-i-nagambie-1-killed", "date": "Apr 29, 2001 at 1312 LT", "type": "Cessna 208A Caravan", "operator": "Alan McVinish", "flight_phase": "Flight", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Nagambie - Nagambie", "msn": "208-0003", "yom": 1985, "flight_number": null, "city": "Nagambie", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 11, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4000, "captain_hours_type": 700, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8576, "circumstances": "Four parachutists were practising as a team for a skydiving competition. They had completed seven parachute descents prior to the accident flight. Each descent had been video recorded by a cameraman using a helmet-mounted camera. The parachutists used a Cessna Aircraft Company Caravan aircraft. That aircraft was climbed to 14,000 ft with the team of four parachutists, their cameraman, six other parachutists and the pilot. At the drop altitude, the team members carried out their ‘pin check’ in which each parachutist’s equipment was checked to ensure that the release pins for the main and reserve parachutes were correctly positioned. Approaching overhead the drop zone, a roller blind, which covered the exit doorway on the left side of the aircraft, and minimised windblast during the climb, was raised. The cameraman positioned himself on the step outside and to the rear of the exit doorway. The first three members of the team positioned themselves in the exit doorway. The team member nearest to the front of the aircraft faced out and the next two members faced into the aircraft. The team member in the middle grasped the jumpsuits of the adjacent parachutists. The fourth member was inside the aircraft facing the exit. As the team exited the aircraft, the middle parachutist’s reserve parachute’s pilot chute deployed. Due to the bent over position of that parachutist, the action of the ejector spring in the pilot chute pushed the chute upwards and over the horizontal stabiliser of the aircraft, pulling the reserve canopy with it. The parachutist passed below the horizontal stabiliser resulting in the reserve parachute risers and lines tangling around the left elevator and horizontal stabiliser. Eleven seconds later, the empennage separated from the aircraft and the left elevator and the parachutist separated from the empennage. The parachutist descended to the ground with the reserve and main parachutes entangled and landed 800 metres west of the drop zone landing strip. A short section of the elevator was tangled in the parachute lines. The parachutist’s rate of descent was estimated to be 3.6 times greater than that for an average parachutist under canopy. Immediately after the empennage separated, the aircraft entered a steep, nose-down spiral descent. The pilot instructed the remaining parachutists to abandon the aircraft. The last one left the aircraft before it descended through 9,000 ft. The pilot transmitted a mayday call, shutdown the engine and left his seat. On reaching the rear of the cabin, he found that the roller blind had closed, preventing him from leaving the aircraft. After several attempts, the pilot raised the blind sufficiently to allow him to exit the aircraft, and at an altitude of approximately 1,000 ft above ground level, he deployed his parachute and landed safely. The aircraft, minus the empennage, descended almost vertically and crashed on the drop zone landing strip. It was destroyed by impact forces and the post-impact fire. The empennage, in several pieces, landed 600 metres west of the landing strip. A Country Fire Authority fire vehicle arrived at the accident site within two minutes of the accident and extinguished the fire. The parachutist that had been entangled was fatally injured. The injuries sustained when entangled on the horizontal stabiliser made the parachutist incapable of operating the main parachute. The other parachutists and the pilot were uninjured. ", "probable_cause": "The following factors were identified:\r\n- The parachutist’s reserve parachute deployed prematurely, probably as a result of the parachute container coming into contact with the aircraft doorframe/handrail.\r\n- The reserve parachute risers and lines tangled around the horizontal stabiliser and elevator.\r\n- The reserve canopy partially filled, applying to the aircraft empennage a load that exceeded its design limits.\r\n- The empennage separated from the aircraft and the elevator separated from the empennage, releasing the parachutist and sending the aircraft out of control."}