{"url": "https://www.baaa-acro.com/crash/crash-atr42-512-florence-1-killed", "date": "Jul 30, 1997 at 1110 LT", "type": "ATR42-500", "operator": "Air%20Littoral", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nice - Florence", "msn": "492", "yom": 1996, "flight_number": "FU701", "city": "Florence-Peretola", "zone": "Tuscany", "country": "Italy", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 14, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10000, "captain_hours_type": null, "copilot_hours": 10000, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Nice-Côte d'Azur Airport on a regular schedule service to Florence, carrying 14 passengers and three crew members. On approach to Florence-Peretola Airport runway 23, the aircraft' speed was too high and after touchdown, it bounced several times and landed firmly 350 metres from the runway end. Unable to stop within the remaining distance, it overran, went through fences and eventually collided with an embankment and came to rest on the emergency lane of the motorway Florence - Pisa. The aircraft broke in two and the cockpit was destroyed on impact. All 15 people seating in the main cabin (14 passengers and the stewardess) were evacuated with minor injuries while both pilots were seriously injured. Two days later, one of them died from his injuries. ", "probable_cause": "The following findings were identified:\r\n- Weather conditions were considered as good with light wind,\r\n- The pilot acting as captain was flying on this route for the first time and this was also his first landing at Peretola Airport, \r\n- Florence-Peretola Airport runway 23 is 1,650 metres long but has a displaced threshold, so the landing distance available is 1,030 metres only, \r\n- The copilot was the pilot-in-command at the time of the accident. He was also a captain and could operate as an instructor, \r\n- The approach configuration was incorrect since the aircraft's touchdown speed was 30 knots above the speed prescribed in the flight manuals,\r\n- Failure of the crew to initiate a go-around procedure while the landing manoeuvre was obviously missed. "}