{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-pukatawagan-1-killed", "date": "Jul 4, 2011 at 1610 LT", "type": "Cessna 208B Grand Caravan", "operator": "Missinippi%20Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pukatawagan - The Pas", "msn": "208B-1114", "yom": 2005, "flight_number": null, "city": "Pukatawagan", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1900, "captain_hours_type": 400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Beaver Air Services Limited Partnership Cessna 208B (registration C-FMCB serial number 208B1114), operated by its general partner Missinippi Management Ltd (Missinippi Airways), was departing Pukatawagan, Manitoba, for The Pas/Grace Lake Airport, Manitoba. At approximately 1610 Central Daylight Time, the pilot began the takeoff roll from Runway 33. The aircraft did not become fully airborne, and the pilot rejected the takeoff. The pilot applied reverse propeller thrust and braking, but the aircraft departed the end of the runway and continued down an embankment into a ravine. A post-crash fire ensued. One of the passengers was fatally injured; the pilot and the 7 other passengers egressed from the aircraft with minor injuries. The aircraft was destroyed. The emergency locator transmitter did not activate.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\nRunway conditions, the pilot's takeoff technique, and possible shifting wind conditions combined to reduce the rate of the aircraft's acceleration during the takeoff roll and prevented it from attaining takeoff airspeed. The pilot rejected the takeoff past the point from which a successful rejected takeoff could be completed within the available stopping distance. The steep drop-off and sharp slope reversal at the end of Runway 33 contributed to the occupant injuries and fuel system damage that in turn caused the fire. This complicated passenger evacuation and prevented the rescue of the injured passenger. The deceased passenger was not wearing the available shoulder harness. This contributed to the serious injuries received as a result of the impact when the aircraft reached the bottom of the ravine and ultimately to his death in the post-impact fire.\r\nFindings as to Risk:\r\nIf pilots are not aware of the increased aerodynamic drag during takeoff while using soft-field takeoff techniques they may experience an unexpected reduction in takeoff performance. Incomplete passenger briefings or inattentive passengers increase the risk that they will be unable to carry out critical egress procedures during an aircraft evacuation. When data recordings are not available to an investigation, this may preclude the identification and communication of safety deficiencies to advance transportation safety. Although the runway at Pukatawagan and many other aerodromes are compliant with Aerodrome Standards and Recommended Practices (TP 312E), the topography of the terrain beyond the runway ends may increase the likelihood of damage to aircraft and injuries to crew and passengers in the event of an aircraft overrunning or landing short. TC's responses to TSB recommendations for action to reduce the risk of post-impact fires have been rated as Unsatisfactory. As a result, there is a continuing risk of post-impact fires in impact-survivable accidents involving these aircraft. The lack of accelerate stop distance information for aircraft impedes the crew's ability to plan the takeoff-reject point accurately.\r\nOther finding:\r\nSeveral anomalies were found in the engine's power control hardware. There was no indication that these anomalies contributed to the occurrence."}