{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-zurich", "date": "Dec 21, 1976 at 2031 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Business Flyers", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ajaccio - Zurich", "msn": "421B-0226", "yom": 1972, "flight_number": null, "city": "Zurich-Kloten", "zone": "Zurich", "country": "Switzerland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 584, "captain_hours_type": 9, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1753, "circumstances": "Following an uneventful flight from Ajaccio-Campo dell'Oro Airport, the pilot started the approach to runway 14 at Zurich-Kloten in poor weather conditions. By night and limited visibility, at an excessive speed of 180 knots, the pilot failed to realize his altitude was too low when the twin engine airplane struck the ground and crashed 1,700 metres short of runway 14. The aircraft was destroyed and both occupants were injured. At the time of the accident, weather conditions were as follow: wind calm, horizontal visibility over 100 metres, RVR of 400 metres for runway 14, freezing fog and vertical visibility less than 100 feet. ", "probable_cause": "The accident was the consequence of a controlled flight with ground during a night approach under CAT I conditions. The following contributing factors were reported:\r\n- The pilot's experience on this type of aircraft was insufficient, \r\n- The pilot failed to monitor his instruments, \r\n- The aircraft was unstable on final approach, \r\n- The airplane struck the ground without any corrective manoeuvre on part of the pilot who failed to initiate a go-around procedure, \r\n- Poor weather conditions, \r\n- Visibility below minimums,\r\n- A CAT I approach to runway 14 was thoughtless, \r\n- Excessive approach speed, 180 knots instead of the recommended 105-115 knots."}