{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6a-russian-mission-4-killed", "date": "Jul 20, 1996 at 1506 LT", "type": "Douglas DC-6", "operator": "Northern%20Air%20Cargo_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Emmonak – Aniak", "msn": "44663", "yom": 1955, "flight_number": "HU033", "city": "Russian Mission", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 14200, "captain_hours_type": 7200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 38248, "circumstances": "The cargo flight was en route, when a fire erupted in or near the #3 engine. During subsequent emergency procedures, the flight crew pulled the fire handle first. Later, they feathered the #3 engine. The fire did not extinguish. During an attempt to land at a rural, intermediate airstrip, while the airplane was in the traffic pattern, witnesses saw fire coming from the area of the #3 engine. They stated the right wing buckled upward, and the airplane crashed. Examination of the wreckage revealed a failure of the master rod in the front bank of cylinders of the #3 engine. Metallurgical tests revealed a crack in the top of the master rod head, which had resulted from corrosion pits. The side of the master rod head was measured and found to be out of round. The master rod shank also fractured due to fatigue. The operator's training procedures and the Douglas Aircraft emergency checklist procedures, required that the engine's propeller be feathered first, and then the fire extinguishing system to be activated. According to information derived from the airplane's cockpit voice recorder, the flight crew reversed that order. The effectiveness of the fire suppression system is diminished if the propeller is not feathered first. ", "probable_cause": "Fatigue failure of the master connecting rod, which originated from corrosion pitting, subsequently compromised the engine crankcase, and resulted in a fire; and failure of the flight crew to follow emergency procedures by pulling the fire handle before feathering the propeller, which diminished the effectiveness of the fire suppression system. "}