{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130-hercules-kukes", "date": "Jun 11, 1999", "type": "Lockheed C-130 Hercules", "operator": "Royal-Air-Force-4", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "4264", "yom": 1968, "flight_number": null, "city": "Kukës", "zone": "Kukës", "country": "Albania", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the night of 11 June 1999, RAF Hercules XV298 was tasked to collect personnel and equipment from Kukes airstrip, Albania. The aircraft flew from Italy and landed on the unlit airstrip using normal Night Vision Goggle (NVG) procedures. The crew had been briefed that there would be sufficient runway remaining from the pickup point to the end of the airstrip. The crew were unable to see the end of the airstrip as artificial lighting in the near distance interfered with their night vision goggles. After loading personnel and equipment it began its takeoff run along the remaining available runway, but soon hit a fence and several other ground obstacles. XV298 slowed then veered to the right, suffering severe damage to its right wing before stopping. Fuel leakage from the damaged wing ignited and the subsequent fire destroyed much of the aircraft.", "probable_cause": "The Board quickly discounted aircraft performance or serviceability as factors in the accident, concluding that the take-off distance was insufficient for the aircraft to get airborne safely . This was partly due to anomalies in the operating instructions for tactical landing zone operations which were contained in three separate documents - one used by the aircrew, one for personnel training, and the other used by the airstrip marking party. Consequently each party had different expectations as to what procedure would be followed, which in turn led to the airstrip markings having been laid out differently to those briefed to the aircrew . Further, the Board established that the airstrip data used to plan the sortie was significantly different from the actual airstrip dimensions ; and also concluded that reduced night vision goggle performance contributed to the accident. The Board of Inquiry concluded that the accident was caused because the take-off distance was insufficient for the aircraft to get airborne safely."}