{"url": "https://www.baaa-acro.com/crash/crash-cessna-t303-crusader-binghamton", "date": "Nov 1, 1999 at 0616 LT", "type": "Cessna 303 Crusader", "operator": "Twin%20Cities%20Air%20Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Portland – Youngstown", "msn": "303-00192", "yom": 1982, "flight_number": null, "city": "Binghamton", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2430, "captain_hours_type": 60, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5480, "circumstances": "While in cruise flight, at 6,000 feet, the left engine lost power. The pilot attempted a restart of the engine, but only about one-half rotation of the left engine propeller was observed, and the engine was secured. The pilot stated that he was unable to maintain altitude and initiated a decent. He requested and was cleared for an instrument approach at an airport where the weather conditions were, 1/4 statute mile of visibility, fog, and a vertical visibility of 100 feet. On the approach, at the minimum descent altitude, the pilot executed a missed approach. As the airplane climbed, the pilot reported to the controller that the 'best altitude [he] could get was 2,200 feet.' A second approach was initiated to the reciprocal runway. While on the second approach, the pilot 'was going to fly the aircraft right to the runway, and told the controller so.' He put the gear down, reduced power, and decided there was 'no hope for a go-around.' He then 'flew down past the decision height,' and about 70-80 feet above the ground, 'added a little power to smooth the landing.' The pilot also stated, 'The last thing I remember was the aircraft nose contacting the runway.' A passenger stated that once the pilot could not see the runway, [the pilot] 'applied power, pitched the nose up,' and attempted a 'go-around' similar to the one that was executed on the first approach. Disassembly of the left engine revealed that the crankshaft was fatigue fractured between connecting rod journal number 2 and main journal number 2. Review of the pilot's operating handbook revealed that the single engine service ceiling, at a weight of 4,800 pounds, was 11,700 feet. The average single engine rate of climb, at a pressure altitude of 6,000 feet, was 295 feet per minute. The average single engine rate of climb, at a pressure altitude of 1,625 feet, was 314 feet per minute. Review of the ILS approach plate for Runway 34 revealed that the decision height was 200 feet above the ground.", "probable_cause": "The pilot's improper in-flight decision to descend below the decision height without the runway environment in sight, and his failure to execute a missed approach. A factor in the accident was the failed crankshaft."}