{"url": "https://www.baaa-acro.com/crash/crash-canadair-cl-415-forte-dei-marmi-2-killed", "date": "Mar 18, 2005 at 1805 LT", "type": "Canadair CL-415", "operator": "SOREM", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "City", "schedule": "Rome - Rome", "msn": "2051", "yom": 2001, "flight_number": "Tanker 22", "city": "Forte dei Marmi", "zone": "Tuscany", "country": "Italy", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2000, "captain_hours_type": 1500, "copilot_hours": 2000, "copilot_hours_type": 1232, "aircraft_hours": 1733, "circumstances": "The crew departed Rome-Ciampino Airport in the afternoon on a fire fighting mission in Forte dei Marmi, north of Pisa. Following two successful missions, the crew was attacking the fire in hilly terrain and low altitude when the aircraft collided with power cables. A fire erupted on the right side of the aircraft and the crew lost control of the airplane that crashed in a residential area. Both pilots were killed while there were no injuries on the ground. ", "probable_cause": "The accident was the consequence of an in-flight collision with a power line because the crew adopted a wrong approach configuration to the fire area. The following contributing factors were identified: \r\n- Poor decision making in attacking the fire, causing the crew to focus their attention on obstacles (pylons) of power line n°500, without considering the presence of the cable guard line n°550,\r\n- The reduced visibility of obstacles resulting from the smoke of the forest,\r\n- The inadequate reporting of electricity pylons and associated overhead lines,\r\n- Non-activation of the required radio links, so the crew could not receive reports on the presence of obstacles,\r\n- Short and discontinuous experience of the captain in that role, coming from the institution of the \"PIC Frozen\",\r\n- The combination of to similar qualified pilots (\"PIC Frozen\") in the cockpit for the operation of a flight, one just rehabilitated to a high command function, the other still employed in the role of co-pilot: This condition could have a negative impact in terms of crew integration, obscuring decision making,\r\n- The existence of criticality in corporate manuals used at the date of the accident,\r\n- Reduced operational capacity of the crew in the last phase of flight, resulting from the strong heat of the fire under the left wing which penetrated the airplane through an opening created by the separation of a porthole."}