{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6bf-nuiqsut", "date": "Sep 25, 2001 at 1609 LT", "type": "Douglas DC-6", "operator": "Northern%20Air%20Cargo_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Deadhorse - Nuiqsut", "msn": "45202", "yom": 1957, "flight_number": "NAC690", "city": "Nuiqsut", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 22000, "captain_hours_type": 14000, "copilot_hours": 6100, "copilot_hours_type": 3000, "aircraft_hours": 7754, "circumstances": "The crew was conducting a GPS instrument approach in a Douglas DC-6B airplane under IFR conditions. Both pilots were certificated and type-rated in the Douglas DC-6B airplane. The first pilot, seated in the right seat, was one of the company's senior check airman, and possessed a right seat dependency endorsement. The second pilot, seated in the left seat, had less experience in the DC-6B airplane. It had been previously agreed that the second pilot would fly the leg of the flight on which the accident occurred. The first pilot reported that light snow showers were present, with visibility reported at 4 miles. During final approach as the airplane passed over the airstrip threshold, a higher than normal sink rate was encountered. He said that the initial touchdown was \"firm,\" but was thought to be within acceptable tolerances. Just after touchdown, the left wing broke free from the airplane at the wing to fuselage attach point. The airplane veered to the left, continued off the left side of the 5,000 feet long by 75 feet runway, down an embankment, and came to rest in an area of wet, tundra covered terrain. A postcrash fire heavily damaging the center section of the fuselage. The cockpit voice recorder (CVR) revealed that as the airplane progressed along the approach, the first pilot says: \"You're only one mile from it....Take it on down ah three.\" As the airplane passes over the runway threshold, the first pilot says: \"Keep that, keep that (expletive) power off.... Just push forward on the nose.\" The sound of impact is heard 4 seconds later. The minimum descent altitude (MDA) for the approach is 400 feet msl (383 feet agl). A contract weather observer reported lower ceilings, with about 1 mile visibility, over the approach end of the runway at the same time as the accident.", "probable_cause": "The flightcrew's continued use of an unstabilized GPS approach. Factors associated with the accident were low ceilings, and the inadequate coordination between the crew. "}