{"url": "https://www.baaa-acro.com/crash/crash-douglas-r4d-1-akron-3-killed", "date": "Nov 4, 1949 at 2134 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Harrington's", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "North Philadelphia – Cleveland", "msn": "4304", "yom": 1942, "flight_number": null, "city": "Akron-Canton", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 5000, "captain_hours_type": 600, "copilot_hours": 2300, "copilot_hours_type": null, "aircraft_hours": 1965, "circumstances": "The aircraft departed from the North Philadelphia Airport, Philadelphia, Pennsylvania, at 1846, November 4, 1949, for Cleveland. A flight plan was then filed with Philadelphia ATC which specified that the flight proceed from Philadelphia to Allentown according to Visual Flight Rules, and from Allentown to Cleveland according to Instrument Flight Rules at a cruising altitude of 4,000 feet Mansfield, Ohio, was designated as the alternate airport. At the time of takeoff, the aircraft carried 3,000 pounds of fuel and 4,878 pounds of cargo, Total aircraft weight was 24,800 pounds which was within the allowable limit, and the load was so distributed that the aircraft's center of gravity was within the certificated limits. The flight was routine until it reported over Youngstown, Ohio, at 2100, at which time a new flight plan was filed with Cleveland ATC because the Cleveland weather was below the authorized landing minimums and also because freezing rain was forecast at the time of the flight's arrival. The destination was changed to Akron, and Toledo Ohio, was designated as the alternate. At 2114 the flight reported to the Akron-Canton Tower estimating arrival over the Akron Range Station at 2117 at 4,500 feet and the tower issued approach clearance. At 2118 the flight reported over the Akron Range Station Five minutes later, at 2123, the flight reported outbound at 2,500 feet over the outer marker, 4 3 miles south of Runway 36. The tower, at 2128, transmitted to the flight the 2125 Akron-Canton weather as follows. At 2132, the flight reported inbound at 2,500 feet over the outer marker and was cleared to land on Runway 36. This was the last radio contact with the flight Approximately two minutes later the aircraft crashed south of the airport. The wreckage was found 3,250 feet south of the runway 36 threshold and 880 feet east of the center line. All three crew members were killed. \r\nCrew:\r\nJames R. Harrington, pilot,\r\nJohn E. Franklin, copilot,\r\nRobert S. Yarano, crew chief. ", "probable_cause": "The Board determines that the probable cause of this accident was the improper execution of an instrument approach which resulted in the aircraft being flown to the right of the proper approach path at an altitude too low to clear the terrain."}