{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31p-pressurized-navajo-saint-louis-3-killed", "date": "Feb 25, 1985 at 1935 LT", "type": "Piper PA-31-310 Navajo", "operator": "WTS Inc.", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Saint Louis - Saint Louis", "msn": "31P-018", "yom": 1970, "flight_number": null, "city": "Saint Louis-Weiss (Fenton)", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1420, "captain_hours_type": 3, "copilot_hours": null, "copilot_hours_type": 110, "aircraft_hours": 493, "circumstances": "The aircraft was on a night instructional flight with 2 multi-engine instructor pilots at the controls and a rated pilot occupying a rear passenger seat. The right front seat occupant was an experienced multi-engine pilot with 110 hours in this make and model; however, his 2nd class medical certificate was issued in January 1983. The left front seat occupant had just received his multi-engine instructor rating and had only 3 hours in this make and model. He had a current medical certificate and was presumed to be the pilot-in-command. The aircrew made 2 passes over runway 18, then maneuvered onto a downwind leg of the pattern. According to witnesses, the aircraft was northeast of the airport at approximately 300 to 400 feet agl and maneuvering back toward the runway when it entered a steep descent, crashed and burned. The aircraft crashed northeast of the airport in a wooded area. Impact occurred on a southerly heading in about an 18° dive. No preimpact part failure/malfunction was found; however, the aircraft was extensively damaged during impact. Toxicological checks of the passenger and right front seat occupants showed each had an alcohol level of 1,17‰. No alcohol found in the left front seat occupant's blood. All three occupants were killed. ", "probable_cause": "Occurrence #1: in flight collision with terrain/water\r\nPhase of operation: approach - vfr pattern - base turn\r\nFindings\r\n1. (f) judgment - poor - pilot in command\r\n2. (c) judgment - poor - other crewmember\r\n3. (c) impairment (alcohol) - other crewmember\r\n4. (f) qualification - other crewmember\r\n5. (f) light condition - dark night\r\n6. (c) aircraft handling - not maintained - pilot in command\r\n7. (f) lack of total experience in type of aircraft - pilot in command\r\n8. (c) remedial action - inadequate - other crewmember\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}