{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-reno", "date": "Mar 13, 2002 at 1940 LT", "type": "Beechcraft 90 King Air", "operator": "Regent Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "City", "schedule": "Durango - Truckee", "msn": "LW-236", "yom": 1977, "flight_number": null, "city": "Reno-Tahoe (ex Cannon)", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1610, "captain_hours_type": 608, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8773, "circumstances": "During an instrument approach, upon descending to the prescribed minimum descent altitude, about 1/2 mile from the missed approach point, the pilot failed to maintain flying airspeed. The airplane stalled, rolled left, and in an uncontrolled descent collided with a commercial building 0.96 nm from the runway's displaced threshold. The accident occurred during the return portion of a round trip flight, while on final approach to the pilot's alternate airport due to a weather-induced diversion. Moderate intensity snow showers and freezing fog existed. During the initial approach, the reported visibility was 1 1/2 miles. About the time the pilot passed the final approach fix, the visibility decreased to 1/2 mile, but the pilot was not informed of the decrease below his 1-mile minimum requirement. The pilot had maintained the recommended 140-knot approach speed in the icing conditions until about 3 1/2 miles from the runway. Thereafter, the airplane's speed gradually decreased until reaching about 75 knots. After the airplane started vibrating, the pilot increased engine power, but his action was not timely enough to avert stalling. Company mechanics maintained the airplane. On previous occasions overheat conditions had occurred wherein the environmental ducting melted and heat was conducted to the adjacent pneumatic tube that provides deice air to the empennage boots. During the accident investigation, the deice tube was found completely melted closed, thus rendering all of the empennage deice boots dysfunctional.", "probable_cause": "The pilot's inadequate approach airspeed for the existing adverse meteorological conditions followed by his delayed remedial action to avert stalling and subsequent loss of airplane control. Contributing factors were the pilot's reduced visibility due to the inclement weather and the icing conditions."}