{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-vancouver-2-killed", "date": "Oct 27, 2011 at 1612 LT", "type": "Beechcraft 100 King Air", "operator": "Northern%20Thunderbird%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Vancouver - Kelowna", "msn": "B-36", "yom": 1970, "flight_number": "NTA204", "city": "Vancouver", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 13876, "captain_hours_type": 978, "copilot_hours": 1316, "copilot_hours_type": 85, "aircraft_hours": 26993, "circumstances": "The Northern Thunderbird Air Incorporated Beechcraft King Air 100 (serial number B-36, registration C‑GXRX) departed Vancouver International Airport for Kelowna, British Columbia, with 7 passengers and 2 pilots on board. About 15 minutes after take-off, the flight diverted back to Vancouver because of an oil leak. No emergency was declared. At 1611 Pacific Daylight Time, when the aircraft was about 300 feet above ground level and about 0.5 statute miles from the runway, it suddenly banked left and pitched nose-down. The aircraft collided with the ground and caught fire before coming to rest on a roadway just outside of the airport fence. Passersby helped to evacuate 6 passengers; fire and rescue personnel rescued the remaining passenger and the pilots. The aircraft was destroyed, and all of the passengers were seriously injured. Both pilots succumbed to their injuries in hospital. The aircraft’s emergency locator transmitter had been removed.", "probable_cause": "Findings as to causes and contributing factors:\r\nDuring routine aircraft maintenance, it is likely that the left-engine oil-reservoir cap was left unsecured.\r\nThere was no complete preflight inspection of the aircraft, resulting in the unsecured engine oil-reservoir cap not being detected, and the left engine venting significant oil during operation.\r\nA non-mandatory modification, designed to limit oil loss when the engine oil cap is left unsecure, had not been made to the engines.\r\nOil that leaked from the left engine while the aircraft was repositioned was pointed out to the crew, who did not determine its source before the flight departure.\r\nOn final approach, the aircraft slowed to below VREF speed. When power was applied, likely only to the right engine, the aircraft speed was below that required to maintain directional control, and it yawed and rolled left, and pitched down.\r\nA partially effective recovery was likely initiated by reducing the right engine’s power; however, there was insufficient altitude to complete the recovery, and the aircraft collided with the ground.\r\nImpact damage compromised the fuel system. Ignition sources resulting from metal friction, and possibly from the aircraft’s electrical system, started fires.\r\nThe damaged electrical system remained powered by the battery, resulting in arcing that may have ignited fires, including in the cockpit area.\r\nImpact-related injuries sustained by the pilots and most of the passengers limited their ability to extricate themselves from the aircraft.\r\nFindings as to risk:\r\nMulti-engine−aircraft flight manuals and training programs do not include cautions and minimum control speeds for use of asymmetrical thrust in situations when an engine is at low power or the propeller is not feathered. There is a risk that pilots will not anticipate aircraft behavior when using asymmetrical thrust near or below unpublished critical speeds, and will lose control of the aircraft.\r\nThe company’s standard operating procedures lacked clear directions for how the aircraft was to be configured for the last 500 feet, or what to do if an approach is still unstable when 500 feet is reached, specifically in an abnormal situation. There is a demonstrated risk of accidents occurring as a result of unstabilized approaches below 500 feet above ground level.\r\nWithout isolation of the aircraft batteries following aircraft damage, there is a risk that an energized battery may ignite fires by electrical arcing.\r\nErroneous data used for weight-and-balance calculations can cause crews to inadvertently fly aircraft outside of the allowable center-of-gravity envelope."}