{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-100-lawrence", "date": "Dec 9, 2001 at 1645 LT", "type": "Dassault Falcon 10", "operator": "Air Del", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Madison - Lawrence", "msn": "202", "yom": 1984, "flight_number": null, "city": "Lawrence", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10500, "captain_hours_type": 1200, "copilot_hours": 1229, "copilot_hours_type": 22, "aircraft_hours": 5421, "circumstances": "The pilot said that the copilot was flying a visual approach to runway 15 at the Lawrence Municipal Airport, Lawrence, Kansas. The pilot said, \"With gear down and full flaps at approximately 15 to 20 feet above the runway and 115 KTS, the nose abruptly dropped and there was no elevator effectiveness with the yoke pulled back to the mechanical stop.\" The pilot said, \"After landing, I noticed that the stabilizer trim indicated full nose down in the cockpit and, upon exterior inspection, the stab was in that position.\" The copilot said, \"I made my turn to base and proceeded to make my turn to final. No problems with the controllability were noted at this time. The turn to final was made and the airplane was lined up with the runway on final approach with normal glide path. My altitude was dropping normally and my airspeed was approximately 140 knots.\" The copilot said, \"When it got time to pull the power back to idle for landing our airspeed was approximately 110 knots and power was reduced. At that point in time the nose of the aircraft seemed to pitch over towards the runway and increase speed. I pulled back on the yoke to raise the nose and at that same instance the pilot recognized the pitch over and pulled back on the yoke at the same time. The yoke did not seem to pull all of the way to its full extent of travel and felt to mechanically stop at about 3/4 the way travel. Even with both pilot's pulling on the yoke it seemed unresponsive and failed to raise the nose back to a proper landing attitude. The aircraft hit the runway very hard and came to a stop on the runway.\" A preliminary inspection of the airplane showed the stabilizer positioned at 4 degrees nose down. An examination of the airplane's systems revealed no anomalies.", "probable_cause": "The copilot's failure to maintain aircraft control during the landing. Factors relating to this accident were the copilot's improper in-flight decision not to execute a go-around, the copilot not performing a go-around, the inadequate crew coordination prior to landing between the pilot and copilot, and the improperly set stabilizer trim."}