{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-spokane-1-killed", "date": "Feb 22, 2015 at 1405 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Michael J. Clements", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Villeneuve – Spokane – Stockton", "msn": "46-36281", "yom": 2000, "flight_number": null, "city": "Spokane-Felts Field", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 667, "captain_hours_type": 63, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2388, "circumstances": "The pilot was conducting a cross-country flight from Canada to California and had landed to clear customs into the United States and to refuel his airplane. The pilot then departed to continue the flight. During the initial climb after takeoff, the engine experienced a total loss of power, and the pilot attempted to make an off-airport forced landing. The right wing struck railroad tracks at the top of a hill, and the airplane continued down an embankment, where it came to rest adjacent to the bottom of a railroad bridge. Postaccident interviews revealed that, when requesting fuel from the fixed-base operator (FBO), the pilot did not specify a grade of fuel to be used to service the airplane. The refueler mistakenly identified the airplane as requiring Jet A fuel, even though the fuel filler ports were placarded \"AVGAS (aviation gasoline) ONLY.\" The fueler subsequently fueled the airplane with Jet A instead of aviation gasoline. Additionally, the fueling nozzle installed on the fuel truck at the time of the refueling was not the proper type of nozzle. Jet A and AvGas fueling nozzles are different designs in order to prevent fueling an airplane with the wrong type of fuel. Following the fueling, the pilot returned to the FBO and signed a receipt, which indicated that the airplane had been serviced with Jet A. There were no witnesses to the pilot's preflight activities, and it is unknown if the pilot visually inspected or obtained a fuel sample before takeoff; however, had the pilot done this, it would have been apparent that the airplane had been improperly fueled. ", "probable_cause": "A total loss of engine power due to the refueler's incorrect refueling of the airplane. Contributing to the accident was the fixed-base operator's improper fueling nozzle, which facilitated the use of an incorrect fuel, and the pilot's inadequate preflight inspection."}