{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-snow-lake-1-killed", "date": "Nov 18, 2012 at 0956 LT", "type": "Cessna 208B Grand Caravan", "operator": "Gogal%20Air%20Services", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Snow Lake - Winnipeg", "msn": "208B-1213", "yom": 2006, "flight_number": null, "city": "Snow Lake", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2865, "captain_hours_type": 1020, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1487, "circumstances": "The Gogal Air Services Limited Cessna 208B (registration C-GAGP, serial number 208B1213) departed Runway 21 at Snow Lake en route to Winnipeg, Manitoba, with the pilot and 7 passengers on board. At approximately 0956 Central Standard Time, shortly after take-off, the aircraft descended and struck the terrain in a wooded area approximately 0.9 nautical miles beyond the departure end of the runway. The pilot was fatally injured, and the 7 passengers sustained serious injuries. The aircraft was destroyed by impact forces, and a small fire ensued near the engine. The aircraft’s emergency locater transmitter activated. First responders attended the scene, and the injured passengers were taken to area hospitals. The aircraft’s fuel cells ruptured, and some of the onboard fuel spilled at the site.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. The aircraft departed Snow Lake overweight and with an accumulation of ice on the leading edges of its wings and tail from the previous flight. As a result, the aircraft had reduced take-off and climb performance and increased stall speed, and the protection afforded by its stall warning system was impaired.\r\n2. A breakdown in the company’s operational control resulted in the flight not operating in accordance with the Canadian Aviation Regulations and the company operations manual.\r\n3. As a result, shortly after departure, the aircraft stalled at an altitude from which recovery was not possible.\r\nFindings as to risk:\r\n1. If companies operate in instrument meteorological conditions for which they are not authorized, there is an increased risk that accidents may occur.\r\n2. If Transport Canada does not provide the same degree of oversight for repetitive charter operations as it does for a scheduled operator, the risks in the operator’s activities may not be fully evaluated.\r\n3. If passenger briefings are not provided and passengers are not properly seated and restrained, there is an increased risk of injuries to those passengers and the other occupants in the event of an accident.\r\n4. If flights are conducted without ensuring an ice-free airframe, there is a risk of decreased aircraft performance and of loss of control and collision with terrain. \r\nOther findings:\r\n1. On impact, the aircraft’s seats and cabin deformed as designed, and this deformation partially attenuated the impact forces."}