{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-18b-casablanca-72-killed", "date": "Jul 12, 1961 at 0125 LT", "type": "Ilyushin II-18", "operator": "CSA-Czech-Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Prague – Zurich – Rabat – Dakar – Conakry – Bamako", "msn": "181 0029 04", "yom": 1961, "flight_number": "OK511", "city": "Casablanca-Nouasseur (Mohammed V)", "zone": "Grand Casablanca", "country": "Morocco", "region": "Africa", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 64, "pax_fatalities": 64, "other_fatalities": 0, "total_fatalities": 72, "captain_hours": 10560, "captain_hours_type": 826, "copilot_hours": 6301, "copilot_hours_type": 223, "aircraft_hours": 268, "circumstances": "The airplane departed Zurich at 2043LT on 11 July. The en route part of the flight trip was uneventful. At 01:00 the aircraft contacted Sale Tower and requested weather information. The tower replied: \"visibility 10 m (30 ft), ground fog, clear sky.\" The flight then advised it was heading for Casablanca, the alternate. At 01:06 the aircraft gave its position as 5 miles from Casablanca-Anfa (CAS), requested permission to descend and asked for landing instructions. The aircraft was asked to call when on the downwind leg. Four minutes later the flight was asked to call when on final approach and was told that he was number one for landing, the surface wind was 040°at 4 kts. The pilot replied that he would call when over the range station. The aircraft flew over the field at 01:13, and three minutes later the pilot gave his altitude as 400 m (1300 ft) and indicated a ceiling of 150 m (500 ft). The flight was advised that cloud was 7/8, ceiling 140-150 m (450 to 500 ft). Three minutes later conditions were 7/8, 100 m (330 ft). At 01:22 the aircraft requested permission to land in Casablanca-Nouasseur Airport (CMN) if possible, and the tower asked him to wait. Two minutes later the aircraft was asked how much fuel it had remaining. It replied it had enough for 90 minutes. During the time Anfa control was transmitting this request to the American authorities in Nouasseur, the aircraft crashed at 01:25, in line with runway 03 about 8 miles from its threshold.", "probable_cause": "None of the assumptions i.e. Material failure, electrical failure, abrupt manoeuvre to avoid another aircraft and unfavorable weather conditions, satisfied the investigating commission as being a definite cause of the accident. The last one, however, although unlikely at first sight, could account for the accident if the crew warned of the deteriorating weather by the Anfa tower had decided to take advantage of the partial visibility (of the ground) between stratus cloud and had attempted a fast let-down in unfavorable conditions."}