{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-2a8-madras", "date": "Apr 26, 1979 at 1159 LT", "type": "Boeing 737-200", "operator": "Indian%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Trivandrum - Madras", "msn": "20962/380", "yom": 1974, "flight_number": null, "city": "Chennai", "zone": "Tamil Nadu", "country": "India", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 61, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14769, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight for 35 minutes after takeoff from Trivandrum Airport was normal and uneventful. After receiving clearance from Madras, the aircraft commenced descent from a cruising altitude of 27,000 feet. Soon thereafter, a loud explosion was heard from the forward lavatory area. The cockpit and front portion of cabin were filled with smoke and cabin lights went off. There was completed instrument and electrical failure. The aircraft with undercarriage down made a flapless approach and touched down at a distance of 2,500 feet beyond threshold of runway 25 at Madras Airport. The aircraft overshot the runway, ploughing through kutcha grassy field and nullah. After the accident came to a halt, the passengers evacuated through forward and rear doors. The aircraft was destroyed due to inflight explosion and subsequent post crash overrun. The fire started on starboard side after the aircraft came to a halt and damaged the starboard wing. 14 occupants were injured.", "probable_cause": "The accident was caused by the denotation of an explosive device in the forward lavatory of the aircraft. The aircraft overshot the runway due to high speed of touchdown, non-availability of reverse thrust and antiskid system, due to systems failure consequent on explosion."}