{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-83-isparta-57-killed", "date": "Nov 30, 2007 at 0136 LT", "type": "McDonnell Douglas MD-83", "operator": "AtlasJet", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Istanbul - Isparta", "msn": "53185/2090", "yom": 1994, "flight_number": "KK4203", "city": "Isparta", "zone": "Mediterranean Region (Akdeniz Bölgesi)", "country": "Turkey", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 50, "pax_fatalities": 50, "other_fatalities": 0, "total_fatalities": 57, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Istanbul-Atatürk Airport at 0051LT on a schedule service to Isparta, carrying 50 passengers and 7 crew members. After being cleared to proceed to a VOR/DME approach to Isparta Airport runway 05, the crew was supposed to fly over IPT VOR then to follow a 223° heading. But the crew failed to input the arrival procedures in the FMS and started the approach by night over rising terrain. As the EGPWS failed to activate, the crew did not realize his altitude was insufficient when the aircraft collided with trees and crashed in a mountainous area located near Çukurören, about 12 km west of Isparta Airport. The aircraft was destroyed and all 57 occupants were killed.", "probable_cause": "The following findings were identified:\r\n- The crew failed to follow the published procedures, \r\n- The crew failed to adhere to SOP's,\r\n- The EGPWS system failed to activate and to warn the crew about the insufficient altitude, \r\n- The EGPWS failed 86 times during the last 235 flights and was removed from another aircraft to be installed on TC-AKM 10 days prior to the accident, \r\n- Lack of visibility due to the night, \r\n- The CVR system was unserviceable, \r\n- The DFDR system was partially unserviceable and recorded the last 15 minutes of flight only, \r\n- Lack of crew training, \r\n- The captain followed only 20 of the requested 32 hours training, \r\n- The copilot followed a 32-hours training program in Sofia but this was not documented, \r\n- A probable lack of situational awareness on part of the crew. "}