{"url": "https://www.baaa-acro.com/crash/crash-martin-404-pittsburgh-22-killed", "date": "Apr 1, 1956 at 1920 LT", "type": "Martin 404", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pittsburgh – Harrisburg – Reading – Allentown – Newark", "msn": "14103", "yom": 1951, "flight_number": "TW400", "city": "Pittsburgh-Intl", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 33, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 22, "captain_hours": 12000, "captain_hours_type": 2200, "copilot_hours": 7145, "copilot_hours_type": 204, "aircraft_hours": 9177, "circumstances": "Flight 400 was regularly scheduled between Pittsburgh, Pennsylvania, and Newark, New Jersey, with stops at Harrisburg. Reading. and Allentown, Pennsylvania. Captain Raymond F. McQuade, First Officer Harlan V. Jesperson, and Hostess Vary Jane Fanning, comprised the crew. Prior to departure the pilots were briefed on the en route weather and received the sequence and forecast reports. Although the en route weather was generally good the night was dispatched to Newark on an IFR flight plan via airways as is customary. Upon departure the gross weight of the aircraft was 41,822 pounds (the certificated allowable takeoff gross is 44,900 pounds and TWA's own limit is 43.,650 pounds) and the center of gravity of the loaded aircraft was located within the prescribed limits. Scheduled departure time was 1915; the flight asked for and received taxi clearance at 1916, was then given the wind as calm, and was cleared to runway 23. Takeoff clearance was requested and granted at 1919. About one minute later tower personnel observed a seemingly normal takeoff and initial climb immediately followed by a left turning descent, crash, and erupting fire just beyond the southwest boundary of the airport. Passengers extricated themselves from the jumbled wreckage through and ahead of the fire as best they could; some helped others while a few found themselves thrown out through tears and rents in the shattered fuselage. Although airport based fire fighting equipment was dispatched with no loss of tune some 20 minutes elapsed before it reached the site because of the necessity of traversing circuitous country lanes. Once there, the conflagration, which by that time had nearly consumed the wreckage, was quickly smothered. The stewardess and 21 passengers were killed while 14 other occupants were injured. The aircraft was totally destroyed. ", "probable_cause": "The Board determines that the probable cause of this accident was uncoordinated emergency action in the very short time available to the crew, which produced an airplane configuration with unsurmountable drag. The following findings were reported: \r\n- At the time of the first power reduction the first officer saw the left engine zone 1 fire warning light come on and retarded the left throttle to a point where autofeathering was deactivated,\r\n- The first officer then reached for the left manual feathering button but was dissuaded from using it by the captain, who, not knowing that the autofeathering was inoperative, attempted futilely to obtain it by pulling back the left mixture to idle cutoff,\r\n- This action did not comply with the emergency procedures prescribed by the carrier for powerplant fire or failure,\r\n- Although these were not the most desirable procedures, compliance without delay would have feathered the left propeller,\r\n- The windmilling left propeller, the extended landing gear, and the takeoff flaps produced sufficient drag to make the airplane lose altitude and strike the ground,\r\n- The cause of the fire warning was a failed exhaust connector clamp in the left engine which triggered an adjacent fire detecting unit,\r\n- After the accident the carrier revised its emergency procedures for powerplant fire or failure."}