{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-halfmoon-bay-5-killed", "date": "Aug 19, 1998 at 1643 LT", "type": "Cessna 402", "operator": "Vincent%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Halfmoon Bay - Invercargill", "msn": "402C-0512", "yom": 1981, "flight_number": null, "city": "Halfmoon Bay (Stewart Island)", "zone": "Southland Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 14564, "captain_hours_type": 27, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13472, "circumstances": "Surviving passengers reported that en route from Stewart Island to Invercargill there were symptoms of a righthand engine failure, which was corrected by the pilot's manipulation of floor-mounted fuel tank selectors. Shortly afterwards, both engines stopped. The pilot broadcast a Mayday and advised the passengers that they would be ditching. A successful ditching was carried out approximately 12 NM south of Invercargill. All occupants escaped from the aircraft, however, four persons exited without life jackets. The pilot entered the cabin but was unable to locate more before the aircraft sank. Rescuers reached the scene about an hour after the ditching only to find that all those without life jackets had perished, as had a young boy who was wearing one. ", "probable_cause": "A TAIC investigation found that there was no evidence of any component malfunction that could cause a double engine failure, although due to seawater damage the pre-impact condition of most fuel quantity system components could not be verified. Both fuel tank selectors were positioned to the lefthand tank, and it is probable that fuel starvation was the cause of the double engine failure. Company procedures for the Cessna 402 lacked a fuel quantity monitoring system to supplement fuel gauge indications. Dipping of the tanks was not a feasible option. Company pilots believed that the aircraft was fitted with low-fuel quantity warning lights, which was not the case. As three pilots believed the gauges indicated sufficient fuel was on board before the preceding round trip to the island, exhaustion may have followed an undetermined fuel indicating system malfunction. The failure of the company to require the use of operational flight logs, and other deficiencies in record keeping, were identified in the TAIC report. The much-publicised misunderstanding about the ditching location was not considered by the TAIC report to have affected the outcome of the rescue, but provides an example of the continued importance of using the phonetic alphabet in radiotelephony. A safety recommendation that operators use a fuel-quantity monitoring system to supplement fuel gauge indications was also made by the TAIC report."}