{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-orroroo-1-killed", "date": "Sep 20, 1989 at 1222 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Aerial%20Agriculture", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Orroroo - Orroroo", "msn": "1532", "yom": 1963, "flight_number": null, "city": "Orroroo", "zone": "South Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft had been delayed in servicing and repair and had only been released six weeks prior to the accident. This delay had caused the operator/pilot to fall behind in his commitments and, according to some witnesses, caused him to worry about the situation. On the day of the accident, the pilot had just completed spraying a 243 hectare paddock and had landed to reload. After take-off for the new task, the pilot was seen to make an aerial inspection of the paddock before entering the first swath run. At the end of this run, the aircraft collided with a Single Wire Earth Return (SWER) powerline and crashed. It was later shown that the aircraft was in a bank to the right of about 18 degrees. The SWER line ran across one end of the paddock at an angle and on the crop side of a windmill just inside the fence which bordered the road. The line contacted the right maingear and outboard sprayboom attachment struts on the right wing. The wire broke after impact but the aircraft hit the ground heavily on the right main gear. The gear detached from the aircraft, the propeller struck the ground and the aircraft slewed around as it came to rest after some 27 metres of ground travel. The front half of the aircraft was destroyed by fire which broke out almost immediately the aircraft stopped. The pilot, sole on board, was killed. ", "probable_cause": "Two main hypothesis were proposed. One was that the pilot was distracted from a less than demanding task by business worries. The other was that the pilot had perceived that the SWER line was on the right of the windmill and outside the fence and therefore did not present an obstacle to his procedure turn. Neither hypothesis could be substantiated. An additional concern was the fact that the pilot had died from impact injuries in an accident that, prima facie, was survivable. Concern focused on whether the pilot had secured his harness properly and/or whether the inertia reel had failed. Detailed engineering inspection of the inertia reel by the Bureau and the manufacturer could not positively determine the mode of operation of the inertia reel. However, the post mortem report showed that the nature of injuries to the pilot, while sufficient to cause death prior to the fire, were such as to indicate that the inertia reel had probably not failed. The pilot did not see the powerline in time to avoid a collision. "}