{"url": "https://www.baaa-acro.com/crash/crash-cessna-525-citation-cj4-marion", "date": "Apr 2, 2018 at 1709 LT", "type": "Cessna 525 CitationJet CJ4", "operator": "Avis%20Industrial%20Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jackson - Marion", "msn": "525C-0081", "yom": 2012, "flight_number": null, "city": "Marion-Municipal", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 35437, "captain_hours_type": 2537, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2537, "circumstances": "A single-engine airplane was taking off from runway 15 about the same time that a multi-engine business jet landed on a nearly perpendicular runway (runway 22). The single-engine airplane, piloted by a private pilot, was departing on a local flight. The jet, piloted by an airline transport pilot, was rolling down the runway following a straight-in visual approach and landing. The single-engine airplane collided with the empennage of the jet at the intersection of the two runways. Witnesses in the airport lounge area heard the pilot of the single-engine airplane announce on the airport's universal communications (UNICOM) traffic advisory frequency a few minutes before the accident that the airplane was back-taxiing on the runway. The pilot of the jet did not recall making any radio transmissions on the UNICOM frequency and review of the jet's cockpit voice recorder did not reveal any incoming or outgoing calls on the frequency. The pilots of both airplanes were familiar with the airport, and the airport was not tower controlled. The airport had signage posted on all runways indicating that traffic using the nearly perpendicular runway could not be seen and instructed pilots to monitor the UNICOM. A visibility assessment confirmed reduced visibility of traffic operating from the nearly perpendicular runways. The reported weather conditions about the time of the accident included clear skies with 4 miles visibility due to haze. Both airplanes were painted white. It is likely that the pilot of the jet would have been aware of the departing traffic if he was monitoring the UNICOM frequency. Although the jet was equipped with a traffic collision avoidance system (TCAS), he reported that the system did not depict any conflicting traffic during the approach to the airport. Although the visibility assessment showed reduced visibility from the departing and arrival runways, it could not be determined if or at what point during their respective landing and takeoff the pilot of each airplane may have been able to see the other airplane. In addition to the known reduced visibility of the intersecting runways, both airplanes were painted white and there was reported haze in the area, which could have affected the pilots' ability to see each other. ", "probable_cause": "The failure of both pilots to see and avoid the other airplane as they converged on intersecting runways. Contributing to the accident was the jet pilot's not monitoring the airport's traffic advisory frequency, known reduced visibility of the intersecting runways, and hazy weather condition."}