{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-wernadinga-station-8-killed", "date": "Sep 4, 2000 at 1510 LT", "type": "Beechcraft 200 Super King Air", "operator": "Central Air", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Perth - Leonora", "msn": "BB-47", "yom": 1975, "flight_number": null, "city": "Wernadinga Station", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 2053, "captain_hours_type": 138, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 18771, "circumstances": "On 4 September 2000, a Beech Super King Air 200 aircraft, VH-SKC, departed Perth, Western Australia at 1009 UTC on a charter flight to Leonora with one pilot and seven passengers on board. Until 1032 the operation of the aircraft and the communications with the pilot appeared normal. However, shortly after the aircraft had climbed through its assigned altitude, the pilot’s speech became significantly impaired and he appeared unable to respond to ATS instructions. Open microphone transmissions over the next 8-minutes revealed the progressive deterioration of the pilot towards unconsciousness and the absence of any sounds of passenger activity in the aircraft. No human response of any kind was detected for the remainder of the flight. Five hours after taking off from Perth, the aircraft impacted the ground near Burketown, Queensland, and was destroyed. There were no survivors.", "probable_cause": "Due to the limited evidence available, it was not possible to draw definitive conclusions as to the factors leading to the incapacitation of the pilot and occupants of VH-SKC.\r\nThe following findings were identified:\r\n1. The pilot was correctly licensed, had received the required training, and there was no evidence to suggest that he was other than medically fit for the flight.\r\n2. The weather conditions on the day presented no hazard to the operation of the aircraft on its planned route.\r\n3. The flightpath flown was consistent with the aircraft being controlled by the autopilot in heading and pitch-hold modes with no human intervention after the aircraft passed position DEBRA.\r\n4. After the aircraft climbed above the assigned altitude of FL250, the speech and breathing patterns of the pilot, evidenced during the radio transmissions, displayed changes consistent with hypoxia.\r\n5. Testing revealed that Carbon Monoxide and Hydrogen Cyanide were highly unlikely to have been factors in the occurrence.\r\n6. The low Carbon Monoxide and Cyanide levels, and the absence of irritation in the airways of the occupants indicated that a fire in the cabin was unlikely.\r\n7. The incapacitation of the pilot and passengers was probably due to hypobaric hypoxia because of the high cabin altitude and their not receiving supplemental oxygen.\r\n8. A rapid or explosive depressurisation was unlikely to have occurred. \r\n9. The reasons for the pilot and passengers not receiving supplemental oxygen could not be determined.\r\n10. Setting the visual alert to operate when the cabin pressure altitude exceeds 10,000 ft and incorporating an aural warning in conjunction with the visual alert, may have prevented the accident.\r\n11. The training and actions of the air traffic controller were not factors in the accident.\r\nSignificant factors:\r\n1. The aircraft was probably unpressurised for a significant part of its climb and cruise for undetermined reasons.\r\n2. The pilot and passengers were incapacitated, probably due to hypobaric hypoxia, because of the high cabin altitude and their not receiving supplemental oxygen. "}