{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1245-state-college-6-killed", "date": "Mar 27, 2005 at 1348 LT", "type": "Pilatus PC-12", "operator": "J2W Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Naples – State College", "msn": "299", "yom": 1999, "flight_number": null, "city": "State College-University Park", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 1645, "captain_hours_type": 173, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1523, "circumstances": "The accident airplane was on an instrument landing system (ILS) approach to land, when witnesses reported seeing it spinning in a nose down, near vertical attitude before it collided with the ground. The accident site was about 3 miles from the approach end of the intended runway. A review of radar data disclosed that the private pilot had difficulty maintaining altitude and airspeed while on final approach, with significant excursions above and below the glidepath, as well as large variations in airspeed. Interviews with other pilots in the area just prior to and after the accident revealed that icing conditions existed in clouds near the airport, although first responders to the accident site indicated that there was no ice on the airplane. Post accident inspection of the airplane, its engine and flight navigation systems, discovered no evidence of preimpact anomalies. An analysis of the airplane's navigation system's light bulbs, suggests that the pilot had selected the GPS mode for the initial approach, but had not switched to the proper instrument approach mode to allow the autopilot to lock onto the ILS. ", "probable_cause": "The pilot's failure to maintain sufficient airspeed to avoid a stall during an instrument final approach to land, which resulted in an inadvertent stall/spin. Factors associated with the accident are the inadvertent stall/spin, the pilot's failure to follow procedures/directives, and clouds."}