{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-elkins", "date": "Dec 28, 1997 at 1340 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Golden Eagle Aviation - USA", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Elkins - Orlando", "msn": "421C-1059", "yom": 1981, "flight_number": null, "city": "Elkins", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3100, "captain_hours_type": 60, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3593, "circumstances": "The pilot/owner and a flight instructor had flown in to pick-up passengers. The owner was not multiengine rated and was receiving instruction from the instructor. The airplane was fueled and two adults and three children were boarded about 1 hour later. The owner was the flying pilot in the left seat. The owner stated that the 4,500 foot long runway was covered with 2 1/2 to 3 inches of snow and slush. He further stated that during the takeoff roll, 'The snow was so bad we could not get off the ground...' The pilot estimated that he aborted the takeoff at 100 mph, the braking action was zero, and the airplane went off the end of the runway. According to a witness, the five passengers arrived with 'lots of heavy bags.' After the accident, the baggage was removed before it could be weighed. An estimated airplane takeoff weight of 7,856 pounds was computed without baggage, based upon weights from the airplane weight and balance form, the police report, and FAA records. According to the Pilot's Operating Handbook, the maximum takeoff weight was published at 7,560 pounds.", "probable_cause": "The flight instructor's failure to identify an unsafe runway condition and his delay in aborting the takeoff. Contributing was the aircraft's maximum takeoff weight exceeded, and a snow covered runway. "}