{"url": "https://www.baaa-acro.com/crash/crash-cessna-425-conquest-windhoek-3-killed", "date": "Jan 29, 2016 at 1010 LT", "type": "Cessna 425 Conquest", "operator": "Eros-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Windhoek - Windhoek", "msn": "425-0077", "yom": 1981, "flight_number": null, "city": "Windhoek-Hosea Kutako", "zone": "Khomas Region", "country": "Namibia", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 11686, "captain_hours_type": null, "copilot_hours": 3765, "copilot_hours_type": 256, "aircraft_hours": 10108, "circumstances": "On 29 January 2016, at 08:10 a Cessna 425 Conquest, which was privately operated, crashed approx. 300 meters NNE of threshold Runway 26. 1.1.2 According to the flight plan filled on the 28th January 2016, the flight was scheduled for a renewal of CPL and IR ratings for the two pilots by a Designated Examiner (DE). Departure time was scheduled at 07:45 at a cruising altitude of FL100 for Hosea Kutako Airport. The pilots requested a procedure for an Instrument Landing System (ILS) approach. The Air Traffic Controller (ATC) cleared them for the procedure for runway 26 ILS approach with QNH 1024. They were also asked to report when at nine miles-inbound. At around nine miles they reported their location and were instructed to continue the approach along the glide slope. The DE requested a VOR approach for their next approach and an early right hand turnout that was approved by ATC who also required them to report when going around. The ATC stated that he saw them at around 4nm on final approach. He then stated that he looked away for a moment after which he heard a slight bang, then saw a ball of flames at about 300 meters north of threshold runway 26. He called out to the aircraft three times whilst looking out for it when he finally concluded that it could have been V5-MJW that had crashed. The ATC pressed a crash alarm after a moment when it did not go off, the controller then called the fire station and alerted them of the occurrence. The Airport’s Fire and Rescue team after receiving the initial notification from the ATC took around 10 minutes to reach the site, by that time fire had engulfed the plane and its occupants. The team took 3-4 minutes to extinguish the fire. The weather was reported as fine with winds about 140° at 08 kts with scattered clouds at 4000ft and unrestricted visibility.", "probable_cause": "The aircraft stalled at low altitude and consequently impacted the ground.\r\nContributory Factors:\r\n- Loss of control of the aircraft,\r\n- Non-adherence of go-around procedures as set on the AIP,\r\n- Normalization of deviation -where non-standard go-around procedures are executed."}