{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh89a-dragon-rapide-near-edale", "date": "Dec 30, 1963", "type": "De Havilland DH.89 Dragon Rapide", "operator": "Solair Flying Services", "flight_phase": "Flight", "flight_type": "Aerial photography", "survivors": "Yes", "site": "Mountains", "schedule": "Middleton Saint George – Birmingham", "msn": "6572", "yom": 1948, "flight_number": null, "city": "Edale", "zone": "Derbyshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a flight from Middleton St. George to Birmingham, and the crew of one pilot and one photographer planned to complete several photographic survey jobs en route. Shortly after sunset, when flying at 2,000 ft. a.m.s.l. at an estimated position five miles west of Sheffield and near high ground rising to 2,000 ft. a.m.s.l., the pilot decided that the fuel remaining was insufficient to reach Birmingham with the existing headwind of 40 knots. He established contact with Manchester Approach Control and was given permission to divert to Manchester Airport on a special VFR clearance \"not above 3,500 ft. a.m.s.l. on a QNH of 1013 mbs., clear of all cloud, and in sight of the surface\". Shortly after this, when on a north-westerly heading to intercept a QDM of 270°M to the 'ME' (Manchester) beacon, the pilot saw hill tops about four miles ahead and commenced climbing from 2,000 ft. to 3,500 ft. The pilot states that the aircraft entered cloud at 2,500 ft. and that, on reaching 2,700 ft., he noticed that the vertical speed indicator was showing a descent of 2,000 ft./min. He states that he applied full power and eased the nose up but, after this, he remembers nothing further until he regained consciousness lying on the ground, alongside the photographer in front of the wrecked aircraft. ", "probable_cause": "Examination at the scene of the accident showed that the aircraft had struck the ground, in a normal cruising attitude and at a low engine power setting, at a point 1,990 ft. a.m.s.l. An aftercast of the weather conditions showed that the cloud base over the hills at the time of the accident probably varied between 1,800 and 3,000 ft. a.m.s.l., the wind at 2,000 to 3,000 ft. was 240°/45-50 knots, and horizontal visibility was 1 1/2-3 n.m. with some turbulence over high ground. \"Sigmet\" warnings broadcast by Preston A.T.C.C, and in force at the time of the accident, gave warning that locally severe turbulence, up to FL 100 over high ground in the Preston FIR had been forecast. From the information available, however, it was not possible to determine whether significant downdrafts existed in the area where the crash occurred. "}