{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-251-near-thiells-3-killed", "date": "Dec 1, 1974 at 1926 LT", "type": "Boeing 727-200", "operator": "Northwest%20Airlines2", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Plain, Valley", "schedule": "New York - Buffalo", "msn": "20296/777", "yom": 1969, "flight_number": "NW6231", "city": "Thiells", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 7434, "captain_hours_type": 1973, "copilot_hours": 1938, "copilot_hours_type": 1611, "aircraft_hours": 10289, "circumstances": "Flight NW6231 departed New York-JFK at 19:14 for a ferry flight to Buffalo and was cleared by departure control to climb to FL140. At 19:21 the flight was cleared to climb to FL310. The aircraft began to climb 2,500 fpm at an airspeed of 305 knots. As the aircraft climbed through FL160, both the airspeed and the rate of climb began to increase. Reaching FL230, the airspeed had reached 405 knots and the rate of climb had exceeded 6,500 fpm. The overspeed warning horn sounded a little later, followed 10 seconds later by a stick shaker stall warning. The aircraft then leveled at 24800 feet with a speed of 420 knots until it turned rapidly to the right, 13 seconds later. The airplane started to descend out of control, reaching a vertical acceleration of +5g until it struck the ground in a slightly nose down and right wing-down attitude. The aircraft had descended from 24000 feet to 1090 feet in 83 seconds.", "probable_cause": "The loss of control of the aircraft because the flight crew failed to recognize and correct the aircraft's high-angle-of-attack, low-speed stall and its descending spiral. The stall was precipitated by the flight crew's improper reaction to erroneous airspeed and Mach indications which had resulted from a blockage of the pitot heads by atmospheric icing. Contrary to standard operational procedures, the flight crew had not activated the pitot head heaters."}