{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b90-king-air-dodge-city-3-killed", "date": "Feb 17, 2004 at 0257 LT", "type": "Beechcraft 90 King Air", "operator": "Ballard%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Wichita - Dodge City", "msn": "LJ-377", "yom": 1968, "flight_number": null, "city": "Dodge City", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3066, "captain_hours_type": 666, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9005, "circumstances": "The emergency medical services (EMS) airplane was destroyed by terrain impact and post impact fire about 7 nautical miles (nm) west of its destination airport, Dodge City Regional Airport (DDC), Dodge City, Kansas. The 14 Code of Federal Regulations Part 91 positioning flight departed the Wichita Mid-Continental Airport (ICT), Wichita, Kansas, about 0215 central standard time and was en route to DDC. Night visual meteorological conditions prevailed when the accident occurred about 0257 central standard time. The flight had been on an instrument flight rules (IFR) flight plan, but the pilot cancelled the IFR flight plan about 34 nm east of DDC and initiated a descent under visual flight rules. Radar track data indicated that the airplane maintained a magnetic course of about 265 degrees during the flight from ICT to DDC. The rate of descent was about 850 to 950 feet per minute. During the descent, the airplane flew past the airport on a 270 degree course. Witnesses in the area reported hearing the engine noise of a low-flying airplane followed by the sound of impact. One of the witnesses described the engine noise as sounding like the engines were at \"full throttle.\" The on-site inspection revealed that the airplane impacted the terrain in a gear-up, wings-level attitude. The inspection of the airplane revealed no anomalies to the airframe or engines. A review of the pilot's 72-hour history before the accident revealed that it had been 14 hours and 32 minutes from the time the pilot reported for duty about 1225 central standard time until the time of the accident. It had been 20 hours 57 minutes from the time the pilot awoke (0600) on the morning before the accident until the time of the accident. No evidence of pilot impairment due to carbon monoxide, drugs, or medical incapacitation was found. The accident occurred during a time of day that was well past the pilot's normal bedtime and also at a time of day when the physiological need to sleep is especially strong. The findings from a Safety Board's human performance analysis indicates that the pilot was likely fatigued. A review of 14 CFR 135.267 indicated that the pilot had adhered to the flight time limitations and rest requirements specified in the regulation.", "probable_cause": "The pilot failed to maintain clearance with terrain due to pilot fatigue (lack of sleep)."}