{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-60-duke-edenton-1-killed", "date": "Jun 7, 2010 at 1932 LT", "type": "Beechcraft 60 Duke", "operator": "Joseph S. Konicki", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Edenton - Edenton", "msn": "P-13", "yom": 1968, "flight_number": null, "city": "Edenton", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1558, "captain_hours_type": 343, "copilot_hours": 30000, "copilot_hours_type": null, "aircraft_hours": 3562, "circumstances": "The pilot was receiving instruction and an instrument proficiency check (IPC) from a flight instructor. Following an hour of uneventful instruction, the IPC was initiated. During the first takeoff of the IPC, the pilot was at the flight controls, and the flight instructor controlled the throttles. Although the pilot normally set about 40 inches of manifold pressure for takeoff, the flight instructor set about 37 inches, which resulted in a longer than expected takeoff roll. Shortly after takeoff, at an altitude of less than 100 feet, with the landing gear extended, the flight instructor retarded the left throttle at 83 to 85 knots indicated airspeed; 85 knots was the minimum single engine control speed for the airplane. The pilot attempted to advance the throttles, but was unable since the flight instructor’s hand was already on the throttles. The airplane veered sharply to the left and rolled. The pilot was able to level the wings just prior to the airplane colliding with trees and terrain. The pilot reported that procedures for simulating or demonstrating an engine failure were never discussed. Although the flight instructor’s experience in the accident airplane make and model was not determined, he reported prior to the flight that he had not flown that type of airplane recently. The flight instructor was taking medication for type II diabetes. According to his wife, the flight instructor had not experienced seizures or a loss of consciousness as a result of his medical condition.", "probable_cause": "The flight instructor’s initiation of a simulated single engine scenario at or below the airplane’s minimum single engine control speed, resulting in a loss of airplane control. Contributing to the accident was the flight instructor’s failure to set full engine power during the takeoff roll and the flight instructor’s lack of recent experience in the airplane make and model."}