{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh114-heron-sierra-de-luquillo-19-killed", "date": "Mar 5, 1969 at 1738 LT", "type": "De Havilland DH.114 Heron", "operator": "Prinair", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Charlotte Amalie – San Juan", "msn": "14125", "yom": 1961, "flight_number": "PQ277", "city": "Sierra de Luquillo", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 17, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 19, "captain_hours": 26800, "captain_hours_type": 1000, "copilot_hours": 1524, "copilot_hours_type": 1200, "aircraft_hours": 4167, "circumstances": "Prinair flight PQ277 departed Charlotte Amalie Airport (Saint Thomas Island) at 1715LT for an IFR flight to San Juan. At 17:32, the flight contacted San Juan Approach Control and advised that the flight was maintaining 4,000 feet. The trainee approach controller replied: \"Prinair two seven seven San Juan Approach Control radar contact three miles east of Isla Verde fly a heading of two five zero for a vector to ILS final maintain four thousand.\" Actually the flight was 3 miles east of the Fajardo intersection instead of the Isla Verde intersection which is located about 10 miles west of the Fajardo intersection. One minute later the Heron was cleared to descend to 3,000 feet. At 17:38, after being vectored for a runway 07 approach, the airplane contacted trees and crashed, coming to rest near the top of a knoll in the Sierra de Luquillo mountains at an elevation of about 2400 feet (731 m). The wreckage was found about 24 km southeast of San Juan-Isla Verde Airport and all 18 occupants were killed. ", "probable_cause": "The vectoring of the aircraft into mountainous terrain, under IFR conditions, without adequate obstruction clearance altitude by a controller who, for reasons beyond his control, was performing beyond the safe limits of his performance capability and without adequate supervision."}