{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-27-islander-near-tuktoyaktuk-7-killed", "date": "Dec 3, 1993 at 1713 LT", "type": "Britten-Norman Islander", "operator": "Arctic Wings & Rotors", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Tuktoyaktuk - Inuvik", "msn": "398", "yom": 1974, "flight_number": null, "city": "Tuktoyaktuk", "zone": "Northwest Territories", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 3224, "captain_hours_type": 848, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9391, "circumstances": "On 03 December 1993, a Britten-Norman BN2A-20 Islander, registration C-GMOP, owned and operated by Arctic Wings and Rotors, departed Tuktoyaktuk, Northwest Territories, on a night\r\nvisual flight rules (VFR) flight to the Inuvik townsite airstrip. On board were the pilot and six passengers. The pilot took off from runway 09 at 1706:34 mountain standard time (MST) , and had turned the aircraft to a southerly direction when the right engine (Textron Lycoming IO540-K1B5) lost all power. At 1710:40, the pilot reported to Tuktoyaktuk Flight Service Station (FSS) that he had an engine problem and was trying to get back to the airport. At 1711:44, he reported that he was \"presently heading back to the airport at this time.\" At 1711:58, he reported \"showing six miles back from the airport at this time.\" The FSS specialist asked if he was declaring an emergency, and the pilot's response was indecisive. During the last radio transmission, there were indications of stress in the pilot's voice; however, there was no further mention of the specific nature of the problem. The pilot did not report his altitude during the conversations with the FSS. The transmission lasted approximately 15 seconds and ended at 1713:03. When the aircraft did not return to the airport, an air and ground search was initiated. The aircraft was located on an ice-covered lake approximately eight miles southeast of the airport. The aircraft struck the ice in a steep nose-down attitude. The engines and front of the aircraft penetrated the approximately two-foot-thick layer of ice. The remainder of the fuselage, wings, and empennage remained on the ice surface. The seven occupants were fatally injured. The accident occurred during the hours of darkness at approximately 1713 MST, at latitude 69°20'N, longitude 132°56'W, at an elevation of approximately 50 feet above sea level (asl).", "probable_cause": "A magneto impulse coupling, worn beyond the prescribed limits, resulted in the failure of the right engine. Following the engine failure, the pilot mistrimmed the rudder and was unable to maintain control of the aircraft."}