{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31p-pressurized-navajo-czestochowa-11-killed", "date": "Jul 5, 2014 at 1611 LT", "type": "Piper PA-31-310 Navajo", "operator": "Omega Skydiving School", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Częstochowa - Częstochowa", "msn": "31P-7630005", "yom": 1976, "flight_number": null, "city": "Częstochowa-Rudniki", "zone": "Silesian Voivodeship (Śląskie)", "country": "Poland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 11, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 996, "captain_hours_type": 40, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft was engaged in a series of skydiving flights at Częstochowa-Rudniki Airport, Silesia. It took off from runway 26C with 11 skydivers and one pilot on board. During initial climb, at an altitude of 100 metres, the pilot encountered technical problems with the engines and elected to make an emergency landing. He informed the passengers about the emergency situation and reduced his altitude when the aircraft rolled to the left to an angle of 70° then stalled and crashed in a wooded area, bursting into flames. The wreckage was found 4,200 metres past the runway end. Three skydivers were seriously injured while 9 other occupants were killed. Few minutes later, two of the survivors died from their injuries.", "probable_cause": "The following findings were identified:\r\n- The aircraft was operated without a valid CofA, \r\n- Failure of the left engine during initial climb after the crankshaft failed, causing the malfunction of the propeller that could not be feathered, resulting in an asymmetry that caused the aircraft to enter a stall condition. Damages to the pin clutch connecting the crankshaft to the drive shaft of the right engine transmission could be due to the following causes: an earlier impact of a propeller's blade with an obstacle, in circumstances and time which could not be determined and/or a long-term fatigue process caused by uneven engine operation (one of the cylinders was replaced on the right engine),\r\n- Improper maintenance of the aircraft,\r\n- The left engine was producing low power due to improper operation, \r\n- The fuel in the tanks did not meet the engine manufacturer's requirements, \r\n- The aircraft was modified in violation of its Type Certificate, \r\n- A high ambiant temperature."}