{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2sx-jyl-kol-3-killed", "date": "May 24, 2013 at 1002 LT", "type": "PZL-Mielec AN-2", "operator": "Valor Air", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Tash Kumyr - Tash Kumyr", "msn": "1G153-56", "yom": 1974, "flight_number": null, "city": "Jyl-Kol", "zone": "Jalal-Abad Province", "country": "Kyrgyzstan", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 9818, "captain_hours_type": 6518, "copilot_hours": 4334, "copilot_hours_type": 2401, "aircraft_hours": 10995, "circumstances": "The crew was engaged in a fumigation mission against locusts over plantation located near Jyl-Kol, in the Jalal-Abad Province. While flying at a height of about 15 metres, the aircraft hit power cables and crashed, bursting into flames. All three occupants were killed and aircraft was destroyed by post crash fire. \n", "probable_cause": "In violation of Section 5.1.15 of the Guidelines for Aviation Chemical Works (ACW), the Aircrew Commander (AC) decided to combine the production flight with followed inspection of the new site, taking a representative of the Customer on board. In violation of Section 5, PPLS, the passenger was seating in the co-pilot seat and this is prohibited. Before making a decision to operate a flight, the Aircrew Commander received an indicative weather forecast from the hydro meteorology experts of Osh International Airport. The revised weather forecast was not drawn up and the crew did not receive it because the flight control officer did not send an actual weather data  provided by the crew after take-off, in accordance with the requirements of paragraph 8.7.7, APKR-3 . The technology of air traffic controllers’ work at Osh International Airport does not include responsibility for the transfer of information about the actual weather obtained from the crews to base aerodrome meteorological office responsible for forecasting weather and it does not specifically define the actions of air traffic services in obtaining information about an aviation accident. No changes were made in the temperature regime when performing aviation chemical works in accordance with the Guidelines for the Implementation of ACW technology in Agriculture and Forestry” designed by the Civil Aviation Ministry, USSR, and issued on December 30, 1980,  Number 668/Y (these instructions were entered into operation by the order of the Director of the Civil Aviation Department under the Kyrgyz Ministry of Transport and Communications on March 20, 2009,  number 188/p in the “List of Legislative Acts Regulating the Civil Aviation Activities of the Kyrgyz Republic”). Portable emergency radio beacon, PARM -406, did not function at the time of the accident. The Statute of Aeronautical Search and Rescue Service of the Kyrgyz Republic has no changes related to its reorganization in 2007."}