{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e18-mt-haleakala-9-killed", "date": "Apr 22, 1992 at 1553 LT", "type": "Beechcraft E18", "operator": "Scenic%20Air%20Tours", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Hilo - Honolulu", "msn": "BA-308", "yom": 1957, "flight_number": "SAT022", "city": "Mt Haleakala", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 2100, "captain_hours_type": 465, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15925, "circumstances": "During the air tour flight the pilot had radioed his intentions to FSS to overfly an area about 5 miles southwest of the island of Maui. Approximately 10 minutes later the airplane impacted mountainous terrain on the island. IMC prevailed at the time and location of the accident. The pilot did not possess the minimum hours stipulated in the company ops manual to qualify as a captain. He falsified the employment application and resume. The company did not pursue substantive pre employment background checks, nor were they required by the FAA to do so. Regulations are needed for air tour operators that will enable FAA inspectors to require, rather than merely encourage, operators to adhere to procedures that offer the safety improvements of sfar 50-2 and FAA handbook 8400.10 bulletin 92-01. All nine occupants were killed. ", "probable_cause": "The captain's decision to continue visual flight into instrument meteorological conditions that obscured rising mountainous terrain and his failure to properly use available navigational information to remain clear of the island of Maui. Contributing to the accident was the failure of Scenic Air Tours to conduct substantive pilot pre-employment background screening, and the failure of the Federal Aviation Administration to require commercial operators to conduct substantive pilot pre-employment screening."}