{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-111-mulhouse-3-killed", "date": "Jun 26, 1988 at 1445 LT", "type": "Airbus A320", "operator": "Air-France-31", "flight_phase": "Flight", "flight_type": "Demonstration", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Basel - Mulhouse - Basel", "msn": "009", "yom": 1988, "flight_number": "AF296Q", "city": "Mulhouse-Habsheim", "zone": "Haut-Rhin", "country": "France", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 130, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 10463, "captain_hours_type": 138, "copilot_hours": 10853, "copilot_hours_type": 44, "aircraft_hours": 22, "circumstances": "A newly delivered Airbus A320, F-GFKC, was destroyed when it impacted trees during a low pass over the runway at Mulhouse-Habsheim Airport, France. A fire broke out, killing three occupants. The Mulhouse Flying Club had requested Air France to perform a fly by at their air show at Mulhouse-Habsheim Airport on June 26, 1988. Air France prepared a low speed pass with the gear down at 100 feet and the another pass at high speed in clean configuration. While Air France had performed more than twenty low passes since 1987, the altitude of 100 feet was not allowed according to regulations. French air safety regulations imposed a minimum VFR overflight height of 170 feet. The fly by was to be performed using an Airbus A320, an aircraft model that was introduced by launching customer Air France in March 1988. F-GFKC was the third A320 in the fleet and had been delivered on June 23. The flight crew scheduled to perform the demonstration flight were two captains: the head of A320 training subdivision (Pilot Flying) and a captain participating in the placing into service of the A320(Pilot Monitoring). On board the flight were four cabin crew members and 130 passengers. The aircraft took off from nearby Basel-Mulhouse Airport at 14:41 and climbed to 1000 feet agl. The crew started the descent three minutes later and Habsheim was in sight at 450 feet agl. The Pilot Monitoring informed the Pilot Flying that the aircraft was reaching 100 feet at 14:45:14. The descent continued to 50 feet 8 seconds later and further to 30-35 feet. Go-around power was added at 14:45:35. The A320 continued and touched trees approximately 60 meters from the end of runway 34R at 14:45:40 with a 14 degree pitch attitude and engines at 83% N1. The plane sank slowly into the forest and a fire broke out.", "probable_cause": "The Commission believes that the accident resulted from the combination of the following conditions: \r\n1) Very low flyover height, lower than surrounding obstacles; \r\n2) Speed very slow and reducing to reach maximum possible angle of attack; \r\n3) Engine speed at flight idle; \r\n4) Late application of go-around power. \r\nThis combination led to impact of the aircraft with the trees. The Commission believes that if the descent below 100 feet was not deliberate, it may have resulted from failure to take proper account of the visual and aural information intended to give the height of the aircraft."}