{"url": "https://www.baaa-acro.com/crash/crash-vickers-745d-viscount-near-brunswick-11-killed", "date": "May 20, 1958 at 1129 LT", "type": "Vickers Viscount", "operator": "Capital-Airlines3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Chicago – Pittsburgh – Baltimore", "msn": "108", "yom": 1956, "flight_number": "CA300", "city": "Brunswick", "zone": "Maryland", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 12719, "captain_hours_type": 1432, "copilot_hours": 2467, "copilot_hours_type": 1596, "aircraft_hours": null, "circumstances": "On may 20, 1958, about 1129 e. d. t., a Capital Airlines Viscount, N 7410 and a Maryland Air National. Guard T-33, 35966, collided in the air about four miles east-northeast of Brunswick, Maryland. Seven passengers and the crew of four aboard the Viscount were killed. A passenger in the T-33 was killed but the pilot, although severely burned, parachuted safely. Both aircraft were totally destroyed by in-flight collision, ground impact, and the ensuing fire. The collision occurred at an altitude of about 8,000 feet on Victor Airway lilt while the Viscount was descending en route from Pittsburgh to Baltimore-Friendship Airport. It was operating on an instrument flight rules flight plan but in visual flight rules weather conditions. The T-33 pilot was on a VFR proficiency flight from Martin Airport, Baltimore, Maryland. Just before the collision the aircraft were observed in the area west of Brunswick flying parallel easterly courses with the T-33 some distance behind and to the left of the Viscount. The T-33 quickly overtook the Viscount and made a gentle right turn, during which it struck the forward left side of the fuselage of the Viscount. Both aircraft were being operated in visual flight rules weather conditions and it was therefore the responsibility of each crew to provide separation from other aircraft by visual reference. The right-of-way rules contained in the Civil Air Regulations clearly set out the pilot's responsibility in the overtaking situation. It is the Board's aim to provide for a positive control system of air-craft separation which will not depend upon the \"see and be seen\" principle to prevent the occurrence of collision accidents. The Board has been actively engaged for some time in the development of such a program. Its full implementation is several years away and will be dependent on additional technical improvements in equipment and on the expansion of the air traffic control facilities to accommodate the ever increasing amount of traffic. Since the accident the USAF and Capital Airlines, along with other carriers, in an effort to reduce collision hazards, have required, in general, that all aircraft on airways above 10,000 feet be operated in accordance with IFR.", "probable_cause": "The Board determines the probable cause of this accident was the failure of the T-33 pilot to exercise a proper and adequate vigilance to see and avoid other traffic."}