{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900d-nairobi-2-killed", "date": "Nov 9, 2009 at 0517 LT", "type": "Beechcraft 1900D", "operator": "Bluebird%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Nairobi – Guriceel", "msn": "UE-250", "yom": 1996, "flight_number": null, "city": "Nairobi-Wilson", "zone": "Nairobi City District", "country": "Kenya", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15866, "circumstances": "The airplane departed Wilson Airport at 03:39 hours, transporting a cargo of miraa to Guriceel Airstrip, Somalia. Taxi, take off and climb were uneventful. However, at 04:23 and flying at FL230 the crew contacted Nairobi Area Control Centre (ACC) and requested for a turn back to Wilson Airport due to a 'slight problem'. At about the same time, the aircraft made a right turn from a heading of 50° to 240° magnetic and commenced descent. The crew reported descending to FL220 and expressed intention to descend further to FL180. However, ACC informed the crew to initially maintain FL200 due to traffic moving in the opposite direction. At 04:28 the crew informed ACC that they were unable to maintain FL200 and requested to descend to FL180 having crossed the opposite traffic. At 04:29, the crew confirmed to Air Traffic Control (ATC) that they were heading to Wilson Airport and indicated that they did not require any assistance. The aircraft continued descending until FL120. The Nairobi Approach Radar established contact with the aircraft at 04:41 and indicated to the crew that they were 98 nautical miles North East of November Victor. The crew was then told to turn left to a heading of 225° and report when they were top of descent, which they did. The crew reported again that they had a 'slight problem' and as a safety measure they had to shut down one engine. They also expressed desire to route direct to Silos. At 04:42 5Y-VVQ aligned with the North East access lane via Ndula Marker. At 04:45, the crew confirmed to Nairobi Approach Radar that the malfunction was on the left engine and again acknowledged that they did not require any assistance. At 04:51, the crew requested for radar vectors for an ILS approach to runway 06 at Jomo Kenyatta International Airport with a long final to runway 32 of Wilson Airport. At 05:09, the aircraft descended to 8000ft heading 260°. At 05:14, the crew was given vectors for runway 32 Wilson Airport. At the same time, the aircraft turned right to a heading 310° as it continued to descend to 7000ft. The crew confirmed the vectors and at 05:15 stated that they were passing Visual Meteorological Conditions (VMC). They were also informed that the Wilson Airport runway 32 was 6.5 nautical miles away in the two o'clock direction. The aircraft continued to descend to 6000ft and at 05:16, the crew confirmed sight of runway 32. The crew was then transferred from the radar to the Wilson Tower frequency for landing. 5Y-VVQ was cleared for a straight-in approach to runway 32. Wilson Tower then communicated to the crew airfield QNH was 1022hPa and that winds were calm. The Tower controller had 5Y-VVQ visual and it was cleared to land on runway 32. At about the same time, the aircraft made a 5° right bank and again leveled off before making a steep left bank rising to 30° within 4 seconds. According to Tower and eyewitness information, the aircraft appeared high on approach and on short-final, it was observed to turn a bit to the right. This was followed by a steep left bank. The aircraft left wing hit the ground first approximately 100 meters outside the airport perimeter fence. The aircraft then flipped over, hitting and breaking the airport fence and coming to rest on the left of runway 32 approximately 100 meters from its threshold. The aircraft immediately caught fire upon the impact. Upon further investigations and interview of company personnel, it was established that the crew had made the decision to shut down the left engine following a low oil pressure warning. The flight crew did not declare an emergency.", "probable_cause": "The investigation determined the probable cause of the accident as loss of aircraft control at low altitude occasioned by operation of the aircraft below VMCA during one engine inoperative approach.\r\nOther significant contributory factors to this accident include:\r\n- Inadequate pilot training on single engine operation and VMCA;\r\n- inappropriate handling technique during one engine inoperative flight;\r\n- inability of the pilot to monitor the degrading airspeed."}