{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-stanwell-park-3-killed", "date": "Nov 1, 1988 at 1740 LT", "type": "Piper PA-31-310 Navajo", "operator": "Delhi Australian Petroleum", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Nowra - Nowra", "msn": "31-364", "yom": 1968, "flight_number": null, "city": "Stanwell Park", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft had been modified by the installation of an air driven winch for the purpose of towing gunnery targets and was operating in conjunction with a warship for scheduled sea/air gunnery practise. Weather conditions in the area were reported as overcast at 4000 feet, wind 060 degrees / 15-20 knots and visibility of 15-20 kilometres. At about 1717 hours the aircraft was instructed to commence carrying out gunnery tracking runs at an altitude of 1000 feet with the sleeve target not deployed. Between 1720 and 1735 hours the aircraft carried out two such runs from the west and east. The aircraft then tracked to the south, away from the ship, to a distance of about 10 kilometres. At about 1738 the aircraft was instructed to turn inbound for a run from astern. At about 1739 hours the pilot reported engine problems and about one minute later advised \"I've got problems, Mayday, I'm going in\". Crewmen stationed near the stern of the ship, reported seeing the aircraft dive into the sea. The warship was immediately turned back towards the crash position. Other warships and aircraft were also ordered to the crash position. The only wreckage sighted was at the crash datum and was believed to have been a section of wing. This wreckage was located about two metres below the surface and sank before it could be recovered. The approximate depth of water at the crash position is 450 fathoms. No trace of the aircraft or its occupants has been discovered to date. ", "probable_cause": "The subsequent investigation established that the flight crew were properly qualified to conduct the flight, and that the aircraft was appropriately certified and maintained. The flight was conducted in accordance with the conditions of the operating contract. At the time of the occurrence the aircraft had not deployed the sleeve target and no firing was being carried out. No evidence was found to suggest an in-flight structural failure or fire. The installation of the target towing equipment was not considered to have been a factor in the development of the accident. There was a loss of control of the aircraft following an apparent engine malfunction. The precise reasons for the accident have not been established. \r\nThe following factors were considered relevant to the development of the accident:\r\n1. Apparent engine failure or malfunction.\r\n2. Control of the aircraft was lost for reasons which have not been determined. "}