{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-049-constellation-shannon-9-killed", "date": "Dec 28, 1946 at 0209 LT", "type": "Lockheed L-049 Constellation", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris – Shannon – Gander – New York", "msn": "2026", "yom": 1945, "flight_number": "TW6963", "city": "Shannon", "zone": "Munster", "country": "Ireland", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 4, "pax_on_board": 14, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 2964, "captain_hours_type": 114, "copilot_hours": 1978, "copilot_hours_type": 70, "aircraft_hours": 1098, "circumstances": "At 0135 the flight transmitted a report to Shannon Radio indicating its position as over the Irish coast at 7,000 feet. At this time the flight was cleared to cross the Limerick marker at 5,000 feet. Shortly thereafter Shannon Radio advised the flight of the Shannon weather. Visibility 2 miles, 10/10 cloud cover at 900 feet, 3/10 at 500 feet, wind 160 degrees, 5 knots, altimeter setting 30 04 inches. At 0153 the flight reported over the Shannon radio range station at 5,000 feet and was given clearance to descend on the SE leg. While in the procedure turn at 0200 the flight transmitted a position report to Shannon Radio and, in acknowledgement, received a later Shannon weather report. Rain and drizzle, visibility 2 miles, 10/10 cloud cover at 900 feet, 6/10 at 400 feet, wind 120 degrees, 5 knots, altimeter setting 30 04. Receipt of this weather retort was acknowledged and the Shannon control tower cleared the aircraft for approach to Runway 14. At 0206 the flight reported over the range station at 1,200 feet at which time Shannon Tower advised Aircraft 505 that Shannon was reporting 10/10 cloud cover at 400 feet, 4/10 at 250 feet, visibility 1 mile, wind 120 degrees, 5 knots. Upon receiving acknowledgement from the flight Shannon Tower requested the pilot to make a ceiling check. This request was also acknowledged by the flight. At approximately 0208 personnel at Shannon Airport observed Aircraft 505 approach the field on a heading parallel to Runway 32. The aircraft appeared to continue on this heading until over the airport at which time it turned to the right to a heading of approximately north. Shortly thereafter the aircraft disappeared from sight. At approximately 0209 these observers saw a brilliant flash WNW of the airport and heard a loud noise. Realizing that Aircraft 505 had crashed, tower personnel immediately initiated rescue operations and dispatched emergency crews to the scene of the accident.", "probable_cause": "The board determines that the probable cause of this accident was an error in altimeter indication, the primary reason for which was the reversal of the primary and alternative static source lines which leg the pilot to conduct his approach, to the airport at a dangerously low altitude. A contributing factor was the negligence of maintenance personnel in certifying to the satisfactory functioning of the static system although the tests required to determine such a condition were not accomplished. A further contributing factor was the restriction of vision from the cockpit resulting from fogging of the unheated windshield panels."}