{"url": "https://www.baaa-acro.com/crash/crash-fokker-100-heho-2-killed", "date": "Dec 25, 2012 at 0853 LT", "type": "Fokker 100", "operator": "Air%20Bagan", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Mandalay - Heho", "msn": "11327", "yom": 1991, "flight_number": "JAB011", "city": "Heho", "zone": "Shan State", "country": "Myanmar", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 65, "pax_fatalities": 1, "other_fatalities": 1, "total_fatalities": 2, "captain_hours": 5937, "captain_hours_type": 2547, "copilot_hours": 849, "copilot_hours_type": 486, "aircraft_hours": 27378, "circumstances": "On 25 December 2012 at 0603 local Time, an Air Bagan Ltd Fokker 100 aircraft registered XY-AGC (MSN-11327) departed Yangon International Airport (VYYY) on a scheduled passenger flight to Mandalay International Airport (VYMD) with the Pilot in command (PIC) as pilot flying. The aircraft was refueled after 60 passengers disembarked and 46 passengers boarded. The PIC made briefing and completed the aircraft checks. At 0826 local time, departed Mandalay International Airport (VYMD) to Heho Airport (VYHH). On Board the pilot in command (PIC), first officer (FO), 4 cabin crews and 65 passengers (Total 71 POB) and the First Officer was designated as the Pilot Flying for the flight. The aircraft climbed to FL. 130 and cruised with an indicated airspeed of 250 Kts. The Pilot in command contacted Heho ATC at flight level 130 and 50 NM to Heho. Heho ATC provided the present weather condition (wind calm, visibility 3000M, Distinct fog, Temperature 17. C, QNH 1018 mb, RW 36). At about 0836 local time, the first officer started crew briefing and called out \"Radio Altimeter\" alive . The aircraft started descend to 9000ft and continued overhead Heho NDB. At about 0847 local time, while heading 220 degrees and descending to 6000ft and commenced a non-precision Non Directional Beacon (NDB) approach to runway 36. During the final inbound track at about 2.5 NM to the runway at 08:52:349, the EGPWS aural warning called out \"500\". The Pilot in command initiated \"Alt hold\" at about 0853, just before the EGPWS alert \"100\" \"50\" 40\" \"30\" and the aircraft struck 66 KV power lines, trees, telephone cables, fence and collided with terrain short of the runway, coming to rest approximately 0.7 NM from the threshold. During the ground collision, both wings separated and a fire commenced almost immediately. An emergency evacuation was initiated by the cabin crews. One aircraft occupant and one motorcyclist on the ground were fatally injured, 70 of the occupants and one motorcyclist survived and the aircraft was destroyed by fire.", "probable_cause": "Primary Cause:\r\n- During the final approach, the aircraft descended below the MDA and  the crew did not follow the operator SOP's.\r\n- The pilots had no corrective action against to change VMC to IMC during bad weather condition and insufficient time for effective respond to last moment.\r\nSecondary Cause:\r\n- Captain of the aircraft had insufficient assessment on the risk that assigned the FO as PF.\r\n- There may be under pressure by the following aircrafts as the first plane on that day to Heho."}