{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-ellington-2-killed", "date": "Sep 17, 2005 at 2124 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Reacin", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Ellington – Lago Vista", "msn": "46-8508076", "yom": 1985, "flight_number": null, "city": "Ellington AFB (Houston)", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 641, "captain_hours_type": 330, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3916, "circumstances": "The 641-hour private pilot and passenger were departing on a 155-nautical mile night cross country flight. Shortly after the airplane took off, the tower controller heard a weak transmission that she could not completely understand, but did hear the words \"engine\" and \"power.\" The controller asked the pilot to \"say again\", but there was no response. She again asked, \"say again\" and the pilot transmitted, \" I'm going down.\" There were no further communications from the pilot. While approximately 400 feet above ground level, the airplane's engine stopped producing power. While in a left turn, the left wingtip impacted the ground and the airplane cartwheeled. The debris field encompassed an area approximately 125 feet long and approximately 50 feet wide. Witness reports of the airplane's flight path along with the wreckage distribution path were consistent with the pilot's attempt to return to the airport. A post-impact fire consumed the fuselage and caused extensive thermal damage to the engine and wings. An examination of the wreckage revealed the landing gear and wing spoilers were in the retracted position. The position of the flaps could not be determined. No mechanical deficiencies were noted with the airframe that could have prevented normal operations. Examination of the engine revealed no preimpact anomalies. The reason for loss of engine power could not be determined.", "probable_cause": "The pilot's improper in-flight decision to maneuver back to the departure airport following a loss of engine power on initial climb. Contributing factors were the loss of engine power for undetermined reasons, and the dark night conditions."}