{"url": "https://www.baaa-acro.com/crash/crash-lockheed-wv-3-super-constellation-pacific-ocean", "date": "Sep 17, 1956 at 2200 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "US%20Navy", "flight_phase": "Flight", "flight_type": "Meteorological / Weather", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Andersen - Andersen", "msn": "4380", "yom": 1956, "flight_number": null, "city": "Pacific Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 18, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 723, "circumstances": "The Lockheed WV-3 Super Constellation, BuNo 137893, took off from Guam at 06:00 in the morning of September 1956 on a weather recon mission with an 18 man crew. The flight was normal for the first 14 hours or so. On the return leg, when the flight was 200 miles from Guam, when it lost engine #1 due to oil starvation. The engine was shut down and the propeller feathered. The pilot reported his position to Guam central and the radioman sent the position to the VW3 squadron duty office where it was tracked. The flight continued toward Guam at an altitude of 1200 feet. With 100 miles to go #4 engine experienced complete loss of power and was shut down. The propeller was feathered. However, the propeller never went to full feather and windmilled. There was a violent swerve to the right. Shortly after this, engines #2 and #3 started to lose power. At 80 miles from Guam and losing altitude at 500 to 700 feet per minute the captain decided to ditch the aircraft while he still had lateral control and issued the \"Prepare to Ditch\" command. Navigator Wanbaugh gave an updated position report to the pilot and radioman for the \"May-Day\" transmissions. A ditching was carried out. All 18 occupants climbed into two life rafts, already deployed, and pushed off at around 22:00. At about 03:20 on September 18th, the life rafts were sighted by a P2V Neptune aircraft flying search and rescue. The occupants were rescued by Coast Guard Cutter Buttonwood.\r\nSource: \r\nhttps://aviation-safety.net/database/record.php?id=19560917-1", "probable_cause": null}