{"url": "https://www.baaa-acro.com/crash/crash-convair-rb-36h-25-cf-peacemaker-random-island-23-killed", "date": "Mar 18, 1953 at 0410 LT", "type": "Convair B-36 Peacemaker", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Mountains", "schedule": "Lajes – Saint John’s – Rapid City", "msn": null, "yom": null, "flight_number": null, "city": "Random Island", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 18, "pax_fatalities": 18, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Capt. Jacob Pruett Jr., Capt Orion Clark, Brigadier General Richard Ellsworth, Major Frank Wright and a crew of nineteen took off in RB-36H, 51-13721 of the 28th Strategic Reconnaissance Wing (Heavy) from Lajes Airdrome in the Azores at 0000 Zulu (11:00 PM Azores time) on March 18, 1953. Their destination was their home base of Rapid City Air Force Base, South Dakota. Their flight path took them across the Atlantic Ocean and over Newfoundland. The flight was expected to take 25 hours. The pre-flight weather briefing indicated that their flight path would take them to the south of a low pressure zone. The counter-clockwise rotation of the low would produce headwinds that were forecast to average 17 knots from 300 degrees. General Ellsworth and Major Wright were not current in take-offs and landings, so Capt. Jacob Pruett Jr. and Capt Orion Clark were probably at the controls during the take-off. Major Wright then moved into the pilot's seat on the left and General Ellsworth got into the co-pilot's seat on the right. Major Wright and General Ellsworth flew the over water portion of the flight about 1,000 feet off the water for best range performance. They monitored their altitude above the water with the radar altimeter as they flew through the darkness. The navigator intended to turn on the mapping radar an hour before the time that he expected the RB-36H to reach land. The pilots planned to climb to an altitude that would carry the RB-36H safely over the mountains of Newfoundland while they were still 20 miles from land. Most of the flight was flown in overcast conditions that prevented the navigator from using the sextant for a celestial observation to determine the true position of the airplane. The low pressure zone moved south of its predicted position before the RB-36H reached its vicinity. The airplane passed to the north of the low. Instead of the anticipated headwinds, the airplane encountered tailwinds that averaged 12 knots from 197 degrees. Ocean station delta received a position update from the RB-36H at 0645Z. The navigator reported that the ground speed of the airplane was 130 knots. The position was in error by 138 nautical miles, and the true ground speed was closer to 185 knots. The RB-36H reached Newfoundland about 1-1/2 hours earlier than expected. The crew made no attempt to contact air defense when they were fifty miles off shore. The navigator did not turn on the radar. The pilots continued to fly at low altitude. In the last twenty minutes of the flight, the ground speed averaged 202 knots. The visibility was less than 1/8-mile as the airplane flew straight and level through sleet, freezing drizzle, and fog. At 0740Z (4:10 AM Newfoundland time), thirty miles after crossing the coastline the RB-36H struck an 896-foot tall ridge at an elevation of 800 feet. The six whirling propellers chopped the tops off numerous pine trees before the left wing struck the ground. The left wing ripped off of the airplane, and spilled fuel ignited a huge fireball. The fuselage and right wing impacted 1,000 feet beyond the left wing. The entire crew was killed on impact. Wreckage was strewn for 3/4-mile across the hillside. U. S. Air Force 1st Lt Dick Richardson heard the RB-36H approaching his cabin at Nut Cove. The sound of the engines stopped suddenly, to be replaced by a loud explosion. Richardson reported that, \"Everything lit up real bright\". He could see a fire burning on the hillside above. He woke up the other men on the hill. They boiled up the kettle and sent a search party up to the crash site through deep snow. They found no survivors. Following this tragedy, the Rapid City\tairbase will be renamed Ellsworth AFB to honor the general.\r\nCrew:\r\nCpt Jacob Pruett Jr., \r\nCpt Orion Clark, \r\nBr Gen Richard Ellsworth, \r\nMaj Frank Wright,\r\nCpt Stuart Fauhl,\r\nCpt Harold Smith,\r\nCpt William Maher,\r\n1st Lt Edwin Meader,\r\n1st Lt James Pace,\r\nMaj John Murray,\r\n1st Lt James Powell Jr.,\r\nA2cC Robert Nall,\r\n1st Lt Clifford Bransdor,\r\nM/Sgt Jack Winegardner,\r\nA2cC Morris Rogers,\r\nT/Sgt Walter Pinski,\r\nA1c Burse Vaughn,\r\nS/Sgt Ira Beard,\r\nS/Sgt Robert Ullom,\r\nA2c Phillip Mancos Jr.,\r\nA2c Keith Hoppons,\r\nA1c Theodore Kuzik,\r\nT/Sgt Jack Maltsberger.\r\nSource: \r\nhttp://www.air-and-space.com/b-36 wrecks.htm#51-13721", "probable_cause": "The accident investigation board recommended that a forward looking radar should be developed to provide warning of high terrain ahead of an airplane. Navigators were instructed to scan for land with the radar every six minutes and pilots were instructed to climb to a safe altitude whenever the estimated position of the airplane was within 200 miles of land."}