{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-880-22-1-cincinnati-70-killed", "date": "Nov 20, 1967 at 2057 LT", "type": "Convair CV-880", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Los Angeles - Cincinnati - Pittsburgh - Boston", "msn": "22-00-27", "yom": 1961, "flight_number": "TW128", "city": "Cincinnati-Northern Kentucky", "zone": "Kentucky", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 5, "pax_on_board": 75, "pax_fatalities": 65, "other_fatalities": 0, "total_fatalities": 70, "captain_hours": 12895, "captain_hours_type": 1389, "copilot_hours": 2647, "copilot_hours_type": 447, "aircraft_hours": 18850, "circumstances": "Flight 128 was a scheduled domestic flight from Los Angeles International Airport, California, to Boston, Massachusetts, with intermediate stops at Cincinnati, Ohio and Pittsburgh, Pennsylvania. The departure from Los Angeles was delayed due to an equipment change but the aircraft was airworthy at the time of departure. The only carry- over discrepancy was an inoperative generator which had no bearing on this accident. The flight took off from Los Angeles at 1737 hours Eastern Standard Time. The descent into the Cincinnati area from cruising altitude was delayed due to conflicting traffic and was initiated closer to the destination than normal. It required the crew to conduct the descent with a higher than normal rate toward the initial approach fix. The crew discussed the technique they were going to use to increase the rate of descent, and evidence revealed that they were relaxed, unworried and operating within the established operating limits of the aircraft. As the flight reported leaving 15 500 ft remarks were made in the cockpit about the rapidity of the descent and the hope, apparently with reference to the underlying cloud conditions, that it would be a thin layer. The crew checked the anti-icing equipment and conversations after that time indicated that they were not aware of any discrepancies regarding that system. Control of the flight was normal until the flight was turned over to the approach controller who failed to provide the crew with the current altimeter setting of 30.07 in Hg instead of 30.06 previously given to the crew. However, shortly after the crew intercepted a transmission to another aircraft containing the current altimeter setting of 30.07 they set and cross-checked that setting on their altimeters. Throughout the descent, the co-pilot called out the appropriate warnings to the pilot-in-command as the aircraft approached assigned altitudes and apparently performed all of his assigned duties without prompting by the pilot-in-command. Crew coordination was very good during that portion of the flight. The weather conditions in the Cincinnati area were such that the crew should have established visual contact with the ground by the time they reached 3 000 to 4 000 ft. As the flight approached the final fix, approximately 7 minutes before the accident, the crew was given the latest reported weather which indicated that the ceiling was approximately 1 000 ft and the visibility was 13 miles in snow and haze. Approximately 1 minute later they were reminded that the ILS glide slope was out of service, as well as the middle marker beacon and the approach lights. The crew acknowledged receipt of this information and planned their approach to the proper minimum altitude of 1 290 ft AMSL, 400 ft above the ground, to allow for these outages. From this point in the approach to the outer marker, the aircraft altitudes and headings were in general agreement with altitudes reported by the crew and the headings they were instructed to fly. Operation of the aircraft was normal and the proper configuration was established for the approach to the outer marker in accordance with the company's operating instructions. The crew reported over the outer marker at 2056 hours and were cleared to land on runway 18 and advised that the wind was 090°/8 kt and the RVR more than 6 000 ft (see Fig. 22-1). The co-pilot reported to the pilot-in-command that they were past the marker and that there was no glide slope. The pilot-in-command acknowledged this and stated \". . . We gotta go down to, ah, four hundred, that would be, ah.\" At this point, the co-pilot supplied the information \"twelve ninety\" and the pilot-in-command repeated \"twelve ninety.\" The flight had arrived at the outer marker with the landing gear down, the flaps set at 40' down at an altitude of approximately 2 340 it and at an airspeed of approximately 200 kt. (The prescribed minimum altitude over the outer marker beacon, 4 miles from the threshold, was 1 973 ft AMSL). After the aircraft passed the outer marker, a rate of descent of 1 800 ft/min was established at an airspeed of about 190 kt. The rate of descent was greater than that recommended by the company for an instrument approach and remained nearly constant until approximately 20 sec before the first recorded sound of impact. At that time the rate increased to approximately 3 000 ft/min coincident with a request for 50° flaps, and a decrease in thrust, and then decreased to about 1 800 ft/min until about 5 sec before the initial contact. Prior to initial contact, the aircraft was rotated to a virtually level attitude, the rate of descent was decreasing, the airspeed was about 191 kt, and the indicated altitude was about 900 ft AMSL. The aircraft first struck small tree limbs at an elevation of approximately 875 ft AMSL, 9 357 it short of the approach end of runway 18 and 429 it right of the extended runway centre line. After several more impacts with trees and the ground, the aircraft came to rest approximately 6 878 it from the runway and 442 ft right of the extended runway centre line and burst into flames. A stewardess who survived the accident stated that the first noticeable impact felt like a hard landing. None of the survivors recalled any increase of engine power or felt any rotation of the aircraft. The accident occurred at 2057 hours during darkness in an area where snow was falling. Five crew members and 65 passengers were killed while 12 other occupants were seriously injured. ", "probable_cause": "The Board determined that the probable cause of this accident was an attempt by the crew to conduct a night, visual, no-glide-slope approach during deteriorating weather conditions without adequate altimeter cross reference. The approach was conducted using visual reference to partially lighted irregular terrain which may have been conducive to producing an illusionary sense of adequate terrain clearance."}