{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-mac-gillivray-1-killed", "date": "Feb 20, 2001 at 1900 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Confidential Management Services", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Mac Gillivray – Santa Ana", "msn": "46-22059", "yom": 1989, "flight_number": null, "city": "Mac Gillivray", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 12000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4194, "circumstances": "The accident occurred during a dark night departure from a private unlighted airstrip. The pilot had landed, assisted by the headlights of a car, on the landing strip/road about 1830. After dropping off a passenger, he departed about 1900. The departure direction was towards a sparsely populated area of rolling hills. Local area residents reported hearing a plane depart, followed by a loss of engine sound, and an impact in a grape vineyard. Examination of the wreckage revealed that the airplane impacted the ground in a nose down attitude. According to maintenance records, the last recorded annual inspection occurred 12 months and about 299.5 flight hours prior to the accident. Approximately 5 months before the accident, the FAA Certified Repair Station (CRS) that performed the maintenance on the airplane had given the pilot/owner a 15-item list of \"grounding discrepancies.\" The discrepancies were: Cracked nose cowling; fraying seat belts; LH mag switch broken; LH window cracked; LH windshield crazed; stall warning inoperative; turbine inlet temperature inoperative; door latch safety inoperative; several hydraulic components leaking; main gear trunion pins worn; several cracks in wing lower skins; fuel leaks; loose rivets on RH flap; wing spar bolts loose; and elevator trim cable frayed. According to the CRS manager, the only item that had been repaired prior to the accident was the cracked nose cowling. However, an engine log entry indicated the TIT gage had also been replaced. Additionally, several witnesses reported that the pilot had been flying the airplane with an inoperative landing gear retract system for about 4 months. During post accident examination of the wreckage, investigators were able to verify that  many of the listed discrepancies still existed; however, none of these discrepancies could be directly linked to the accident.", "probable_cause": "The pilot/owner/operator's failure to maintain control of the airplane during the takeoff initial climb resulting in an in-flight collision with terrain. Contributing to the accident was the dark night light condition."}