{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-byron-bay-2-killed", "date": "Jan 27, 2004 at 1335 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Coolangatta - Coolangatta", "msn": "61-0497-128", "yom": 1978, "flight_number": null, "city": "Byron Bay", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7127, "captain_hours_type": 308, "copilot_hours": 283, "copilot_hours_type": 3, "aircraft_hours": null, "circumstances": "The Ted Smith Aerostar 601 aircraft, registered VH-WRF, departed Coolangatta at 1301 ESuT with a flight instructor and a commercial pilot on board. The aircraft was being operated on a dual training flight in the Byron Bay area, approximately 55 km south-south-east of Coolangatta. The aircraft was operating outside controlled airspace and was not being monitored by air traffic control. The weather in the area was fine with a south-easterly wind at 10 - 12 kts, with scattered cloud in the area with a base of between 2,000 and 2,500 ft. The purpose of the flight was to introduce the commercial pilot, who was undertaking initial multi-engine training, to asymmetric flight. At approximately 1445, the operator advised Australian Search and Rescue that the aircraft had not returned to Coolangatta, and that it was overdue. Recorded radar information by Airservices Australia revealed that the aircraft had disappeared from radar coverage at 1335. Its position at that time was approximately 18 km east-south-east of Cape Byron. Search vessels later recovered items that were identified as being from the aircraft in the vicinity of the last recorded position of the aircraft. Those items included aircraft checklist pages, a blanket, a seat cushion from the cabin, as well as a number of small pieces of cabin insulation material. No item showed any evidence of heat or fire damage. No further trace of the aircraft was found.", "probable_cause": "Without the aircraft wreckage or more detailed information regarding the behaviour of the aircraft in the final stages of the flight, there was insufficient information available to allow any conclusion to be drawn about the development of the accident. Many possible explanations exist. The fact that no radio transmission was received from the aircraft around the time radar contact was lost could indicate that the aircraft was involved in a sudden or unexpected event at that time that prevented the crew from operating the radio. The speed regime of the aircraft during the last recorded data points indicated that airframe failure due to aerodynamic overload was unlikely. The nature of the items from the aircraft that were recovered from the ocean surface indicated that the aircraft cabin had been ruptured during the accident sequence."}