{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-concord-4-killed", "date": "Jun 14, 1999 at 1257 LT", "type": "Cessna 421C Golden Eagle III", "operator": "David Drye Company", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Concord – Anderson", "msn": "421C-0305", "yom": 1977, "flight_number": null, "city": "Concord-Padgett", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 7500, "captain_hours_type": 3000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5145, "circumstances": "An aircraft mechanic stated one of the airplanes engines was making an unusual noise during takeoff. An Air Traffic Controller stated the flight used about 4,500 feet of runway before lifting off. About 1 minute after being cleared for takeoff, the pilot reported 'were coming around were losing a right engine'. The controller and a witness observed the airplane level off, sway to the left and right, and then descend. The pilot reported he was not going to make it. The airplane was lost from sight behind trees. Post crash examination of the airplane structure, flight controls, engines, and propellers showed no evidence of pre-crash failure or malfunction that would have prevented operation. The landing gear and wing flaps were found retracted. The left and right propellers were found in the low blade angle position and had similar damage. An NTSB sound study of ATC communications showed that at the time the pilot reported they were not going to make it, a propeller signature showed 1,297 rpm and another propeller signature of 2,160 rpm. The engine inoperative procedure contained in the Pilot Operating Handbook for the Cessna 421C, calls for the throttle on the inoperative engine to be closed, the mixture placed in idle cut-off, and the propeller feathered. The Pilot Operating Handbook also showed the airplane would normally use 2,000 feet of runway for takeoff under the accident conditions. ", "probable_cause": "The failure of the pilot to shutdown the right engine and feather the propeller after a reported loss of power in the engine shortly after takeoff resulting in the airplane descending, colliding with trees and then the ground. "}