{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-bwagaoia-4-killed", "date": "Aug 31, 2010 at 1615 LT", "type": "Cessna 550 Citation II", "operator": "Trans Air - Papua New Guinea", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Port Moresby – Bwagaoia", "msn": "550-0145", "yom": 1980, "flight_number": null, "city": "Bwagaoia (Misima Island)", "zone": "Milne Bay", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 14591, "captain_hours_type": null, "copilot_hours": 872, "copilot_hours_type": null, "aircraft_hours": 14268, "circumstances": "The aircraft was conducting a charter flight from Jackson’s International Airport, Port Moresby, National Capital District, Papua New Guinea (PNG), to Bwagaoia Aerodrome, Misima Island, Milne Bay Province, PNG (Misima). There were two pilots and three passengers on board for the flight. The approach and landing was undertaken during a heavy rain storm over Bwagaoia Aerodrome at the time, which resulted in standing water on the runway. This water, combined with the aircraft’s speed caused the aircraft to aquaplane. There was also a tailwind, which contributed the aircraft to landing further along the runway than normal. The pilot in command (PIC) initiated a baulked landing procedure. The aircraft was not able to gain flying speed by the end of the runway and did not climb. The aircraft descended into terrain 100 m beyond the end of the runway. The aircraft impacted terrain at the end of runway 26 at 1615:30 PNG local time and the aircraft was destroyed by a post-impact, fuel-fed fire. The copilot was the only survivor. Other persons who came to assist were unable to rescue the remaining occupants because of fire and explosions in the aircraft. The on-site evidence and reports from the surviving copilot indicated that the aircraft was serviceable and producing significant power at the time of impact. Further investigation found that the same aircraft and PIC were involved in a previous landing overrun at Misima Island in February 2009. ", "probable_cause": "Contributing safety factors:  \r\n• The operator’s processes for determining the aircraft’s required landing distance did not appropriately consider all of the relevant performance factors. \r\n• The operator’s processes for learning and implementing change from the previous runway overrun incident were ineffective. \r\n• The flight crew did not use effective crew resource management techniques to manage the approach and landing. \r\n• The crew landed long on a runway that was too short, affected by a tailwind, had a degraded surface and was water contaminated. \r\n• The crew did not carry out a go-around during the approach when the visibility was less than the minimum requirements for a visual approach. \r\n• The baulked landing that was initiated too late to assure a safe takeoff. \r\nOther safety factors: \r\n• The aircraft aquaplaned during the landing roll, limiting its deceleration. \r\n• The runway surface was described as gravel, but had degraded over time. \r\n• The weather station anemometer was giving an incorrect wind indication."}