{"url": "https://www.baaa-acro.com/crash/crash-boeing-kc-135a-bn-stratotanker-fairchild-afb-7-killed", "date": "Mar 13, 1987 at 1320 LT", "type": "Boeing KC-135 Stratotanker", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Demonstration", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Fairchild AFB - Fairchild AFB", "msn": "18136", "yom": 1961, "flight_number": null, "city": "Fairchild AFB (Spokane)", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 1, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10956, "circumstances": "At 1:20 p.m. on Friday, March 13, 1987, a B-52 Stratofortress and a KC-135 Stratotanker took off from Fairchild Air Force Base (AFB) to practice aerial maneuvers for a 15-minute air show scheduled on Sunday, May 17, Fairchild's annual Aerospace Day. The show was to be the debut of a new aerobatics team dubbed the Thunderhawks, the brainchild of General John T. Chain Jr., commander-in-chief of the Strategic Air Command (SAC). Its purpose was to demonstrate the capabilities of SAC’s large aircraft through a series exciting routines that included a low-level refueling simulation, high-bank turns, and flybys down the runway. Colonel Thomas J. Harris, commander of the 92nd Bombardment Wing at Fairchild AFB had been assigned the responsibility for the Thunderhawks’ creation and development in December 1986. The KC-135A-BN Stratotanker, No. 60-0361, had three instructor pilots aboard the aircraft: Lieutenant Colonel Michael W. Cornett, Captain Christopher Chapman, and Captain Frank B. Johnson.  But no one on the ground at Fairchild knew who was actually in command of the aircraft when it took off. Also on board plane were two navigators, Captain James W. Litzinger and First Lieutenant Mark L. Meyers, and refueling-boom operator, Staff Sergeant Rodney S. Erks. The KC-135 had just taken off from runway 23, in tandem with the B-52, and was executing a steep left-hand turn when it suddenly rolled from an intended 45-degree bank to almost 90 degrees, stalling the two engines on the left wing. The crew managed to level the aircraft, but it was flying too low and slow to recover. The plane crashed landed in an open area north of the flightline, behind three large hangars, narrowly missing the base’s bombing and refueling squadron offices. It skidded through a security fence, across an access road, and killed Senior Master Sergeant Paul W. Hamilton, a member of the Thunderhawks on his day-off from flying, who was sitting in his car watching. The aircraft traveled for another 200 yards, then hit an unmanned weather radar tower and burst into flames.  During the journey, the tail section separated from the fuselage as well as the wings, engines, and wheels.  One wing, ripped off by the collision with the radar tower, landed 50 yards beyond the burning wreckage. Within minutes, Fairchild’s crash teams were on scene, fighting the fire caused by spilled jet fuel. Spokane International Airport, four miles east of the base, dispatched a crash truck and the Spokane Fire Department mobilized an entire engine company to assist in battling the blaze.  Because of the toxic fumes and dangerous flare-ups, reporters and photographers were not permitted near the scene. It took firefighters more than three hours to extinguish the flames and hot-spots from the crash. Searchers found the bodies of five crewmen in the forward section of the blackened fuselage. The body of the sixth crew member was finally found late Friday night, tangled inside the cockpit wreckage. It wasn’t discovered immediately because the recovery teams were being careful to safeguard the crew compartment for the Air Force accident investigators.\r\nThose killed were:\r\nCpt Christophe L. Chapman, pilot,\r\nLt Col Michael W. Cornett, pilot,\r\nS/Sgt Rodney Scott Erks, refueling-boom operator,\r\nSM/Sgt Paul W. Hamilton, refueling-boom operator,\r\nCpt Frank B. Johnson, pilot,\r\nCpt James W. Litzinger, navigator,\r\n1st Lt Mark L. Myers, navigator.\r\nSource: Daryl C. McClary via https://www.historylink.org/File/8871", "probable_cause": "Loss of control caused by wake turbulences. "}