{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90b-king-air-besancon-4-killed", "date": "Oct 19, 2006 at 0042 LT", "type": "Beechcraft 90 King Air", "operator": "Flowair%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Besançon – Amiens", "msn": "LJ-1321", "yom": 1992, "flight_number": null, "city": "Besançon", "zone": "Doubs", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3500, "captain_hours_type": 450, "copilot_hours": 4000, "copilot_hours_type": null, "aircraft_hours": 3501, "circumstances": "The twin engine aircraft was engaged in an ambulance flight from Besançon to Amiens with 2 surgeons, one pilot and one operator agent. Following a course of 950 metres on runway 23 at Besançon-La Vèze Airport by night, the aircraft lifted off. With a low climb gradient, the aircraft collided with trees and crashed in a wooded area located 250 metres past the runway end, bursting into flames. The aircraft was totally destroyed and all four occupants were killed. Both surgeons were en route to Amiens in order to a lever harvesting.", "probable_cause": "The lack of flight recorders made it impossible to trace the chain of events on board the aircraft. As a result, the causes of the accident could not be determined with precision. However, at least two scenarios could simultaneously explain the length of the takeoff roll and the low height after rotation: a lack of control of the airplane by the pilot, either by poor adjustment of the elevator trim or because his attention would have been focused inside the cockpit by any event, without reaction from the pilot passenger seated on the right. This scenario is consistent with his relative inexperience with the type of aircraft. The second scenario could be based on an inappropriate decision to seek significant speed after take-off or improvised instruction, neither pilot being aware of the obstacle constraints of the airfield. The significant obscurity, the operating specificities in medical transport and the presence of a second pilot with a status and role not provided for in the operations manual, without there being therefore any crew or distribution of tasks within the company's crew, are likely contributing factors. The 48-year-old pilot had a total of 3,500 flight hours, including 450 on type. The company agent who was seating on the right was a professional pilot who did not have a license on this type of aircraft and took advantage of the flight, in agreement with the corporate management, to acquire experience in a view to his future qualification on this type of airplane. He had a total of more than 4,000 flight hours."}