{"url": "https://www.baaa-acro.com/crash/crash-quest-kodiak-100-doyo-baru-2-killed", "date": "Apr 9, 2014 at 0940 LT", "type": "Quest Kodiak 100", "operator": "Adventist-Aviation-Services", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Doyo Baru – Ninia", "msn": "100-0049", "yom": 2011, "flight_number": null, "city": "Doyo Baru", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 25530, "captain_hours_type": 1752, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1752, "circumstances": "A Kodiak-100 aircraft, registered PK-SDF, on 9 April 2014 was being operated by PT. Adventist Aviation Indonesia as non-schedule flight from Doyo Baru Airstrip with intended destination of Ninia Airstrip, Papua. On board in this flight were 7 persons consist of one pilot and six passengers. This flight was the fourth flights for the pilot who has performed flights from Doyo Baru (DOB) – Puldamat (PUL) at 2138-2228 UTC; Puldamat (PUL) –Soya (SOY) at 2243-2247 UTC; Soya (SOY) – Doyo Baru (DOB) at 2256-2344 UTC. The flight time to destination was estimated of 1 hour with cruising altitude of 10,000 feet and the fuel on board were sufficient for 4 hours flight time. Doyo Baru Airstrip located at approximately 10 NM North West of Sentani Airport (WAJJ). Air traffic movement to and from Doyo Baru Airstrip was controlled by Sentani Tower controller. At 0015 UTC, the pilot contacted to Sentani Tower controller, requested for start engine and clearance to fly to Ninia. The requests were approved and to report when ready for departure. At 0021 UTC, the pilot reported to the Sentani Tower controller ready for departure from Doyo Baru Airstrip. The Sentani Tower Controller instructed the pilot to hold to wait an aircraft took off from Sentani Airport. At 0024 UTC, the pilot received clearance for takeoff with additional traffic information and to report after airborne. At 0027 UTC, Sentani Tower controller has not received reports from the PK-SDF pilot and tried to call but was not responded. After several observations toward Doyo Baru area and did not see PK-SDF aircraft, The Sentani Tower controller reported to the Chief Section of Sentani Tower Air Navigation. At 0030 UTC, The Chief Section of Sentani Tower Air Navigation clarified the condition of PK-SDF aircraft to one of Indonesian Adventist Aviation pilot in Doyo Baru and obtained information that the aircraft had experienced in accident during takeoff at Doyo Baru. An engineer after received the information went to the accident site and saw appearance of white smoke came out from the side of the river which was known as the accident aircraft located. After arrived at the accident site the engineer saw the Adventist’s staffs and local people tried to extinguish the fire on the aircraft engine by throwing some water and used two fire extinguishers while some people moved the passengers from the wreckage. Two occupants including the pilot were fatally injured and five other passengers were seriously injured. All occupants were taken to Yowari Hospital (Rumah Sakit Umum Daerah – RSUD Yowari).", "probable_cause": "Contributing Factors:\r\n- The failure to airborne was due to the aircraft was not in correct takeoff configuration which required wing flap 20° while the flap was found at approximately 6° position during impact. \r\n- The actions to recover the situation by selection of emergency power and flap were not proper for particular condition."}