{"url": "https://www.baaa-acro.com/crash/crash-convair-c-131d-samaritan-munich-53-killed", "date": "Dec 17, 1960 at 1410 LT", "type": "Convair C-131 Samaritan", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "City", "schedule": "Munich – Northolt", "msn": "212", "yom": 1955, "flight_number": null, "city": "Munich", "zone": "Bavaria", "country": "Germany", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 13, "pax_fatalities": 13, "other_fatalities": 33, "total_fatalities": 53, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was engaged in a special flight from Munich to RAF Northolt, near London, carrying British students who were flying back home for Christmas and a crew of seven. One minute after takeoff from Munich-Riem Airport, while climbing to an altitude of 1,000 meters, the crew informed ground about the failure of the left engine and obtained the permission to return for an emergency landing. Few seconds later, the copilot informed ground that he was unable to control the loss of altitude. In a limited visibility due to fog (800 meters horizontal and 40 meters vertical), the airplane struck the top of the St Paul church with its left wing and crashed in a huge explosion in the center of a commercial district of Munich. The airplane exploded while hitting a tramway, several cars and people and debris were scattered in the street and several shops as well. All 20 occupants on board the aircraft were killed as well as 33 people on the ground, essentially people sitting in the tramway. Nine other people were seriously injured. ", "probable_cause": "Its is believed that the failure of the left engine was caused by the combination of the following factors:\r\n- The fuel line, the fuel tank and the fuel pump were contaminated with water,\r\n- Due to low temperature and icing conditions, the carburetor performances were reduced, \r\n- The crew encountered engine difficulties prior to takeoff but apparently decided to continue the procedure."}