{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-elross-lake-1-killed", "date": "Sep 1, 2005 at 1630 LT", "type": "De Havilland DHC-2 Beaver", "operator": "NordPlus-Norpaq", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Plain, Valley", "schedule": "Pons Camp - Squaw Lake", "msn": "205", "yom": 1952, "flight_number": null, "city": "Elross Lake", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2550, "captain_hours_type": 1700, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 20900, "circumstances": "The float-equipped de Havilland DHC-2 Beaver (registration C-FODG, serial number 205) departed the outfitter base camp at Squaw Lake, Quebec, at 0925 eastern daylight time, with a passenger and a few supplies on board, for a round-trip visual flight rules (VFR) flight to two wilderness camps, Camp 2 and Camp Pons. The weather in Squaw Lake was suitable for visual flight at the time of take-off but was forecast to deteriorate later in the day. The pilot completed the flights to the two camps and on the way back to Squaw Lake, the weather forced the pilot to make a precautionary landing on Elross Lake, 15 nautical miles (nm) northwest of Squaw Lake. At 1630, he reported to the company via high frequency (HF) radio that he intended to take off from Elross Lake, as there seemed to be a break in the weather. Rescue efforts were initiated in the evening when the aircraft did not arrive at the base camp. The aircraft was located at 1230 the following day, 4 nm from Elross Lake. The aircraft was destroyed by a post-impact fire. The pilot sustained fatal injuries. ", "probable_cause": "Finding as to Causes and Contributing Factors:\r\n1. The pilot attempted to cross the mountain ridge in adverse weather, and the aircraft stalled at an altitude from which recovery was not possible. Loss of visual references, strong updrafts, moderate to severe turbulence and possible wind shear likely contributed to the onset of the aerodynamic stall.\r\nOther Finding:\r\n1. Had this been a survivable accident, rescue efforts may have been compromised by a lack of communication. A satellite phone provides a more effective means of communication when in remote areas. "}