{"url": "https://www.baaa-acro.com/crash/crash-boeing-767-2s1er-guatemala-city", "date": "Apr 6, 1993 at 1827 LT", "type": "Boeing 767-200", "operator": "TACA-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Salvador – Guatemala City – Los Angeles", "msn": "23494", "yom": 1986, "flight_number": "TA510", "city": "Guatemala City-La Aurora", "zone": "Guatemala", "country": "Guatemala", "region": "Central America", "crew_on_board": 9, "crew_fatalities": 0, "pax_on_board": 227, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 27558, "circumstances": "The approach to Guatemala City-La Aurora Airport was completed in poor weather conditions with rain falls, a visibility of three miles below a 2,000 feet cloud ceiling. The crew was cleared to land on runway 19 with a tailwind component as the wind was from 030° at 8 knots. The aircraft landed 1,070 metres past the runway threshold (runway 19 is 2,763 metres long) at a speed that was 17 knots above Vref. The crew started the braking procedure and thrust reversers were deployed. At a distance of 300 metres from the runway end, the captain decided to veer off runway to the left. At a speed of 90 knots, the aircraft went through a perimeter fence, down an embankment and eventually came to rest into several houses. All 236 occupants evacuated safely while the aircraft was damaged beyond repair. Three people on the ground were slightly injured. ", "probable_cause": "Poor approach planning and landing configuration on part of the flying crew. The following findings were reported:\r\n- The aircraft was approaching runway 19 above the glide, \r\n- The speed upon landing was 17 knots above Vref, \r\n- The runway surface was wet and the braking coefficient was limited, \r\n- The aircraft landed too far down a wet runway, reducing the landing distance available,\r\n- The landing was completed with a tailwind component, \r\n- The crew failed to initiate a go-around procedure. \n"}