{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-caernarfon-1-killed", "date": "Sep 6, 2017 at 1723 LT", "type": "Piper PA-31-310 Navajo", "operator": "Sky West Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "31-7612040", "yom": 1976, "flight_number": null, "city": "Caernarfon", "zone": "Gwynedd", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9243, "circumstances": "Approximately 20 minutes after takeoff from a private airstrip in Cheshire the pilot reported pitch control problems and stated his intention to divert to Caernarfon Airport. Approximately 5 minutes later, the aircraft struck Runway 25 at Caernarfon Airport, with landing gear and flaps retracted, at high speed, and with no noticeable flare manoeuvre. The aircraft was destroyed. The elevator trim was found in a significantly nose-down position, and whilst the reason for this could not be determined, it is likely it would have caused the pilot considerable difficulty in maintaining control of the aircraft. The extensive fire damage to the wreckage and the limited recorded information made it difficult to determine the cause of this accident with a high level of confidence. A possible scenario is a trim runaway, and both the CAA and the EASA are taking safety action to promote awareness for trim runaways as a result of this accident.", "probable_cause": "After reporting pitch control problems, N250AC made a direct diversion with a significantly unstable approach, in a clean configuration, to Runway 25 at Caernarfon Airport. The elevator trim was found in a nose-down position and, whilst the reason for this could not be determined, it is likely that it caused the pilot considerable difficulty in controlling the aircraft. The aircraft struck Runway 25 at Caernarfon Airport, with landing gear and flaps retracted, at high speed, and with no noticeable flare manoeuvre. The extensive fire damage to the wreckage and the limited recorded information made it difficult to determine the cause of this accident with a high level of confidence. It is possible there was a nose-down trim runaway that the pilot was unable to stop."}