{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-62-konigs-wusterhausen-156-killed", "date": "Aug 14, 1972 at 1701 LT", "type": "Ilyushin II-62", "operator": "Interflug-2_0", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Berlin - Burgas", "msn": "00702", "yom": 1970, "flight_number": null, "city": "Königs Wusterhausen", "zone": "Brandenburg", "country": "Germany", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 148, "pax_fatalities": 148, "other_fatalities": 0, "total_fatalities": 156, "captain_hours": 8100, "captain_hours_type": null, "copilot_hours": 6041, "copilot_hours_type": null, "aircraft_hours": 3520, "circumstances": "The four engine aircraft departed Berlin-Schönefeld Airport at 1630LT on a charter flight to Burgas, carrying 148 passengers (144 East German citizens, three Austrians and one unknown nationality) and eight East-German crew members. Thirteen minutes later, while cruising at an altitude of 29,200 feet, the crew informed ATC about technical problems and was cleared to return to Berlin. The dumping fuel system was activated at 1651LT and three minutes later, as the situation worsened, the captain started an emergency descent. At 1659LT, he informed ATC that he was losing control of the airplane and declared a fire on board. Shortly later, the empennage detached and totally out of control, the airplane dove into the ground and crashed in flames in a wooded area located in Königs Wusterhausen, about 11 km southeast of Berlin-Schönefeld Airport. The aircraft was totally destroyed and none of the 156 occupants survived the crash. Up to date, this was the worst aircraft crash in the European History. ", "probable_cause": "A hot-air tube in the rear of the airplane had contained a leak for some time. During the operation of the plane hot air with temperatures of around 300 degrees C had caused a weakening of the insulation material of electricity wires and the airplane controls. Immediately after takeoff on the ill-fated flight, a short-circuit occurred. Sparks with a temperature of up to 2000 degrees C caused substantial melting and ultimately a fire in the nr. 4 cargo bay which was located in the rear of the plane. The fire weakened the fuselage structure, causing the tail section to fail in-flight."}