{"url": "https://www.baaa-acro.com/crash/crash-cessna-414a-chancellor-near-wonthaggi", "date": "Oct 27, 1989 at 0833 LT", "type": "Cessna 414 Chancellor", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Melbourne – Port Welshpool", "msn": "414A-0261", "yom": 1979, "flight_number": null, "city": "Wonthaggi", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot reported that whilst enroute from Essendon to Wonthaggi he descended to the lowest safe altitude of 3600 feet above sea level, lowered the landing gear, reduced power and airspeed to counter the effect of turbulence and entered a holding pattern to the south south west of the Wonthaggi navigation aid. During the holding pattern the aircraft descended until it collided with trees that were 865 feet above sea level. The weather at the time included gale force winds, rain and low cloud. There were no thunderstorms or microbursts in the area, however, other aircraft reported a very low cloud base and severe turbulence. A few minutes prior to the accident ground witnesses, south south west of the accident site, reported an aircraft matching the description of VH-SDV, flying below a low, misty, ragged cloud base. There was no record of another aircraft in the area at the time. Information was available which indicated that the aircraft had descended below 3600 feet during the approach to Wonthaggi. The passengers reported that the pilot gave no indication of any problem or danger. Until the impact, they believed the aircraft was descending normally for a landing at Port Welshpool.", "probable_cause": " No aircraft defects were found which may have been factors in the accident. The investigation indicates that the pilot attempted to fly under the low cloud base, in order to reach the Port Welshpool destination where weather conditions were earlier reported to have been partially sunny. Port Welshpool is not serviced by an approved navigation aid. The pilot attempted to descend below the cloud base, hoping to achieve visual flight conditions to continue to his destination. "}