{"url": "https://www.baaa-acro.com/crash/crash-boeing-307b-1-stratoliner-monte-renoso-25-killed", "date": "Dec 29, 1962 at 1312 LT", "type": "Boeing 307 Stratoliner", "operator": "Air%20Nautic", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Bastia – Ajaccio – Nice", "msn": "2001", "yom": 1940, "flight_number": null, "city": "Monte Renoso", "zone": "Corse-du-Sud", "country": "France", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 22, "pax_fatalities": 22, "other_fatalities": 0, "total_fatalities": 25, "captain_hours": 9865, "captain_hours_type": 3130, "copilot_hours": 7388, "copilot_hours_type": 497, "aircraft_hours": 41150, "circumstances": "The Boeing SA.307 Stratoliner F-BELZ arrived at Bastia (BIA), France from Nice (NCE) at 05:25 UTC. The plane took off again for the return flight via Ajaccio (AJA), Corsica at 11:49 and was cleared for a cruising altitude of FL120, estimating Ajaccio at 12:20 UTC. Last radio contact with the flight was at 12:09 when the flight crew replied to the weather and active runway information from Ajaccio Approach. At 12:12 the flight flew into a sheer rock face of Monte Renoso which is located 45 km from the Ajaccio VOR on the 048 radial. Impact was at an altitude of 2,285 m (7,500 feet) and about 50 m (165 feet) below the summit. The aircraft rebounded after impact and fell about 100 m down the slope of the mountain. All 25 occupants were killed, among them members of the Bastia Basketball team who were flying to Nice for the National Championship. The aircraft was totally destroyed. \r\nCrew:\r\nRoger Mercier, pilot,\r\nFernand Delime, copilot,\r\nAntoine Blois, mechanic. ", "probable_cause": "The accident was attributed to a series of errors by the crew who: \r\n- Made insufficient preparation for the flight and committed a serious error in estimating the duration of the flight,\r\n- Failed to observe the cruising altitude entered on the flight plan, \r\n- Failed to check properly the navigation of the aircraft which resulted in a wrong estimation of the position of the aircraft,\r\n- Failed to maintain the safety altitude, and\r\n- Started the descent prematurely, subsequently entering into instrument flight conditions. \r\nThe errors of the crew were made possible: \r\n- By a lack of supervision of the flights on the part of the operator; and \r\n- By a lack of correct route instructions for the segment Bastia-Ajaccio. The Board was led to conclude that the crew of F-BEIZ did not have the necessary instructions for the route via the turning point. Even supposing that the instructions supplied to the Board by the operator were issued before the accident, and that they were available to the pilot-in-command, the Board considered that these instructions were inaccurate and dangerous since they did not give the altitude at the turning point and they provided for a flight time between Bastia and Ajaccio which was incompatible with the attainment of safety altitudes.\r\n- By a certain fatigue of the crew. Although the regulations concerning flight time limitations were strictly observed, it is worth mentioning that the flight activity of the crew was fairly strenuous during the three days preceding the accident."}