{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-0-buffalo", "date": "Jan 20, 1954 at 1642 LT", "type": "Convair CV-240", "operator": "American-Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Buffalo – Saint Louis", "msn": "88", "yom": 1948, "flight_number": "AA767", "city": "Buffalo", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 21, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8671, "captain_hours_type": 4389, "copilot_hours": 4249, "copilot_hours_type": 2082, "aircraft_hours": 11018, "circumstances": "While taxiing to Runway 23 the flight received an IFR (Instrument Plight Rules) clearance from ARTC (Air Route Traffic Control). Normal pre-takeoff checks were performed and the takeoff roll was started at 1640. The aircraft became airborne after using approximately one-half of the 5.630-foot runway. Immediately after leaving the ground the gear was raised and the first officer saw the left feathering button light come on dimly which indicated that the left propeller was in the process of being feathered by the auto-feathering system. After definitely determining the light was on and visually checking the left propeller, the auto-feathering system was disarmed and the captain., in an effort to stop the feathering cycle, pulled the feathering button to neutral. This effort was unsuccessful. the left propeller feathered, and the engine stopped. During the climb an air speed of 140 m.p.h. was reached and maintained., the right engine remaining at full takeoff power. Approximately 250 feet above the ground a shallow left turn was started and the first officer was ordered to reinstate the left engine. the captain believing the aircraft would climb no farther. In the effort to restart the left engine by unfeathering the left propeller. only 600 r.p.m. could be obtained and the captain felt a buffeting through the control yoke. The aircraft at this time had progressed in the left turn approximately 180 degrees from the takeoff direction and the captain. fearing he would be unable to clear obstructions. Including high tension lines, decided to make a wheels-up landing. The landing was made in a field approximately one mile south of the airport. When the aircraft stopped, the passengers and crew evacuated it in an expeditious and orderly manner. The airplane was damaged beyond repair. ", "probable_cause": "The Board determines that the probable cause of this accident was (1) a mechanical failure of the torquemeter boost pump that automatically feathered the left propeller immediately after becoming airborne., and (2) the use of an incorrect procedure for unfeathering which resulted from the ambiguity of the instruction for unfeathering contained in the company's manual. The following findings were reported:\r\n- Immediately after takeoff the left propeller automatically feathered due to a mechanical failure of the torquemeter boost pump,\r\n- The engine stopped as a result of the feathering and was capable of being restarted,\r\n- The procedure used to unfeather the propeller and reach starting r.p.m. was incorrect due to an ambiguity of the unfeathering instructions outlined in the flight manual,\r\n- The first officer did not reinstate the mixture control to \"auto-rich\" because starting r.p.m. was not reached,\r\n- The windmilling propeller drag. the existing weather and the banked attitude of the aircraft caused it to lose altitude,\r\n- A forced landing was made one mile south of the Buffalo Airport shortly after becoming airborne."}