{"url": "https://www.baaa-acro.com/crash/crash-bae-3101-jetstream-31-knoxville-2-killed", "date": "Mar 12, 1992 at 0013 LT", "type": "BAe Jetstream 31", "operator": "CC%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Knoxville - Knoxville", "msn": "683", "yom": 1985, "flight_number": null, "city": "Knoxville-McGee Tyson", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4929, "captain_hours_type": 4400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10607, "circumstances": "After a series of instrument procedures, the flight returned to Knoxville and landed. On the next takeoff, the first officer dropped the airplane's checklist and the check airman elected to continue the flight without using the checklist. On the next visual approach, the check airman and first officer attempted a landing without lowering the landing gear. The airplane touched down and both propeller assemblies struck the concrete runway surface. The pilot reported the gearup touchdown to the control tower and elected to go around. During the climbout the check airman lowered the landing gear, established a teardrop pattern for the opposite runway and feathered the right propeller. Crash fire rescue (cfr) equipment was alerted and was in position for the second landing attempt. While on short final, the check airman called for max power, a reduction in the flap setting, and initiated a single engine go-around below 200 feet. There is no operational procedure for a single engine go-around below 200 feet. The airplane climbed briefly and crashed inverted about 7,500 feet from the approach end of the runway. Both pilots were killed. ", "probable_cause": "The pilot's failure to use the airplane checklist which resulted in a gear up landing; and the pilot's failure to maintain flying speed which resulted in an uncontrolled collision with the ground."}