{"url": "https://www.baaa-acro.com/crash/ground-fire-boeing-767-269er-fort-lauderdale", "date": "Oct 29, 2015 at 1233 LT", "type": "Boeing 767-200", "operator": "dynamic.png", "flight_phase": "Taxiing", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Lauderdale - Caracas", "msn": "23280/131", "yom": 1986, "flight_number": "DYA405", "city": "Fort Lauderdale-Hollywood", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 11, "crew_fatalities": 0, "pax_on_board": 90, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15700, "captain_hours_type": null, "copilot_hours": 4140, "copilot_hours_type": null, "aircraft_hours": 30108, "circumstances": "On October 29, 2015, about 12:33 pm eastern daylight time (EDT), Dynamic International Airways flight 405, a Boeing 767-200ER, N251MY, experienced a fuel leak and subsequent fire while taxiing for departure at the Fort Lauderdale-Hollywood International Airport, Florida (FLL). Of the 101 passengers and crew onboard, one passenger received serious injuries. The airplane sustained substantial damage from the fire. The flight was operating under the provisions of 14 Code of Federal Regulations Part 121 supplemental as a scheduled charter from FLL to Maiquetía Simón Bolívar International Airport (CCS), Caracas, Venezuela. A significant fuel leak and subsequent fire occurred in the left engine strut and nacelle during taxi, resulting in substantial damage to the airplane. The fuel leak was the result of a fuel line flexible coupling (Wiggins fitting) loosening and becoming disengaged due to the lack of a safety lockwire on the coupling as required by the maintenance manual. The leaking fuel contacted hot engine case surfaces which ignited the fire. Records indicate that maintenance was conducted on this fitting in October of 2012 at the 4C check prior to the airplane being prepared for storage. The area would also have been subject to a visual inspection when the airplane was brought out of storage in 2015. The same maintenance facility conducted both of these activities. About 240 flight hours were logged between the aircraft returning to service and the accident. The leak occurred after the coupling loosened due to the missing safety wire which was the result of an error by the third-party maintenance provider. The flight crew promptly shut down the left engine using the fire handle, and requested fire equipment. As the airplane stopped on the taxiway, passengers saw the fire and insisted that the cabin crew initiate an evacuation. One passenger opened an overwing exit on his own, and the slide did not deploy. The cabin crew initiated the evacuation without coordination with the flight crew. After the evacuation had already begun, the flight crew advised over the PA to evacuate out the right side of the airplane. The flight crew did not immediately shut down the right engine and an evacuating passenger ran behind the engine and was blown to the pavement resulting in serious injuries. The lack of coordination between the flight crew and cabin crew resulted in the evacuation initiating while the right engine was still running.", "probable_cause": "The separation of the flexible fuel line coupling and subsequent fuel leak due to the failure of maintenance personnel to install the required safety lockwire. Contributing to the severity of the accident was the initiation of the evacuation before the right engine was shut down which led to the passenger's injury."}