{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-pellston-1-killed", "date": "Jan 15, 2013 at 1958 LT", "type": "Cessna 208B Grand Caravan", "operator": "Martinaire-2", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Pellston - Lansing", "msn": "208B-0386", "yom": 1994, "flight_number": "MRA605", "city": "Pellston-Emmet County", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1921, "captain_hours_type": 34, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10132, "circumstances": "The pilot landed at the airport to refuel the airplane and pick up cargo. The pilot spoke with three employees of the fixed base operator who stated that he seemed alert and awake but wanted to make a \"quick turn.\" After the airplane was fueled and the cargo was loaded, the pilot departed; the airplane crashed 1 minute later. Night visual meteorological conditions prevailed at the time. An aircraft performance GPS and simulation study indicated that the airplane entered a right bank almost immediately after takeoff and then made a 42 degree right turn and that it was accelerating throughout the flight, from about 75 knots groundspeed shortly after liftoff to about 145 knots groundspeed at impact. The airplane was climbing about 500 to 700 feet per minute to a peak altitude of about 260 feet above the ground before descending. The simulation showed a gas generator speed of about 93 percent throughout the flight. The study indicated that the load factor vectors, which were the forces felt by the pilot, could have produced a somatogravic illusion of a climb, even while the airplane was descending. The postaccident examination of the airframe and engine revealed no evidence of mechanical malfunctions or failures that would have precluded normal operation. Based on the findings from the aircraft performance GPS and simulation study, the degraded visual reference conditions present about the time of the accident, and the forces felt by the pilot, it is likely that he experienced spatial disorientation, which led to his inadvertent controlled descent into terrain.", "probable_cause": "The pilot's inadvertent controlled descent into terrain due to spatial disorientation. Contributing to the accident was lack of visual reference due to night conditions."}