{"url": "https://www.baaa-acro.com/crash/crash-cessna-402a-avon-park-2-killed", "date": "Dec 5, 1995 at 0632 LT", "type": "Cessna 402", "operator": "Missionary Aviation Ministries", "flight_phase": "Takeoff (climb)", "flight_type": "Humanitarian", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Avon Park – Moss Town – Port-au-Prince", "msn": "402A-0051", "yom": 1969, "flight_number": null, "city": "Avon Park", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2700, "captain_hours_type": 104, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11512, "circumstances": "After takeoff at dawn on a foggy morning, the airplane collided with electrical transmission wires about one mile from the end of the runway, on an extended line about 50 degrees left of the extended runway centerline. The left wing tip fuel tank (left main) was partially severed from the airplane, breaching the tank. Additionally, the top of the vertical stabilizer and rudder were severed, and a portion of the windscreen was separated. A suggestion was made by the operator that the autopilot trim may have been improperly set, precipitating a nose pitch down upon engagement of the autopilot during the climb. The airplane continued to fly for about 20 minutes, then impacted in a steep right wing down attitude into a densely wooded area that was surrounded by open terrain. The ensuing fire precluded any determination of engine malfunction, systems' discrepancies, or wire strike damage to the left propeller. No determination of pilot incapacitation was possible because of the post impact fire. Based upon the ground witness statement, the left engine was probably inoperative following the wire strike. The impact attitude was inconsistent with a decreasing speed loss of control with the left engine inoperative. However, the flight control trim settings, left main fuel tank selected, and throttle quadrant settings all may have been indicative of pilot incapacitation that precluded proper emergency procedure response. Additionally, the airplane impacted into a densely wooded area surrounded by flatter terrain absent of tall obstacles. ", "probable_cause": "The failure of the pilot to maintain the proper climb rate and direction of flight following takeoff, resulting in a collision with obstacles. The reason for the loss of control and subsequent unusual attitude ground impact was not determined."}