{"url": "https://www.baaa-acro.com/crash/crash-cessna-425-conquest-i-denver-4-killed", "date": "Aug 13, 2005 at 2020 LT", "type": "Cessna 425 Conquest", "operator": "Sgavit Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sandpoint - Denver", "msn": "425-0166", "yom": 1982, "flight_number": null, "city": "Denver-Centennial", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 5000, "captain_hours_type": 1450, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4003, "circumstances": "During an ILS approach in night instrument meteorological conditions, the airplane impacted terrain and was destroyed by impact forces and post crash fire. Prior to departure, the pilot obtained a weather briefing, which reported light rain, mist, and instrument meteorological conditions at the destination airport. After approaching the terminal area, the pilot received radar vectors to intercept the localizer for the Runway 35R ILS approach. The pilot's keying of the microphone and the timing of his speech exhibited decreased coordination during the approach phase of flight. After crossing the outer marker and at altitude of 7,700 feet, the pilot asked the controller what the current ceilings were at the airport, and the controller stated 500 feet. With the airplane at an altitude of 6,800 feet, the controller informed the pilot of a \"low altitude alert\" warning, at which the pilot responded, \"Yeah, I am a bit low here.\" Approximately 20 seconds later, the pilot stated, \"I'm back on glideslope.\" No further communications were received from the accident airplane. The controller issued another low altitude warning, and the radar target was lost. The accident site was located on a hilly, grass field at an elevation of 6,120 feet approximately 2.6 nautical miles from the runway threshold\r\nnear the extended centerline of the runway. At 2027, the weather conditions at the airport were reported as wind from 360 degrees at 10 knots, visibility 2 statute miles with decreasing rain, scattered clouds at 500 feet, broken clouds at 1,100 feet, and an overcast ceiling at 2,800 feet. An acquaintance of the pilot, who had flown with him on other occasions, provided limited information about the pilot's proficiency, but stated, \"a night ILS in IFR conditions would not be [the pilot's] first choice if he had an option.\" The pilot's logbooks were not located. The pilot did not hold a valid medical certificate at the time of the accident, and postaccident toxicological test revealed the presence of unreported prescription medications. No anomalies were noted with the airframe and engines. Ground inspection and flight testing of the airport's navigational equipment revealed that the equipment functioned satisfactorily.", "probable_cause": "The pilot's failure to properly execute the published instrument approach procedure, which resulted in controlled flight into terrain."}