{"url": "https://www.baaa-acro.com/crash/crash-sikorsky-s-43-cristobal-14-killed", "date": "Aug 2, 1937 at 1938 LT", "type": "Sikorsky S-43", "operator": "Panagra-1", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Lima – Guayaquil – Tumaco – Cali – Cristóbal – Panama City", "msn": "4305", "yom": 1936, "flight_number": null, "city": "Colón", "zone": "Colón", "country": "Panama", "region": "Central America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": null, "captain_hours_type": 991, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While descending to Cristóbal-France Field (Colón) at an altitude of some 2,000 feet, the pilot informed ATC that he was approaching the city via the Bahía Limón Bay. In limited visibility due to rain falls, the float plane named 'Santa Maria' went out of control and crashed into the sea few km offshore. Debris were found the following floating on water and all 14 occupants were killed. ", "probable_cause": "The Board is conclusively of the opinion that the accident was caused by the NC15065 striking the water while moving less then 90 miles per hour, tearing the ship to pieces, causing the death of all aboard and that a fire resulted from the impact with the water. The Board is convinced that at the time of the collision the plane had a minimum of 80 gallons of gas which would have burned on the water a sufficient length of time to cause all burns or scorches found one any recovered wreckage. The specific contributing cause of this aircraft colliding with the water is beyond the knowledge of man. However, there must have been a specific contributing cause or causes, and the Board is of the opinion that the most probable contributing cause is one of the following and in the order named: \r\n- Failure of one or both engines due to faulty gasoline system, occurring during the spiraling down mentioned in the pilot's last radio message.\r\n- The encountering of a sudden severe rain, as altitude was being lost by the plane in the spiraling descent, resulting in the blanking out of all visual contact.\n"}