{"url": "https://www.baaa-acro.com/crash/crash-antonov-24rv-varandey-28-killed", "date": "Mar 16, 2005 at 1353 LT", "type": "Antonov AN-24", "operator": "Regional Airlines - Regionalnye Avialinii", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ufa - Perm - Usinsk - Varandey - Naryan Mar", "msn": "2 73 081 07", "yom": 1972, "flight_number": "RL9288", "city": "Varandey", "zone": "Nenets Autonomous Okrug", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 2, "pax_on_board": 45, "pax_fatalities": 26, "other_fatalities": 0, "total_fatalities": 28, "captain_hours": 14221, "captain_hours_type": 9833, "copilot_hours": 517, "copilot_hours_type": 60, "aircraft_hours": null, "circumstances": "The aircraft was completing a charter flight from Ufa to Naryan Mar with intermediate stops in Perm, Usinsk and Varandey under contract of Naryanmarneftyegaz, a sister company of Lukoil. On final approach under VFR mode in good weather conditions, at a speed of 170 km/h, the aircraft stalled, causing the left wing to struck a sand dune (3 metres high). The aircraft crashed 4,217 metres short of runway, bursting into flames. The captain, the navigator and 26 passengers were killed while 24 other people were injured. The aircraft was totally destroyed by impact forces and a post crash fire. OAT was -24° C. at the time of the accident and the visibility was good. ", "probable_cause": "The accident was the consequence of an aerodynamic stall that occurred on short final at low height due to the combination of the following factors: the aircraft was in a critical angle of attack and its speed was insufficient because both engines run at low regime for a period of more than 20 seconds. Possible errors in the reading of certain instruments such as the speed indicator and the angle of attack indicator remain a contributing factor."}