{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-124v-near-kilpyavr-afb-11-killed", "date": "Jan 29, 1970 at 1927 LT", "type": "Tupolev TU-124", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Leningrad - Murmansk", "msn": "5 35 17 06", "yom": 1965, "flight_number": "SU145", "city": "Kilpyavr AFB", "zone": "Murmansk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 3, "pax_on_board": 32, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7425, "circumstances": "Following an uneventful flight by night at an assigned altitude of 8,400 meters, the crew was cleared to descent to 2,400 bound for Kilpyavr AFB near Murmansk. While in a 3° nose-down attitude, the airplane struck the snow covered slope of a hill (240 meters high), slid for 624 meters then lost its both engines and wings and came to a halt, broken in two. The wreckage was found 29,5 km from the airport and 8 km to the right of the extended centerline. Eight passengers and three crew members (the captain, the navigator and the flight engineer) were killed while 27 other occupants were injured. ", "probable_cause": "It was determined that the pilot-in-command started the descent prematurely, causing the aircraft to descend below the minimum prescribed altitude. The lack of visibility caused by night and the absence of any visual reference points on the ground did not allow the crew to know his exact position and to distinguish the ground obstacles. ATC allowed the crew to perform a straight-in approach with radar control. The following factors were considered as contributing: \r\n- Absence of an established approach procedure, \r\n- Intermittent loss of VHF communications during the approach procedure, \r\n- The relative inexperience of the flying crew with less than 500 flying hours on this type of aircraft. "}