{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-mayo-1-killed-0", "date": "Mar 31, 2011 at 1507 LT", "type": "De Havilland DHC-3 Otter", "operator": "Black%20Sheep%20Aviation", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Mayo - Rackla", "msn": "108", "yom": 1956, "flight_number": null, "city": "Mayo", "zone": "Yukon", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5000, "captain_hours_type": 3000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16431, "circumstances": "The aircraft was being utilized in support of mineral exploration activities, to transport building materials, fuel, and winter camp supplies from Mayo, Yukon, to winter airstrips located at Withers Lake and Rackla River, Yukon. Withers Lake is located 113 statute miles (sm) east of Mayo, and Rackla Airstrip is located 94 sm northeast of Mayo (Appendix B). On the accident flight, the aircraft was transporting a load of twelve 6-inch by 6-inch wood timbers, each 16 feet long, and 2 barrels of jet fuel. The pilot had arrived at the Mayo Airport at about 0630 1 on the morning of the accident. The pilot’s first trip of the day was to Withers Lake, departing Mayo at 0834. The pilot completed 2 trips to Withers Lake and 1 trip to Rackla prior to the accident flight. The accident flight departed Mayo at 1448 under visual flight rules (VFR) on a company itinerary. At 1507 the Canadian Mission Control Centre (CMCC) received a 406-MHz emergency locater transmitter (ELT) alert. Joint Rescue Co-ordination Centre Victoria (JRCC Victoria) was notified at 1522. Aircraft operating in the area were alerted, and a commercial helicopter was dispatched from Ross River, Yukon, approximately 1 hour later to search for the aircraft. The helicopter crew located the aircraft wreckage at 1833 at about 4300 feet above sea level (asl), on a remote, snow-covered hillside 38 nautical miles (nm) northeast of Mayo. \n", "probable_cause": "The aircraft departed controlled flight for reasons which could not be determined, and broke up due to high speed."}