{"url": "https://www.baaa-acro.com/crash/crash-gaf-nomad-n24a-weston-green", "date": "Apr 13, 2002 at 0830 LT", "type": "GAF Nomad N.24", "operator": "Nomad Fleet Vamdrup", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Weston-on-the-Green - Weston-on-the-Green", "msn": "117", "yom": 1981, "flight_number": null, "city": "Weston-on-the-Green", "zone": "Oxfordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 13, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 581, "captain_hours_type": 51, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A series of parachute flights had been planned from Weston-on-the-Green. The forecast conditions were good, predicting a surface wind of 360°/10 kt, visibility 30 km, with no significant weather and some strato-cumulus cloud with a base of 3,000 feet. The first flight, which consumed 144 lb of fuel, was completed successfully with 12 parachutists jumping from 12,000 feet. Thirteen parachutists boarded for the second flight and the aircraft was cleared to take off from the dry surface of grass Runway 01 (take off run available 3,194 feet). The surface wind at the time was 360°/15 kt with no significant weather and the temperature was 15°C. The pilot subsequently reported that he checked the condition levers were set to 100% N2, the flaps were set to 10° and that the trim was set in the take off range. He also reported that the company recommended power  of 738°C turbine outlet temperature (TOT), and 89 pounds per square inch (psi) manifold pressure were set and achieved during the take off run. This power setting was equivalent to the 'Max Cruise Rating' as specified in the 'Operating Limits' section of the aircraft manual and no take off performance charts or data concerning 'take off distance required' (TODR) and 'accelerate stop distance required' (ASDR) information was available. The maximum take off power available (5 minute limit) was 810°C TOT and 102 psi. At approximately 80 to 83 kt (scheduled rotation speed 71 kt) the pilot pulled back on the control column. He reported that, 'the aircraft felt more nose heavy', 'the aircraft nose did not rise and he perceived that the aircraft was no longer accelerating'. He decided to abort the take off, commenced braking and set the condition levers to the full reverse position. As the aircraft decelerated he turned it to the right in order to avoid trees and bushes ahead. The aircraft struck a small earth mound, whilst still travelling at about 15-20 kt, and came to an abrupt halt. The pilot shut down both engines and selected the fuel and the battery to OFF. The crew and passengers evacuated the aircraft unaided. ", "probable_cause": "The pilot had successfully completed a similar flight in the same aircraft, in benign meteorological conditions and the available evidence suggests that the aircraft was serviceable. He reported that during the second take off run 'the company recommended take off power of 738°C TOT and 89 psi was set and achieved'. The take off was therefore attempted with only 89 -90% of the maximum power available. This would have had the effect of not only increasing the take off distance but also the 'ASDR' to achieve a successful rejected take off from a speed at or beyond normal rotate speed. With the flap position and trim set correctly for take off the pilot attempted to rotate the aircraft between 80 to 83 kt, at least 9 kt above the scheduled rotation speed of 71 kt. If the aircraft loading had been within the limits of mass and CG prompt rotation of the aircraft should have occurred. This however did not happen and instead the pilot felt the aircraft to be 'more nose heavy than normal'. The exact mass and CG for this flight are uncertain. If the CG position was at the forward limit for the calculated mass, control column forces would have been high but not sufficiently high to prevent a successful takeoff. Extreme forces would only have been encountered if the aircraft CG position was significantly in error. It is therefore considered that for the second takeoff of the day the aircraft CG was significantly forward of the forward CG limit."}