{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46f-1-cu-commando-near-whittier-29-killed", "date": "Apr 18, 1952 at 0334 LT", "type": "Curtiss C-46 Commando", "operator": "Robin-Airlines1", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "New York – Chicago – Kansas City – Phoenix – Hollywood", "msn": "22466", "yom": 1945, "flight_number": "RBN416W", "city": null, "zone": null, "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 26, "pax_fatalities": 26, "other_fatalities": 0, "total_fatalities": 29, "captain_hours": 7913, "captain_hours_type": 600, "copilot_hours": 3000, "copilot_hours_type": 495, "aircraft_hours": null, "circumstances": "The crew started the descent to Hollywood-Burbank by night and marginal weather (low clouds) when he was instructed by ATC to divert to Los Angeles for a safe ILS approach. While descending in dark conditions, the aircraft hit the slope of the Mt Puente located two miles east of Whittier. The wreckage was found few hours later. All 29 occupants have been killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the action of the pilot in voluntarily descending below the minimum altitude for which he was cleared, and attempting an approach at an altitude too low to clear the terrain. The following findings were pointed out:\r\n- Captain Lewis R. Powell served as command pilot on this flight and on previous ones, contrary to the limitation imposed by his medical certificate, although he was fully aware that this limitation restricted his flying activities to company check pilot duties only,\r\n- Copilot Charles K. Waldron was properly certificated for the flight involved, but during this flight exceeded the flight time limitations prescribed under Section 42.48 of the Civil Air Regulations,\r\n- The flight was not conducted in accordance with the ARTC approach clearance, in that it descended considerably lower than the minimum altitude prescribed between Riverside range and Downey fan marker,\r\n- The flight was in clear weather until reaching the Puente Hills, which were clear on the east slope but in fog to the west,\r\n- Weather conditions at Los Angeles International Airport were satisfactory for the ILS approach for which the flight had been cleared, but were not satisfactory for a visual approach."}