{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-near-nantes-2-killed", "date": "Sep 25, 1979 at 2220 LT", "type": "Beechcraft 200 Super King Air", "operator": "Eagle%20Aircraft%20Services", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Stansted - Exeter", "msn": "BB-508", "yom": 1979, "flight_number": null, "city": "Nantes", "zone": "Loire-Atlantique", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 9400, "captain_hours_type": null, "copilot_hours": 9550, "copilot_hours_type": 7, "aircraft_hours": 47, "circumstances": "After a flight from Leavesden to Stansted, the instructor had filed an IFR flight plan for Stansted - Exeter, at FL310, the planned departure from Stansted being at 1400. Take-off from Stansted was at 1303, and during the following 40 minutes the aircraft flew locally in the Stansted zone where it conducted two ILS approaches followed by an overshoot. At 1345 it was authorised to change from the Stansted frequency and contact the London Centre. The climb to FL310 was normal. At 1421 hrs the pilot asked ATC whether it would be possible to perform an emergency descent exercise before reaching Exeter, his intention being to begin the descent after passing Dawlish. The controller agreed and asked the pilot to call back when he was ready to begin the manoeuvre. At 1435 the Beech was almost over Dawlish and the crew announced they were ready to begin the exercise. They stated that they would keep a listening watch on the frequency during the descent, but would not be able to transmit while they were donning their masks. At 1436, the flight was authorised to begin the descent, initially to FL120. At 1438 the controller gave the Beech a right-hand turn heading for Exeter. At 1439 he repeated the heading. At 1443, noting that the aircraft had commenced a turn to the left, he authorised it to turn left to head for Exeter. At 1444 he asked for the pilot to give an identifying 'squawk' on the transponder. He did not receive a reply to any of these communications. Since 1438 Beech G-BGHR had been describing large circles to the left at FL310. The wind at that altitude made the aircraft drift towards the south, and it was to pass successively over Guernsey, Jersey, Dinard and Rennes. At the end of its endurance at 2020 (2220LT) the aircraft crashed near Nantes, 20 km to the east/southeast of the town. A RAF Nimrod escorted the Beechcraft during its progress to the vicinity of Nantes. G-BGHR was also followed by two Dassault Mirage III and three Mirage F1 of the French Air Force from 1810 until 2010. The pilots of these aircrafts checked the external condition of the Beech, which appeared normal, the doors and emergency exits were in their normal position, the cabin and cockpit were illuminated and the navigation lights were operating. However, they were unable to make any contact but they all noted the presence of warning lights on the control panel.", "probable_cause": "The immediate cause of the accident was the aircraft striking the ground at a steep angle. The cause of the accident was depressurization of the cabin at high altitude by the pilot. This exercise is too dangerous to be carried out on an aircraft in this class, in view of the useful consciousness time available to the pilots in the case of any failure of the oxygen circuit. In this particular case, the oxygen masks were not connected and the crew died in flight due to hypoxia."}