{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-18v-ashgabat-12-killed", "date": "Mar 5, 1963 at 1934 LT", "type": "Ilyushin II-18", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Krasnovodsk – Ashgabat", "msn": "181 0034 04", "yom": 28, "flight_number": "SU191", "city": "Ashgabat", "zone": "Ashgabat City District", "country": "Turkmenistan", "region": "Asia", "crew_on_board": 11, "crew_fatalities": 8, "pax_on_board": 43, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2098, "circumstances": "The aircraft departed Krasnovodsk Airport at 1804LT and shortly after takeoff, the crew was informed about weather conditions at destination with a sand storm and a visibility limited to 1,000 meters. En route, while cruising at an altitude of 6,000 meters, weather conditions worsened and the crew obtained the permission to modify his route. At a distance of 25 km from Ashgabat, the crew started the descent and reached the altitude of 400 meters when he reported the runway lights in sight. Shortly later, the airplane became unstable and lost height. It banked left to an angle of 7°, struck power cables and a concrete post. Out of control, it banked left to an angle of 30°, stalled and crashed in flames 1,012 meters short of runway threshold. Eight crew members and four passengers were killed while 42 other occupants were injured. The aircraft was destroyed by impact forces and a post crash fire. ", "probable_cause": "Wrong decision on part of the crew who continued the approach in below minima weather conditions. Errors on part of ATC were also reported as they cleared the crew to land in below minima weather conditions and failed to divert the crew to another airport. It was also determined that the information transmitted to the crew relating to weather conditions at destination did not reflect the truth, which was considered as a contributing factor. "}