{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-kennedy-lake", "date": "Jun 25, 2014 at 1425 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Sudbury%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Sudbury - Kennedy Lake", "msn": "284", "yom": 1952, "flight_number": null, "city": "Kennedy Lake", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3500, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Sudbury Aviation Limited float-equipped de Havilland DHC-2 Beaver aircraft (registration C-FHVT, serial number 284) was on approach to Kennedy Lake, Ontario, with the pilot and 2 passengers on board, when the aircraft rolled to the left prior to the flare. The pilot attempted to regain control of the aircraft by applying full right rudder and right aileron. The attempt was unsuccessful and the aircraft struck rising tree-covered terrain above the shoreline. The aircraft came to a stop on its right side and on a slope. The pilot and the passenger in the rear seat received minor injuries. The passenger in the right front seat was not injured. All were able to walk to the company fishing camp on the lake. There was no fire and the 406 megahertz emergency locator transmitter (ELT) was manually activated by one of the passengers. One of the operator's other aircraft, a Cessna 185, flew to the lake after C-FHVT became overdue. A search and rescue aircraft, responding to the ELT, also located the accident site. Radio contact between the Cessna 185 and the search and rescue aircraft confirmed that their assistance would not be required. The accident occurred at 1425 Eastern Daylight Time.", "probable_cause": "Prior to touchdown in a northerly direction, the aircraft encountered a gusty westerly crosswind and the associated turbulence. This initiated an un-commanded yaw and left wing drop indicating an aerodynamic stall. The pilot was unsuccessful in recovering full control of the aircraft and it impacted rising terrain on the shore approximately 30 feet above the water surface."}