{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-fort-lauderdale-1-killed", "date": "Jan 1, 2002 at 1802 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Air Taxi (USA)", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "North Eleuthera - Fort Lauderdale", "msn": "31-7952127", "yom": 1979, "flight_number": null, "city": "Fort Lauderdale-Hollywood", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2241, "captain_hours_type": 72, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7132, "circumstances": "The pilot stated that on the day of the accident he ordered fuel only on the first flight of the day. He said he did not add additional fuel during subsequent flights. He said he flew the accident airplane from Fort Lauderdale Executive Airport, Fort Lauderdale, Florida, to Chubb Cay, Bahamas, to Big Whale Cay, Bahamas, back to the Fort Lauderdale Executive Airport. He said he then departed Fort Lauderdale Executive Airport with his next load of passengers and flew to the North Eleuthera Airport, North Eleuthera, Bahamas, without having refueled, and was returning from North Eleuthera, Bahamas, to the Fort Lauderdale International Airport, when he ditched the airplane off Dania Beach, Florida, in the Atlantic Ocean. When asked whether the fuel on board the airplane had been exhausted, the pilot stated, \" the way the engines were acting, it seemed like the airplane ran out of fuel.\" On scene examination of the airplane, as well as follow on examination of its engines revealed no pre accident anomalies with the airplane or its systems. Information obtained from the FAA showed that at 1757, the pilot contacted FAA Miami Approach Control and advised \"minimum fuel, further stating that he was not declaring an emergency at that time. At 1758, the controller responded, passing communications control to the FAA Fort Lauderdale Air Traffic Control Tower (ATCT). In response to the pilot's initial communications call to the Fort Lauderdale ATCT, the pilot was given a clearance to land on runway 09R, and told that he was number one. At 1758:43, the pilot replied, asking if there was any chance of getting runway 27L, and at 1759:17, the controller instructed the pilot to descend at his discretion and remain slightly south of final for landing on runway 27L, and to expect 27L. At 1800:07, the pilot contacted the controller and stated, \"two five yankee would like to declare an emergency at this time.\" At 1800:10, the controller responded, \"two five yankee yes sir runway two seven left you are cleared to land the wind zero one zero at six.\" At 1800:16 the pilot responded acknowledging the wind report, and at 1800:27, the controller asked whether the nature of the emergency was minimum fuel, to which the pilot responded, \"exactly two five yankee may be coming in dead stick. At 1800:40, the pilot stated that he had the airport in sight and will try to glide, and at 1801:32, the pilot said \"two five yankee I'm going to be short of the shore.\" At 1802, the pilot ditched the airplane about 300 yards from the Dania Beach shoreline, in the area of John Lloyd State Park, in about 15 feet of water. The occupants of the airplane consisted of the pilot and four passengers. All exited the airplane and one passenger drowned in the Atlantic Ocean when according to the  pilot \"he was in a state of panic\" when he tried to instruct him in the use of the life vest while they was in the water, and subsequently tried to use him for flotation when he tried to help him. All remaining passengers confirmed that the pilot had not given them any pre departure safety related briefing prior to or during the accident flight.", "probable_cause": "The pilot's inadequate planning for a Title 14 CFR Part 135 on-demand air taxi flight, and his failure to refuel the airplane, which resulted in fuel exhaustion while en route over the Atlantic Ocean, a power off glide, and ditching in the ocean."}