{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-12-near-savasleyka-3-killed", "date": "Sep 20, 1949 at 0405 LT", "type": "Ilyushin II-12", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Moscow – Kazan – Chelyabinsk – Kostanay – Karaganda", "msn": "8 302 60 4", "yom": 0, "flight_number": null, "city": "Savasleyka AFB", "zone": "Nizhny Novgorod oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 550, "circumstances": "The crew was performing a cargo flight from Moscow to Karaganda with intermediate stops in Kazan, Chelyabinsk and Kostanay, carrying a load of various goods consisting of an industrial furnace (765 kg), theater sets, brass tubes (1,030 kg) and electrical equipment (695 kg). While cruising by night at an altitude of 1,800 meters, the flight engineer spotted some flames coming out from the left engine. The crew made several tests and controls, the captain reduced his altitude to 1,500 meters but eventually decided to continue. About an hour later, while flying at an altitude of 3,000 meters, the left engine failed. In such conditions, the pilot was unable to maintain a safe height and the aircraft descended until it hit some tree tops and crashed in a wooded area located on the top of a hill some 22 km east of Mourom, 12 km north of Savasleyka. Three crew members were killed while a fourth was seriously injured. ", "probable_cause": "Failure of the left engine caused by the rupture of a flexible set on a hydraulic line, which prevented the engine to be properly lubricated. It was determined that the hose was improperly fixed during a maintenance performed during last April. Lack of visibility caused by night and a wrong decision on part of the crew who decided to continue the flight in such conditions after the first anomaly that occurred an hour prior to the accident remain contributing factors."}