{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-lanseria", "date": "Jun 13, 2010 at 1100 LT", "type": "Swearingen SA226 Metro II", "operator": "African%20Skies%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lanseria – Polokwane", "msn": "TC-293", "yom": 1979, "flight_number": null, "city": "Lanseria", "zone": "Gauteng", "country": "South Africa", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 13, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6900, "captain_hours_type": 400, "copilot_hours": 1630, "copilot_hours_type": 35, "aircraft_hours": 27532, "circumstances": "Two flight crew members accompanied by thirteen passengers departed from FALA to FAPP. The flight was uneventful until during the approach to land on Runway 05 at FAPP. The flight crew selected landing gear down and observed a red light which indicate undercarriage unsafe. The flight crew reported the situation to FAPP Air Traffic Control (ATC). FAPP ATC gave instruction to do a missed approach at low level fly-past. The intention was to conduct a visual inspection of the undercarriage to determine its condition. The ATC observed that the left main gear had not extended.  FAPP ATC gave an instruction to the flight crew, to hold over the beacon (BHV), where they could attempt to extend the gear by means of normal and emergency procedure. The flight crew was not successful and undercarriage remained retracted. The flight crew returned to FALA with the intention to carry out an emergency landing.  FALA ATC give instructions to the flight crew to hold over the beacon (LIV), to again attempt the normal and emergency undercarriage extension procedures. But jet again; the flight crew was unsuccessful to lower the left main gear. ATC then instructed that the aircraft should execute the emergency landing on Runway 24R. During short finals overhead the threshold, prior to touchdown, the flight crew shut down both engines, feathered the propellers and switched off all the electronics. The aircraft landed and came to a gradual stop on its lower fuselage on the centreline of the runway. ", "probable_cause": "The pilot executed a belly “wheels up” emergency landing after the left main landing gear failed to extend. \r\nContributory Factors: \r\nThe new tyres installed on the main landing gear wheels were not in compliance with the instructions of the Fairchild Service Letter 226-SN-131. \n"}