{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-46j-kabul", "date": "Dec 10, 2016 at 1224 LT", "type": "Boeing 737-400", "operator": "Safi%20Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Herat - Kabul", "msn": "27826/2694", "yom": 1995, "flight_number": "4Q502", "city": "Kabul", "zone": "Kabul", "country": "Afghanistan", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 0, "pax_on_board": 164, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5078, "captain_hours_type": 4877, "copilot_hours": 3380, "copilot_hours_type": 3177, "aircraft_hours": 56805, "circumstances": "On 10 December 2016, JAV Boeing 737-400 Aircraft, registration JY-JAQ, operating a leased scheduled passenger flight SFW 502, on behalf of SAFI Airways under wet lease contract with the later call sign, departed a domestic flight from Herat Airport (OAHR), at 07:00 Z from RWY 36 to Kabul International Airport (OAKB) Afghanistan. At approximately 07:57:45 Z, the Aircraft touched down RWY 29 at Kabul. The aircraft departed Herat with 164 passengers ,07 Operating Crewmembers and 02 Engineers , Total on board were 173 person. As the flight approached OAKB, the crew received the automatic terminal information service (ATIS) from OAKB station at 07:45 Z indicating normal weather with visibility of 6 Km, temperature 07 degrees Celsius and wind of 150/07. The Aircraft was configured for landing with the flaps set to 30, and approach speed selected of 152 knots (VREF + 10) indicated airspeed (IAS). The Aircraft was cleared to approach ILS 29. The Aircraft was vectored by the radar for RWY 29. Air traffic control cleared the flight to land, with the wind reported to be 190 degrees at 15 knots. The crew stated that a few seconds after the touchdown, they felt the aircraft vibrating, during which they applied brakes and deployed the reverse thrust. The vibration was followed by the aircraft rolling slightly low to the right. It later came to a full stop left of the runway centre line, resting on its left main landing gear and the right engine, with the nose landing gear in the air. The occurrence occurred at approximately 3,806 ft / 1,160 m past the threshold. The PIC declared Emergency to the ATC and the cockpit crew initiated an evacuation command from the left side of the aircraft. Evacuation was successfully accomplished with No reported injuries. Kabul airport RFF reached the occurrence aircraft and observed the smoke coming from right side and immediately deployed their procedures by spraying foam on engine # 2. The aircraft sustained substantial damage due to the separation of the right main gear resulting on the aircraft skidding on the right engine cowlings. No injuries were sustained by any of the occupants during the occurrence or the evacuation sequence. Operating crew of the incident flight were called by the Afghani Civil Aviation Authority (ACAA) for interview and medical examination (alcohol and drugs, blood test). No injuries were reported by the occupants of the Aircraft or the ground crew. ", "probable_cause": "The Investigation committee determines that the airplane occasionally experienced main landing gear shimmy and the most probable cause indicated that the struts were extended for long period of time. As a result, the torsion link of the shimmy damper remained in an extended vertical position, where the damper has less mechanical advantage for longer periods of time. Despite the presence of shimmy damper hardware which is designed to reduce the torsional vibration energy generated during landing.\r\nContributing factors to the event include:\r\n- High altitude airport of 5,877 feet.\r\n- An overly soft landing, allows the landing gears to remain in the air mode longer, which makes them more vulnerable to shimmy,\r\n- Touchdown with a closure rate of 1 fps, which is considered overly soft and may increase the risk of shimmy torsional forces,\r\n- High ground speed at touchdown of 178 knots ,which resulted from the high touchdown airspeed of 158 knots , touchdown at (VREF+16)."}