{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-144s-goussainville-14-killed", "date": "Jun 3, 1973 at 1529 LT", "type": "Tupolev TU-144", "operator": "Tupolev", "flight_phase": "Flight", "flight_type": "Demonstration", "survivors": "No", "site": "City", "schedule": "Paris - Paris", "msn": "01-2", "yom": 1972, "flight_number": null, "city": "Goussainville", "zone": "Val-d'Oise", "country": "France", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 8, "total_fatalities": 14, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The supersonic airplane was engaged in a demonstration flight during the 'Paris Air Show'. Following a low pass over runway 03 at an altitude of 190 meters for about one km, the crew increased engine power and initiated a steep climb till the altitude of 1,200 meters. Then the airplane started to descent and four second after it reached the altitude of 750 meters on descent, the airplane rolled to the left at an angle of 40° with positive g loads of 4 to 4,5 g. At an altitude of 280 meters and a speed of 780 km/h, the front left wing detached, struck the left main wing and punctured the fuel tank. Out of control, the airplane disintegrated in the air and crashed in flames in Goussainville. All six occupants were killed as well as eight people on the ground. 28 other people were injured, some of them seriously. Several houses were destroyed. ", "probable_cause": "On 28 July 1974, French and Soviet experts confirmed in the final report that no anomaly could be found in the construction or operation of the aircraft and that the intervention of a human was therefore the greatest probability to explain the accident. Nearly 25 years later, members of the commission of inquiry revealed some elements about the crash after archives have been open to public. In the morning of the accident, a Mirage III fighter aircraft of the French Air Force (Armée de l'Air) took off from Strasbourg and the crew was asked to perform some aerial photos of the Tupolev during its low pass over Le Bourget Airport. By the time the Tupolev crew was at an altitude of about 500 meters, the Mirage was positioned about 200 meters above him and slightly ahead of him. According to investigations, the presence of this fighter likely distracted the crew of the Tupolev who felt that the distance of separation between both aircraft was insufficient. After a few seconds, the crew of the Mirage III was instructed to evacuate the zone (the procedure at that time was that each aircraft performing a demonstration at the Bourget Air Show must respect a minimum of 8 km of 'free' area). When the Mirage pilots made a turn to the left, the Mirage naturally seemed bigger to the Tupolev crew. As a result, the pilot-in-command of the supersonic positioned the aircraft in a slight pitch attitude during which a negative aerodynamic force of one g was recorded. As a result, a structural failure occurred on the left wing, which caused the aircraft to roll on its back, to brake in two parts and to explode in the air. It was later confirmed that the Tupolev TU-144 was designed to support a positive force of five to seven g but a negative force of one g only. In the present case, the negative force having been reached, a structural failure occurred. It was also confirmed that the Soviet pilots made this maneuver to avoid the collision with the Mirage. However, given the position of each aircraft at that time, a collision was impossible."}