{"url": "https://www.baaa-acro.com/crash/crash-learjet-24d-sierra-blanca-2-killed", "date": "Dec 10, 2001 at 1821 LT", "type": "Learjet 24", "operator": "Air Cargo Express (Fort Wayne)", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Harlingen – El Paso", "msn": "24-247", "yom": 1972, "flight_number": "Turbodog36", "city": "Sierra Blanca", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 20000, "captain_hours_type": 15000, "copilot_hours": 1400, "copilot_hours_type": null, "aircraft_hours": 7966, "circumstances": "The twin-turbojet, transport-category airplane was destroyed when it departed controlled flight during descent into its final destination and impacted terrain. The flight was cleared to descend from FL 390 to 10,000 feet, and the flight crew established a 4,000-foot/minute descent. As the airplane descended through FL 219, air traffic control requested the pilot contact approach control. However, the pilot read back an incorrect frequency and spoke an unintelligible word. The controller attempted to correct the pilot; however, no additional communications were received from the flight crew. Located within a pause in the pilot's last transmission, a 1680 Hz frequency could be heard for 0.1 seconds. There are only two systems in the airplane with aural warning systems within that frequency range; the cabin altitude warning, and the overspeed warning (both systems were destroyed during the accident sequence). Shortly after the last transmission from the pilot, radar data depicted the airplane climbing back up to FL 231 before entering a steep and rapid descent. A performance study indicated that just prior to the loss of control, the airplane exceeded its maximum operating airspeed of 300 knots calibrated. However, according to the manufacturer, the airplane had been successfully flown at airspeeds up to 400 knots calibrated without loss of control. The right wing and sections of the right horizontal stabilizer/elevator separated from the airplane just prior to its impact with terrain and were located approximately 200-250 feet from the main impact crater. No anomalies with the airframe or engine were found that would have led to the loss of control. A cockpit voice recorder was installed in the accident airplane; however, it did not record the accident flight.", "probable_cause": "A loss of control during descent for undetermined reasons."}