{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54d-1-dc-skymaster-miami-2-killed", "date": "Apr 14, 1970 at 0724 LT", "type": "Douglas C-54 Skymaster", "operator": "Ecuatoriana", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Miami – Panama City – Quito", "msn": "10608", "yom": 1945, "flight_number": "EU461", "city": "Miami-Intl", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3053, "captain_hours_type": 318, "copilot_hours": 3251, "copilot_hours_type": 120, "aircraft_hours": 20413, "circumstances": "The aircraft was being operated as an international cargo flight by Compania Ecuatoriana de Aviacion. The accident occurred during the initial climb, following an instrument takeoff on Runway 27R at Miami International Airport. The flight was en route,from Miami to Panama City, Panama, the first leg of a flight which was to terminate at Quito, Ecuador. The two pilots, the only occupants of the aircraft, were killed, and the aircraft was demolished by impact and post impact ground fire. The crew first requested a takeoff clearance at 0621 but because fog reduced visibility to one-eighth mile, the tower controller delayed issuance of the clearance until 0722 when the visibility was reported to be one quarter mile, the visibility minimum the pilot had stated he needed for takeoff. The crew's acknowledgment of this clearance was the last recorded transmission from the flight. Following liftoff, the aircraft was observed flying in a level flight attitude at an altitude of approximately 50 feet near the western end of Runway 27R, which was 10,500 feet long. The landing gear was retracted. As the observers watched the aircraft, they saw the nose drop slightly, check, and then the aircraft descended to earth. Impact occurred 279 feet north and 230 feet beyond the western end of the takeoff runway. The aircraft continued 89 feet beyond the initial impact point, struck a concrete abutment and burned. ", "probable_cause": "Improper monitoring of instruments during an IMC take-off. Factors were the improper procedures after take-off and reduced visibility due to fog."}