{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-820c-navajo-sao-paulo-1-killed", "date": "Jun 5, 2001 at 2030 LT", "type": "Embraer EMB-820 Navajo/Carajá", "operator": "Oliveira e Silva Táxi Aéreo", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Franca – São Paulo", "msn": "820-048", "yom": 1977, "flight_number": null, "city": "São Paulo-Congonhas", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2000, "captain_hours_type": 600, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5289, "circumstances": "The aircraft departed Franca Airport in the evening on a cargo flight to São Paulo, carrying one pilot and bank notes. On a night approach to São Paulo-Congonhas Airport, the pilot cancelled the IFR flight plan when he encountered technical problems with the right engine. He shut down the engine and continued the approach to runway 35R without informing ATC of his situation. Too high on the glide, he apparently decided to initiate a go-around when he lost control of the aircraft that rolled to the left, lost height and crashed in a residential area, bursting into flames. The aircraft was destroyed and the pilot was killed. Two people on the ground were injured. ", "probable_cause": "It was determined that the hydraulic pump on the right engine failed in flight, forcing the pilot to shut the engine down. It was reported that the pilot continued the approach in a single-engine configuration without informing ATC and that the aircraft was too high on the glide and approaching with an excessive speed. The pilot improperly analyzed the aircraft's flight conditions after shutting down the right engine, causing the aircraft to enter an approach configuration that was not compliant with the published procedures."}