{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-soldotna-6-killed", "date": "Jul 31, 2020 at 0827 LT", "type": "De Havilland DHC-2 Beaver", "operator": "High%20Adventure%20Air%20Charter", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": null, "msn": "904", "yom": 1956, "flight_number": null, "city": "Soldotna", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 19530, "captain_hours_type": 13480, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 23595, "circumstances": "On July 31, 2020, about 0827 Alaska daylight time, a de Havilland DHC-2 (Beaver) airplane, N4982U, and a Piper PA-12 airplane, N2587M, sustained substantial damage when they were involved in an accident near Soldotna, Alaska. The pilot of the PA-12 and the pilot and the five passengers on the DHC-2 were fatally injured. The DHC-2 was operated as a Title 14 Code of Federal Regulations (CFR) Part 135 on-demand charter flight. The PA-12 was operated as a Title 14 CFR Part 91 personal flight. The float-equipped DHC-2, operated by High Adventure Charter, departed Longmere Lake, near Soldotna, about 0824 bound for a remote lake on the west side of Cook Inlet. The purpose of the flight was to transport the passengers to a remote fishing location. The PA-12, operated by a private individual, departed Soldotna Airport, Soldotna, Alaska, (PASX) about 0824 bound for Fairbanks, Alaska. Flight track data revealed that the DHC-2 was traveling northwest about 78 knots (kts) groundspeed and gradually climbing through about 1,175 ft mean sea level (msl) when it crossed the Sterling Highway. The PA-12 was traveling northeast about 1,175 ft msl and about 71 kts north of, and parallel to, the Sterling Highway. The airplanes collided about 2.5 miles northeast of the Soldotna airport at an altitude of about 1,175 ft msl. A witness located near the accident site observed the DHC-2 traveling in a westerly direction and the PA-12 traveling in a northerly direction. He stated that the PA-12 impacted the DHC-2 on the left side of the fuselage toward the back of the airplane. After the collision, he observed what he believed to be the DHC-2's left wing separate, and the airplane entered an uncontrolled, descending counterclockwise spiral before it disappeared from view. He did not observe the PA-12 following the collision.", "probable_cause": "The failure of both pilots to see and avoid the other airplane. \r\nContributing to the accident were:\r\n1) the PA-12 pilot’s decision to fly with a known severe vision deficiency that had resulted in denial of his most recent application for medical certification and \r\n2) the Federal Aviation Administration’s absence of a requirement for airborne traffic advisory systems with aural alerting among operators who carry passengers for hire. "}