{"url": "https://www.baaa-acro.com/crash/crash-vickers-417-wellington-iii-wykeham-abbey-5-killed", "date": "Jul 24, 1946 at 1645 LT", "type": "Vickers 417 Wellington III", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Leconfield - Leconfield", "msn": null, "yom": null, "flight_number": null, "city": "Wykeham Abbey", "zone": "North Yorkshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 1535LT on 24th July 1946 this aircraft took off from Leconfield airfield for its crew to carry out a fighter affiliation exercise with a Spitfire (Spitfire TD236, of \"F\" Flight piloted by S/Ldr Leonard A Wood). The aircraft flew in a northerly direction, met up with the Spitfire over Driffield and then, owing to low cloud, the exercises were carried out at 10,000 feet over the Scarborough area. On board the Wellington was a pilot, a gunnery instructor and three trainee air gunners. During the exercise the Wellington was practicing taking evasive action when attacked by the fighter, it was thought that the pilot of the Wellington was making such a turn downwards, believed to have been the last of the exercise, but immediately after the last attack the Wellington went into a near vertical dive from between 6,000 and 7,000 feet from which it did not recover. At 1645LT the aircraft crashed into the grounds of Wykeham Abbey and while not catching fire it disintegrated on impact creating a large crater. All five on board stood no chance, they were killed instantly and the body of one of the crew was never found. The list or airmen below shows their trades as CWGC give. The resulting crash investigation reported that the aircraft had been reported as being nose-heavy in the weeks leading up to the crash but it was checked but was passed as serviceable on the day of this crash. The investigation listed a number of previous incidents when the aircraft had been inspected. It had been used in the prototype bouncing bomb trials and had its bomb doors removed for this but was later converted back to a \"normal\" Wellington and on 1st December 1943 repairs were completed at Vickers factory, Weybridge. On 17th July 1946 it was test flown and rear doors found locked up. A day later on 18th July 1946 it was test flown and the elevator trim for level flight was found incorrectly set, the cables were adjusted for correct movement. On 23rd July 1946 it was flown by F/Lt Meikle, who reported the aircraft nose heavy and the port engine was running slow. Extra ballast was added and the port engine revs were adjusted. On 24th July 1946 it was flown by W/O Schwedoski, who reported aircraft was satisfactory (he would be killed soon after in a crash at Appleton le Moors just a few days after this incident at Wykeham) but later that day the fatal crash at Wykeham occurred. \r\nCrew:\r\nW/O Roland Harrison, pilot,\r\nF/Lt John Christopher Haldon, air gunner, \r\nW/O Frederick Charles Stiff, air gunner, \r\nF/Sgt Peter Ingram, air gunner, \r\nW/O John Forest Armstrong, wireless operator and engineer. \r\nSource: \r\nhttp://www.yorkshire-aircraft.co.uk/aircraft/planes/ryedale/bj895.html", "probable_cause": "The crash report concluded that the aircraft should never have been in the air on the day because of known problems with it."}