{"url": "https://www.baaa-acro.com/crash/crash-antonov-26b-100-deputatsky", "date": "Nov 21, 2012 at 1431 LT", "type": "Antonov AN-26", "operator": "Polyarnye%20Avialinii", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yakutsk - Deputatsky", "msn": "111 08", "yom": 1981, "flight_number": "PI227", "city": "Deputatsky", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 23, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8845, "captain_hours_type": 1150, "copilot_hours": 2566, "copilot_hours_type": 245, "aircraft_hours": 22698, "circumstances": "Following an uneventful flight from Yakutsk-Magan Airport, crew started the descent to runway 10. On touch down on a snow covered runway, aircraft landed slightly to the left of the centerline. After a course of 350 meters, left main gear hit a snow berm of 20-50 cm high. Aircraft continued to the left, veered off runway and came to rest in snow covered field with its right main gear and right wing severely damaged. All 29 occupants were evacuated safely while the aircraft was damaged beyond repair. ", "probable_cause": "The non-fatal accident with An-26B RA-26061 aircraft was caused by its RWY overrun that resulted in aircraft structure damage. The accident was possible due to combination of the following factors:\r\n- Pilot's error resulted in approach procedure correction up to the moment of landing resulted in offset approach towards unpaved RWY axis and considerably to the left from its axis;\r\n- Non-compliance of unpaved RWY of \"Deputatsky\" Airport\" condition with Civil aerodrome operation manual requirements RF-94, in part of interface between cleaned and uncleaned surface of unpaved RWY with slope no more than 1:10;\r\n- Nose-left moment during main landing gear movement along interface from recent snow up to 30-50 cm as a result of both left landing gear wheels dipping into snow."}