{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-283b-madrid-181-killed", "date": "Nov 27, 1983 at 0106 LT", "type": "Boeing 747-200", "operator": "Avianca-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Frankfurt – Paris – Madrid – Caracas – Bogotá", "msn": "21381", "yom": 1977, "flight_number": "AV011", "city": "Madrid-Barajas", "zone": "Madrid", "country": "Spain", "region": "Europe", "crew_on_board": 19, "crew_fatalities": 19, "pax_on_board": 173, "pax_fatalities": 162, "other_fatalities": 0, "total_fatalities": 181, "captain_hours": 23215, "captain_hours_type": 2432, "copilot_hours": 4384, "copilot_hours_type": 875, "aircraft_hours": 20811, "circumstances": "Following an uneventful flight from Paris-Roissy-CDG Airport, the crew was cleared to descent to Madrid-Barajas Airport runway 33. Once the altitude of 9,000 feet reached on descent, the crew was cleared to continue. At 0103LT, he was cleared to land on runway 33 and should complete a turn to the right. Following several errors on approach, the crew initiated a right turn prior to pass over the VOR, causing the aircraft to descent below the MDA. At an altitude of 2,247 feet and at a speed of 142 knots, the right main gear struck the top of a hill. Upon impact, the right main gear and the engine n°4 were torn off. Three seconds later, while in a 4,9° nose-up attitude, at a speed of 135 knots, the aircraft struck the top of a second hill. Then, six seconds later, the right wing struck the ground. The aircraft overturned and crashed upside down, bursting into flames. The wreckage was found 12 km from the runway threshold in an olive plantation. Eleven passengers (among them four members of the same family, father, mother and both children) were injured while 181 other occupants were killed, among them the Peruvian writer Manuel Scorza. ", "probable_cause": "Following a series of omissions and navigation errors on descent, the crew adopted a wrong approach configuration, causing the aircraft to descend below the MDA without proper visual contact with the runway until initial and final impact with the ground. The following contributing factors were reported: \r\n_ Inaccurate navigation by the crew, which placed them in an incorrect position for initiating the approach manoeuvre,\r\n- Failure of the crew to take corrective action after the GPWS alarm sounded in the cockpit, \r\n- Poor crew coordination, \r\n- Crew fatigue, \r\n- Lack of ATC assistance during the last portion of the flight,\r\n- Misinterpretation of ATC instructions on part of the flying crew,\r\n- Lack of visibility due to the night. "}