{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-30-boston", "date": "Dec 17, 1973 at 1543 LT", "type": "Douglas DC-10", "operator": "Iberia-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Madrid - Boston", "msn": "46925/87", "yom": 1973, "flight_number": "IB933", "city": "Boston-Logan", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 14, "crew_fatalities": 0, "pax_on_board": 154, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 21705, "captain_hours_type": 426, "copilot_hours": 34189, "copilot_hours_type": 403, "aircraft_hours": 2016, "circumstances": "On approach to runway 33L at Boston-Logan Airport, the crew encountered marginal weather conditions with rain falls and a limited visibility to 3/4 mile in fog. While passing from IFR to VFR mode on short final, the captain failed to realize that the airplane lost height when the right main gear struck a dyke and was torn off. The airplane struck the runway surface, veered off runway to the right then lost its undercarriage and came to rest in flames. All 168 occupants were evacuated, six of them were injured. The aircraft was destroyed. ", "probable_cause": "The captain did not recognize, and may have been unable to recognize, an increased rate of descent in time to arrest it before the aircraft struck the approach light piers. The increased rate of descent was induced by an encounter with a low-level wind shear at a critical point in the landing approach where he was transitioning from automatic flight control under instrument flight conditions to manual flight control with visual references. The captain's ability to detect and arrest the increased rate of descent was adversely affected by a lack of information as to the existence of the wind shear and the marginal visual cues available. The minimal DC-10 wheel clearance above the approach lights and the runway threshold afforded by the ILS glide slope made the response time critical and, under the circumstances, produced a situation wherein a pilot's ability to make a safe landing was greatly diminished."}