{"url": "https://www.baaa-acro.com/crash/crash-bristol-175-britannia-101-littleton-upon-severn", "date": "Feb 4, 1954", "type": "Bristol Britannia", "operator": "Bristol-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Bristol - Bristol", "msn": "12874", "yom": 1953, "flight_number": null, "city": "Littleton-upon-Severn", "zone": "Gloucestershire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 13, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew (Bristol pilots and engineers and KLM pilots) was performing a test flight out from Bristol-Filton Airport. About seven minutes after takeoff, the engine number three temperature rose. The engine was shut down and later restarted as the temperature cooled. While climbing to an altitude of 10,000 feet, the temperature rose again and the engine exploded. The fire could not be extinguished and as a precaution, it was decided to shot down the engine number four and to return to Filton. On approach, both left engines stopped but were quickly restarted. In such conditions, the captain decided to attempt a belly landing in the Severn estuary, off Littleton-upon-Severn. All 13 occupants escaped with minor injuries while the aircraft was damaged beyond repair. \r\nSource:\r\nhttp://www.bristol-britannia.com/p/history-of-romeo-x-ray.html", "probable_cause": "It was determined that the explosion of the engine number three was the consequence of the failure of the reduction gear. A pinion at the front of the propeller shaft had been stripped of its teeth. The revolutionary Proteus turboprop engine had a free turbine design, so the reduction gear failure left the propeller turbine unloaded. In this state it rapidly oversped, and eventually disintegrated in an explosion. The fire was caused by shrapnel piercing the engine oil tank, and igniting the oil. The reduction gear was later redesigned and installed in subsequent aircraft. The straight teeth on the offending pinion were replaced with helical teeth. The cause of the shutdown of engines no. 1 and 2 was due to a short circuit, caused by the fire."}