{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-141b-starlifter-atlantic-ocean-9-killed", "date": "Sep 13, 1997 at 1710 LT", "type": "Lockheed C-141 Starlifter", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Windhoek - Georgetown - McGuire AFB", "msn": "6142", "yom": 1965, "flight_number": "REACH4201", "city": "Atlantic Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 36430, "circumstances": "Some 65 nautical miles west off the Namibian coast, a US Air Force Lockheed C-141B Starlifter collided with a German Air Force Tupolev 154M in mid-air. Both aircraft crashed, killing all 33 occupants. The Tupolev 154M (11+02), call sign GAF074, operated on a flight from Cologne/Bonn Airport in Germany to Kaapstad, South Africa. En route refueling stops were planned at Niamey, Niger and Windhoek, Namibia. On board were ten crew members and 14 passengers. The C-141B, (65-9405), call sign REACH 4201, had delivered UN humanitarian supplies to Windhoek and was returning to the U.S. via Georgetown on Ascension Island in the South Atlantic Ocean. On board were nine crew members. GAF074 departed Niamey, Niger at 10:35 UTC. REACH 4201 took off from Windhoek at 14:11 UTC and climbed to its filed for and assigned cruise level of 35,000 feet (FL350). At the same time, GAF074 was not at its filed for cruise level of FL390 but was still at its initially assigned cruise level FL350. Windhoek ATC was in sole and continuous radio contact with REACH 4201, with no knowledge of GAF 074's movement. Luanda ATC was in radio contact with GAF074, but they were not in radio contact with REACH 4201. Luanda ATC did receive flight plans for both aircraft but a departure message for only REACH 4201. At 15:10 UTC both aircraft collided at FL350 and crashed into the sea.", "probable_cause": "The primary cause of this accident, in my opinion, was GAF 074 flying a cruise level (FL350) which was not the level they had filed for (FL390). Neither FL350 nor FL390 were the correct cruise levels for that aircraft's magnetic heading according to International Civil Aviation Organization regulations. The appropriate cruise level would have been FL290, FL330, FL370, FL410, etc. A substantially contributing factor was ATC agency Luanda's poor management of air traffic through its airspace. While ATC communications could be improved, ATC agency û Luanda did have all the pertinent information it needed to provide critical advisories to both aircraft. If ATC agency Luanda was unable to contact GAF 074, it should have used other communication means (HF radio, telefax or telephone) to contact REACH 4201 through ATC agency Windhoek, as outlined in governing documents. Another substantially contributing factor was the complicated and sporadic operation of the Aeronautical Fixed Telecommunications Network (AFTN). Routing of messages to affected air traffic control agencies is not direct and is convoluted, creating unnecessary delays and unfortunate misroutings. Specifically, ATC agency Windhoek did not receive a flight plan or a departure message on GAF 074, which could have been used by the controllers to identify the conflict so they could have advised REACH 4201. In my opinion, the absence of TCAS was not a cause or substantially contributing factor, but the presence of a fully operational TCAS could have prevented the accident.\" (William H.C. Schell, jr., Colonel, USAF President, Accident Investigation Board)."}