{"url": "https://www.baaa-acro.com/crash/crash-vickers-621-viking-1-southall-7-killed", "date": "Sep 2, 1958 at 0632 LT", "type": "Vickers Viking", "operator": "Independent Air Travel", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "London – Nice – Brindisi – Athens – Tel Aviv", "msn": "127", "yom": 1946, "flight_number": null, "city": "London-Heathrow", "zone": "London Metropolis", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 4, "total_fatalities": 7, "captain_hours": 13000, "captain_hours_type": null, "copilot_hours": 1000, "copilot_hours_type": null, "aircraft_hours": 2319, "circumstances": "The Viking took off from London Airport at 0554 hours GMT with a crew of 3 for a flight to Nice, Brindisi, Athens and Tel Aviv. Fifteen minutes later the cap tain informed London Airport that he had engine trouble and wished to return to Blackbushe. During the return flight the aircraft initially maintained 7,000 feet. Clearance was given to descend to 3000 feet but the descent was apparently continued to 1,000 feet without informing control. Shortly afterwards the aircraft reported \"having difficulty maintaining height\" and six minutes later, at 0632LT, it crashed in Southall, about 3 miles from the airport. The aircraft was totally destroyed upon impact as well as several houses. All three crew members and four people on the ground were killed. Fifteen other people on the ground were injured. ", "probable_cause": "The aircraft was allowed to lose height and flying speed with the result that the pilot was no longer able to exercise asymmetric control. The conduct of the pilot and the whole course of events outlined were contributed to by the deliberate policy of this Company, which was to keep its aircraft in the air and gainfully employed regardless of the regulations or of the elementary requirements which should enjoin consideration for the conditions of working of its employees or the maintenance of its aircraft. Any responsibility of the captain is to be viewed in the light of his position as an employee upon whose shoulders an intolerable burden was placed. At the time of the accident, the airplane was overloaded and the captain was overduty as he had been on duty for 31 hours 30 minutes, a gross breach of Article 34E of the Order, since the maximum permissible flying duty period for a two-pilot crew is 16 hours."}