{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-leesburg-3-killed", "date": "Mar 1, 2003 at 1445 LT", "type": "Socata TBM-700", "operator": "High Performance Technologies", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Greenville - Leesburg", "msn": "059", "yom": 1992, "flight_number": null, "city": "Leesburg-Executive", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 730, "captain_hours_type": null, "copilot_hours": 8375, "copilot_hours_type": null, "aircraft_hours": 1049, "circumstances": "The private pilot, who sat in the left seat, was executing the LOC RWY 17 instrument approach in actual instrument meteorological conditions, when the airplane decelerated, lost altitude, and began a left turn about 2 miles from the airport. Subsequently, the airplane collided with terrain and came to rest on residential property. The radar data also indicated that the airplane was never stabilized on the approach. A witness, a private pilot, said the airplane \"appeared\" out of the fog about 300-400 feet above the ground. It was in a left bank, with the nose pointed down, and was traveling fast. The airplane then \"simultaneously and suddenly level[ed] out,\" pitched up, and the engine power increased. The witness thought that the pilot realized he was low and was trying to \"get out of there.\" The airplane descended in a nose-high attitude, about 65 degrees, toward the trees. Radar data indicates that the airplane slowed to 80 knots about 3 miles from the airplane, and then to 68 knots 18 seconds later as the airplane began to turn to the left. Examination of the airplane and engine revealed no mechanical deficiencies. Weather reported at the airport 25 minutes before the accident included wind from 140 degrees at 5 knots, visibility 1 statute mile, and ceiling 500 foot overcast. Weather 5 minutes before the accident included wind from 140 degrees at 5 knots, visibility 1 statute miles, and ceiling 300 foot overcast.", "probable_cause": "The pilot's failure to fly a stabilized, published instrument approach procedure, and his failure to maintain adequate airspeed which led to an aerodynamic stall."}