{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-44-widgeon-near-pelican-1-killed", "date": "Nov 4, 1954 at 1310 LT", "type": "Grumman G-44 Widgeon", "operator": "Alaska%20Coastal%20Airlines2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Sitka – Pelican – Hoonah – Juneau", "msn": "1321", "yom": 1943, "flight_number": "ACA060", "city": "Pelican", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 14000, "captain_hours_type": 600, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2763, "circumstances": "Flight 60 originated at Sitka, Alaska, with stops scheduled at Pelican City, Hoonah, and Juneau, the destination. Before departure from Sitka, the dispatcher in Juneau issued clearance for the flight to proceed DVFR (Defense Visual Flight Rules) to Hoonah and wait, if necessary, at that station for weather to improve in the Juneau area. The flight plan indicated estimated time from Sitka to Juneau, including stops, would be two hours and fifty minutes. Fuel consumption was estimated at 60 gallons, with 20 gallons re-serve upon arrival at Juneau. Gross weight of all disposable load at takeoff was 1,401 pounds, 30 less than the maximum allowable. The flight departed Sitka at 1153 with Captain James C. Rinehart (pilot), four passengers, cargo, mail, and baggage. The route between Sitka and Pelican City follows the North Pacific shore. The flight landed at Pelican City at 1235. Two passengers deplaned and 88 pounds of baggage, mail, and cargo were taken off; 159 pounds of cargo were added. The aircraft was not refueled. The pilot reported by radio that the flight departed Pelican City at 1305 en route to Hoonah. This was the last radio contact. When the flight became overdue at Hoonah, search operations were instituted. The Coast Guard was notified at 1655 and began search. At approximately 0800 the following morning, the pilot of a private aircraft located the wreckage in a mountain pass several miles southeast of Pelican City. A Coast Guard and civilian ground rescue party arrived the afternoon of November 5, rendered first aid to the two passengers, and stayed until the survivors and the body of the pilot were evacuated by helicopter on November 6. ", "probable_cause": "The Board determines that the probable cause of this accident was loss of control of the aircraft during a steep turn in severe turbulence while the pilot was attempting to conduct visual flight at less than the required altitude and weather minimums. The following findings were reported: \r\n- Weather conditions within the pass were: Rain, fog, severe turbulence, and low ceiling, with the base of the clouds extending about halfway down the 3,000-foot mountain slopes,\r\n- Flight 60 crashed one-fourth mile due south of the summit of the pass about 1.500 feet above mean sea level, the pilot having negotiated about three miles of its 10-mile length,\r\n- The aircraft struck the ground on a west heading at a sharp bend in the narrow pass, having encountered strong turbulence in a steep left bank at low altitude,\r\n- The pilot had reversed course when the accident occurred,\r\n- The two passengers survived but the pilot was fatally injured,\r\n- Alaska Coastal Airlines flights in this type aircraft are restricted to Defense Visual Flight Rules operations,\r\n- The Alaska Coastal Airlines operations manual specified that the pass must be flown at 3,000 feet altitude,\r\n- The pilot was attempting to negotiate the pass at less than the altitude specified in the operations manual and in weather conditions which were lower than DVFR requirements."}