{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227bc-metro-iii-cork-6-killed", "date": "Feb 10, 2011 at 0950 LT", "type": "Swearingen SA227 Metro III", "operator": "Manx2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Belfast – Cork", "msn": "BC-789B", "yom": 1992, "flight_number": "NM7100", "city": "Cork", "zone": "Munster", "country": "Ireland", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 10, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 1801, "captain_hours_type": 1600, "copilot_hours": 539, "copilot_hours_type": 289, "aircraft_hours": 32653, "circumstances": "The aircraft departed Belfast City Airport (EGAC) on an international scheduled passenger service to Cork Airport (EICK). Low Visibility Procedures (LVP) were in operation at the destination. The aircraft carried out two ILS1  approaches, each followed by a missed approach. The aircraft then entered a holding pattern following which a third ILS approach was made to Runway (RWY) 17. The approach was continued below Decision Height (200 ft) and a missed approach was initiated. Approaching the runway threshold, the aircraft rolled to the left followed by a rapid roll to the right during which the right wingtip contacted the runway surface. The aircraft continued to roll and impacted the runway in a fully inverted position. The aircraft departed the runway surface to the right and came to rest in soft ground. A significant quantity of mud entered the aircraft through a fracture in the roof, partially filling the cabin. Six persons (including the two Flight Crew members) were fatally injured, four were seriously injured and two received minor injuries. The propeller blades on both engines were severely damaged; three of the four propeller blades on the right-hand engine detached during the impact sequence. Fire occurred in both engines after impact. These fires were extinguished expeditiously by the Airport Fire Service.", "probable_cause": "Loss of control during an attempted go-around initiated below Decision Height (200 feet) in Instrument Meteorological Conditions.\r\nThe following factors were considered as significant:\r\n- The approach was continued in conditions of poor visibility below those required.\r\n- The descent was continued below the Decision Height without adequate visual reference being acquired.\r\n- Uncoordinated operation of the flight and engine controls when go-around was attempted\r\n- The engine power-levers were retarded below the normal in-flight operational range, an action prohibited in flight.\r\n- A power difference between the engines became significant when the engine power levers were retarded below the normal in-flight range.\r\n- Tiredness and fatigue on the part of the Flight Crew members.\r\n- Inadequate command training and checking.\r\n- Inappropriate pairing of Flight Crew members, and\r\n- Inadequate oversight of the remote Operation by the Operator and the State of the Operator."}