{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-las-vegas-3-killed", "date": "Jul 12, 1993 at 1440 LT", "type": "Cessna 402", "operator": "Air%20Nevada", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Las Vegas – Grand Canyon", "msn": "402C-0324", "yom": 1980, "flight_number": null, "city": "Las Vegas-McCarran", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4120, "captain_hours_type": 568, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11513, "circumstances": "The pilot had a 25 minutes turnaround for the accident trip from the prior flight. No witnesses were found who observed the pilot preparing for the flight or performing a preflight inspection. Company procedures specify that the pilots are responsible for loading and unloading the baggage. The manifest for the prior flight showed 54 lbs of baggage in the nose compartment. Shortly after liftoff, the pilot told the local controller that the baggage door was open and he requested a 'go around.' The local controller told the pilot to make right traffic. Multiple witnesses saw the airplane in a nose high attitude during the initial climb after takeoff. They reported the pilot entered a right turn which continued until the airplane 'fell to the ground and hit nose first.' An airline pilot witness said that the airplane's actions were a 'classic VMC roll.' Other witnesses reported that the left nose baggage compartment door was open during the takeoff and initial climb. Evidence shows that the right eng was developing little or no power. All three occupants were killed. ", "probable_cause": "The pilot's failure to maintain adequate airspeed while maneuvering in the traffic pattern. A factor which contributed to the accident was the pilot's failure to assure that the nose baggage compartment door was secured."}