{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6-amsterdam", "date": "May 1, 1948 at 1046 LT", "type": "Douglas DC-6", "operator": "KLM-21", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Amsterdam - Amsterdam", "msn": "43112", "yom": 1948, "flight_number": null, "city": "Amsterdam-Schiphol", "zone": "North Holland", "country": "Netherlands", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14000, "captain_hours_type": 21, "copilot_hours": 2000, "copilot_hours_type": 2, "aircraft_hours": null, "circumstances": "The crew was engaged in a local training flight on this brand new aircraft that was delivered to KLM last April 22. After several touch and goes completed without any issues, the instructor decided to perform a takeoff with the engine number one voluntarily inoperative. Ready for departure on runway 23, the crew increased power on all four engines and started the takeoff procedure. At a speed of 137 km/h, the captain started the rotation and the nose wheel left the ground. At a speed of 169 km/h, the instructor decided to reduce the power on the engine number one and pull the power lever to the back. At this moment, the aircraft was still on the ground and slightly deviated from the runway center line to the left. The captain tried to counteract this with the tail when the right main gear left the ground. Due to the presence of obstacles ahead, the instructor decided to increase power on the engine number one that oversped. The left wing dropped and hit a rocky wall, causing the aircraft to stall and crash into a ditch. All five crew members were injured while the aircraft was destroyed. ", "probable_cause": "It is possible that the accident may have been caused by a fault in the time position of the screw system of the engine number one, whereby the blade angle of this screw was incorrect. Unfortunately, this could not be demonstrated conclusively. In addition of that, the reaction from the crew when  the aircraft started to deviate from the path and the correction with the rudder was approximately 3.5 seconds, which lead the aircraft to become out of control. "}