{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154-irkoutsk-125-killed", "date": "Jan 3, 1994 at 1207 LT", "type": "Tupolev TU-154", "operator": "Baikal%20Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Irkutsk - Moscow", "msn": "89A801", "yom": 1989, "flight_number": "BKL130", "city": "Irkutsk", "zone": "Irkutsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 115, "pax_fatalities": 115, "other_fatalities": 1, "total_fatalities": 125, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While preparing the flight, the crew encountered technical problems with the engine n°2 and 17 minutes were necessary to start all three engines. A technical issue occurred with the starter of the engine n°2 and a warning light came on in the cockpit. The crew did not find any corrective actions in the operations manual and as he thought the warning was false, decided to take off. Four minutes after the aircraft departed Irkutsk Airport runway 12, while climbing, the starter located in the engine n°2 failed. Debris scattered around and hydraulic and fuel lines were cut. The crew declared an emergency and was cleared for an immediate return after the engine n°2 caught fire. Unfortunately, the crew was unable to extinguish the fire and the aircraft entered an uncontrolled descent and eventually crashed on farm buildings located about 11 km from the airport. The aircraft disintegrated on impact and all 124 occupants were killed as well as one farmer. Another farmer was seriously injured. ", "probable_cause": "The commission found that the air starter malfunction occurred when the engine was started due to a structural element of the air conditioning system, probably a fragment of the air-to-air radiator (VVR) splitter of engine n°2, hit under the constant pressure flap. This became possible due to the lack of protection against the ingress of foreign objects from the air lines and the low operational reliability of the VVR. A constant supply of air under pressure from the engines operating at a mode close to the nominal through an open damper led to the starter not switching off and the turbine rotor spinning up to off-design speed with the alarm \"Dangerous starter speed\" being triggered, which was detected by the flight engineer after starting all the engines. Pressing the starter shutdown button did not turn off the alarm. There were no other signs of failure other than the operation of the warning lamp. The crew, believing that the alarm was false, made the wrong decision to take off, which was a consequence of the unwillingness to act in such a situation due to shortcomings in the regulatory documentation, information support, as well as insufficient information content of the starter's technical condition monitoring system in the cockpit. Laying the mains of all three hydraulic systems through the fire-hazardous compartment of the engine n°2 is a constructive disadvantage of the Tu-154M aircraft."}