{"url": "https://www.baaa-acro.com/crash/crash-casa-212-aviocar-200-long-apung-3-killed", "date": "Jan 26, 2008 at 0936 LT", "type": "Casa 212 Aviocar", "operator": "Dirgantara%20Air%20Service-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tarakan – Long Apung", "msn": "412/92N", "yom": 1993, "flight_number": null, "city": "Long Apung", "zone": "North Kalimantan", "country": "Indonesia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 21019, "captain_hours_type": 14234, "copilot_hours": 16849, "copilot_hours_type": 16849, "aircraft_hours": 11750, "circumstances": "On 26 January 2008, a Casa 212-200 aircraft, registered PK-VSE, was being operated by PT. Dirgantara Air Service as a cargo charter flight from Tarakan Airport to Long Apung Airport. There were 3 persons on board; two pilots and one aircraft maintenance engineer/load master. The aircraft was certified as being airworthy prior to departure. The aircraft departed from Tarakan at 0011 UTC (08:11 local time), and the estimated time arrival at Long Apung was 0136. At 0411 the pilot of another aircraft received a distress signal and informed air traffic services at Tarakan. Searchers subsequently found the aircraft wreckage at an elevation of 2,766 feet, about 3.4 NM from Long Apung Airport. The coordinates of the accident site were 01° 39.483′ S and 115° 00.265′ E near Lidung Payau Village, Malinau, East Kalimantan. The accident site was on the left downwind leg of the runway 35 circuit.", "probable_cause": "The following findings were identified:\r\n• The aircraft was certified as being airworthy prior to departure.\r\n• All crew members held appropriate and valid flight crew licenses.\r\n• The pilots continued flight into instrument meteorological conditions.\r\n• The aircraft impacted terrain in controlled flight.\r\n• The cargo was not adequately restrained.\r\nCauses:\r\nThe crew did not appear to have awareness of the aircraft’s proximity with terrain until impact with terrain was imminent. The pilot attempted to continue the flight in instrument meteorological\r\nconditions, below the lowest safe altitude. "}