{"url": "https://www.baaa-acro.com/crash/crash-short-s25-sunderland-iii-near-brandon-10-killed", "date": "Jul 28, 1943 at 0520 LT", "type": "Short S.25 Sunderland", "operator": "BOAC-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Lagos – Lisbon – Foynes", "msn": null, "yom": 1942, "flight_number": null, "city": "Mt Brandon", "zone": "Munster", "country": "Ireland", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 1, "pax_on_board": 18, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "By night, the crew overflew the Shannon estuary and continued to the north at an altitude of 6,000 feet. Forty-five minutes later, the captain disengaged the automatic pilot system and started the descent manually. After passing through the last cloud layer, the crew distinguished the ground but did not realized that his altitude was to low. The seaplane hit the slope of Mt Brandon with its right wing, stalled and crashed in flames southwest of Brandon village. Fifteen occupants were injured while ten others were killed, among them the captain.\r\nCrew:\r\nThomas Allitt, pilot, †\r\nJohn Harrop Slater, copilot,\r\nEric William Vincent, navigator,\r\nCharles Harry P. Phillips, radio operator,\r\nFrederick Thomas James Parr, radio operator,\r\nVictor Rawlinson, flight engineer, \r\nRalph Bousquet Lawes, flight engineer.\r\nPassengers:\r\nDavid William Stannard, †\r\nJohn Diarmuid Hartigan, †\r\nArthur Friedrich Rawson Lumby, †\r\nWilliam Sacheverell Hebden,\r\nLewis Milner, †\r\nSidney Leonard Pullinger, †\r\nIan Kenneth Thom, †\r\nHarold Tristram, †\r\nThomas Watson Thomson,\r\nKenneth Joseph Devall, †\r\nLeonard King,\r\nVictor Francis Edward Simmons,\r\nOliver Frith,\r\nAlfred Brooker Depree,\r\nMax Albert Roth, †\r\nLloyd Gilbert French,\r\nRoy Elliott Bertram,\r\nRaymond François Larche.\r\nSource: http://www.csn.ul.ie/~dan/war/gages.pdf", "probable_cause": "Navigation for the flight west from Foynes was by compass and loop bearing on the ground radio station and there was no request from the aircraft for QTE bearings to be transmitted from the radio station. If it is assumed that the aircraft's loop bearing on the radio station was free from error, the alteration in the aircraft's track should have been immediately apparent by a change in the compass course. Alternatively, if the course remained constant the alteration in track should have been indicated by a change in the loop bearing. The departure from the required track was not discovered by the crew and the reason for this is not conclusively evident. Radio direction-finding apparatus of the type used on the aircraft is subject to error around sunset and sunrise. The presence of this error, known as “Night Effect” cannot always be detected, even by experienced radio operators. The probable final cause of the accident was “Night Effect” which affected the accuracy of the direction-finding apparatus on the aircraft. The contributory causes of the accident may be summarized as follows:\r\n- A strong south-westerly wind which resulted in the aircraft's arriving at Shannon Airport thirty minutes before its scheduled time of arrival;\r\n- A change in wind direction from S.W. To N.W. in the Shannon area around the actual time of arrival;\r\n- The pilots error in technique in relying entirely on the aircraft's loop bearings for radio assistance to the exclusion of direction signals from the ground station."}