{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-50-teterboro-3-killed", "date": "Nov 10, 1985 at 1722 LT", "type": "Dassault Falcon 50", "operator": "Nabisco", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "City", "schedule": "Morristown - Teterboro", "msn": "118", "yom": 1982, "flight_number": null, "city": "Teterboro", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 1, "total_fatalities": 3, "captain_hours": 8265, "captain_hours_type": 817, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Dassault Falcon 50 jet (N784B) and an Air Pegasus Piper PA-28-181 Archer (N1977H) collided about 1500 feet over the towns of Fairview and Cliffside Park, New Jersey, USA. The Falcon 50 was cleared for a standard instrument approach procedure in visual meteorological conditions and was in a left turn to position itself on the downwind leg to runway 19 at the Teterboro Airport, and the PA-28 was transiting the airport traffic area from west to east when they collided. The accident occurred 4 1/2 miles east-southeast at the edge of the airport traffic area in visual meteorological conditions. Both airplanes had been in radio contact with the Teterboro control tower. The flightcrew, the only occupants aboard the Falcon 50, and the pilot and two passengers onboard the PA-28 were killed. The Falcon 50 crashed into an apartment building killing one resident and seriously injuring two bystanders.", "probable_cause": "A breakdown in air traffic control coordination which resulted in an air traffic conflict and the inability of the DA50 flightcrew to ‘see and avoid' the other aircraft due to: \r\n- An erroneous and inadequate traffic advisory and \r\n- The physiological limitations of human vision and reaction time at night. \r\nAir traffic control management contributed to the accident by failing to insure that controllers were following prescribed procedures and by failing to recognize and correct operational deficiencies."}