{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31p-pressurized-navajo-gallup-1-killed", "date": "Dec 29, 2004 at 1018 LT", "type": "Piper PA-31-310 Navajo", "operator": "Ronald L. Patton", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Glendale – Newton", "msn": "31-7530008", "yom": 1975, "flight_number": null, "city": "Gallup", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 936, "captain_hours_type": 62, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6773, "circumstances": "While maneuvering during a precautionary landing with the right engine shutdown, the airplane entered a Vmc roll and an uncontrolled descent, and impacted wires, trees, and terrain. According to air traffic control communications, while en route the pilot experienced a rough running right engine and performed a precautionary shutdown of the engine. The pilot elected to divert to an airport and received vectors from air traffic control for a visual approach. Witnesses who were located at the airport reported the airplane was on a normal downwind for the runway. When the airplane reached the approach end of the runway, the pilot turned to the right which was away from the airport. A witness who was monitoring the UNICOM frequency informed the pilot he was turning away from the airport and the pilot responded, \"Busy.\" The airplane continued the right turn subsequently entered a Vmc roll and a rapid descent toward the terrain. The airplane wreckage was located on hilly, rocky terrain approximately 3 miles south of the airport. The airplane was fragmented and destroyed during the impact sequence and post-impact fire. Examination of the airframe and propellers revealed no anomalies that would have precluded normal operations. Examination of the left engine revealed the forward gearbox was destroyed and mechanical continuity of the rotating components and internal mechanisms was established. Examination of the right engine revealed the forward gearbox was destroyed and mechanical continuity of the rotating components and internal mechanisms was established. The reason for the reported rough running engine was not determined. The lifters installed in both engines during the overhauls were not approved lifters for the accident engines.", "probable_cause": "The pilot's failure to maintain minimum controllable airspeed which resulted in the loss of control, and impact with wires, a tree and terrain."}