{"url": "https://www.baaa-acro.com/crash/crash-north-american-tb-25n-mitchell-stockton", "date": "Sep 19, 2020 at 1925 LT", "type": "North American B-25 Mitchell", "operator": "Proair Holding Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Vacaville - Stockton", "msn": "108-33263", "yom": 1944, "flight_number": null, "city": "Stockton", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5100, "captain_hours_type": 296, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8099, "circumstances": "While the airplane was in cruise flight and being flown by the copilot, the left engine fuel pressure fluctuated, which was followed by a brief loss of engine power. Concerned that the airplane might have a failed engine-driven fuel pump, the pilot turned the boost pumps to high and asked the passenger (the airplane’s mechanic) to open the fuel cross-feed valve. As the airplane approached its intended destination, both fuel pressure needles began to fluctuate. The pilot assumed that fuel starvation to the engines was occurring and decided to make an off-airport landing to a field behind their airplane’s position due to residential areas located between the airplane’s location and the airport. The pilot stated that he took control of the airplane from the copilot and initiated a right turn toward the field, and that, shortly afterward, both engines lost total power. During the landing roll, the pilot observed a ditch in front of the airplane and was able to get the airplane airborne briefly to avoid the first ditch; however, he was not able to avoid a second, larger ditch. Subsequently, the airplane struck the second ditch, became airborne, and impacted the ground, which resulted in substantial damage to the fuselage. Recovery company personnel reported that, during recovery of the wreckage, about 1 gallon of fuel was removed from the two forward and the two aft wing fuel tanks. Postaccident examination of the airplane revealed no evidence of any pre-existing anomalies that would have precluded normal operation of either engine except that all four main fuel tank fuel gauges displayed erroneous indications after each tank was filled with water. No leaks were observed throughout the fuel system. The airplane was last refueled on the day before the accident with 497.7 gallons. When the airplane was last refueled, the fuel tanks were reportedly filled to about 3 inches below the fuel filler neck. The investigation could not determine, based on the available evidence for this accident, how much of the airplane’s fuel load (maximum capacity was 670 gallons) the airplane had onboard after it was refueled. Additionally, the pilot reported that he commonly used a fuel burn rate of 150 gallons per hour for flight planning purposes; that figure included takeoff fuel burn. Recorded automatic dependent surveillance broadcast data showed that the airplane had flown for 4 hours 1 minute since refueling and included six takeoffs and five landings (but did not include taxi times). As part of the investigation, the pilot estimated that 485.9 gallons of fuel had been used since the last refueling. However, on the basis of the pilot’s initial planned fuel load and recorded flight times, the airplane would have used about 600 gallons of fuel. The pilot later submitted an estimated fuel burn for the flights since refueling of 485.9 gallons. The flight manual did not have fuel burn references for the exact power settings and altitudes flown; thus, the hourly fuel burn could not be determined. The pilot, copilot, and passenger did not visually verify the fuel levels in all four main fuel tanks before the accident flight. The pilot also underestimated the amount of fuel that would be used for the planned flights. As a result, fuel exhaustion occurred, which led to a total loss of engine power.", "probable_cause": "A total loss of engine power due to fuel exhaustion. Contributing to the accident was the erroneous fuel gauge indications and inadequate preflight planning and inspection."}