{"url": "https://www.baaa-acro.com/crash/crash-embraer-135-george", "date": "Dec 7, 2009 at 1101 LT", "type": "Embraer ERJ-135", "operator": "South%20African%20Airlink", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cape Town - George", "msn": "145-423", "yom": 2001, "flight_number": "SA8625", "city": "George", "zone": "Western Cape", "country": "South Africa", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 32, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11973, "captain_hours_type": 2905, "copilot_hours": 2336, "copilot_hours_type": 864, "aircraft_hours": 21291, "circumstances": "Flight SA8625 departed from Cape Town International Airport on a domestic scheduled flight to George Airport (FAGG) with three crew members and 32 passengers on board. The weather at FAGG was overcast with light rain, and the aircraft was cleared for an instrument landing system approach for runway 11. It touched down between the third and fourth landing marker. According to the air traffic controller, the landing itself appeared normal, but the aircraft did not vacate the runway to the left as it should have. Instead, it veered to the right, overran the runway and rolled on past the ILS localiser. Realising that something was wrong, he activated the crash alarm. The cockpit crew did not broadcast any messages to indicate that they were experiencing a problem. The aircraft collided with eleven approach lights before bursting through the aerodrome perimeter fence and coming to rest in a nose-down attitude on the R404 public road. Several motorists stopped and helped the passengers, who evacuated the aircraft through the service door (right front) and left mid-fuselage emergency exit. The aerodrome fire and rescue personnel arrived within minutes and assisted with the evacuation of the cockpit crew, who were trapped in the cockpit. Ten occupants were admitted to a local hospital for a check-up and released after a few hours. No serious injuries were reported. ", "probable_cause": "The crew were unable to decelerate the aircraft to a safe stop due to ineffective braking of the aircraft on a wet runway surface, resulting in an overrun. \r\nContributory factors:\r\n- The aircraft crossed the runway threshold at 50 ft AGL at 143 KIAS, which was 15 kt above the calculated VREF speed. \r\n- Although the aircraft initially touched down within the touchdown zone the transition back into air mode of 1.5 seconds followed by a 4 second delay in applying the brakes after the aircraft remained in permanent ground mode should be considered as a significant contributory factor to this accident as it was imperative to decelerate the aircraft as soon as possible. \r\n- Two of the four main tyres displayed limited to no tyre tread. This was considered to have degraded the displacement of water from the tyre footprint, which had a significant effect on the braking effectiveness of the aircraft during the landing rollout on the wet runway surface. \r\nSeveral non-compliance procedures were not followed. "}