{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-244-pucallpa-40-killed", "date": "Aug 23, 2005 at 1509 LT", "type": "Boeing 737-200", "operator": "TANS-Peru-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lima - Pucallpa - Iquitos", "msn": "22580", "yom": 1981, "flight_number": "TJ204", "city": "Pucallpa", "zone": "Ucayali", "country": "Peru", "region": "South America", "crew_on_board": 7, "crew_fatalities": 5, "pax_on_board": 91, "pax_fatalities": 35, "other_fatalities": 0, "total_fatalities": 40, "captain_hours": 5867, "captain_hours_type": 3763, "copilot_hours": 4755, "copilot_hours_type": 1109, "aircraft_hours": 49865, "circumstances": "Following an uneventful flight from Lima, the aircraft was descending to Pucallpa-Capitán David Abensur Rengifo Airport runway 02, an intermediate stop on the flight from Lima to Iquitos. As the crew approached the destination, weather conditions deteriorated with heavy rain falls, CB's and turbulences. On final approach, the aircraft was unstable and descended below the glide until it crashed in a swampy and wooded area located 3,5 km short of runway. The aircraft was destroyed by impact forces and a post crash fire. 58 people were injured, some seriously, while 40 other occupants including five crew members were killed, among them 34 Peruvian, three American, one Australian, one Colombian and one Spanish. ", "probable_cause": "The Commission determines the likely cause of the accident as follows:\r\n- The decision of the flight crew to continue the final approach and landing at the airport of Pucallpa in severe weather (storm).\r\n- The decision of the flight crew to descend unstabilized and not act to stop the steep descent to the ground at a descent rate of above 1500 feet per minute; what triggered the GPWS (Ground Proximity Warning System).\r\n- The decision of the flight crew not avoid the storm, not choosing to conduct a landing on the other runway or divert to the nearest airport until weather conditions improved.\r\n- The decision of the flight crew to penetrate the storm, it having been detected on weather radar aircraft approximately 190 miles in advance.\r\n- The loss of the horizontal and vertical visibility of the flight crew while penetrating the core of the storm (severe hailstorm). Severe hail causes obscuration of the front windows of the aircraft and therefore the total loss of situational awareness."}