{"url": "https://www.baaa-acro.com/crash/crash-fairchild-hiller-fh-227b-charleston-35-killed", "date": "Aug 10, 1968 at 0857 LT", "type": "Fairchild-Hiller FH-227", "operator": "Piedmont%20Airlines2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cincinnati - Charleston", "msn": "557", "yom": 1967, "flight_number": "PI230", "city": "Charleston-Yaeger (Kanawha)", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 34, "pax_fatalities": 32, "other_fatalities": 0, "total_fatalities": 35, "captain_hours": 6884, "captain_hours_type": 2809, "copilot_hours": 3722, "copilot_hours_type": 403, "aircraft_hours": 2197, "circumstances": "Flight 230 was a scheduled domestic flight from Louisville, Kentucky, to Roanoke, Virginia, with en-route stops at Cincinnati, Ohio and Charleston, Kanawha County Airport, West Virginia. The flight to Cincinnati was routine. At 0805 hours eastern daylight time the flight departed Cincinnati on an IFR clearance to Charleston via Victor Airways 128 south to York, thence Victor 128 to Charleston, to maintain 9 000 ft. At 0835 hours the flight contacted the Charleston Tower to request the latest weather information, which was provided as: sky partially obscured, visibility 4 mile fog and smoke, runway 23 visibility less than 1/8 of a mile. Shortly thereafter it was cleared by the Indianapolis ARTCC to the Milton Intersection (10 miles west-northwest of the Charleston VORTAC on Victor 128) and to descend to and maintain 5 000 ft. At approximately 0841 hours the flight contacted Charleston Approach Control and reported leaving 6 000 for 5 000 ft. The controller advised the flight that radar contact had been established and instructed the flight to take a 070' heading for a vector to the holding pattern at the ILS outer marker. The latest weather was also given at this time as: sky partially obscured, visibility 4 mile, fog and smoke, runway visibility runway 23 zero, altimeter setting 29.94 in. The flight was then provided with holding instructions to be followed upon arrival over the outer marker compass locator (LOM) and was given an expected approach time of 0915 hours subject to weather conditions. At 0850 hours prior to reaching the LOM, the flight was instructed to turn right to a heading of 140°, cleared to descend to 2 400 ft and advised that the runway visibility for runway 23 had improved to seven-eighths of a mile. At 0851 hours the flight was advised that it was seven miles northeast of the outer locator, instructed to turn right to a 200' heading and cleared for an ILS approach. The flight acknowledged the clearance and it shortly thereafter was advised by the approach controller that the glide path was out of service. At 0852 hours the flight was advised that it was 5 miles from the LOM and instructed to contact Charleston Tower on 120.3 MHz. At 0853 hours radio contact with the flight was established by the tower local 'controller who cleared the flight to land. By that time the landing check had been completed by the crew and descent was established at a fairly constant rate of descent of approximately 620 ft/min. At 0854:40 hours the flight reported passing the outer marker inbound and requested the wind which was given as being 230°/4 kt. At 0855:55 hours the flight asked the tower if the approach lights and high intensity runway lights were turned all the way up and the controller replied in the affirmative, adding \"a little fog right off the end there and its wide open after you get by that, it's more than a mile and a half on the runway\". This was the last known radio communication from the flight. At 0856:09 hours the pilot-in-command mentioned to the co-pilot that he was going to hold the present altitude which was approximately 1 250 ft AMSL (350 ft above the elevation of runway 23 threshold). At 0856:24 hours the co-pilot informed the pilot-in-command that he had the lights in sight \"down low\" and asked him if he could see them. The pilot-in-command replied he had them in sight and requested landing flaps. The co-pilot then commented \"I got to get to the chart right here we're likely to lose it\". At 0856:42 hours the co-pilot asked the pilot-in-command if he saw the lights \"there\", the pilot-in-command replied in the affirmative and shortly thereafter reduced the power and 2 sec later increased it - 1 sec later the co-pilot commented \"watch it\". About 1 sec later the aircraft crashed. The controller observed a column of smoke rising near the approach end of the runway and immediately activated the crash siren and called for the dispatch of airport emergency equipment. The aircraft struck the steep hillside about 250 ft short of the runway threshold at an elevation of 865 ft AMSL (approximately 33 ft below the elevation of the threshold). The aircraft then careened up and over the side of the hill and on to the airport, coming to rest off the right side of runway 23. The accident occurred at 0856:53 hours during daylight. Two passengers were seriously injured while 35 other occupants were killed. ", "probable_cause": "The Board determined that the probable cause of this accident was an unrecognized loss of altitude orientation during the final portion of an approach into shallow, dense fog. The disorientation was caused by a rapid reduction in the ground guidance segment available to the pilot, at a point beyond which a go-around could not be successfully effected. The following findings were reported:\r\n- The aircraft was being operated in visual meteorological conditions until approximately 6 sec before the crash, when it entered a shallow fog overlying the approach lights and the approach end of runway 23,\r\n- Visual range in the final portion of the approach zone and over the runway 23 threshold was 500 ft or less in the fog,\r\n- Because of the visual guidance segment available in the initial part of the approach, the pilot would have no way of judging the visual range in fog until the moment of penetration,\r\n- Descent below MDA into the restricted visibility was permissible under present regulations. "}