{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-188c-electra-reno-70-killed", "date": "Jan 21, 1985 at 0104 LT", "type": "Lockheed L-188 Electra", "operator": "Galaxy%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Reno - Minneapolis", "msn": "1121", "yom": 1960, "flight_number": "GX203", "city": "Reno-Tahoe (ex Cannon)", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 65, "pax_fatalities": 64, "other_fatalities": 0, "total_fatalities": 70, "captain_hours": 14500, "captain_hours_type": 5600, "copilot_hours": 5000, "copilot_hours_type": 172, "aircraft_hours": 34148, "circumstances": "A Galaxy Airlines Lockheed L-188A Electra, registration N5532, was scheduled operate flights from Seattle (SEA) to Oakland as Flight 201, from Oakland to Reno (RNO) as Flight 202, from Reno (RNO) to Minneapolis (MSP) as Flight 203 and finally returning to Seattle using flight number 204. Scheduled departure time for Flight 201 had been 15:30, but had been delayed and the airplane departed Seattle at 20:19 on a ferry flight to Oakland, where it arrived at 22:25. Sixty-five passengers boarded the plane for the flight to Reno. Following ground servicing the ground handler supervisor signalled to the crew that they could commence engine starting. However, after engines one and four were started, he noticed that the other ground handler was unable to disconnect the air start hose. It was stretched taut from the power cart to the airplane’s air start access panel, located on the underside of the right wing leading edge, close to the fillet area. The supervisor gave the flightcrew an emergency stop signal, left his position, and disconnected the hose. None of the two ground crew members remembered closing the air start access door. At approximately 00:59 the first officer requested taxi instructions Reno tower almost immediately thereafter cleared Galaxy 203 to taxi to runway 16R. The aircraft taxied to the runway and at 01:01:32 the first officer requested takeoff clearance. Four seconds later Galaxy 203 was given clearance to take off from runway 16R. While accelerating through V1 speed, a \"thunking\" type sound was heard, followed by another one just after V2. Heavy airframe vibration started after liftoff. The captain reacted to the airplane’s vibration by reducing power significantly in all four engines, indicating that he believed the vibration was caused by the powerplants or propellers. The airplane reached an altitude of about 200-250 feet and started a right hand turn to return to the airport. The Electra then entered an aerodynamic stall buffet because of insufficient engine power to maintain flight. The Electra crashed into a field, bounced, slid into some mobile homes and burst into flames. Of the 71 occupants, three initially survived the crash. One died on January 29, while the second died of injuries on February 4. The sole survivor, a 17-year-old male, was thrown clear of the airplane onto the adjacent highway.", "probable_cause": "The captain's failure to control and the co-pilot's failure to monitor the flight path and airspeed of the aircraft. This breakdown in crew coordination followed the onset of unexpected vibration shortly after takeoff. Contributing to the accident was the failure of ground handlers to properly close an air start access door, which led to the vibration."}