{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-evanston-2-killed", "date": "Feb 18, 2018 at 1505 LT", "type": "Socata TBM-700", "operator": "William E. Patterson", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tulsa – Evanston", "msn": "118", "yom": 1997, "flight_number": null, "city": "Evanston-Uinta County", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4154, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3966, "circumstances": "The commercial pilot was conducting an instrument approach following a 3.5-hour cross-country instrument flight rules (IFR) flight in a single-engine turboprop airplane. About 1.6 miles from the runway threshold, the airplane began a climb consistent with the published missed approach procedure; however, rather than completing the slight left climbing turn toward the designated holding point, the airplane continued in an approximate 270° left turn, during which the airplane's altitude varied, before entering a descending right turn and impacting terrain. Tree and ground impact signatures were consistent with a 60° nose-low attitude at the time of impact. No distress calls were received or recorded from the accident flight. A postimpact fire consumed a majority of the cockpit and fuselage. Weather information for the time of the accident revealed that the pilot was operating in IFR to low IFR conditions with gusting surface winds, light to heavy snow, mist, cloud ceilings between 700 and 1,400 ft above ground level with clouds extending through 18,500 ft, and the potential for low-level wind shear and clear air turbulence. The area of the accident site was under AIRMETs for IFR conditions, mountain obscuration, moderate icing below 20,000 ft, and moderate turbulence  below 18,000 ft. In addition, a winter storm warning was issued about 6 hours before the flight departed. Although the pilot received a weather briefing about 17 hours before the accident, there was no indication that he obtained updated weather information before departure or during the accident flight. Examination of the airframe and engine did not reveal any preimpact anomalies that would have precluded normal operation; however, the extent of the fire damage precluded examination of the avionics system. The airplane was equipped with standby flight instruments. An acquaintance of the pilot reported that the pilot had experienced an avionics malfunction several months before the accident during which the airplane's flight display went blank while flying an instrument approach. During that occurrence, the pilot used ForeFlight on his iPad to maneuver back to the northeast and fly the approach again using his own navigation. During the accident flight, the airplane appeared to go missed approach, but rather than fly the published missed approach procedure, the airplane also turned left towards to northeast. However, it could not be determined if the pilot's actions were an attempt to fly the approach using his own navigation or if he was experiencing spatial disorientation. The restricted visibility and turbulence present at the time of the accident provided conditions conducive to the development of spatial disorientation. Additionally, the airplane's turning flight track and steep descent profile are consistent with the known effects of spatial disorientation.", "probable_cause": "The pilot's loss of control due to spatial disorientation.\n"}