{"url": "https://www.baaa-acro.com/crash/crash-casa-212-aviocar-200-mayaguez-2-killed", "date": "May 8, 1987 at 0650 LT", "type": "Casa 212 Aviocar", "operator": "American-Eagle-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Juan - Mayaguez", "msn": "271", "yom": 1982, "flight_number": "AA5452", "city": "Mayaguez-Eugenio Maria de Hostos", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 9802, "captain_hours_type": 473, "copilot_hours": 4473, "copilot_hours_type": 459, "aircraft_hours": 6264, "circumstances": "On May 8, 1987, flight 5452, a commuter flight regularly scheduled to depart from San Juan, Puerto Rico, at 0615 local time, for a flight to Mayaguez, Puerto Rico, departed at 0620 with four passengers and two crewmembers. The captain was 15 minutes late when he arrived for the flight at 0600. The first officer arrived on time at 0545. The airplane, a CASA C-212~CC, was operated by Executive Air Charter, Inc., doing business as American Eagle. The flight was on a visual flight rules flight plan, and communications with the flight en route were reported to have been routine. The first officer handled the initial radio communications, and the captain made subsequent radio communications. While in the vicinity of Mayaguez, the captain cancelled the flight plan and proceeded to make a visual approach to runway 9. The captain did not make the customary in-range call to the operations agent at Mayaguez to report the flight’s arrival estimate and fuel requirements. Witnesses who observed the airplane on its downwind leg reported that it appeared normal. One witness said the airplane seemed too fast on the approach and appeared to overshoot the extended centerline on the baseleg turn to final. Another said the airplane “turned tighter” and did not extend the downwind leg as normal. He said as the airplane came toward him, the nose rose up quickly and then the airplane rolled to the right and nosed over. A third witness said the airplane made a violent turn, and he thought the engine noise was louder than normal. A fourth confirmed that the airplane made a shortened downwind leg, making a continuous left turn and sinking fast. He said that it turned rapidly to the right and nosed down and struck the ground. He then saw it pivot around and slide backwards. He stated that fire began when the right wing and engine separated from the airplane. A fifth witness, a company baggage handler, said he heard an explosion and saw flames come out of the right engine before it turned twice and struck the ground. A crop duster pilot reported that everything appeared normal until the airplane was about 1,000 feet from the runway and about 100 feet above the ground. He said at that point, he heard a sound similar to that of a turbo propeller airplane going into reverse pitch to slow down after landing. He said the airplane then yawed to the right, followed by a roll to the left, as if the pilot had attempted to counteract the yaw. The airplane then rolled back to the right and the right wing tip struck the ground. A fire erupted immediately, the airplane turned about 1800, and it came to rest upright. The four passengers on board reported that the flight was routine until the approach into Mayaguez. One passenger seated in 3A noticed that the noise from the engines was lower than usual and that it was not the normal engine sound. He thought afterward that perhaps an engine had stopped and that the noise was different on the right. He said the airplane was not shaking or vibrating. A second passenger seated in 4C reported that the airplane lost altitude abruptly and that it fell rapidly as it banked to the left on the approach. He said he heard strange sounds from the left side and that it was an engine or scraping noise. He stated that he saw a 1 l/2- to 2-foot long flame come from the left engine, but that it did not appear to be spreading. He reported that the airplane jerked before it hit the ground. The third passenger, seated in 6A, reported that she heard an unusual metallic sound similar to a landing gear retracting or extending immediately before the crash. The fourth passenger in seat 78 was asleep and did not awaken until the crash. He said that he thought the airplane made a hard or gear-up landing.", "probable_cause": "Improper maintenance in setting propeller flight idle blade angle and engine fuel flow resulting in a loss of control from an asymmetric power condition. A factor contributing to the accident was the pilot's unstabilized visual approach."}