{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-134a-surgut-20-killed", "date": "Feb 27, 1988 at 0607 LT", "type": "Tupolev TU-134", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Minsk – Kuybyshev – Tyumen – Surgut", "msn": "2 35 17 05", "yom": 1972, "flight_number": "SU7867", "city": "Surgut", "zone": "Khantia-Mansia okrug", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 3, "pax_on_board": 45, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 18900, "circumstances": "Following an uneventful flight from Kuybyshev, the crew initiated the descent to Surgut Airport by night. The visibility was reduced due to marginal weather conditions. On approach, ATC instructed the pilot to modify his trajectory and to follow the glide as the aircraft deviated to the left. At this time, it is believed that the captain got distracted. After the crew passed the decision height, the captain continued the approach despite the fact he did not establish any visual contact with the runway lights and failed to initiate a go-around. At a height of 38 meters and a speed of 286 km/h, the aircraft passed 50 meters to the left of the threshold and the captain decided to continue. ATC instructed the crew to go-around when, one second later, the aircraft touched the ground of a snowy field some 714 meters past the runway threshold and 113 meters to the left of the runway. With a positive acceleration of 4,8 g, the aircraft lost its right wing and came to rest upside down, bursting into flames. 31 people were injured while 20 others were killed, among them the copilot. ", "probable_cause": "It was determined that the crew adopted a wrong approach configuration and took the decision to continue the approach after passing the decision height without establishing any visual contact with the runway lights. The following contributing factors were reported: \r\n- The captain got distracted, \r\n- The crew failed to initiate a go-around procedure, \r\n- The approach lights were not activated, \r\n- The visibility was reduced due to the night and marginal weather conditions, \r\n- Poor flight preparation, \r\n- Poor approach planning, \r\n- Inaccurate information were transmitted to the crew related to weather conditions and visibilty."}