{"url": "https://www.baaa-acro.com/crash/crash-saab-340b-stornoway", "date": "Jan 2, 2015 at 0833 LT", "type": "Saab 340", "operator": "FlyBe-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stornoway – Glasgow", "msn": "246", "yom": 23, "flight_number": "BE6821", "city": "Stornoway", "zone": "Hebrides Islands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 26, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3880, "captain_hours_type": 3599, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft had been prepared for a Commercial Air Transport flight from Stornoway Airport to Glasgow Airport with 26 passengers and three crew on board; the commander was the Pilot Flying (PF) and the co-pilot was the Pilot Monitoring (PM). At 0825 hrs the aircraft was taxied towards Holding Point A1 for a departure from Runway 18. At 0832 hrs G-LGNL was cleared to enter the runway from Holding Point A1 and take off, and the ATC controller transmitted that the surface wind was from 270° at 27 kt. The commander commented to the co-pilot that the wind was across the runway and that there was no tailwind. As the aircraft taxied onto the runway, the co-pilot applied almost full right aileron input consistent with a cross-wind from the right, and the commander said to the co-pilot “charlie1, one hundred, strong wind from the right”. The commander advanced the power levers, the co-pilot said “autocoarsen high” and the engine torques increased symmetrically. The commander instructed the co-pilot to “set takeoff power” to which the co-pilot replied “apr armed”. Approximately one second after this call, the engine torques began to increase symmetrically, reaching 100% as the aircraft accelerated through 70 kt. During the early stages of the takeoff, left rudder was applied and the aircraft maintained an approximately constant heading. As the aircraft continued accelerating, the rudder was centralised, after which there was a small heading change to the left, then to the right, then a rapid heading change to the left causing the aircraft to deviate to the left of the runway centreline. The pilot applied right rudder but although the aircraft changed heading to the right in response, it did not alter the aircraft’s track significantly and the aircraft skidded to the left, departing the runway surface onto the grass at an IAS of 80 kt. The power levers remained at full power as the aircraft crossed a disused runway and back onto grass. During this period the nose landing gear collapsed before the aircraft came to a halt approximately 38 m left of the edge of the runway and 250 m from where it first left the paved surface. After the aircraft came to a halt, the captain saw that the propellers were still turning and so called into the cabin for the passengers to remain seated. One of the passengers shouted for someone to open the emergency exit but the cabin crew member instructed the passengers not to do so because the propellers were still turning. The co-pilot observed that the right propeller was still turning so operated the engine fire extinguishers to shut down both engines. When the passenger seated in the emergency exit row on the right of the aircraft saw that the right propeller had stopped, he decided to open the exit. He climbed out onto the wing and helped the remaining passengers leave the aircraft through the same exit, instructing them to slide off the rear of the wing onto the ground. The left propeller was still turning at the time the right over-wing exit was opened and the passenger seated in the left-side emergency exit row decided not to open the left exit. The crash alarm was activated by ATC at 0833 hrs. An aircraft accident was declared and the aerodrome emergency plan was put into action. When the Rescue and Fire Fighting Services (RFFS) arrived at the scene, passengers were still exiting the aircraft and the left propeller was still turning. After leaving the aircraft, the cabin crew member confirmed to the RFFS that all passengers had exited the cabin and had been accounted for outside. The passengers were taken to the fire station and then on to the passenger terminal. There were no injuries.", "probable_cause": "During the attempted takeoff, the rudder was central from 40 kt and remained so until approximately 65 kt. Between approximately 52 and 65 kt, the aircraft turned right slightly before it turned left sharply at approximately 65 kt. Given that the rudder was central, this change of direction might have been caused by one, or a combination of the following factors:\r\na. Differential braking\r\nb. Asymmetric thrust\r\nc. A change in wind speed and direction\r\nd. A nose wheel steering input\r\nData from the FDR showed that thrust was applied symmetrically throughout the takeoff run, and the manufacturer did not consider that the data for longitudinal acceleration and indicated airspeed supported the use of differential braking."}