{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601p-bartonville-2-killed", "date": "Mar 10, 1990 at 1228 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "BHP Inc.", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Saint Louis – Rochelle", "msn": "61-0367-116", "yom": 1977, "flight_number": null, "city": "Bartonville", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3312, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Before takeoff, the pilot received a weather briefing and was advised of thunderstorms and heavy rain along the route. The briefing included a warning of a severe thunderstorm watch with hail, wind gusts to 65 knots and a sigmet (31c). The pilot filed an IFR flight plan and took off at 1148 cst. While en route at 15,000 msl, he requested and received clearance to divert 10° left to avoid 'some clouds.' Soon thereafter, the ATC controller noticed the aircraft was about 500 feet high and reminded the pilot to maintain 15,000 feet. The pilot acknowledged, then there was no further communication with the aircraft. Subsequently, an in-flight breakup of the aircraft occurred and the plane crashed. The left outboard wing panel separated from positive overload failure and was found about one mile from the main wreckage. No preimpact fatigue was found. A witness, who saw the aircraft descending out of the clouds, saw a funnel cloud in the area before the accident. Both occupants were killed. ", "probable_cause": "The pilot allowed the aircraft to exceed its design stress limits after encountering adverse weather. Factors related to the accident were: the pilot's improper evaluation of the weather and the adverse weather conditions."}