{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-124a-globemaster-ii-atlantic-ocean-53-killed", "date": "Mar 23, 1951 at 0050 LT", "type": "Douglas C-124 Globemaster II", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Walker – Barksdale – Loring – Lakenheath", "msn": "43173", "yom": 1949, "flight_number": null, "city": "Atlantic Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 13, "crew_fatalities": 13, "pax_on_board": 40, "pax_fatalities": 40, "other_fatalities": 0, "total_fatalities": 53, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 1915 Zulu, on Wednesday, the 21st of March, 1951, the C-124 commanded by Major Robert J. Bell of the 2nd Strategic Support Squadron departed Walker AFB, loaded with aircrews and equipment of the 509th Bomber Group, final destination was RAF Lakenheath, England. At 2212 Zulu, they touched down at Barksdale AFB, Shreveport, Louisiana where they remained overnight. On Thursday, the 22nd of March Brigadier General Paul T. Cullen and his staff joined the other passengers and boarded the  aircraft. BG Cullen was the commander of the newly established 7th Air Group assigned to England. The flight took off at 0425 Zulu, destination Loring AFB, Limestone, Maine. Following an uneventful eight hour flight, the C-124 touched down at Loring, time: 1230 Zulu. While the aircraft was being refueled, the pilots and navigators went to base ops where they received an updated weather briefing. They filed the flight plan for the final leg: Limestone direct Gander, great circle (rumb line) to RAF Lakenheath (some sources reports RAF Mildenhall, both in Suffolk, UK). The flight route was over the weather ships that linked the American continent to the British Isles. Along the route, they checked in with each ship, giving a position report, status on board, and receiving updated weather. At 0100 Zulu, Friday the 23rd of March, 1951, they checked in with the British weather ship 4YJ stationed at 52 degrees north latitude, 20 degrees west longitude. The C-124 radio operator gave their position report (approximately 800 miles southwest of Ireland). Shortly thereafter, the C-124 gave out a Mayday call, reporting a fire in the cargo crates. They began jettisoning the crates and announced they were ditching. The C-124 ditched at the approximate grid 50 degrees 45 minutes North, 24 degrees 03 minutes West. The aircraft was intact when it touched down on the ocean. All hands excited the aircraft wearing life preservers and climbed into the inflated 5 man life rafts. The rafts were equipped with cold weather gear, food, water, flares, and Gibson Girl hand crank emergency radios. The USAF 509th element stationed in England launched a B-29 to search for the survivors. Captain Muller was the pilot in command. He located the men when they fired several flares. The B-29 was not carrying any rescue equipment that could be dropped to the survivors. Captain Muller radioed back that he had located the men and would remain on station until bingo fuel. They continued circling and hoping for rescue aircraft to arrive but to no avail. Reaching critical fuel, Captain Muller was forced to abandon his fellow airmen and return to base. When the first rescue craft reached the scene 19 hours later, all that was found was a burned briefcase and a partially deflated life raft. Despite the largest air and sea search up to that time, not one body was found. Not one ship or a single aircraft returned to the position given by Captain Muller until Sunday, the 25th of March, 1951. When the ships arrived all they found were some charred crates and a partially deflated life raft. Ships and planes continued searching for the next several days but not a single body was found. The men of C-124 #49-0244 had quite simply disappeared. The flight was performed for the US Strategic Air Command and among the 53 occupants was the Brigadier General Paul Thomas Cullen, first commander of the 7th Air Division of Strategic Air Command and deputy commander and chief of staff of the 2nd Air Force. Later it was revealed that Soviet submarines and surface vessels were active in the area. It has been speculated that Cullen and his companions were taken aboard Soviet submarines and brought to Russia for interrogation. Due to their expertise in nuclear and other defense matters, Cullen and the other men on the airplane would have been an intelligence windfall to the Soviets. Cullen had been the air service's leading expert on aerial reconnaissance and aerial photography. He also was the head of photography at the Crossroads atom bomb tests in the Pacific in the late 1940s. He also had served as commander of the 2nd Operations Group on two occasions during World War II. \n\r\nCrew (509th Wing, 2nd Strategic Squadron):\r\nMaj Robert J. Bell, pilot,\r\nCpt Emmette E. Collins, pilot,\r\n2nd Lt Howard P. Mathers, pilot,\r\nS/Sgt Robert D. Amsden, flight engineer, \r\nT/Sgt Charles E. Green, flight engineer, \r\n2nd Lt Karl R. Armstrong, navigator, \r\nCpt Francis N. Davis, navigator, \r\nS/Sgt Homer Jones Jr., radio operator, \r\nS/Sgt Martin C. Bemis, civil engineer,\r\nSgt Joseph D. Broussard, civil engineer, \r\nM/Sgt Everett D. Scarbrough, civil engineer, \r\nCpl Arthur F. Chute, \r\nCpl Jack R. Crow.\n\r\nPassengers: \r\nS/Sgt Glenn E. Adler, \r\nCpt Phil B. Adrean,\r\nSgt George W. Ambrose,\r\nCpl Sterling L. Ambrose,\r\nPvt Dwight A. Berenberg,\r\nSgt Robert R. Bristow,\r\nCpt John E. Counsell,\r\nBrig Gen Paul Thomas Cullen, \r\nCpt Mark O. Dubach,\r\nCpt Miezyslaw Dudek,\r\nS/Sgt Gene D. Dughman,\r\n1st Lt Jack R. Fife,\r\n2nd Lt William E. Fisher Jr.,\r\nCol Kenneth N. Gray,\r\nT/Sgt Charles E. Green,\r\nS/Sgt Thomas E. Green,\r\nLt Col James I. Hopkins,\r\nCpt Robert F. Kampert,\r\nCpt Thomas R. Kelly,\r\nCpt Carl N. Krawiec,\r\n2nd Lt Max D. Lee,\r\nS/Sgt Nicolo A. Lengua,\r\nBbr Samuel P. Lutjeans,\r\nSgt Ronald D. McGee,\r\nLt Col Edwin A. McKoy,\r\nSgt Frank A. Meckler,\r\nCpt Walter T. Peterson,\r\nCpt Calvin Porter,\r\nLawrence E. Rafferty,\r\nMaj Gordon H. Stoddard,\r\nCpl Clarence G. Swisher,\r\nCpl Bobby G. Thomas,\r\nM/Sgt Taylor H. Vangilder,\r\nCpt Roger S. Vincent,\r\nWalter A. Wagner Jr.,\r\nM/Sgt H. C. Williamson,\r\nBbr Raymond L. Witkowski,\r\nCpt Edwon D. Zabawa,\r\nCpt Frank B. Zalac,\r\nCpt John C. Zweygarti.\n\r\nSource:\r\nhttp://www.findagrave.com/cgi-bin/fg.cgi?page=gr&GRid=57408636\n\r\nhttp://www.wafbmuseum.org/alumni-stories/last-flight-the-missing-airmen-march-1951/", "probable_cause": null}