{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-18v-mineralnye-vody-32-killed", "date": "Dec 31, 1961 at 1758 LT", "type": "Ilyushin II-18", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tbilisi – Mineralnye Vody", "msn": "181 0032 02", "yom": 1961, "flight_number": null, "city": "Mineralnye Vody", "zone": "Stavropol Krai", "country": "Russia", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 2, "pax_on_board": 110, "pax_fatalities": 30, "other_fatalities": 0, "total_fatalities": 32, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 593, "circumstances": "The airport of Mineralnye Vody was closed since three days due to poor weather in all the Caucasus region. Thus, many flights were cancelled and more than 500 passengers were blocked at Tbilisi Airport. In the afternoon of December 31, the airport of Mineralnye Vody was reopened to trafic and two IL-18 aircraft were chartered for the stranded passengers. The boarding process was disorganized and chaotic. Tickets were not checked and too many passengers boarded the plane. There were 84 passenger seats, so 26 passengers stood or sat on their luggage in the aisles as well as in the galley. The maximum rear centre of gravity was exceeded by 1%. Nevertheless, the flight to Mineralnye Vody was uneventful but on approach, weather conditions were still marginal with a visibility limited to 2 km, a cloud base at 120 meters, light rain and mist. On final approach to runway 12, at an altitude of 250 m and heading 117°, as the pilot-in-command was unable to locate the runway nor the approach lights, he decided to make a go around and increased power on all four engines.  The crew turn right heading 188° but failed to gain height. Shortly later, the airplane struck obstacles and crashed in flames 3 km southwest of the airfield. The aircraft was destroyed by a post crash fire and 32 occupants were killed, among them two crew members. All 87 other occupants were evacuated. ", "probable_cause": "The decision of the crew to attempt a go around was correct due to lack of visibility on final approach. But for unknown reason, the crew continued a low level circuit southwest of the airfield, causing the aircraft to struck obstacles and to crash. A chaotic and disorganized situation at Tbilisi Airport, an excessive number of passengers on board and a high stress situation during the flight were considered as contributing factors. "}