{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1247-mesquite", "date": "Apr 23, 2020 at 1600 LT", "type": "Pilatus PC-12", "operator": "Boutique-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dallas – Muscle Shoals", "msn": "813", "yom": 2007, "flight_number": null, "city": "Mesquite Metro", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2283, "captain_hours_type": 1137, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7018, "circumstances": "Shortly after takeoff the pilot reported to the air traffic controller that he was losing engine power. The pilot then said he was going to divert to a nearby airport and accepted headings to the airport. The pilot then reported the loss of engine power had stabilized, so he wanted to return to his departure airfield. A few moments later the pilot reported that he was losing engine power again and he needed to go back to his diversion airport. The controller reported that another airport was at the pilot’s 11 o’clock position and about 3 miles. The pilot elected to divert to that airport. The airplane was at 4,500 ft and too close to the airport, so the pilot flew a 360° turn to set up for a left base. During the turn outbound, the engine lost all power, and the pilot was not able to reach the runway. The airplane impacted a field, short of the airport. The airplane’s wings separated in the accident and a small postcrash fire developed. A review of the airplane’s maintenance records revealed maintenance was performed on the day of the accident flight to correct reported difficulty moving the Power Control Lever (PCL) into reverse position. The control cables were inspected from the pilot’s control quadrant to the engine, engine controls, and propeller governor. A static rigging check of the PCL was performed with no anomalies noted. Severe binding was observed on the beta control cable (propeller reversing cable). The cable assembly was removed from the engine, cleaned, reinstalled, and rigged in accordance with manufacturer guidance. During a post-accident examination of the engine and propeller assembly, the beta control cable was found mis-rigged and the propeller blades were found in the feathered position. The beta valve plunger was extended beyond the chamfer face of the propeller governor, consistent with a position that would shut off oil flow from the governor oil pump to the constant speed unit (CSU). A wire could be inserted through both the forward and aft beta control cable clevis inspection holes that function as check points for proper thread engagement. The forward beta control cable clevis adjustment nut was rotated full aft. The swaging ball end on the forward end of the beta control cable was not properly secured between the clevis rod end and the push-pull control terminal and was free to rotate within the assembly. Before takeoff, the beta valve was in an operational position that allowed oil flow to the CSU, resulting in normal propeller control. Vibration due to engine operation and beta valve return spring force most likely caused the improperly secured swaging ball to rotate (i.e. “unthread”) forward on the beta control cable. The resulting lengthening of the reversing cable assembly allowed the beta valve to stroke forward and shut off oil flow to the propeller CSU. Without propeller servo oil flow to maintain propeller control, the propeller faded to the high pitch/feather position due to normal leakage in the transfer bearing. The reported loss of power is consistent with a loss of thrust due to the beta control cable being mis-rigged during the most recent maintenance work.", "probable_cause": "The loss of engine power due to a mis-rigged beta control cable (propeller reversing cable), which resulted in a loss of thrust inflight. "}