{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-954-fox-glacier-9-killed", "date": "Sep 4, 2010 at 1327 LT", "type": "Fletcher FU-24", "operator": "Skydive New Zealand", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Fox Glacier - Fox Glacier", "msn": "281", "yom": 1981, "flight_number": null, "city": "Fox Glacier", "zone": "West Coast Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 4554, "captain_hours_type": 41, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after take off from Fox Glacier aerodrome, while climbing, aircraft stalled and crashed in flames in a paddock near the airfield. All nine occupants, the pilot and 8 skydivers, were killed. The new owner and operator of the aeroplane had not completed any weight and balance calculations on the aeroplane before it entered service, nor at any time before the accident. As a result the aeroplane was being flown outside its loading limits every time it carried a full load of 8 parachutists. On the accident flight the centre of gravity of the aeroplane was well rear of its aft limit and it became airborne at too low a speed to be controllable. The pilot was unable to regain control and the aeroplane continued to pitch up, then rolled left before striking the ground nearly vertically.", "probable_cause": "Findings: \r\n- There were no technical defects identified that may have contributed to the accident and the aeroplane was considered controllable during the take-off roll, with the engine able to deliver power during the short flight.\r\n- The aeroplane’s centre of gravity was at least 0.122m rear of the maximum permissible limit, which created a tendency for the nose to pitch up. The most likely reason for the crash was the aeroplane being excessively out of balance. In addition, the aeroplane probably became airborne early and at too low an airspeed to prevent uncontrollable nose-up pitch.\r\n- The aeroplane reached a pitch angle that would have made it highly improbable for the unrestrained parachutists to prevent themselves sliding back towards the tail. Any shift in weight rearward would have made the aeroplane more unstable.\r\n- The engineering company that modified ZK-EUF for parachuting operations did not follow proper processes required by civil aviation rules and guidance. Two of the modifications had been approved for a different aircraft type, one modification belonged to another design holder and a fourth was not referred to in the aircraft maintenance logbook.\r\n- The flight manual for ZK-EUF had not been updated to reflect the new role of the aeroplane and was limited in its usefulness to the aeroplane owner for calculating weight and balance.\r\n- Regardless of the procedural issues with the project to modify ZK-EUF, the engineering work conducted on ZK-EUF to convert it from agricultural to parachuting operations in the standard category was by all accounts appropriately carried out.\r\n- The weight and balance of the aeroplane, with its centre of gravity at least 0.122m outside the maximum aft limit, would have caused serious handling issues for the pilot and was the most significant factor contributing to the accident.\r\n- ZK-EUF was 17 kg over its maximum permissible weight on the accident flight, but was still 242 kg lighter than the maximum all-up weight for which the aeroplane was certified in its previous agricultural role. Had the aeroplane not been out of balance it is considered the excess weight in itself would have been unlikely to cause the accident. Nevertheless, the pilots should have made a full weight and balance calculation before each flight.\r\n- The aeroplane owner and their pilots did not comply with civil aviation rules and did not follow good, sound aviation practice by failing to conduct weight and balance calculations on the aeroplane. This resulted in the aeroplane being routinely flown overweight and outside the aft centre of gravity allowable limit whenever it carried 8 parachutists.\r\n- The empty weight and balance for ZK-EUF was properly recorded in the flight manual, but the stability information in that manual had not been appropriately amended to reflect its new role of a parachute aeroplane. Nevertheless, it was still possible for the aeroplane operator to initially have calculated the weight and balance of the aeroplane for the predicted operational loads before entering the aeroplane into service.\r\n- The aeroplane owner did not comply with civil aviation rules and did not follow good, sound aviation practice when they: used the incorrect amount of fuel reserves; removed the flight manual from the aeroplane; and did not formulate their own standard operating procedures before using the aeroplane for commercial parachuting operations.\r\n- The Director of Civil Aviation delegated the task of assessing and overseeing major modifications to Rule Part 146 design organisations and individual holders of “inspection authorisations”. The delegations did not absolve the Director of his responsibility to monitor compliance with civil aviation rules and guidance.\r\nPage 38 | Report 10-009\r\n- The delegations increased the risk that unless properly managed the CAA could lose control of 2 safety-critical functions: design and inspection. The Director had not appropriately managed that risk with the current oversight programme.\r\n- The CAA had adhered strictly to its normal practice and was acting in accordance with civil aviation rules when approving the change in airworthiness category from special to standard. However, knowing the scope, size and complexity of the modifications required to change ZK-EUF from an agricultural to a parachuting aeroplane, it should have had greater participation in the process to help ensure there were no safety implications.\r\n- There was a flaw in the regulatory system that allowed an engineering company undertaking major modification work on an aircraft to have little or no CAA involvement by using an internal or contracted design delegation holder and a person with the inspection authorisation to oversee and sign off the work.\r\n- The level of parachuting activity in New Zealand warranted a stronger level of regulatory oversight than had been applied in recent years.\r\n- The CAA’s oversight and surveillance of commercial parachuting were not adequate to ensure that operators were functioning in a safe manner.\r\n- The CAA had mechanisms through the Director’s powers under the Civil Aviation Act and his designated powers under the HSE Act to effectively regulate the parachuting industry pending the introduction of Rule Part 115.\r\n- An alcohol and drug testing regime needs to be initiated for persons performing activities critical to flight safety, to detect and deter the use of performance-impairing substances.\r\n- In this case the impact was not survivable and the passengers wearing safety restraints would not have prevented their deaths, but in other circumstances the wearing of safety restraints might reduce injuries and save lives.\r\n- Safety harnesses or restraints would help to prevent passengers sliding rearward and altering the centre of gravity of the aircraft. It could not be established if this was a factor in this accident."}