{"url": "https://www.baaa-acro.com/crash/crash-antonov-12bp-near-batagay-6-killed", "date": "Oct 4, 1988 at 2258 LT", "type": "Antonov AN-12", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Tiksi - Batagay - Yakutsk", "msn": "7 3 447 05", "yom": 1963, "flight_number": "SU40066", "city": "Batagay", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16419, "circumstances": "The four engine aircraft was completing a cargo flight from Tiksi to Irkutsk with an intermediate stop in Batagay, carrying six crew members and a load of 15,5 tons of apples. The descent to Batagay Airport was initiated by night and marginal weather conditions. Thus, the visibility was limited and the crew was unable to establish a visual contact with the ground or the airport. For unknown reasons, the crew and especially the captain failed to follow the approach procedures and preferred to follow a schema dedicated for VFR approach only. This caused the aircraft to descent below the minimum prescribed altitude when the GPWS warning sounded in the cockpit. The captain disengaged the GPWS alarm system and decided to continue the descent when, at a speed of 355 km/h, the aircraft struck the slope of a mountain located 25 km from the Batagay Airport. In a right bank of 22°, the aircraft crashed and disintegrated in a snow covered ground. All six occupants were killed. ", "probable_cause": "Poor approach planning and wrong approach configuration on part of the crew who continued the descent below the minimum descent altitude. After the GPWS warning sounded, the captain deactivated the system and continued the approach without any visual contact with the ground or the airport. In such conditions, the crew should initiate a go-around procedure. "}