{"url": "https://www.baaa-acro.com/crash/crash-martin-404-near-albuquerque-16-killed", "date": "Feb 19, 1955 at 0713 LT", "type": "Martin 404", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Albuquerque – Santa Fe – Baltimore", "msn": "14120", "yom": 1952, "flight_number": "TW260", "city": "Albuquerque", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 13, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Flight 260 received an IFR clearance from the tower at 0703 hours: \"ATC clears TWA260 for approach at the Santa Fe Airport via Victor 19 climb northbound on the back course of the ILS localiser\". The flight departed Albuquerque at 0705 hours. The tower requested the flight to report over-the Weiler Intersection (formerly the Alameda Intersection), however, after taking off there were no further radio contacts with the flight. The aircraft was last seen at an estimated altitude of 3000 feet (8300 feet mean sea level) in a high speed shallow climb continuing its heading towards Sandia Ridge, the upper portion of which was obscured by clouds. The wreckage was sighted the following morning at 9243 feet mean sea level, just below the crest of Sandia Mountain, approximately 13 miles north-east of the Albuquerque Airport and almost directly on a straight line course of 30 degrees magnetic from that airport (elevation 5340 feet mean sea level) to the Santa Fe Airport (elevation 6 344 feet mean sea level). An investigation was initiated by the Civil Aeronautics Board immediately after the accident. This included examination of the wreckage at the crash site which was discontinued because of deep snow and dangerous footing in the mountainous terrain. On May 3, 1955, a second trip was made to the scene of the accident and study of the wreckage was continued. On October 12, 1955, the Board’s Accident Investigation Report was released. The probable cause was determined to have been lack of conformity with prescribed en route procedures and a deviation from airways at an altitude too low to clear obstructions ahead. Because of controversy over certain elements of the report of October 12, 1955, additional study was given to the facts and circumstances of the accident and an amended report thereon was issued by the Board on August 26, 1957. The probable cause of the accident in this report was identical to that of the first report although the analysis portion was altered to revise the statement that the direct course was intentional. On October 10, 1958, the Air Line Pilots Association presented to the Bureau of Safety certain factual information and theories concerning the cause of the accident. On November 24, 1958, a third trip to the accident site was made. While there a new determination was made of the airplane’s heading at the time of impact. Because of these developments since the August 26, 1957, accident report was issued, active investigation and study was resumed. Additional testimony and documentary material were received from representatives of the ALPA, TWA, CAB, Eclipse-Pioneer Division of the Bendix Aviation Corporation, and the Collins Radio Company at Kansas City, Missouri, on January 15 and 16, 1959. In addition, a later study and presentation of facts concerning the instrumentation of the airplane and an analysis of tests made of the fluxgate compass system by Eclipse-Pioneer and ALPA were considered.", "probable_cause": "The Board determines that the probable cause of this accident was a deviation from the prescribed flight path for reasons unknown."}