{"url": "https://www.baaa-acro.com/crash/crash-boeing-ct-34a-dubrovnik-35-killed", "date": "Apr 3, 1996 at 1457 LT", "type": "Boeing 737-200", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tuzla - Dubrovnik", "msn": "20696", "yom": 1973, "flight_number": "IFO21", "city": "Dubrovnik", "zone": "Neretva", "country": "Croatia", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 29, "pax_fatalities": 29, "other_fatalities": 0, "total_fatalities": 35, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A United States Air Force Boeing T-43A (USAF designation for the Boeing 737-200) was destroyed after impacting a hillside during an NDB approach to Dubrovnik Airport, Croatia. All 35 on board were killed. The aircraft was engaged in a mission to fly United States Secretary of Commerce Ron Brown and a delegation of industry executives around the region for visits. The party was to be flown from Zagreb to Tuzla and Dubrovnik before returning to Zagreb. Operating with a call sign of IFO21, the accident aircraft departed Zagreb at 06:24 hours. The crew landed at Tuzla at 07:15 after an uneventful flight. The passengers deplaned, and the aircraft was then repositioned to Split because of insufficient ramp space at Tuzla to park the aircraft for the duration of the visit. At 12:47, the aircraft landed at Tuzla, where the passengers reboarded. The accident flight departed Tuzla for Dubrovnik at 13:55. After crossing Split at 14:34 the flight was cleared to descend from FL210 to FL140. Further descent clearance was given to FL100. After the aircraft reached FL100 at 14:45, south of Split VOR, Zagreb Center transferred control to Dubrovnik Approach/Tower. The controller cleared IFO21 direct to the Kolocep (KLP) NDB. After opposite-direction traffic had been cleared, IFO21 was cleared to descend to 5000 feet. At 14:52, the crew told Dubrovnik Approach/Tower that they were 16 NM from the airport. They were cleared to descend to 4,000 feet and told to report crossing the KLP beacon. At 14:53, the aircraft crossed KLP, which was the Final Approach Fix (FAF), at 4100 feet and began the approach without approach clearance from Dubrovnik Tower. At that point the aircraft was slightly high and fast and not completely configured for the approach, as it should have been. At 14:54, the copilot of IFO21 called Dubrovnik Approach/Tower and said, \"We’re inside the locator, inbound.\" IFO21 was then cleared for the NDB approach to runway 12. The aircraft tracked a course of 110 degrees after crossing KLP, instead of tracking the published course of 119 degrees. The aircraft maintained this track from KLP to the point of impact. The accident aircraft descended to 2200 feet which was consistent with the published minimum descent altitude of 2,150 feet. At 14:57, the aircraft impacted a rocky mountainside approximately 1.7 NM to the left (northeast) of the extended runway centerline and 1.8 NM north of the approach end of runway 12 at Dubrovnik Airport.", "probable_cause": "Controlled flight into terrain. The following findings were reported:\r\n- The command failure to comply with directives that required a review of all instrument approach procedures, not approved by the Defense Dept,\r\n- Preflight planning errors, combined with errors made during the flight made by the aircrew,\r\n- Improper design of the Dubrovnik NDB."}