{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6b2-h2-turbo-porter-near-peterborough", "date": "Dec 18, 1983 at 1042 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "Peterbourgh%20Parachute%20Center", "flight_phase": "Flight", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Peterborough - Peterborough", "msn": "812", "yom": 1981, "flight_number": null, "city": "Peterborough", "zone": "Cambridgeshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2350, "captain_hours_type": 700, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off on the first flight of the day with eight parachutists, and a reported fuel load of 70 US gallons. At an altitude of approximately 11,000 feet it was decided that the cloud cover at that time was obscuring the dropping zone to an unacceptable degree, and so the detail was cancelled. During the subsequent descent, on rolling out of a left turn at about 4,500 feet, a bang was heard, and the left aileron was seen to have become partially detached. After a violent lateral oscillation of the control column lasting a few seconds, the right aileron also became partially detached. At this stage the parachutists successfully abandoned the aircraft on the orders of the pilot. The aircraft then adopted an angle of bank to the right of approximately 45° despite the application of full left rudder. The descent was continued until the pilot realized that the aircraft was approaching the village of Yarwell; he therefore applied engine power to ensure that the aircraft would clear the houses. The bank angle then increased to 60° and the aircraft struck the ground right wing low, coming to rest upright, and facing the opposite direction. The pilot sustained minor injuries, and there was no fire. ", "probable_cause": "Subsequent examination showed that, on each aileron, the centre of the three attachments to the wing had suffered an in-flight failure, leading to the subsequent detachment of one half of each aileron control surface. Detailed inspection revealed the presence of fatigue in each of the rear angle brackets, located within the wing, to which are attached the aileron supports. Preliminary indications are that the point of primary failure occurred at the left aileron rear angle bracket; the remaining brackets had failed subsequently as a result of overload. "}