{"url": "https://www.baaa-acro.com/crash/crash-avro-504k-ashford", "date": "Aug 27, 1922 at 1745 LT", "type": "Avro 504", "operator": "Provincial Flying Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Bournemouth - Ashford", "msn": "H1925", "yom": 1919, "flight_number": null, "city": "Ashford", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Pilot R. H. Leavey was performing a flight from Bournemouth to Kennington, northeast of Ashford, Kent. Upon arrival, he circled round several times before gliding down. A flock of sheep had just been driven into one corner of the field to make room. Unfortunately the glide didn't continue to the intended landing point and at the last moment Leavy opened up the engine. The Avro 504 struck the top of the bank at the south-east boundary of the field and was completely wrecked. Mr. Leavey, and his passenger Mr. Swan, scrambled out unhurt. The landing ground in question, when licensed for one month in November of the previous year, measured approximately 281 yards by 263 yards. It had subsequently been divided into two fields by a post and wire fence, and on the day of the accident the part available for landings was only 159 yards long. The field had already been inspected and approved by the pilot, and he had advertised passenger pleasure flights to commence from that spot on the 29AUG. On impact with the ground, G-EALD had swung through 180° and come to rest just inside the SE boundary of the field. The fuselage had broken in half and the port wings had shattered, and the undercarriage had been dragged away. ", "probable_cause": "The accident investigators concluded, unsurprisingly, that the crash was due to an error of judgement on the part of the pilot."}