{"url": "https://www.baaa-acro.com/crash/crash-hawker-siddeley-hs125-600b-dunsfold-6-killed", "date": "Nov 20, 1975 at 1611 LT", "type": "BAe 125", "operator": "Hawker%20Siddeley", "flight_phase": "Takeoff (climb)", "flight_type": "Demonstration", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dunsfold - Dunsfold", "msn": "256043", "yom": 1974, "flight_number": null, "city": "Dunsfold", "zone": "Surrey", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 6, "total_fatalities": 6, "captain_hours": 11848, "captain_hours_type": 1327, "copilot_hours": 1030, "copilot_hours_type": 891, "aircraft_hours": 373, "circumstances": "The HS-125-600B jet aircraft was making a demonstration flight at Dunsfold and took-off on runway 07 at 1611 hrs with two pilots and seven passengers on board. Until the aircraft started its takeoff run no birds had been noticed which could have been a hazard to the aircraft but nevertheless, in accordance with normal bird strike precautionary procedures, the aircraft took-off with its landing lights as well as strobe and navigation lights on. At the moment the aircraft started to roll eye-witnesses saw a large flock of birds rise from the grass verge north of and towards the eastern end of the runway, apparently having been disturbed by an incoming Harrier aircraft as it taxied west along the perimeter track after landing. This track lies about 120 metres north of and parallel to the runway at this point. These birds rose into the air in a fairly dense formation and wheeled south across the runway just as the HS-125 became airborne. Other witnesses noticed a second bird flock rise from the centre of the aerodrome at the same time and fly north. The aircraft became airborne shortly before the halfway point of the runway and the commander had just reduced power from 100% to between 98 and 96% and ordered the undercarriage raised when the aircraft, then at a height of 50 to 100 feet and a speed of approximately 150 knots, met either or both of the bird flocks. The commander heard and felt a series of bangs as birds hit the aircraft. The ground witnesses describe hearing the engines at high power prior to the aircraft encountering the birds, and then hearing a succession of noises (between one to three), variously described as a muffled explosion, bang, thump, boom or whoof followed by the cessation of the high power engine noise. At the same time balls of flame, lasting between one to three seconds, appeared at the rear of each engine. Some witnesses also saw birds falling away from the aircraft, and after the accident the remains of 11 dead birds identified as Lapwings (Vanellus vanellus) were found at a point about 1,170 metres from the commencement of the runway, i.e. a little over half way. The largest of the dead birds weighed 303g and had a wingspan of 61cm. Although neither pilot noticed any instrument indications following the bird strike the commander sensed an immediate decrease in acceleration which he considered was due to a complete loss of power on both engines; he also thought that some of the bangs were caused by the engines surging. He therefore decreased the climb attitude to maintain flying speed, partially reduced the throttle setting, and then re-opened to full throttle, but as far as he was aware there was no increase in thrust from either engine. He therefore decided to make a forced landing straight ahead and called for the undercarriage to be extended and for full flaps; simultaneously he closed the throttles and lowered the nose of the aircraft to assume the appropriate attitude for an approach to land. The aircraft touched down on the mainwheels about 180 metres before the end of the runway at a speed the commander estimated as approximately 120 knots; after lowering the nosewheel onto the ground he applied full wheel brakes which he maintained throughout the whole of the landing run. The aircraft overran the end of the runway and continued in a straight line across grass fields and through hedges before striking a ditch on the west side of the A281 road, about 285 metres beyond the end of the runway; the impact with the ditch ruptured and initiated the detachment of the entire undercarriage. The aircraft then bounced across the road at an estimated speed of 85 knots and in so doing struck and demolished a passing private Ford Cortina motor car; all six occupants of the car were killed. The aircraft continued on it underside for about 150 metres across a field on the far side of the road. Shortly before it came to a stop the commander closed the high pressure fuel cocks. Noticing light behind him the commander assumed the aircraft was on fire and ordered an immediate evacuation; the forward entry door was opened when the aircraft came to a stop and all nine occupants safely evacuated it before the fire spread.", "probable_cause": "The accident was caused by a serious power loss on both engines following multiple bird ingestion just after the aircraft became airborne."}