{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-barkardal-1-killed", "date": "Aug 9, 2015 at 1445 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "Yes", "site": "Mountains", "schedule": "Akureyri – Keflavik", "msn": "1446", "yom": 1960, "flight_number": null, "city": "Barkárdal", "zone": "Northeastern Region (Norðurland eystra)", "country": "Iceland", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 22000, "captain_hours_type": 250, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 14:01 on August 9th, 2015, a pilot along with a friend, a contracted ferry flight pilot, planned to fly airplane N610LC, which is of the type De Havilland DHC-2 Beaver, under Visual Flight Rules (VFR) from Akureyri Airport to Keflavik Airport in Iceland. The purpose of the flight was to ferry the airplane from Akureyri to Minneapolis/St. Paul in the United States, where the airplane was to be sold. The airplane was initially flown in Eyjafjörður in a northernly direction from Akureyri, over Þelamörk and then towards and into the valley of Öxnadalur. The cloud ceiling was low and it was not possible to fly VFR flight over the heath/ridge of Öxnadalsheiði. The airplane was turned around in the head of the valley of Öxnadalur and flown towards the ridge of Staðartunguháls, where it was then flown towards the heath/ridge of Hörgárdalsheiði at the head of the valley of Hörgárdalur. In the valley of Hörgárdalur it became apparent that the cloud base was blocking off the heath/ridge of Hörgárdalsheiði, so the airplane was turned around again. The pilots then decided to fly around the peninsula of Tröllaskagi per their original backup plan, but when they reached the ridge of Staðartunguháls again the pilots noticed what looked like a break in the cloud cover over the head of the valley of Barkárdalur. A spontaneous decision was made by the pilots to fly into the valley of Barkárdalur. The valley of Barkárdalur is a long narrow valley with 3000 – 4500 feet high mountain ranges extending on either side. At the head of the valley of Barkárdalur there is a mountain passage at an elevation of approximately 3900 ft. About 45 minutes after takeoff the airplane crashed  in the head of the valley of Barkárdalur at an elevation of 2260 feet. The pilot was severely injured and the ferry flight pilot was fatally injured in a post crash fire.", "probable_cause": "Causes:\r\n- According to the ITSB calculations the airplane was well over the maximum gross weight and the airplane’s performance was considerably degraded due to its overweight condition.\r\nWeather\r\n- VFR flight was executed, with the knowledge of IMC at the planned flight route across Tröllaskagi. The airplane was turned around before it entered IMC on two occasions and it crashed when the PF attempted to turn it around for the third time.\r\n- Favorable weather on for the subsequent flight between Keflavik Airport and Greenland on August 10th may have motivated the pilots to fly the first leg of the flight in poor weather conditions on August 9th.\r\nTerrain\r\n- The pilots failed to take into account the geometry of the valley of Barkárdalur, namely its narrow width and the fast rising floor in the back of the valley.\r\nContributing factors:\r\nCRM - Inadequate planning\r\n- The W&B calculations performed by the PF prior to the flight were insufficient, as the airplane’s weight was well over the maximum gross weight of the airplane.\r\n- The plan was to look for an opening (in the weather), first in the head of the valley of Öxnadalur, then the head of Hörgárdalur and finally in the head of Barkárdalur.\r\n- The decision to fly into the valley of Barkárdalur was taken spontaneously, when flying out of the valley of Hörgárdalur and the pilots noticed what looked like a break in the cloud cover over the head of the valley of Barkárdalur. \r\nCRM – Failed to conduct adequate briefing\r\n- A failure of CRM occurred when the PNF did not inform the PF of the amount of fuel he added to the airplane prior to the flight.\r\nOverconfidence\r\n- The special ferry flight permit the pilots received for the ferry flight to Iceland in 2008 may have provided the pilots with a misleading assumption that such loading of the airplane in 2015 was also satisfactory.\r\nContinuation bias\r\n- The pilots were determined to continue with their plan to fly to Keflavik Airport, over the peninsula of Tröllaskagi, in spite of bad weather condition.\r\nLoss of situational awareness\r\n- The pilots were not actively managing the flight or staying ahead of the aircraft, taking into account various necessary factors including performance, weather and terrain.\r\n- The airplane most likely incurred severe carburetor icing in Barkárdalur. "}