{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-new-york-26-killed", "date": "Dec 18, 1954 at 1400 LT", "type": "Douglas DC-6", "operator": "Linee-Aeree-Italiane-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rome – Milan – Paris – Shannon – Gander – Boston – New York", "msn": "44418", "yom": 1954, "flight_number": "LAI451", "city": "New York-Idlewild", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 22, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 26, "captain_hours": 14734, "captain_hours_type": 3356, "copilot_hours": 7546, "copilot_hours_type": 3670, "aircraft_hours": 1424, "circumstances": "After an uneventful instrument flight involving no Air Route Traffic Control routing and control, Flight 451 reported at 1122 to the Idlewild Approach Control as being aver the Mitchell Radio Range Station at 7,000 feet. The flight was then cleared to enter the Scotland holding pattern (located approximately 13 nautical miles southwest of the airport) and was subsequently \"laddered down\" to the number one position to approach. Between 1147 and 1159 weather conditions deteriorated below the ceiling minimum of 400 feet for landing on runway 22, the runway then in use. The flight continued to hold. At 1159 reported weather conditions improved and I-LINE was cleared for an approach to runway 22 using the back course of the ILS (Instrument Landing System). At 1218 the flight reported it had discontinued this approach. It was then issued missed-approach instructions and returned to the Scotland holding pattern. Shortly thereafter weather conditions were again reported below minimums for runway 22. They were then reported as: Ceiling 300 feet, broken, 2,500 feet, overcast; visibility 2-1/2 miles, light rain and fog; wind south-southeast 20 knots. While holding, the flight was asked by Approach Control if it would be able to make an approach to runway 4, the ILS runway, considering the tailwind component. The flight accepted runway 4 and was cleared at 1307 for an ILS approach. At 1313 the tower was advised by 451 that the approach had been missed. The flight was next offered, and it accepted, a GCA (Ground Controlled Approach). This approach was abandoned at 1324, a missed-approach procedure was followed, and the flight returned to Scotland. At 1327 the Italian Airlines Station Manager, in a message relayed by the tower, asked the flight its remaining fuel, and received the reply that there was three hours of holding fuel. The Station Manager then suggested that the flight hold for 1-1/2 hours and if unable to land to proceed to Washington, D. C. At 1329 the flight acknowledged this message. At 1349 the flight was again cleared for an ILS approach, the third approach to runway 4 and its fourth to the airport. At approximately 1400 the aircraft struck the left pier. The impact was accompanied by a violent explosion and followed by an intense fire. Tower personnel immediately sounded the crash alarm and initiated emergency procedures. At the time of the accident weather conditions were reported as: Ceiling 200 overcast; visibility 2-1/2 miles, light rain and fog; wind south-southeast 16 knots. Italian Airlines' minimums for ILS approaches to runway 4 are ceiling 200 feet and visibility 1/2 mile. The aircraft was destroyed and all 10 crew members and 16 passengers were killed, six others were injured. ", "probable_cause": "The Board determines that the probable cause of this accident was an erratic approach which resulted in a descent to an altitude too low to avoid striking the pier. A contributing factor to this accident was pilot fatigue due to the particular and difficult circumstances. The following findings were reported:\r\n- The flight made four instrument approaches to the Idlewild Airport, one to runway 22 and three to runway 4,\r\n- The three approaches to runway 4 were made with a downwind component approximately 8 knots,\r\n- There were no language difficulties between the flight crew and control personnel,\r\n- Prior to the last approach weather and altimeter information was given the flight,\r\n- The weather information was adequate for the normal ILS breakout area,\r\n- Radar advisories were given the flight during the ILS approaches and during the last approach the flight was repeatedly advised that it was low with respect to normal ILS altitudes,\r\n- The last approach was apparently made without using the ILS glide path,\r\n- The radio navigational and landing facilities for the airport were functioning normally,\r\n- When the aircraft struck the pier it was nearly level laterally, slightly nose-high, and without appreciable descent,\r\n- Approximately 80 percent of the wreckage was recovered, the examination of which revealed no structural or mechanical failure of the power units, propellers, airframe, controls, or instruments prior to impact,\r\n- The crew reported no mechanical or other difficulty."}