{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-14-maria-la-baja-51-killed", "date": "Jan 11, 1995 at 1938 LT", "type": "Douglas DC-9", "operator": "Intercontinental%20de%20Aviacion-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Bogotá – Cartagena – San Andres – Panama City – Cali – Bogotá", "msn": "45742/26", "yom": 1966, "flight_number": "RS256", "city": "María La Baja", "zone": "Bolívar", "country": "Colombia", "region": "South America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 47, "pax_fatalities": 46, "other_fatalities": 0, "total_fatalities": 51, "captain_hours": 10924, "captain_hours_type": 4605, "copilot_hours": 4229, "copilot_hours_type": 3952, "aircraft_hours": 65084, "circumstances": "The aircraft departed Bogotá-El Dorado Airport at 1843LT with a delay of six hours because of technical problems with the electrical systems. At 1934LT, after being cleared to start the descent to Cartagena-Rafael Núñez Airport, the crew descended from FL190 to FL080 when radar contact was lost. Four minutes later, the pilot of a Cessna 208 operated by Aerocorales informed ARTCC about a plane descending vertically and crashing in a marshy field located near María La Baja. The wreckage was found about 40 km southeast of Cartagena Airport. The aircraft disintegrated on impact and among the debris, a nine year old girl was found alive, all 51 other occupants have been killed. ", "probable_cause": "It was determined that the loss of control occurred after the pilot-in-command suffered a loss of situational awareness. Contributing to the loss of Vertical Situational Awareness, was the failure of the altimeter Number one during the descent, the lack of light in the altimeter Number two, the ineffectiveness of the Altitude Alert due to the failure of the altimeter Number one, the lack of radar service in the area, the complacency of the command crew because of good weather conditions, flight training that may not have been authorized by the company, the failure of the ground proximity warning system (GPWS), or lack of crew reaction time to respond to this alarm."}