{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-san-juan", "date": "Feb 28, 2005 at 1120 LT", "type": "Rockwell Shrike Commander 500", "operator": "Clair Aero", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Juan – Tortola", "msn": "500-3233", "yom": 1975, "flight_number": null, "city": "San Juan-Luis Muñoz Marín (Isla Verde)", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1038, "captain_hours_type": 282, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6943, "circumstances": "The non-Spanish speaking commercial pilot was preparing for a Title 14, CFR Part 135 on-demand charter flight in a twin-engine airplane with gasoline engines. A non-English speaking fuel truck operator inadvertently serviced the accident airplane with 120 gallons of Jet-A turbine fuel. In the pilot's written statement he reported that just after takeoff, with six passengers aboard, both engines began to lose power, and the airplane subsequently descended and collided with tree-covered terrain at the departure end of the runway. An on-site examination of the fuel vender's Jet-A fuel truck disclosed that the dispensing nozzle installed on the truck was the same nozzle as a typical gasoline nozzle. An examination of the accident airplane's fuel caps and fueling ports disclosed that the accident airplane was equipped with round, fuel tank inlet restrictors, that would prevent fueling from a jet fuel nozzle of the appropriate size, but the fueling ports were not placarded with the required statement indicating that only gasoline (av-gas) should be used.\n", "probable_cause": "The fuel truck operator's improper refueling of a gasoline engine powered airplane with jet (turbine) fuel, and the pilot's inadequate preflight, which resulted in a loss of power in both engines and subsequent collision with trees. Factors associated with the accident were the unclear communications between the Spanish-speaking fuel truck operator and the English speaking pilot, and the  uel truck operator's lack of familiarity with the accident airplane's fueling requirements. An additional factor was the absence of the required placards adjacent to the fuel filler caps indicating that only gasoline (av-gas) should be used."}