{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-21e-turbo-goose-dupage-2-killed", "date": "Jun 13, 1995 at 1955 LT", "type": "Grumman G-21A Goose", "operator": "Air Classic Museum", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "DuPage - DuPage", "msn": "1211", "yom": 1942, "flight_number": null, "city": "DuPage", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4200, "captain_hours_type": 400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "This was the first flight of the Grumman G-21 in two years. Also, the pilot had not flown the G-21 for two years. Before taking off, the pilot reported that three takeoffs and landings would be needed for purposes of becoming current. After takeoff, he flew the airplane approximately one hour and made two full stop landings. During the third takeoff, the airplane was described as lifting off in a short distance and going into a nose high attitude below an altitude of 100 feet. The airplane then rolled left, struck the ground in a steep descent, and burned. Witnesses reported that the engines were providing power until impact; the engines and propellers had evidence of rotational damage. The flap actuators were found extended to a position that equated with 30° of flaps (half flaps). Four G-21 pilots were interviewed. According to them, flaps were not normally used for takeoff in this airplane. They reported that the turboprop engines had substantial power for the weight of the airplane, especially when the plane was not loaded, and that the G-21 would tend to become airborne quickly with flaps extended. No pre impact mechanical problem was noted during the investigation.", "probable_cause": "The pilot allowed excessive nose-up rotation of the airplane during lift-off, and failed to obtain and/or maintain adequate airspeed, which resulted in an inadvertent stall and collision with the terrain. Factors relating to the accident were: the pilot's lack of recent experience in the make and model of airplane, and the use of flaps during a light weight takeoff."}