{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-near-rooisand-4-killed", "date": "Jun 26, 2003 at 1930 LT", "type": "Cessna 208B Grand Caravan", "operator": "Comav%20Aviation", "flight_phase": "Flight", "flight_type": "Ambulance", "survivors": "No", "site": "Mountains", "schedule": "Rooisand - Windhoek", "msn": "208B-0549", "yom": 1996, "flight_number": null, "city": "Rooisand", "zone": "Khomas Region", "country": "Namibia", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Chartered by International SOS, the single engine aircraft was dispatched to the Rooisand Desert Ranch Aerodrome with a medical team to pick up a patient who suffered a car accident. The aircraft landed at Rooisand Airstrip about 15 minutes before sunset. Due to the night and because the airfield was not equipped with any light systems, the pilot asked people to park their cars along the runway with their lights on. After take off, the aircraft continued westbound with a 12 knots tailwind and was supposed to circle the runway two or three times to gain sufficient height to avoid the hills surrounding the area. Then the aircraft turned right towards a hill that was 258 metres higher than the end of the runway. The aircraft had flown about 4,8 km far towards that hill when it banked steeply to the left and headed back to the southeast. The aircraft then descended to a height of 191 metres until it struck the slope of a hill. The wreckage was found 17 metres below the hill's top and all four occupants were killed. ", "probable_cause": "Controlled flight into terrain caused by the combination of the following factors:\r\n- The decision of the pilot to take off from an airfield that was not suitable for night operations, \r\n- The absence of a copilot considerably increased the workload of the captain, assuming that the copilot could have assisted him in the reconnaissance of the terrain, the preparation of the flight, the assistance to the patient and the medical team,\r\n- Lack of visibility due to the night and lack of visual reference points on the ground, especially since the pilot had to wear corrective glasses, \r\n- The pilot could not clearly distinguish the various parameters displayed on his instrument's panel because he forgot his glasses."}