{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-30er-baltimore", "date": "May 6, 2009 at 1302 LT", "type": "Douglas DC-10", "operator": "World-Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Leipzig – Baltimore", "msn": "46583/292", "yom": 1979, "flight_number": "WOA8535", "city": "Baltimore-Washington-Thurgood Marshall", "zone": "Maryland", "country": "United States of America", "region": "North America", "crew_on_board": 12, "crew_fatalities": 0, "pax_on_board": 168, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6500, "captain_hours_type": 193, "copilot_hours": 6300, "copilot_hours_type": 373, "aircraft_hours": 107814, "circumstances": "The flight was conducting a straight-in approach during visual meteorological conditions. The approach was backed up by an ILS and was stable at 500 feet above touchdown. The initial touchdown was firm and main landing gear rebounded, possibly bouncing slightly off the runway. Control column input and possibly momentum from the touchdown resulted in a rapid pitch down and hard nose gear impact with the runway. Wing spoilers likely did not deploy due to the main gear bounce and/or throttle position. Following the nose gear impact, the airplane pitched up as expected and the column was held in a slightly forward position. Airspeed rapidly decayed, and engine power began to increase as the airplane pitch reversed to a downward motion for a second time. One of the crew, likely the FO, called “flare flare” and the column recorded a rapid nose up input, followed by a rapid nose down input, and the nose gear again struck the runway very hard, likely causing the majority of the damage at that point. Following the second nose gear impact, column inputs stabilized at a slightly nose up command, power was set on all three engines, and the go-around was successfully executed. A slight lag in the power increase on engine number 3 may have contributed to the nose down motion leading to the second nose gear impact, although the large forward (airplane nose down) column movement appears to be a much more significant contributor. It is unclear why the engine was slower to increase. Throttle lever angle was not recorded, but the engine operated as expected for all other phases of the flight, including after the impact, therefore it is possible the pilot did not advance the number 3 throttle concurrently with the others. The captain’s flight and duty schedule complied with Federal Aviation regulations, but he experienced a demanding 10-day trip schedule prior to the incident involving multiple time zone crossings and several long duty periods, and reported difficulties sleeping prior to the accident leg. The captain was likely further affected by a digestive system upset during the accident flight. It is likely that the captain’s performance was degraded by fatigue and some degree of physical discomfort brought on by a short-term illness. The captain had recently completed upgrade training to DC-10, having previously been flying as an MD-11 first officer. The training program was fragmented over approximately ten months, and while in accordance with FAA regulations, may have adversely affected his consolidation of skills and experience.\n", "probable_cause": "The captain’s inappropriate control inputs following a firm landing, resulting in two hard nose-gear impacts before executing a go-around. Contributing to the inappropriate control inputs was the captain’s fatigue and physical discomfort; and a possible lack of practical consolidation of skills and experience due to a protracted and fragmented training period."}