{"url": "https://www.baaa-acro.com/crash/crash-avro-652-anson-i-near-port-erin-5-killed", "date": "Nov 13, 1944", "type": "Avro 652 Anson", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": "Wigtown - Wigtown", "msn": null, "yom": null, "flight_number": null, "city": "Port Erin", "zone": "Isle of Man", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a night navigation exercise from RAF Wigtown in southern Scotland, the aircraft's route was to be from Wigtown to Eggerness Point, Whithorn, Ballyquinton Point, Bardsey Light, Chicken Rock, Port Saint Mary, Ballyquinton Point and return to Wigtown.  The first two points were within ten miles of Wigtown Airfield.  Ballyquinton Point stands at the mouth of Strangford Lough in Northern Ireland, Bardsey Light is on Bardsey Island off the Lleyn Peninsular.  Chicken Rock is off the southern tip of the Isle of Man. The aircraft had reached the Isle of Man and the crew decided to return directly to Wigtown and set course for there.  The court of inquiry concluded that while near Ronaldsway the pilot had climbed from his briefed altitude of 2000ft to 3000ft in order to avoid high ground on the direct route back to Wigtown.  This change in altitude took the aircraft into icing conditions, this would have caused ice build up on the aircraft. The presiding officer suggested that when icing was experienced the pilot most likely turned back towards Ronaldsway, to avoid the high ground, while descending out of cloud at the same time.  The aircraft was flying south east at the time of the crash  and had possibly descended too quickly. The aircraft flew into the north western end of Cronk ny Arrey Laa while in a steep climb, possibly attempting to avoid the hill.\nCrew (1st AFU):\nF/Sgt Hugh Eugene McDonald, pilot,\nF/O Charles Alfred Bardwell, navigator,\nP/O John Darlington, air bomber, \nF/O Percy Henry Hoyle, wireless operator, \nF/Sgt John David Pratt, wireless operator.\nSource: \nhttp://www.peakdistrictaircrashes.co.uk/pages/isleofman/iomax177.htm", "probable_cause": null}