{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-134a-berlin-72-killed", "date": "Dec 12, 1986 at 1800 LT", "type": "Tupolev TU-134", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Minsk - Prague - Berlin", "msn": "63145", "yom": 1980, "flight_number": "SU892", "city": "Berlin-Schönefeld", "zone": "Berlin", "country": "Germany", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 73, "pax_fatalities": 63, "other_fatalities": 0, "total_fatalities": 72, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12658, "circumstances": "Originally, flight SU892 was a direct service from Minsk to Berlin but due to poor weather at Berlin, the flight was diverted to the alternate Airport of Prague-Ruzyne. Following an uneventful flight from Prague, the crew started the descent to Berlin-Schönefeld Airport. At that time, weather conditions were marginal with limited visibility to 900 meters and a ceiling down to 60 meters. After the crew was cleared for an ILS approach to runway 25L, ATC turned on the runway 25R lighting system while informing all crews that runway 25R was closed to traffic due to work in progress. These transmissions being done in english, a misinterpretation of the situation conducted the crew to continue the approach to runway 25R. On short final, ATC realized the wrong position of the aircraft and instructed the crew to make a left turn to reach the runway 25L approach path. With flaps down at 38° and at a speed of 263 km/h, the captain initiated a left turn and descended below the glide. With a rate of descent of 7 meters per second, the aircraft struck tree tops then stalled and crashed in a wooded area located 3 km short of runway threshold, bursting into flames. Twelve passengers were seriously injured while 70 other people were killed. Two weeks later, two of the survivors died from their injuries. ", "probable_cause": "It was determined that the instructions transmitted by ATC on short final were unexpected by the flight crew who took wrong decisions. Because another aircraft of the Hungarian national carrier Malev was also approaching Berlin Airport, ATC messages were transmitted in english on the frequency, and certain elements of the different messages were misinterpreted by the different members of the Soviet crew. On this point, the following contributing factors were reported: \r\n- Lack of crew coordination, \r\n- Absence of cross checks and mutual controls in the various actions,\r\n- Difficulties to understand the english phraseology,\r\n- Lack of knowledge and experience in applying the rules related to radio transmission during international flights. \r\nConsidering the situation, the captain should have taken the decision to initiate a go-around procedure, all safety conditions being clearly not met."}