{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31p-350-mojave-cedar-bluff-3-killed", "date": "Jun 14, 1995 at 2154 LT", "type": "Piper PA-31 Cheyenne", "operator": "Executive Aviation (USA)", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Nashville - Lancaster", "msn": "31-8414028", "yom": 1984, "flight_number": null, "city": "Cedar Bluff", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 6650, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2423, "circumstances": "ATC data indicated the airplane was in cruise flight at about 17,000 feet MSL, when the pilot deviated from the intended flight path to avoid thunderstorms. At 2150 EDT, the pilot requested clearance to climb to 19,000 MSL. At 2152, he requested a right turn out of weather and advised ATC that he was 'getting icing.' Between 2153 and 2154, the pilot's transmissions were garbled, then at 2154:38, he stated '...trying to get out of this mess.' Radar and radio contact with the airplane were lost. An in-flight breakup of the airplane occurred, and wreckage was found scattered over a 3 mile area. Postaccident examination revealed the outboard portion of the right wing had failed and separated in an upward and aft direction. Scrape marks were found on the right side of the fuselage, and there was damage to the right horizontal stabilizer and rudder. Also, there was evidence that both engines had separated in flight; they were found about 1 mile from the main wreckage. No preexisting mechanical malfunction or fatigue of the airplane was found. The pilot had received a complete weather briefing, and was advised of severe weather along the intended route of flight. ", "probable_cause": "The pilot's improper planning/decision, and his allowing the airplane to exceed its maximum design/stress limitation. Factors relating to the accident were: the adverse weather conditions, and the pilot's continued flight into adverse weather. "}