{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3t-turbo-otter-near-ella-lake-9-killed", "date": "Jun 25, 2015 at 1215 LT", "type": "De Havilland DHC-3 Otter", "operator": "Promech-Air-2", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Ketchikan - Ketchikan", "msn": "270", "yom": 1958, "flight_number": null, "city": "Ella Lake", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 4070, "captain_hours_type": 40, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 24439, "circumstances": "The airplane collided with mountainous, tree-covered terrain about 24 miles east-northeast of Ketchikan, Alaska. The commercial pilot and eight passengers sustained fatal injuries, and the airplane was destroyed. The airplane was owned by Pantechnicon Aviation, of Minden, Nevada, and operated by Promech Air, Inc., of Ketchikan. The flight was conducted under the provisions of 14 Code of Federal Regulations (CFR) Part 135 as an on-demand sightseeing flight; a company visual flight rules flight plan (by which the company performed its own flight-following) was in effect. Marginal visual flight rules conditions were reported in the area at the time of the accident. The flight departed about 1207 from Rudyerd Bay about 44 miles east-northeast of Ketchikan and was en route to the operator’s base at the Ketchikan Harbor Seaplane Base, Ketchikan. The accident airplane was the third of four Promech-operated float-equipped airplanes that departed at approximate 5-minute intervals from a floating dock in Rudyerd Bay. The accident flight and the two Promech flights that departed before it were carrying cruise-ship passengers who had a 1230 “all aboard” time for their cruise ship that was scheduled to depart at 1300. (The fourth flight had no passengers but was repositioning to Ketchikan for a tour scheduled at 1230; the accident pilot also had his next tour scheduled for 1230.) The sightseeing tour flight, which the cruise ship passengers had purchased from the cruise line as a shore excursion, overflew remote inland fjords; coastal waterways; and mountainous, tree-covered terrain in the Misty Fjords National Monument Wilderness. Promech pilots could choose between two standard tour routes between Rudyerd Bay and Ketchikan, referred to as the “short route” (which is about 52 nautical miles [nm], takes about 25 minutes to complete, and is primarily over land) and the “long route” (which is about 63 nm, takes about 30 minutes to complete, and is primarily over seawater channels). Although the long route was less scenic, it was generally preferred in poor weather conditions because it was primarily over water, which enabled the pilots to fly at lower altitudes (beneath cloud layers) and perform an emergency or precautionary landing, if needed. Route choice was at each pilot’s discretion based on the pilot’s assessment of the weather. The accident pilot and two other Promech pilots (one of whom was repositioning an empty airplane) chose the short route for the return leg, while the pilot of the second Promech flight to depart chose the long route. Information obtained from weather observation sources, weather cameras, and photographs and videos recovered from the portable electronic devices (PEDs) of passengers on board the accident flight and other tour flights in the area provided evidence that the accident flight encountered deteriorating weather conditions. Further, at the time of the accident, the terrain at the accident site was likely obscured by overcast clouds with visibility restricted in rain and mist. Although the accident pilot had climbed the airplane to an altitude that would have provided safe terrain clearance had he followed the typical short route (which required the flight to pass two nearly identical mountains before turning west), the pilot instead deviated from that route and turned the airplane west early (after it passed only the first of the two mountains). The pilot’s route deviation placed the airplane on a collision course with a 1,900-ft mountain, which it struck at an elevation of about 1,600 ft mean sea level. In the final 2 seconds of the flight, the airplane pitched up rapidly before colliding with terrain. The timing of this aggressive pitch-up maneuver strongly supports the scenario that the pilot continued the flight into near-zero visibility conditions, and, as soon as he realized that the flight was on a collision course with the terrain, he pulled aggressively on the elevator flight controls in an ineffective attempt to avoid the terrain. Although Promech’s General Operations Manual specified that both the pilot and the flight scheduler must jointly agree that a flight can be conducted safely before it is launched, no such explicit concurrence occurred between the accident pilot and the flight scheduler (or any member of company management) before the accident flight. As a result, the decision to initiate the accident tour rested solely with the accident pilot, who had less than 2 months’ experience flying air tours in Southeast Alaska and had demonstrated difficulty calibrating his own risk tolerance for conducting tour flights in weather that was marginal or below Federal Aviation Administration (FAA) minimums. Further, evidence from the accident tour flight and the pilot’s previous tour flights support that the pilot’s decisions regarding his tour flights were influenced by schedule pressure; his attempt to emulate the behavior of other, more experienced pilots whose flights he was following; and Promech’s organizational culture, which tacitly endorsed flying in hazardous weather conditions, as evidenced (in part) by the company president/chief executive officer’s own tour flight below FAA minimums on the day of the accident. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was\r\n(1) the pilot’s decision to continue visual flight into an area of instrument meteorological conditions, which resulted in his geographic disorientation and controlled flight into terrain; and \r\n(2) Promech’s company culture, which tacitly endorsed flying in hazardous weather and failed to manage the risks associated with the competitive pressures affecting Ketchikan-area air tour operators; its lack of a formal safety program; and its inadequate operational control of flight releases."}