{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-31-charlotte-72-killed", "date": "Sep 11, 1974 at 0734 LT", "type": "Douglas DC-9", "operator": "Eastern-Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Charleston - Charlotte - Chicago", "msn": "47400/443", "yom": 1969, "flight_number": "EA212", "city": "Charlotte-Douglas", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 78, "pax_fatalities": 70, "other_fatalities": 0, "total_fatalities": 72, "captain_hours": 8876, "captain_hours_type": 3856, "copilot_hours": 3016, "copilot_hours_type": 2693, "aircraft_hours": 16860, "circumstances": "Eastern Air Lines Flight 212, a Douglas DC-9-31, N8984E, operated as a scheduled passenger flight from Charleston, South Carolina, to Chicago, Illinois, with an en route stop at Charlotte, North Carolina. The flight departed Charleston at 07:00 hours local time with 78 passengers and 4 crew members on board. The first officer was Pilot Flying. During the descent into Charlotte, until about 2 minutes and 30 seconds prior to the accident, the flight crew engaged in conversations not pertinent to the operation of the aircraft. These conversations covered a number of subjects, from politics to used cars, and both crew members expressed strong views and mild aggravation concerning the subjects discussed. At 07:32:13, as the flight intercepted the inbound VOR radial for the approach, the flight crew commenced a discussion of Carowinds Tower, which was located ahead and to the left of the projected flight path. This discussion lasted 35 seconds, during which 12 remarks were made concerning the subject. A considerable degree of the flight crew's attention was directed outside the cockpit during that time. During this period, the aircraft descended through 1,800 feet (1,074 feet above touchdown elevation), the altitude which should have been maintained until it crossed Ross Intersection, the final approach fix (FAF). At the end of the 35-second period, the aircraft was still 1.5 nm short of the FAF. At 07:32:41, during the latter part of the discussion regarding Carowinds Tower, the terrain warning alert sounded in the cockpit, signifying that the aircraft was 1,000 feet above the ground. Within seconds after the discussion of Carowinds Tower terminated at 07:32:48, the rate of descent of the aircraft was slowed from about 1,500 feet per minute to less than 300 feet per minute. At 07:33:24, the aircraft passed over Ross Intersection (the FAF) at an altitude of 1,350 feet (624 feet above field elevation), which is 450 feet below the prescribed crossing altitude. The captain did not make the required callout at the FAF, which should have included the altitude (above field elevation) and deviation from the Vref speed. Although shortly before crossing the FAF, one of the pilots stated \"three ninety four,\" a reference to the MDA in height above field elevation. While in the vicinity of Ross Intersection, the first officer asked for 50 degrees of flaps; this request was carried out by the captain. The airspeed at this time was 168 knots, as contrasted with the recommended procedure which calls for the airspeed when passing over the FAF to be in the area of Vref, which in this instance was 122 knots. At 07:33:36, the captain advised Charlotte Tower that they were by Ross Intersection. The local controller cleared the flight to land on runway 36. The last radio transmission from the flight was the acknowledgement, \"Alright,\" at 07:33:46. Shortly after passing Ross Intersection, the aircraft passed through an altitude of 500 feet above field elevation, which should have prompted the captain to call out altitude, deviation from Vref speed, and rate of descent. No such callout was made, nor was the required callout made when the plane descended through an altitude 100 feet above the MDA of 394 feet above the field elevation. The descent rate, after passing Ross, increased to 800 feet per minute, where it stabilized until approximately 7 to 8 seconds prior to impact, when it steepened considerably. According to the CVR, at 0733:52, the captain said, \"Yeah, we're all ready,\" followed shortly thereafter by \"All we got to do is find the airport\". At 07:33:57, the first officer answered \"Yeah\". About one-half second later both pilots shouted. The aircraft struck some small trees and then impacted a cornfield about 100 feet below the airport elevation of 748 feet. The aircraft struck larger trees, broke up, and burst into flames. It was destroyed by the impact and ensuing fire. The aircraft crashed about 1.75 statute miles from Ross Intersection and about 3.3 statute miles short of the threshold of runway 36. Eleven passengers and two crew members survived the crash and fire. One passenger died 3 days after the crash, one after 6 days and another passenger died 29 days after the accident.", "probable_cause": "The flight crew's lack of altitude awareness at critical points during the approach due to poor cockpit discipline in that the crew did not follow prescribed procedure. The following factors were reported:\r\n- The extraneous conversation conducted by the flight crew during the descent was symptomatic of a lax atmosphere in the cockpit which continued throughout the approach.\r\n- The terrain warning alert sounded at 1,000 feet above the ground but was not heeded by the flight crew,\r\n- The aircraft descended through the final approach fix altitude of 1,800 feet more than 2 miles before the final approach fix was reached at an airspeed of 186 knots,\r\n- The aircraft passed over the final approach fix at an altitude of 1,350 feet (or 450 feet below the prescribed crossing altitude) and at an airspeed of 168 knots, as compared\r\nto the Vref speed of 122 knots,\r\n- Required callouts were not made at the final approach fix, at an altitude of 500 feet above field elevation, or at 100 feet above the minimum descent altitude,\r\n_ A severe post impact fire occurred immediately after the initial impact,\r\n- Fatal injuries were caused by impact and thermal trauma,\r\n- The door exits, except for the auxiliary exit in the tail, were blocked externally. "}