{"url": "https://www.baaa-acro.com/crash/crash-excel-jet-sport-jet-i-colorado-springs", "date": "Jun 22, 2006 at 0953 LT", "type": "Excel Jet Sport Jet I", "operator": "Excel%20Jet", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Colorado Springs - Colorado Springs", "msn": "001", "yom": 2006, "flight_number": null, "city": "Colorado Springs", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5307, "captain_hours_type": 11, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 24, "circumstances": "According to the pilot, passenger, and several witnesses, during takeoff the light jet became airborne momentarily, and then banked aggressively to the left. It impacted the runway in a left wing low attitude and cartwheeled down the runway. An examination of the airplane's systems revealed no anomalies. Approximately 1.5 minutes before the airplane was cleared for takeoff, a De Havilland Dash 8 (DH-8) airplane departed. A wake turbulence study conducted by an NTSB aircraft performance engineer concluded that even slight movement in the atmosphere would have caused the circulation of the vortices near the accident site to decay to zero within two minutes, that is, before the time accident jet would have encountered the wake from the DH-8. The study states, in part: \"Given the time of day of the accident, consistent reports of easterly surface wind speeds on the order of 6 to 7 knots, higher wind speeds aloft, and the mountainous terrain near Colorado Springs, it is unlikely that the atmosphere was quiescent enough to allow the wake vortices near the Sport-Jet to retain any significant circulation after two minutes. Furthermore, easterly surface winds would have blown the wake vortices well to the west of the runway by the time of the accident. Consequently, while in smooth air the wake vortices from the DH-8 that preceded Sport-Jet off of the runway may have retained enough circulation after two minutes to produce rolling moments on Sport-Jet on the order of the rolling moment available from the Sport-Jet's ailerons, it is most likely that the wake vortices were neither strong enough nor close enough to the Sport-Jet to cause the violent roll to the left reported by the pilot and witnesses to the accident.\"", "probable_cause": "A loss of control for an undetermined reason during takeoff-initial climb that resulted in an in-flight collision with terrain."}