{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b60-duke-sedona-3-killed", "date": "Jul 26, 2012 at 0830 LT", "type": "Beechcraft 60 Duke", "operator": "Patrick R. Porter", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sedona – Albuquerque", "msn": "P-524", "yom": 1980, "flight_number": null, "city": "Sedona", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 663, "captain_hours_type": 94, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3924, "circumstances": "Several witnesses observed the airplane before and during its takeoff roll on the morning of the accident. One witness observed the airplane for the entire event and stated that the run-up of the engines sounded normal. During the takeoff roll, the acceleration of the airplane appeared a little slower but the engines continued to sound normal. Directional control was maintained, and at midfield, the airplane had still not rotated. As the airplane continued down the 5,132-foot-long runway, it did not appear to be accelerating, and, about 100 yards from the end of the runway, it appeared that it was not going to stop. The airplane maintained contact with the runway and turned slightly right before it overran the end of the runway. The airplane was subsequently destroyed by impact forces and a postaccident fire. The wreckage was located at the bottom of a deep gully off the end of the runway. Postaccident examination of the area at the end of the runway revealed two distinct tire tracks, both of which crossed the asphalt and dirt overrun of 175 feet. A review of the airplane's weight and balance and performance data revealed that it was within its maximum gross takeoff weight and center of gravity limits. At the time of the accident, the density altitude was calculated to be 7,100 feet; the airport's elevation is 4,830 feet. For the weight of the airplane and density altitude at the time of the accident, it should have lifted off 2,805 feet down the runway; the distance to accelerate to takeoff speed and then to safely abort the takeoff and stop the airplane was calculated to be 4,900 feet. It is unknown whether the pilot completed performance calculations accounting for the density altitude. All flight control components were accounted for at the accident site. Although three witnesses indicated that the engines did not sound right at some point during the runup or takeoff, examination of the engine and airframe revealed no evidence of any preexisting mechanical malfunctions or failures that would have precluded normal operation. Propeller signatures were consistent with rotational forces being applied at the time of impact. No conclusive evidence was found to explain why the airplane did not rotate or why the pilot did not abort the takeoff once reaching the point to safely stop the airplane.", "probable_cause": "The airplane's failure to rotate and the pilot's failure to reject the takeoff, which resulted in a runway overrun for reasons that could not be undetermined because postaccident examination of the airplane and engines did not reveal any malfunctions or failures that would have precluded normal operation.\n"}