{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900d-quiberon-14-killed", "date": "Jul 30, 1998 at 1558 LT", "type": "Beechcraft 1900D", "operator": "Proteus%20Airlines.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Lyon - Lorient", "msn": "UE-238", "yom": 1996, "flight_number": "PRB706", "city": "Quiberon", "zone": "Morbihan", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 3072, "captain_hours_type": 1356, "copilot_hours": 1016, "copilot_hours_type": 361, "aircraft_hours": 3342, "circumstances": "Following an uneventful flight from Lyon-Satolas Airport, the crew was approaching Lorient-Lann-Bihoué Airport when he contacted ATC and requested a special clearance to cancel his IFR flight plan for a visual circuit over the Bay of Quiberon to show the 'Norway' ship (ex France) to the passengers. While cruising under VFR mode in excellent weather conditions at an altitude of 2,000 feet, the twin engine aircraft collided with a private Cessna 177 Cardinal registered F-GAJE and owned by the Aéro Club de Vannes. Following the collision, both aircraft entered an uncontrolled descent and crashed in the Bay of Quiberon about 1,500 metres from the ship and 10 km off Quiberon. All 14 people on board the Beech 1900D as well as the pilot of the Cessna 177 were killed. ", "probable_cause": "The collision was due to the absence of visual detection of the other aircraft by each of the two crews in an uncontrolled Class G Airspace where collision avoidance relies exclusively on external vigilance (\"See and Avoid\" rule). The decision to change the flight regime and trajectory placed the crew of the Beech 1900D in an improvised and unusual flight situation with a public transport aircraft. The following contributing factors have been identified:\r\n- The pilots, on different frequencies, were unaware of their mutual presence,\r\n- The pilots had their attention focused on the ship 'Norway',\r\n- The organization of the activity in the cockpit of the Beech 1900D and its ergonomics did not allow effective monitoring, particularly towards the outside of the turn,\r\n- The dead angles of the Cessna 177 probably masked the Beech 1900D from its pilot while both aircraft were approaching each other,\r\n- The position of the sun may have hampered the pilot of the Cessna 177,\r\n- The Cessna 177 transponder was off, thus the aircraft could not be viewed on the ATC radar based in Lorient. As a result, he was unable to provide traffic information to the crew of the Beech 1900D."}