{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-62-warsaw-183-killed", "date": "May 9, 1987 at 1112 LT", "type": "Ilyushin II-62", "operator": "LOT-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Warsaw - New York", "msn": "3344942", "yom": 1973, "flight_number": "LO5055", "city": "Warsaw-Okęcie-Frederic Chopin", "zone": "Masovian Voivodeship (Mazowieckie)", "country": "Poland", "region": "Europe", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 172, "pax_fatalities": 172, "other_fatalities": 0, "total_fatalities": 183, "captain_hours": 19745, "captain_hours_type": 5546, "copilot_hours": 10957, "copilot_hours_type": 1966, "aircraft_hours": 6972, "circumstances": "At 10:18 flight LO5055 took off from Warsaw runway 33 for a flight to New York-JFK. The aircraft headed for the GRU VOR, which it passed at FL265, climbing to FL310. Two minutes later (at 10:41) the n°2 engine Low Pressure turbine shaft broke loose, followed by the failure of the turbine disc. Debris punctured the aft fuselage, causing a fire in the cargo hold. The elevator control system was severed and the n°1 engine had to be shut down. The flight crew immediately started an emergency descent to 4,000 metres. After shutting down both n°1 and n°2 engine the crew mistakenly thought the fire was extinguished. They had decided to land at Modlin airport, but still unaware of the fire, changed to Warsaw-Okecie runway 33 because of better rescue equipment there. The flight started a left turn for runway 33 at 11:09 at an altitude of 1,450 metres and an airspeed of 480 km/h. The crew lost control during the turn and the Il-62 crashed into a forest, 6 km from the runway at an airspeed of 465 km/h and an 11° left bank and 12° nosedown. The aircraft disintegrated on impact and all 183 occupants were killed. ", "probable_cause": "The cause of the accident was the destruction of engine no.2 resulting in disconnection of the longitudinal control system from the control column, cabin depressurisation, damage to the electric system and fire. At the end stage of flight the fire caused the loss of the aircraft longitudinal control and the impact with the ground after 31 minutes as counted from the beginning of the emergency situation. The destruction of engine no.2 occurred without any signal from the warning/testing system. Under the circumstances the crew members were not able to stop the engine in good time, consequently an emergency situation was created on board the aircraft."}