{"url": "https://www.baaa-acro.com/crash/crash-avro-696-shackleton-mr3-near-stettynskloof-13-killed", "date": "Aug 8, 1963 at 1525 LT", "type": "Avro 696 Shackleton", "operator": "South-African-Air-Force-3", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": "Cape Town - Cape Town", "msn": "1528", "yom": 1957, "flight_number": null, "city": "Stettynskloof", "zone": "Western Cape", "country": "South Africa", "region": "Africa", "crew_on_board": 13, "crew_fatalities": 13, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 777, "circumstances": "The tactical submarine phase of Operation CAPEX (Cape Exercise), a joint training exercise involving elements of Britain's Royal Navy and both the SA Navy and Air Force, commenced on August 7, 1963. During this phase, the Royal Navy submarine, HMS Alliance, would relocate from her existing position south of Port Elizabeth to a position further west, from where she would take part in further exercises with the SA Navy. During this transitional phase of the submarine, Shackleton 1718 was tasked by Maritime Group to conduct a CAPEX A exercise with the submarine. Although 35 Squadron was based at the military section of DF Malan International Airport in Cape Town, the unit's headquarters was at nearby Air Force Station (AFS) Ysterplaat and it was at this latter facility that the flight crew of Shackleton 1718 received a full briefing at 12H30 on August 8, 1963. During this briefing, the Operations Officer on duty advised the Shackleton aircrew to head out over False Bay after takeoff and to transit seawards towards the exercise area. He warned them that the direct overland route to Port Elizabeth should be avoided due to anticipated high icing levels on this route. Forecast weather for the route over False Bay and then southwards was poor. Heavy icing conditions could be expected between 1 220 and 1 829 m ( 4,000 and 6,000 ft) above mean sea level (AMSL) and consequently the flight crew were further briefed that Maritime Group had granted them special clearance to transit to the exercise area under 915 m (3,000 ft) AMSL. A 244 m (800 ft) AMSL cloud base would exist with tops up to 6 707 m (22,000 ft). Heavy air turbulence could be expected with cumulonimbus clouds, hail and heavy rain throughout. Surface wind was 42 km/h (26 mph) at 340° and 92 km/h (57 mph) at 340° and 1 524 m (5,000 ft). Even though the forecast weather over the eastern overland route was no better, at least the seaward route would eliminate the risk of the aircraft accidentally flying into high ground in the conditions of much reduced visibility. The aircraft commander, captain (Capt) TH Sivertsen, when giving his own briefing, confirmed his route as south over False Bay and then seawards towards the exercise area. The flight had been authorised by Maritime Group to provide the Shackleton crew with training in the radar detection of a submarine. No special instructions were issued. Shackleton 1718 was fully serviceable for flight even though the compasses had not been swung on their normal expiry date of July 19, 1963. Maritime Group gave authorisation for a month's extension provided that no major part of the aircraft was replaced. The compasses were therefore considered serviceable. The Flight Office at Ysterplaat was uncomfortable about the weather conditions and telephoned the Maritime Group Operations Centre thrice prior to the departure of the Shackleton, in an effort to get the flight cancelled, but this request was not forthcoming. Just minutes before takeoff, Capt Sivertsen, notwithstanding his briefing instructions, informed Air Traffic Control (ATC) that he would climb to 2 896 m (9,500 ft) AMSL and head overland towards Port Elizabeth. The aircraft lifted off Runway 34 at 15H06 and turned right on 350° for the climb out. Moments later, ATC informed the commander to come to 330° so as to safely avoid Tiger Mountain. Capt Sivertsen acknowledged this transmission and did accordingly. After the lapse of about a minute, he requested clearance to resume his original course of 350°. This was the last radio transmission received from Shackleton 1718. At about 15H20 the radar technician at DF Malan requested permission to deactivate the radar for about ten minutes due to flooding of the radar installation on account of the heavy rain. This permission was granted, but before the radar was deactivated, 1718's location was given as a distance on the radar screen of about 40 km (25 miles) on a course of 100°. The ground course was about 145°. Although the evidence suggested that the airplane had crashed, most likely in the Stettynskloof/Wemmershoek Mountains area, the adverse weather conditions, combined with the lateness of the hour, precluded any meaningful attempt at a search and rescue effort being mounted until the following day, August 9. At 10H00 and again at 13H30 on August 9, helicopters were sent out to the Wemmershoek area to report on the weather, which remained completely adverse. Following a report of an aircraft having been heard, a further helicopter was despatched at 15H00 to search the mountains south of Simonstown. On August 10, another helicopter continued the search at Simonstown from 08H15, while a second aircraft was sent to report back on the weather in the Wemmershoek area. Here, the weather was still closed in, but hinted at the first signs of improvement. At 09H00 at aircraft was sent to fly high over the Wemmershoek Mountains to report on the cloud coverage. At 11H00 two aircraft continued a search in the same mountains and at 13H15 they were joined by a further pair of rotorcraft. The wreck was finally discovered from the air at 17H18 just over two days following the accident. It was evident from the almost complete destruction of the aircraft that nobody aboard could possibly have survived the crash.  The crash occurred about 25.8 km (16 miles from the nearest town, Worcester, in the Stettynskloof valley between Paarl and Stellenbosch. After inspecting the crash scene, the 35 Squadron Engineering Officer, Capt WJ Stiglingh decided to investigate the failures apparent on the port elevator and the upper section of the starboard rudder, both of which detached in flight, although the Board of Inquiry (BOI) officially convened to investigate the cause of the accident, was unable to establish which broke off first.  The section of the starboard rudder was found 1 620 m (5,314 ft) and the port elevator 1 250 m (4,100 ft) from the impact point. Following the disintegration of these two flight control surfaces, the aircraft would have been rendered uncontrollable. At this point (about 15H25) the pilot was heard to make his final radio transmission: “Mayday. Mayday,” but this was not recognised as such by the ATC. The timing of the transmission coincides exactly with the crash time. At the same time that the starboard rudder and port elevator detached in flight, the port fuel tip tank also broke away removing a section of the port wing and both outer elevators. The outer most starboard elevator was found further forward than the impact point of the port tip tank. Clearly, it broke away shortly after the tip tank. The port elevator, which was complete, showed relatively little damage. Most of the damage sustained was consistent with it having fallen on to its inboard end and then on to some rocks. Signs were found, however, of excessive downward movement of this elevator to the extent that the hinges had damaged the steel spar, more so at the outboard hinge where the hinge arm had actually cut into the spar. It was official opinion that pilot applied force could not have caused this damage since the control column movement in restricted by stops strong enough to resist human force. It is considered that at the time of the excessive downward movement of the elevator, the force, mainly due to leverage over the spar, was sufficient to cause failure of the hinge bolts in tension. Failure of the spar attachment upper lug clearly indicated that the outboard end of the elevator broke away first in a rearward direction. No evidence was found to suggest that this port elevator was attached to the airframe at the time of impact. Examination of the starboard elevator indicated that its upward travel had been exceeded; this and other damage to this elevator being consistent with crash damage. Regarding the section of the upper starboard rudder, the outboard skin at the break had failed in tension and the inboard skin was torn away from the front rearwards, this indicating that the broken off portion was first bent inwards and then backwards. Furthermore, apart from damage at the upper leading edge, which was inflicted when the rudder struck the ground, this portion of rudder was altogether undamaged. The rudder was probably detached from the aircraft before the point of impact. As for the lower portion of the starboard rudder, failures on the outboard and inboard skins correspond to failure on the upper section. Damage on this section would appear to indicate that it did not strike the ground at the point of impact, but that it was flung forwards and carried further assisted by the strong winds prevailing at the time. Considerable violence coupled with exceptionally strong winds and/or air turbulence was necessary to carry the port and starboard fin, port tailplane and several other pieces of empennage to their final positions. None of these parts, except the starboard fin, displayed any damage that could have occurred at the point if impact. The port tailplane front spar had pulled out along its length, shearing all its rivets. Examination of the main impact zone indicated that the fuselage struck at right angles to the main mark down the slope and the sideways cartwheel or flick might have thrown empennage parts in to the air forward of, and to the right of, the impact area. Examination of the point of impact of the port wingtip fuel tank indicated that the angle that the tank struck the ground was such that, had the tank been attached to the aircraft, the empennage should then have hit the ground. The tank was therefore most probably detached from the aircraft while still in the air. Positions of the No. 3 and 4 ailerons and part of the port wing support this reasoning. The dump valves of both port and starboard tip tanks were found in the fully open position. As these valves are electromechanically driven, they were probably intentionally open and most likely before the port tip tank impact since this tank still had a considerable amount of fuel left over in it, judging by the flash fire area. The forward portion of the starboard tip tank, on the other hand, showed no signs of flash fire or explosion, indicating that its fuel content at the time of impact must have been low. The open dump valves appear to suggest that the pilot must have been busy dumping fuel in order to reduce the load on the  airframe when it experienced the heavy turbulence and just before the aircraft began disintegrating. The aircraft weighed about 43 213 kg (95,242 lb) at the time of the accident. In an attempt to reconstruct the events leading up to the crash, another Shackleton of the same weight and load as Shackleton 1718, took off from Runway 34 at DF Malan on August 22, 1963 to attempt to emulate as closely as possible the course and climb tempo of the stricken aircraft. Based on this emulation, it was ascertained that Shackleton 1718 was either at or very close to its intended cruise altitude of 2 896 m (9,500 ft) AMSL. Instrument Flight Rules (IFR) flight had been authorised and the aircraft had been operating under IFR conditions at the time of its demise. The Board was satisfied that the flight crew were under all circumstances both qualified and capable of performing the mission with which they had been tasked. The accident occurred over State ground; property of the Department of Forestry. The terrain was unplanted, deforested and in its natural state. No claim could thus be made by the Department. There was no damage to private or other military property. Shackleton 1718 was manufactured in August 1957. Although possessing a maximum takeoff weight of 45 372 kg (100,000 lb), for its final flight it lifted off at 43 938 kg (96,840 lb). Since the aircraft was heavily laden with its maximum weight point close to the rearmost limit, the pilots would have experienced some instability in the yawing (left/right) plane. \n\r\nCrew:\r\nCpt Thomas Howard Sivertsen, pilot,\r\n2nd Lt Charles Alwyn du Plooy, copilot,\r\nCpt Jacques Guillaume Labuschagne, pilot,\r\nLt Abraham Gert Willem Coetzee, navigator,\r\n2nd Lt George James Smith, navigator,\r\nC/O Derek Ian Strauss, navigator, \r\nWO2 Sydney Shields Scully, flight engineer, \r\nL/Cpl Marthienus Christoffel Vorster, flight engineer, \r\nSgt David Hope Sheasby, signaller, \r\nL/Cpl Charl Paul Viljoen, radio operator, \r\nL/Cpl Matthys Johannes Taljaard, radio operator, \r\nL/Cpl Michel Adolf Brodreiss, radio operator,\r\nA/M Johannes Chamberlain, radio operator.\n\r\nSource: ASN", "probable_cause": "The Board established that the impact speed of the aircraft was high and that this, combined with the resulting fire following the crash, caused almost complete destruction of the aircraft. There was no attempt by the crew to use parachutes and all aboard are assumed to have perished in the high G impact. The Board established that the atrocious weather was a significant contributory factor in this accident. Wind was about 148 km/h (92 mph) due to the unstable air mass forming convection currents. Cloud cover extended from 305 m (1,000 ft) to 8 841 m (29,000 ft) AMSL with associated heavy precipitation. Due to the turbulence, the moist unstable air mass and low icing height resulted in unusually high icing conditions from 1 220 m to 1 829 m (4,000 ft-6,000 ft). Air Force headquarters telephonically informed the Board that the maximum acceleration permitted on the Shackleton airframe was 2.4 G. It was thus theoretically possible to easily exceed this low limitation, especially under conditions of unusually high turbulence as in this case. Although it cannot be proved, it is not impossible that the pilot in control could have over controlled the aircraft on at least one occasion in response to the unusually heavy turbulence. This could have placed an additional load on the airframe. It was considered a possibility that, due to the turbulence, the pilot found himself unwittingly between the mountain peaks and that either one wingtip or one of the tail surfaces skimmed the side of one of the mountains, the impact causing the aircraft to disintegrate in flight and causing the pilot to lose control. The Board, however, considered this scenario unlikely given the fact that the ATC heard the pilot's Mayday transmission clearly and the aircraft must have thus been flying above the mountain peaks under normal circumstances when the radio call was put out. Additionally, the fact that the dump valves were open does not correspond with a collision against a mountain. The Board found Capt Sivertsen solely responsible for the accident. He displayed a complete lack of discipline by disobeying a direct order to rather route south over False Bay and instead routed over land, where the mountainous terrain exacerbated the already foul weather conditions. The aerodynamic effect of heavy icing, strong and turbulent winds, the heavy weight of the aircraft combined with the possible over control by the pilot in control, placed an unusually high loading on the airframe. This resulted in the airframe exceeding its design limits and initiated disintegration, leading to the loss of control and the consequent fatal crash. The accident was classed as an avoidable major flying accident. All the evidence submitted by all the witnesses interviewed was considered credible by the Board. Shackleton 1718 was delivered new to the SAAF valued at R 417 250.00. At the time of its demise it had completed 775.15 total airframe hours and, with depreciation, was valued with engines and propellers at R 266 109.45. The Rolls-Royce Griffon Mk 57A piston engines, like the airframe, were all classified as having sustained Category IIIa (write-off damage with no salvageable content). Engine numbers were 64411, 64412, 64416 and 64445. This was the only Shackleton to be written off in 27 years of SAAF service from 1957 to 1984. The Group Commander remarked that the ultimate load factor was 4 G. This figure suggests that the airframe was considerably stronger than the BOI was made to believe when they made their investigation. This information was, however, not available to the Board at the time. The only flight crew member of the 13 that perished on board to have received any honours or awards was WO2 (Warrant Officer Class 2) Scully, recipient of the Africa Star with Clasp and the Union Medal (No. 285)."}