{"url": "https://www.baaa-acro.com/crash/crash-cessna-551-citation-iisp-mountain-view-3-killed", "date": "Nov 18, 1982 at 0930 LT", "type": "Cessna 551 Citation II", "operator": "Coin Acceptors", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Mountain View - Saint Louis", "msn": "551-0024", "yom": 1979, "flight_number": null, "city": "Mountain View", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3750, "captain_hours_type": 1750, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1150, "circumstances": "On November 17, 1982, the pilot called Vichy Flight Service Station (FSS) and filed a request for an instrument flight rules (IFR) clearance for a flight from Mountain View Airport, Mountain View, Missouri, to Lambert - St. Louis International Airport, St. Louis, Missouri, for the following day. The pilot requested the IFR clearance for a 0930 departure. The flight was to be operated under 14 CFR Part 91, and the purpose of the flight was to transport the pilot, who was the president of the company which owned N2CA, and two passengers to St. Louis. Neither passenger was a pilot. Earlier on November 17, the pilot and the company's chief pilot had flown N2CA to Mountain View Airport from St. Louis. The chief pilot said that there were no mechanical deficiencies with the airplane, but that he believed that some of the avionics equipment was slow to warm up and become operationally usable. The Global Navigation System (GNS) 1 / required 4-5 minutes to become operationally usable from the time it was turned on. According to the chief pilot, the attitude director indicator (ADI) on the pilot's side also required more time to become operationally usable than some of the other avionic equipment. He stated that there had been occasions when \"we've had to sit for 1- 1 1/2 minutes waiting for the artificial horizon to leave its caged position and go to the normal flight position.\" He also stated that in the last 10 flying hours, the pilot's heading indicator required more time \"than normal to come on line.\" He said that the pilot had mentioned to him on the previous day that it was taking an increasingly longer time for the flag to disappear before the heading indicator was ready for use in flight. According to the chief pilot, the pilot stated that he (the pilot) occasionally would use the copilot's heading indicator during takeoff until the heading information on the pilot's side was operationally usable. After the flight to Mountain View Airport on November 17, the airplane was refueled with all tanks filled to capacity. A jet-A fuel supply recently had been installed at the airport; the airplane therefore could be \"topped off\" at Mountain View Airport instead of having to make an extra refueling stop. As a result, the airplane was about 3,400 lbs heavier for flight on the 18th than it had been in past takeoffs from Mountain View Airport. About 0730 2/ c.s.t., November 18, the pilot called a fixed-base operator at Lambert - St. Louis International Airport and inquired about the weather. The operator was neither a pilot nor a weather observer. He told the pilot that the visibility was at least 1 1/2 miles, and the ceiling was \"fairly low.\" The operator called the Lambert - St. Louis Air Traffic Control (ATC) Tower and inquired about ATC delays. He then called the pilot back and relayed information about the ATC situation. There was no record of any other weather briefing. At 0909, the pilot called the Vichy FSS for the IFR clearance. The pilot told the FSS specialist that he would need 15 minutes to get to the airport. He was given the clearance which was valid until 0930. The telephone conversation ended at 0914. The call was placed from the pilot's home. Meanwhile, the chief pilot had conducted a preflight inspection of N2CA, and had taken the airplane out of the hangar. The pilot left his home shortly after 0915 and arrived at the airport between 0920 and 0925. The pilot then loaded the baggage and boarded the two passengers. The chief pilot said that both engines had been started by the time he had driven the tug back to the hangar and started to close the hangar door. The airplane remained on the ramp for I5 to 30 seconds while a person handed some company material to the pilot through the cockpit window. The pilot was in the left cockpit seat, and a male passenger was in the right cockpit seat. The airplane was immediately taxied directly to runway 28, a distance of about 225 feet. The chief pilot said that the airplane was stopped on the runway for 30 to 60 seconds before the takeoff roll started. He said it was exactly 0930 by his watch when the takeoff roll started. He said that, assuming that the generators were turned on as soon as the second engine was started, about 2 minutes elapsed from the time they were turned on to the time the takeoff roll was started. The chief pilot and another pilot at the airport described the takeoff as normal, although the airplane required about three-quarters of the runway before liftoff. The airplane disappeared from sight when it was 20 feet to 50 feet above the runway. The witnesses described the weather as low ceilings, reduced visibility because of fog, but no rain. The runway was damp from 8 previous rainfall. No significant winds were noted. There were no witnesses to the accident. One person, located one-half mile northeast of the accident site, heard a \"jet'' fly over his house in a southwesterly direction and shortly afterward heard an explosion. A second person, located one-fifth mile north of the accident site, heard the airplane fly over his house on a southerly heading. He heard a loud explosion and immediately thereafter saw a fire in the woods. He and his sons ran toward the explosion. One son returned to call the sheriff; the call was placed through the operator and was logged at the sheriff's office at 0934. A call was received at a nearby State Police office at 0936. The airplane crashed in a woods about 1.75 miles due north of Mountain View Airport on a heading of 120'in an attitude that was at least 30' nose down and a left bank of 90'. The airplane wreckage was spread over a 400-square-foot area. All three occupants died in the accident. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of the accident was the loss of control of the airplane following the takeoff in instrument meteorological conditions as a result of the pilot's use of attitude and heading instruments which had not become operationally usable and/or his partial reliance on the copilot's flight instruments which resulted in an abnormal instrument scan pattern leading to the pilot's disorientation. Contributing to the accident was the pilot's hurried and inadequate preflight procedures. "}