{"url": "https://www.baaa-acro.com/crash/crash-antonov-124-100-near-kerman-17-killed", "date": "Nov 15, 1993 at 1907 LT", "type": "Antonov AN-124", "operator": "Aviastar3", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Mountains", "schedule": "Dubai - Kerman - Tashkent", "msn": "435913", "yom": 1993, "flight_number": "ATL051", "city": "Kerman", "zone": "Kermanshah", "country": "Iran", "region": "Asia", "crew_on_board": 14, "crew_fatalities": 14, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 17, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 116, "circumstances": "Completing its first commercial flight, the aircraft was returning to Tashkent on a ferry flight from Dubai with three passengers and 14 crew members on board. A fuel stop at Kerman was scheduled. On approach to Kerman, while in the holding pattern, the crew transmitted to ATC conflicting information about their position. In the meantime, he failed to follow the flight track in the holding pattern, causing a deviation from the prescribed route of 47 km to the north. After being cleared to descend to runway 34 from 8,200 metres to 5,200 metres in limited visibility, the crew followed an opposite route. After passing over the airfield, the crew started the descent from 3,300 metres, but failed to complete a standard turn and departed the approach path, flying towards the mountains up to 4,100 metres, with a deviation to the south of the airport by 43.5 km. Four minutes later, while completing a left turn to join the approach path at an unsafe altitude, the radio altimeter sounded in the cockpit. At a speed of about 385 km/h, the aircraft collided with Mt Jupar (3,400 metres high) located about 37 km southeast of the airport. The aircraft disintegrated on impact and all 17 occupants were killed. ", "probable_cause": "The Commission found that during the descent from the flight level for the approach, the crew incorrectly made the decision to approach according to the ALMEK-1A scheme (erroneously proposed by the controller of the Kerman aerodrome with violation of the meteorological minimum); making a mistake in determining his position during the approach (report 'following on the VOR Kerman', while the aircraft was actually moving away from the VOR); could not withstand the speed and flight time established for this scheme. Presumably, the crew did not use the airborne radar in the 'mountain' mode, made a mistake in determining their location due to the 180° pointer indication of the current value of the VOR beacon bearing on the PNP, as well as the large (more than a year) interruption in flights on the MVL on the plane An-124-100. ATC based at Kerman Airport did not respond to conflicting messages from the crew, transmitted at an interval of 9 seconds ('our distance is 20 miles' and 'standing in the area above Kerman') and offered the crew an approach pattern with a violation of the minimum."}