{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-26a-marquise-near-san-fernando-3-killed", "date": "Jul 24, 2017 at 1430 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Aibal", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "San Fernando – Las Lomitas", "msn": "361", "yom": 1977, "flight_number": null, "city": "Buenos Aires-San Fernando", "zone": "Buenos Aires City", "country": "Argentina", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 682, "captain_hours_type": 58, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5804, "circumstances": "Shortly after takeoff from San Fernando Airport in Buenos Aires, while in initial climb, the pilot was contacted by ATC about an apparent transponder issue. The crew did not respond when, few seconds later, the twin engine airplane entered an uncontrolled descent and crashed in a marshy area located in the delta of Paraná de la Palmas. The wreckage was found on August 19 about 17 km north of San Fernando Airport. The aircraft disintegrated on impact and all three occupants were killed. \r\nCrew:\r\nMatías Ronzano,\r\nPassengers:\r\nEmanuel Vega,\r\nMatías Aristi. ", "probable_cause": "Loss of control during climb due to the combination of the following factors:\r\n- The particular characteristics of the aircraft;\r\n- The attention required by the transponder as it is not displayed by air traffic control;\r\n- The detour of the planned flight at the request of the inspection department of air traffic;\r\n- Aircraft trajectory management with autopilot switched off;\r\n- The pilot's limited experience in instrument flight conditions. In addition, the absence of additional instruction in the aircraft type (due to the lack of specific regulations) can be considered a contributing factor, according to the probable scenario described above. In addition, the research identified the following elements with potential impact in operational safety:\r\n- Absence of the TAWS system on the aircraft in non-conformity with the established RAAC 91;\r\n- Lack of effective means to enable the flight plan office to quickly determine whether an aircraft has operating restrictions;\r\n- Shortcomings in the training of staff in the units ATS and SAR in search and rescue."}