{"url": "https://www.baaa-acro.com/crash/crash-antonov-12bk-near-malakal-7-killed", "date": "Jun 27, 2008 at 0705 LT", "type": "Antonov AN-12", "operator": "Juba%20Air%20Cargo", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Khartoum – Juba", "msn": "8 3 460 10", "yom": 1968, "flight_number": null, "city": "Malakal", "zone": "Upper Nile (أعالي النيل)", "country": "South Sudan", "region": "Africa", "crew_on_board": 8, "crew_fatalities": 7, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 13300, "captain_hours_type": 5000, "copilot_hours": 11535, "copilot_hours_type": 3300, "aircraft_hours": 14597, "circumstances": "The aircraft departed Khartoum at 0555LT on a cargo flight to Juba with 8 crew members on board. While cruising at FL170 in bad weather conditions, the engines n° 1 failed. One minute later, the engine n°3 failed as well, followed 40 seconds later by the failure of the engine n°4. The aircraft initiated a descent with a rate of 3,450 feet per minute and reach the altitude of 800 feet three minutes and 40 seconds after the failure of the engine n°1. At an altitude of 600 feet, the crew stabilized the aircraft and elected to restart the three engines but without success. Too low, the aircraft struck trees, lost its left stabilizer and crashed in a prairie 264 metres past the initial impact, bursting into flames. A crew member was rescued while 7 other occupants were killed. ", "probable_cause": "Loss of control and subsequent ground impact following the failure of engine n°1, 3 and 4. \r\nThe following contributing factors were identified:\r\n- The crew entered an area of thunderstorm activity with turbulences and icing conditions, \r\n- Unserviceability or sudden failure of the weather radar,\r\n- Accumulation of ice caused the blockage of the engines air intake assembly,\r\n- Following impact with trees, the aircraft lost parts and the running engine n°2 caused the fire. "}