{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-frobisher-bay-9-killed", "date": "Aug 29, 1979 at 2300 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Bradley%20Air%20Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Brevoort Island - Frobisher Bay", "msn": "415", "yom": 1974, "flight_number": null, "city": "Frobisher Bay", "zone": "Nunavut", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5286, "circumstances": "The airplane was being used for a series of flights between Frobisher (YFB) and Brevoort Island, a distance of 119 nm. These flights were conducted under visual flight rules (VFR) with a Flight Notification filed at Frobisher. Two return flights were accomplished without incident and the aircraft was flown back to Brevoort for another round trip. On the final flight the aircraft, with the same two pilots and with seven passengers, left Brevoort at 21:57 hours local time enroute to Frobisher. The pilots contacted Frobisher Flight Service Station (FSS) at 22:31 reporting at 6000 feet altitude estimating Frobisher in 15 minutes. Upon receiving the latest weather indicating conditions below VFR limits, they requested clearance for \"Special VFR\". This clearance was granted. Another weather report was transmitted by the Frobisher FSS giving the 22:44 observation in which the ceiling had lowered to 400 ft with the visibility at 8 miles and the wind from 190 deg M at 22 knots. The pilot stated they would make a front course ILS approach to runway 36 with a landing on 18. At 22:58 they were issued a clearance for an ILS approach. They subsequently reported outbound at procedure turn altitude and at that time confirmed their planned approach for runway 36 with circling for 18. This was the last radio transmission from C-GROW. The Twin Otter was seen flying north along the runway. It then struck high ground about 1200 feet east of the runway and about 100 feet above runway level. The aircraft was destroyed and all nine occupants were killed. ", "probable_cause": "The exact cause of the accident could not be determined with certainty. However, it is quite possible that there was low cloud over the terrain east of the runway; when the aircraft had nearly completed its turn, it entered low cloud and the crew lost visual contact; the crew continued the right turn probably expecting to become visual again because they knew that good visibility existed over the runway; they did not regain contact with the ground and runway environment however and impacted the higher ground to the east of the runway."}