{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-62m-moscow", "date": "Mar 29, 2006 at 2051 LT", "type": "Ilyushin II-62", "operator": "Libyan Government", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Mitiga - Moscow", "msn": "4053514", "yom": 1990, "flight_number": null, "city": "Moscow-Domodedovo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew departed Mitiga on a positioning flight to Moscow-Domodedovo where the airplane should follow an overhaul program. The airplane crossed the runway 32R threshold at a height of 12 metres and with an excessive speed of 304 km/h. At a height of about five metres, the captain instructed the flight engineer to reduce the speed and to bring back the speed levers to idle. This instruction was confirmed by the flight engineer then the captain asked for the thrust reversers to be activated. In a certain confusion, the flight engineer did not confirm this instruction and asked again the order. Possibly due to a certain distraction, the flight engineer failed to position the power lever in the correction position. As a result, the aircraft floated at a height estimated between 0,5 and one metre before it landed firmly 1,100 metres past the runway threshold at a speed of 258 km/h. Unable to stop within the landing distance available, the aircraft overran, lost its undercarriage and came to rest 680 metres further, broken in three. All six occupants were rescued, among them two were injured. ", "probable_cause": "The accident occurred as a result of erroneous actions by the flight engineer during operations to turn on the engine reverse when landing the plane, expressed in shifting the reverse buckets to direct thrust and putting the 1st and 4th engines to take-off mode after landing. The Commission concluded that the flight engineer’s erroneous actions were facilitated by:\r\n- A low level of technological discipline in the crew due to the weak role of the captain as a leader in the crew, which was manifested in the crew members not fully fulfilling the \"Instructions for the interaction and technology of the crew members of the IL-62M aircraft\" and Aircraft Flight Manual during descent, approach and landing,\r\n- Emotional relaxation of the crew at the end of a business trip and return to base,\r\n- Lack of effective control, including according to the data of flight recorders over flight operations with LIBAVIA,\r\n- In the \"Instructions for the interaction and technology of the crew of the IL-62M aircraft\" there are no control functions on the part of other crew members for the actions of the flight engineer at the stage of aircraft landing and the status of the reverse on/off alarm,\r\n- The absence in the training programs of the simulator of exercises for practicing the actions of crew members in case of erroneous actions by the flight engineer when the reverse is turned on,\r\n- Lack of equipment for the flight engineer’s workplace with a radio headset, lack of procedures in the \"Instructions for Interaction and the Work Technology of the Crew Members of the Il-62M Aircraft\" for the use of a radio headset for flight personnel in flights with a reduced crew,\r\n- Excessive volume of the SSU speakers broadcasting external radio communications, which created additional difficulties when listening to the commands given by the captain,\r\n- Fuzziness (illegibility) of the commands given by the PIC and the lack of response of the PIC to the non-confirmation of the commands given by him to the flight engineer."}