{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-680v-bridgeport-1-killed", "date": "Sep 3, 1984 at 2008 LT", "type": "Rockwell Grand Commander 680", "operator": "Palm Beach Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "West Palm Beach - Bridgeport", "msn": "680-1618-50", "yom": 1966, "flight_number": null, "city": "Bridgeport-Igor I. Sikorsky Memorial", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft descended into the water six and 1/2 miles southwest of Bridgeport, CT. The aircraft was on an ILS approach to runway 06. The aircraft was in communication with NY tracon arrival radar and on his initial call had indicated a desire for a clearance direct to Bridgeport. A brief radio exchange resulted in the desired clearance. There was no indication of any problems or low fuel state in the communication. Approximately 15 minutes after initial call, the controller was giving the final approach instructions to N100CT, after having used some turns and changes in airspeed to space the flight behind landing traffic, when radar and radio contact was lost. Post accident fuel calculations based on fuel aboard vs flight time en route and normal fuel consumption showed approximately 6 gallons of fuel remaining. The normal unusable fuel for this aircraft is 13 gallons which increases during maneuvering. Identifiable parts of the aircraft and some paper documents were recovered by the coast guard. The pilot's body was not recovered.", "probable_cause": "Occurrence #1: in flight collision with terrain/water\r\nPhase of operation: descent\r\nFindings\r\n1. (f) weather condition - low ceiling\r\n2. (c) preflight planning/preparation - inadequate - pilot in command\r\n3. (f) terrain condition - water, rough\r\n4. (c) fuel supply - inadequate - pilot in command\r\n5. (c) emergency procedure - not performed - pilot in command\r\n6. (c) radio communications - inadequate - pilot in command"}