{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-bilogai-3-killed", "date": "Sep 15, 2021 at 0730 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Rimbun%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Nabire – Bilogai", "msn": "493", "yom": 1976, "flight_number": null, "city": "Bilogai-Sugapa", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 13158, "captain_hours_type": 8051, "copilot_hours": 974, "copilot_hours_type": 807, "aircraft_hours": 10333, "circumstances": "On 15 September 2021, a DHC-6-300 (Twin Otter) aircraft registered PK-OTW was being operated for an unscheduled cargo flight from Douw Aturure Airport (WABI), Nabire, Papua to Bilorai Airport (WAYB), Intan Jaya, Papua. The aircraft was operated by two pilots accompanied by one engineer on board. The filed flight plan for the flight indicated that the aircraft would be operated under Visual Flight Rule (VFR) with fuel endurance of 2 hours 30 minutes. The estimate time departure for the flight was at 0640 LT. At 0610 LT, the pilot received weather observation report from the Bilorai aeronautical communication officer (ACO) that the visibility was 5 up to 7 kilometers, several clouds over the airport and all final areas were clear. About 7 minutes later, the ACO updated the observation report which indicated that the visibility changed to 7 up to 8 kilometers (km). After the cargo loading process and the flight preparation had completed, the aircraft taxied to Runway 16. At 0644 LT, the aircraft departed and climbed to the cruising altitude of 9,500 feet. Prior to the departure, there was no record or report of aircraft system malfunction. The Pilot in Command (PIC) acted as Pilot Monitoring (PM) while the Second in Command (SIC) acted as Pilot Flying (PF). At 0658 LT, the PK-OTW pilot reported to the Nabire air traffic control that the aircraft was at 25 Nm with altitude of 9,500 feet. At 0702 LT, the SIC asked the PIC to have the aircraft control as PF. During flight, the PK-OTW pilots monitored weather information provided by the pilots of two other aircraft that flew ahead of the PK-OTW to Bilorai. Both pilots monitored that the first aircraft (Cessna 208B EX) landed using Runway 27 while the second aircraft (Cessna 208B) would use Runway 09. At 0715 LT, the PIC advised the SIC to use the Runway 27 for landing. At 0719 LT, the SIC made initial contact with the ACO and advised that the aircraft was approaching Bilai at altitude of 9,500 feet and the estimate time arrival at Bilorai was 0726 LT. The ACO acknowledged the pilot report and provided current weather observation as follows “…wind westerly 3 until 5 knots, final 09 open with broken fog and final 27 open, visibility 5 until 7 km, blue sky overhead”. The SIC acknowledged the weather information and advised the ACO would report when the aircraft position was on left downwind Runway 27. At 0721 LT, the SIC read the descent checklist included the item of Landing Data/Approach Briefing and was replied by completed. The Cockpit Voice Recorder (CVR) did not record any pilot’s discussion regarding to the airport minimum safe altitude since the beginning of the recording. At 0723 LT, a pilot of DHC-6-400 aircraft registered PK-OTJ, asked the PK-OTW pilot of the weather condition in Bilorai. The PK-OTJ flew behind the PK-OTW with from Nabire to Bilorai. The SIC then responded that the PK-OTW was on descend and would fly through clouds about 5 Nm to Bilorai. Thereafter, the ACO provided traffic information to PK-OTW pilot that there was an aircraft (Cessna 208B aircraft) on final Runway 09. The PIC who acted as PF acknowledged the traffic information and advised to the ACO that the PK-OTW would join left downwind Runway 27 for the landing approach. At 0725 LT, the SIC advised to the ACO that the aircraft was on left downwind Runway 27. The ACO then advised the PK-OTW pilot to report when on final Runway 27. At 07:26:12 LT, a stall warning recorded in the Cockpit Voice Recorder (CVR) then the PIC asked to the SIC to check the aircraft speed. The SIC responded the aircraft speed was 65 knots. At 07:26:16 LT, the PIC asked to the SIC to advise the ACO that they were making a go around. The SIC then advised the ACO that the PK-OTW was making a go around and was responded to report when on final. The CVR did not record pilot’s discussion about the plan maneuver of the go around. At 07:26:45 LT, the PIC informed that they were making a go around to the PK-OTJ pilot. The PK-OTJ pilot responded that the aircraft was approaching Homeyo and would reduce the speed to make enough separation with the PK-OTW. The PIC then advised the PK-OTJ that the PK-OTW would attempt to land using Runway 09. Based on the data transmitted from the flight following system, at 07:27:57 LT, the aircraft was about 3 Nm outbound from Bilorai on direction of 238°. At 07:28:22 LT, the PK-OTJ pilot advised to the ACO that the aircraft was about 6 nm to Bilai and the pilot intended to make holding maneuver over Bilai to make enough separation with the PK-OTW. At 07:28:33 LT, the SIC advised the PIC that the aircraft was at 8,200 feet and was responded that the PIC initiated turning the aircraft. A few second later, the SIC advised to the PIC that the aircraft was turning, and the aircraft was at 3.2 Nm outbound from Bilorai. At 07:28:38 LT, the last data of the flight following system recorded that the aircraft was on direction of 110°. At 07:29:25 LT, the SIC advised the PIC to fly left. Thereafter, the SIC advised the PIC that the aircraft was passing 8,000 feet. At 07:29:35 LTC, the PIC asked to the SIC about the distance to Bilorai and was responded 2.5 Nm. The SIC, reminded the PIC to fly left as the aircraft flew too close to the terrain. At 07:29:49 LT, the CVR recorded the first impact sound and the CVR recording stopped at 07:29:55 LT. At 0730 LT, the ACO asked the PK-OTW pilot intention as the aircraft was not visible from the ACO working position, and the pilot did not respond the ACO. At about the same time, the ACO heard impact sound that was predicted coming from terrain area on west of Bilorai. The ACO then called the PK-OTW pilot several times without response. Several pilots also attempted to contact the PK-OTW with the same result. The PK-OTW was found on a ridge at elevation of 8,100 feet, about 2 Nm on bearing 260° from Bilorai.\n", "probable_cause": null}