{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130a-ii-hercules-near-talin-17-killed", "date": "Sep 2, 1958 at 1400 LT", "type": "Lockheed C-130 Hercules", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Plain, Valley", "schedule": "Incirlik - Incirlik", "msn": "3136", "yom": 1957, "flight_number": null, "city": "Talin", "zone": "Aragatsotn", "country": "Armenia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 17, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew departed Incirlik AFB near Adana on a survey flight over Turkey. The mission consisted of an overflight of the region of Trabzon and Van, maintaining a minimum distance of 160 km with the Turkey/Armenia border. The crew passed over the city of Trabzon at an altitude of 25,500 feet and instead of changing its direction to the south bound for Van, the airplane continued to the east. While flying over Armenia at an altitude of 22,000 feet, the Hercules was shot down by an air-air missile fired by the pilot of a Soviet fighter. Out of control, the four engine aircraft dove into the ground and crashed near the city of Talin. Few weeks later, the bodies of six crew members were transferred to the US Authorities while nothing was heard anymore about the 11 intelligence-gathering personnel belonging to the United States Air Force Security Service (USAFSS).", "probable_cause": "Shot down by a Soviet Air Force fighter after it flew into the Soviet Airspace without prior permission. The C-130 crew may have become disoriented by Soviet navigational beacons which were on frequencies similar to those at Trabzon and Van, one signal in Georgia was stronger than that in Trabzon. More than 30 years after the event, top-secret documents were declassified and transmitted to the medias, stating that the crew was in fact involved in the identification of the Soviet defense radar systems and testing their performances. US Authorities confirmed they obtained the authorization to examine the aircraft's debris in August 1993. "}