{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-42-720-cheyenne-iii-grand-case-4-killed", "date": "May 5, 2012 at 0240 LT", "type": "Piper PA-42 Cheyenne", "operator": "Transports Aériens Intercaraïbes", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Grand Case - Fort-de-France", "msn": "42-8001043", "yom": 1980, "flight_number": "TIF520", "city": "Grand Case", "zone": "Saint-Martin", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3950, "captain_hours_type": 513, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7593, "circumstances": "The twin engine aircraft was engaged in an ambulance flight between Grand Case and Fort-de-France and was carrying a pilot, a nurse, a doctor and a patient, a Greek citizen in honeymoon in Saint Martin who suffered a heart attack. He normally should be transferred to Fort-de-France from Saint Martin-Princess Juliana Airport with another Operator but the aircraft suffered technical problem prior to departure and the patient was transferred to Grand Case Airport. Piper PA-42 left Grand Case-L'Espérance runway 12 at 02H39. One minute later, during initial climb, it lost height and crashed into the Caribbean Sea, some three NM off the airport, off Tintamarre Island. Around 1000LT in the morning, a wheel and some others debris were found floating in water and no trace of the four occupants was found. They were later considered as deceased. ", "probable_cause": "The French BEA said in its final report that no technical anomaly to affect significantly the performance of the airplane or its pitch control could be demonstrated. It appears that the pilot had consumed alcohol before the flight and was awake since 0630LT and did not sleep over 20 hours, which could affect his capabilities. In conclusion, the investigation did not determine the cause of the accident, but the following factors may have contributed:\r\n- aircraft's operation with one pilot only,\r\n- absence of regulation does not allow the Civil Aviation Authority to ensure the adequacy of the operational objectives of an operator and its capacity to maintain its activity. This failure could not ensure that the pilot was able to conduct the flight. \r\n- the presence of a flight recorder would probably help to understand the circumstances of the accident with more precision. Important data failed to the investigation, which was not able to identify all possible measures to avoid a similar accident in the future."}