{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-flagstaff-3-killed", "date": "Jan 31, 1996 at 1305 LT", "type": "Beechcraft 90 King Air", "operator": "Flagstaff%20Medical%20Center", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Mountains", "schedule": "Flagstaff - Phoenix", "msn": "LW-166", "yom": 1976, "flight_number": null, "city": "Flagstaff", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 10700, "captain_hours_type": 613, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5952, "circumstances": "The pilot and 2 nurses departed IFR to transport a patient from another location. During the initial climb, the pilot observed a gear unsafe light. He requested clearance to an area of VFR conditions to address the gear problem. Subsequently, the gear was manually extended with safe gear indications. The flight department requested that the pilot return to base. The pilot obtained an IFR clearance to return for an ILS approach. After handoff to the tower, he was requested to report the FAF inbound after an eastbound procedure turn. That was the last communication from the pilot. Subsequently, the aircraft crashed on the southeast side of Humphreys Peak at an elevation of about 10,500 feet and about 10 miles west of the final approach course. Wreckage was scattered along a heading of 230 degrees. There was evidence that the airplane was in a steep descent when it crashed. Radar data revealed an outbound track west of the published course and no procedure turn. The weather was IMC with light snow and rain. Moderate to severe turbulence was forecast and confirmed by other pilots. The winds at 10,000 feet were forecast to be 50 knots out of the southwest. Moderate turbulence and light rime ice had been reported along the ILS approach course before to the accident time.", "probable_cause": "Failure of the pilot to follow prescribed IFR procedures and his failure to maintain control of the aircraft. Factors relating to the accident were: the adverse weather conditions with icing and turbulence. "}