{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-near-berlin-2-killed", "date": "Nov 30, 1954 at 1115 LT", "type": "Douglas DC-3", "operator": "Northeast%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Boston – Concord – Laconia – Berlin", "msn": "11745", "yom": 1943, "flight_number": "NE792", "city": "Berlin", "zone": "New Hampshire", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7900, "captain_hours_type": 5500, "copilot_hours": 4300, "copilot_hours_type": 831, "aircraft_hours": 26000, "circumstances": "Flight 792 originated at Boston, Massachusetts, for Berlin, New Hampshire, with stops at concord and Laconia, New Hampshire. The drew consisted of Captain W. P. Carey, First Officer George D. McCormick, Stewardess Mary McEttrick, and Flight Superintendent John C. McNulty. Departure from Boston was at 0930, approximately on schedule, with a company clearance to Laconia under Visual Flight Rules. The first two segments of the flight, Boston-Concord and Concord-Laconia, were routine. Departure from Laconia was on schedule at 1039. The aircraft carried fuel for about four hours., its gross weight was considerably under the max allowable,. and its center of gravity was located within prescribed limits. Scheduled arrival at Berlin was 1112. A minute or so after takeoff the flight requested an IFR clearance f or the 73-mile flight which was at once approved by the company dispatcher at Boston, and Issued by the CAA Air Route Traffic Control Center, \"Boston ATC clears Northeast Flight 792 for an approach to the Berlin Airport via Blue 63 to cruise 8,000 feet.\" At 1103 the flight called the company station at the Berlin Airport and asked for local weather. The station agent immediately gave the 1045 observation: Estimated 3,000 feet overcast; visibility 2-1/2 miles; light snow showers. The flight acknowledged but did not give its altitude and position. The agent then made a special weather observation at 1110 and transmitted the following information to the flight: 2,300 scattered, 39000 overcast; visibility 2-1/2 miles; light snow showers; wind northwest 10; snow showers to the north. (This was close to the Berlin minimums of 2,300 foot ceiling and 2 miles visibility.) The flight's acknowledgement of this transmission was logged at 1114; however, the actual time may have been as much as two minutes earlier as the agent was alone and busy. There was no further contact. No position report was received for North Conway, a company-required reporting point about midway between Laconia, and Berlin. At 1125 the company's Boston station asked by teletype regarding the flight, Accordingly, the Berlin operator called the flight at 1128 but received no reply. At 1130 he sent a special weather report and suggested that, the flight return to Laconia. Again there was no reply. (The accident had already occurred.) This special weather was: Ceiling estimated 1,500 feet broken, 3,000 feet overcast; visibility 2 miles; light snow; wind northwest 10 (below Berlin minimums).", "probable_cause": "The Board determines that the probable cause of this accident was a premature and unauthorized instrument descent to an altitude that did not permit terrain clearance. The following findings were reported:\r\n- The 1114 company weather message for Berlin reported marginal weather conditions; this was acknowledged,\r\n- The pilot started his descent not in accord with the approved instrument approach procedure for the Berlin, New Hampshire, airport,\r\n- In so doing he struck a hill while letting down directly toward the airport."}