{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-400-malaybalay-19-killed", "date": "Apr 27, 1967 at 1710 LT", "type": "Fokker F27 Friendship", "operator": "Fokker", "flight_phase": "Takeoff (climb)", "flight_type": "Demonstration", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Malaybalay - Malaybalay", "msn": "10306", "yom": 1966, "flight_number": null, "city": "Malaybalay", "zone": "Bukidnon", "country": "Philippines", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 16, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 19, "captain_hours": 4365, "captain_hours_type": 2190, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 441, "circumstances": "The aircraft was under a two week lease from the owner, the Permina Oil Company of Indonesia, to the Royal Netherlands Aircraft Factories - Fokker, for the purpose of a series of demonstration flights in the Philippines. It arrived at Manila on 24 April 1967 and conducted demonstration flights at various airports on 26 and 27 April 1967. On that day the aircraft took off from Mactan at 0816 hours and after having flown to ten different aerodromes it arrived at Davao at 1557 hours where the main fuel tanks and water/ methanol tanks were filled to capacity. At 1635 hours the aircraft took off from Davao and landed at Malaybalay Airport on runway 06 at 1705 hours. It continued its landing roll up to the end of the runway, made a 180° turn and then took off from runway 24. According to ground witnesses the take-off was initiated with both engines at maximum power and the aircraft became airborne at about two-thirds of the runway length. At that time the right hand propeller was starting to slow down and stopped when the aircraft reached a height of about 1 metre above the ground. The aircraft appeared to have difficulty in gaining height and followed a creek between two hills in a right wing low attitude. It struck a tree and some bamboos and crashed on a hill 45 m higher than the runway elevation. The site of the accident was located 1 380 m from the end of runway 04 and 136.5 m to the right of its extended centre line. The accident occurred at 1710 hours. All three crew members and 16 passengers were killed. ", "probable_cause": "The probable cause of the accident was poor judgement of the pilot in taking off towards the direction where the terrain was unsuitable for single engine performance. Also contributing to the accident were the following: \r\n- The gross take-off weight was more than that allowed to clear the rising terrain along the flight path,\r\n- Inadequate available data regarding Malaybalay Airport. "}