{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-lodi", "date": "May 12, 2016 at 1413 LT", "type": "Cessna 208B Grand Caravan", "operator": "Flanagan Enterprises - USA", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lodi - Lodi", "msn": "208B-0309", "yom": 1992, "flight_number": null, "city": "Lodi", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 17, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7050, "captain_hours_type": 253, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12848, "circumstances": "The commercial pilot reported that, after takeoff on the local skydiving flight, the engine experienced a total loss of power. He initiated a turn toward the airport, but realized the airplane would not reach the runway and chose to perform a forced landing to an open field. During the landing roll, the airplane exited the field, crossed a road, impacted a truck, and continued into a vineyard, where it nosed over. Postaccident examination of the engine revealed that the fuel pressure line that connects the fuel control unit to the airframe fuel pressure transducer was fractured below the fuel control unit fitting's swaged seat. In addition, a supporting clamp for the fuel pressure fuel line was fractured and separated. The operator reported that the fractured fuel line had been replaced the night before the accident and had accumulated about 4 hours of operational time. The previously-installed line had also fractured. Metallurgical examination of the two fractured fuel lines revealed that both fuel lines fractured due to reverse bending fatigue through the tube wall where a ferrule was brazed to the outside of the tube. There were no apparent anomalies or defects at the crack initiation sites. Examination of the supporting clamp determined that it fractured due to unidirectional bending fatigue where one of the clamp's tabs met the clamp loop, with the crack initiating along the inward-facing side of the clamp. The orientation of the reverse bending fatigue cracks and the spacing of the fatigue striations on the tube fracture surfaces were consistent with high-cycle bending fatigue due to a vibration of the tube. The cushioned support clamp is designed to prevent such vibrations from occurring. However, if the clamp tab is fractured, it cannot properly clamp the tube and will be unable to prevent the vibration. The presence of the fractured clamp combined with the fact that the two pressure tubes failed in similar modes in short succession indicated that the clamp most likely failed first, resulting in the subsequent failure of the tubes. Since the clamp was likely fractured when the first fractured fuel pressure line was replaced, the clamp was either not inspected or inadequately inspected at the time of the maintenance.", "probable_cause": "A total loss of engine power due to a fatigue fracture of the fuel pressure line that connected the fuel control unit and the fuel flow transducer due to vibration as the result of a fatigue fracture of an associated support clamp. Contributing to the accident was the mechanic's inadequate inspection of the fuel line support clamp during the previous replacement of the fuel line. "}