{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-burnet", "date": "Jul 21, 2018 at 0915 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Commemorative%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Burnet – Sedalia – Oshkosh", "msn": "15758/27203", "yom": 1945, "flight_number": null, "city": "Burnet", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12500, "captain_hours_type": 2500, "copilot_hours": 8000, "copilot_hours_type": 17, "aircraft_hours": null, "circumstances": "According to the copilot, before takeoff, he and the pilot had briefed that the copilot would conduct the takeoff for the planned cross-country flight and be the pilot flying and that the pilot would be the pilot monitoring. The accident flight was the copilot's first takeoff in the accident airplane with it at or near its maximum gross weight. The pilot reported that he taxied the airplane onto the runway and locked the tailwheel in place and that the copilot then took over the controls. About 13 seconds after the start of the takeoff roll, the airplane veered slightly right, and the copilot counteracted with left rudder input. The airplane then swerved left, and shortly after the pilot took control of the airplane. The airplane briefly became airborne; the pilot stated that he knew the airplane was slow as he tried to ease it back over to the runway and set it back down. Subsequently, he felt the shudder “of a stall,” and the airplane rolled left and impacted the ground, the right main landing gear collapsed, and the left wing struck the ground. After the airplane came to a stop, a postimpact fire ensued. All the airplane occupants egressed through the aft left door. Postaccident examination of the airplane revealed no evidence of any mechanical malfunctions or failures with the flight controls or tailwheel. Both outboard portions of the of the aluminum shear pin within the tailwheel strut assembly were sheared off, consistent with side load forces on the tailwheel during the impact sequence. The copilot obtained his pilot-in-command type rating and his checkout for the accident airplane about 2 months and 2 weeks before the accident, respectively. The copilot had conducted two flights in the accident airplane with a unit instructor before the accident. The instructor reported that, during these flights, he noted that the copilot had directional control issues; made \"lazy inputs, similar to those for small airplanes\"; tended to go to the right first; and seemed to overcorrect to the left by leaving control inputs in for too long. He added that, after the checkout was completed, the copilot could take off and land without assistance; however, he had some concern about the his reaction time to a divergence of heading on the ground. Given the evidence, it is likely the copilot failed to maintain directional control during the initial takeoff roll. It is also likely that, if the pilot, who had more experience in the airplane, had monitored the copilot's takeoff more closely and taken remedial action sooner, he may have been able to correct the loss of directional control before the airplane became briefly airborne and subsequently experienced an aerodynamic stall.", "probable_cause": "The copilot's failure to maintain directional control during the initial takeoff roll and the pilot's failure to adequately monitor the copilot during the takeoff and his delayed remedial action, which resulted in the airplane briefly becoming airborne and subsequently experiencing an aerodynamic stall.\n"}