{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3a-sioux-city-16-killed", "date": "Mar 2, 1951 at 0912 LT", "type": "Douglas DC-3", "operator": "Mid-Continent%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kansas City – Omaha – Sioux City – Minneapolis", "msn": "7400", "yom": 1942, "flight_number": "MD016", "city": "Sioux City", "zone": "Iowa", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 21, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": 8585, "captain_hours_type": 6971, "copilot_hours": 3695, "copilot_hours_type": 1445, "aircraft_hours": 28202, "circumstances": "Flight 16 departed Kansas City, Missouri, at 0724LT, bound for Omaha, Nebraska, Sioux City, Iowa, and other intermediate stops with final destination as Minneapolis, Minnesota. The crew consisted of Captain James H. Graham, First Officer Philip K. Toler, and Stewardess Marilyn Woodbury. Ernest F. Eilert, a trainee copilot, was riding in the cockpit as the fourth crew member. From Kansas City, the aircraft carried 21 passengers, cargo, and fuel, which resulted in a total gross weight of 25,100 pounds, which was within the certificated unit of 25,200 pounds The load was properly distributed with relation to the center of gravity of the aircraft. Weather conditions over the intended route were instrument with a general overcast lowering from 4,200 feet at Kansas City to about 1,000 feet at Omaha. No difficulty was experienced as the flight proceeded to Omaha at 4,000 feet in accordance with an instrument flight plan. A normal landing was made on Runway 11 about 1,000 feet from its approach end, but near the completion of the landing roll the aircraft ran off the right side of the runway, passing over one of the high intensity runway lights. Captain Graham reported this to one of the ground crew at Omaha, and both the aircraft and light were inspected for damage. None was found and the aircraft was prepared for departure to Sioux City. At 0841 the flight took off for Sioux City on an instrument flight plan with Omaha as the alternate airport. There were 21 passengers, 920 pounds of cargo, and 1,500 pounds of fuel, which resulted in a take-off weight of 24,630 pounds. The take-off was without incident and no difficulty was encountered en route to Sioux City, the flight proceeding at 3,000 feet altitude. At 0904 Flight 16 reported over the Sloan Fan Marker, 11.9 miles south-southeast of the approach end of Runway 35 at the Sioux City Airport. It was immediately cleared by the Sioux City Airport tower for a “straight-in” approach and landing on Runway 35. Weather information was furnished to the flight as precipitation, ceiling 500 feet, sky obscured, visibility one mile in light snow showers, and wind from the east at 14 miles per hour. The medium-intensity lights for Runway 17/35 were turned on and placed at the position of full brilliance. Following receipt of this information, the flight requested permission to land to the southeast on Runway 13 and received clearance to do so. At 0909 the flight reported that it was contact over the southeast corner of the field and was cleared to land. At the same time the aircraft was seen by a ground witness one mile southeast of the airport. Shortly thereafter, it was sighted approximately over the intersection of Runways 4/22 and 17/35 on an east-southeast heading. A left climbing turned to the north was then made and the pilot was advised that he was cleared to land on either Runway 17 or Runway 13. The pilot was also advised by the tower that there would be a 90-degree cross-wind if he elected to land on Runway 17. All transmissions to the flight were acknowledged The aircraft was not further observed, and crashed about 600 feet north and west of the approach end of Runway 17. Fire developed immediately. Three crew members and 13 passengers were killed while nine other occupants were seriously injured. The aircraft was destroyed by fire. ", "probable_cause": "The Board determines that the probable cause of this accident was a stall during a left turn too close to the ground to effect recovery."}