{"url": "https://www.baaa-acro.com/crash/crash-canadair-cl-601-3r-challenger-aspen-1-killed", "date": "Jan 5, 2014 at 1222 LT", "type": "Canadair CL-601 Challenger", "operator": "Vineland Corporation Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tucson - Aspen", "msn": "5153", "yom": 1994, "flight_number": null, "city": "Aspen-Pitkin County-Sardy Field", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 17250, "captain_hours_type": 14, "copilot_hours": 20355, "copilot_hours_type": 14, "aircraft_hours": 6750, "circumstances": "The airplane, with two flight crewmembers and a pilot-rated passenger on board, was on a cross-country flight. The departure and en route portions of the flight were uneventful. As the flight neared its destination, a high-altitude, terrain-limited airport, air traffic control (ATC) provided vectors to the localizer/distance measuring equipment (LOC/DME)-E approach to runway 15. About 1210, the local controller informed the flight crew that the wind was from 290º at 19 knots (kts) with gusts to 25 kts. About 1211, the flight crew reported that they were executing a missed approach and then requested vectors for a second approach. ATC vectored the airplane for a second LOC/DME-E approach to runway 15. About 1221, the local controller informed the flight crew that the wind was from 330° at 16 kts and the 1-minute average wind was from 320° at 14 kts gusting to 25 kts. The initial part of the airplane's second approach was as-expected for descent angle, flap setting, and spoilers. During the final minute of flight, the engines were advanced and retarded five times, and the airplane's airspeed varied between 135 kts and 150 kts. The final portion of the approach to the runway was not consistent with a stabilized approach. The airplane stayed nose down during its final descent and initial contact with the runway. The vertical acceleration and pitch parameters were consistent with the airplane pitch oscillating above the runway for a number of seconds before a hard runway contact, a gain in altitude, and a final impact into the runway at about 6 g. The weather at the time of the accident was near or in exceedance of the airplane's maximum tailwind and crosswind components for landing, as published in the airplane flight manual. Given the location of the airplane over the runway when the approach became unstabilized and terrain limitations of ASE, performance calculations were completed to determine if the airplane could successfully perform a go-around. Assuming the crew had control of the airplane, and that the engines were advanced to the appropriate climb setting, anti-ice was off, and tailwinds were less than a sustained 25 kts, the airplane had the capability to complete a go-around, clearing the local obstacles along that path.Both flight crewmembers had recently completed simulator training for a type rating in the CL600 airplane. The captain reported that he had a total of 12 to 14 hours of total flight time in the airplane type, including the time he trained in the simulator. The copilot would have had close to the same hours as the captain given that they attended flight training together. Neither flight crew member would have met the minimum flight time requirement of 25 hours to act as pilot-in-command under Part 135. The accident flight was conducted under Part 91, and therefore, the 25 hours requirement did not apply to this portion of their trip. Nevertheless, the additional flight time would have increased the crew's familiarity with the airplane and its limitation and likely improved their decision-making during the unstabilized approach. Further, the captain stated that he asked the passenger, an experienced CL-600-rated pilot. to accompany them on the trip to provide guidance during the approach to the destination airport. However, because the CL-600-rated pilot was in the jumpseat position and unable to reach the aircraft controls, he was unable to act as a qualified pilot-in-command.", "probable_cause": "The flight crew's failure to maintain airplane control during landing following an unstabilized approach. Contributing to the accident were the flight crew's decision to land with a tailwind above the airplane's operating limitations and their failure not to conduct a go-around when the approach became unstabilized."}