{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-teterboro-2-killed", "date": "May 15, 2017 at 1529 LT", "type": "Learjet 35", "operator": "Trans-Pacific Air Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Philadelphia - Teterboro", "msn": "35A-452", "yom": 1981, "flight_number": null, "city": "Teterboro", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6898, "captain_hours_type": 353, "copilot_hours": 1167, "copilot_hours_type": 407, "aircraft_hours": null, "circumstances": "On May 15, 2017, about 1529 eastern daylight time, a Learjet 35A, N452DA, departed controlled flight while on a circling approach to runway 1 at Teterboro Airport (TEB), Teterboro, New Jersey, and impacted a commercial building and parking lot. The pilot-in-command (PIC) and the second-in-command (SIC) died; no one on the ground was injured. The airplane was destroyed by impact forces and postcrash fire. The airplane was registered to A&C Big Sky Aviation, LLC, and was operated by Trans-Pacific Air Charter, LLC, under the provisions of Title 14 Code of Federal Regulations (CFR) Part 91 as a positioning flight. Visual meteorological conditions prevailed, and an instrument flight rules flight plan was filed. The flight departed from Philadelphia International Airport (PHL), Philadelphia, Pennsylvania, about 1504 and was destined for TEB. The accident occurred on the flight crew’s third and final scheduled flight of the day; the crew had previously flown from TEB to Laurence G. Hanscom Field (BED), Bedford, Massachusetts, and then from BED to PHL. The PIC checked the weather before departing TEB about 0732; however, he did not check the weather again before the flight from PHL to TEB despite a company policy requiring that weather information be obtained within 3 hours of departure. Further, the crew filed a flight plan for the accident flight that included altitude (27,000 ft) and time en route (28 minutes) entries that were incompatible with each other, which suggests that the crew devoted little attention to preflight planning. The crew also had limited time in flight to plan and brief the approach, as required by company policy, and did not conduct an approach briefing before attempting to land at TEB. Cockpit voice recorder data indicated that the SIC was the pilot flying (PF) from PHL to TEB, despite a company policy prohibiting the SIC from acting as PF based on his level of experience. Although the accident flight waslikely not the first time that the SIC acted as PF (based on comments made during the flight), the PIC regularly coached the SIC (primarily on checklist initiation and airplane control) from before takeoff to the final seconds of the flight. The extensive coaching likely distracted the PIC from his duties as PIC and pilot monitoring, such as executing checklists and entering approach waypoints into the flight management system. Collectively, procedural deviations and errors resulted in the flight crew’s lack of situational awareness throughout the flight and approach to TEB. Because neither pilot realized that the airplane’s navigation equipment had not been properly set for the instrument approach clearance that the flight crew received, the crew improperly executed the vertical profile of the approach, crossing an intermediate fix and the final approach fix hundreds of feet above the altitudes specified by the approach procedure. The controller had vectored the flight for the instrument landing system runway 6 approach, circle to runway 1. When the crew initiated the circle-to-land maneuver, the airplane was 2.8 nautical miles (nm) beyond the final approach fix (about 1 mile from the runway 6 threshold) and could not be maneuvered to line up with the landing runway, which should have prompted the crew to execute a go-around because the flight did not meet the company’s stabilized approach criteria. However, neither pilot called for a go-around, and the PIC (who had assumed control of the airplane at this point in the flight) continued the approach by initiating a turn to align with the landing runway. Radar data indicated that the airplane’s airspeed was below the approach speed required by company standard operating procedures (SOPs). During the turn, the airplane stalled and crashed about 1/2 nm south of the runway 1 threshold.", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was the pilot-in-command’s (PIC) attempt to salvage an unstabilized visual approach, which resulted in an aerodynamic stall at low altitude. Contributing to the accident was the PIC’s decision to allow an unapproved second-in-command to act as pilot flying, the PIC’s inadequate and incomplete preflight planning, and the flight crew’s lack of an approach briefing. Also contributing to the accident were Trans-Pacific Jets’ lack of safety programs that would have enabled the company to identify and correct patterns of poor performance and procedural noncompliance and the Federal Aviation Administration’s ineffective Safety assurance System procedures, which failed to identify these company oversight deficiencies."}