{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-35-dk-near-sora-8-killed", "date": "Mar 30, 1963 at 1837 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Aerolinee-Itavia-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Pescara – Rome", "msn": "16477/33225", "yom": 1945, "flight_number": "IH703", "city": "Sora", "zone": "Lazio", "country": "Italy", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 10731, "captain_hours_type": 2296, "copilot_hours": 832, "copilot_hours_type": 832, "aircraft_hours": 13941, "circumstances": "Flight IH703 was a scheduled domestic flight from Pescara Airport to Rome-Ciampino. The aircraft which had departed Rome at 1526 hours GMT, took off from Pescara with the same crew at 1736 hours on an IFR plan and climbed to flight level 100, its cruising altitude. At 1739 hours the pilot requested radar guidance from the Pescara defence radar \"FIONDA\", which is not normally available for flight information service to civil aircraft. The first part of the flight was intentionally carried out south of the direct route to avoid heavy cloud formations. At 1750 hours the Pescara defence radar picked up the flight in the Ortona area and at approximately 1803 hours it passed to the flight \"QDM Ciampino 265°, distance 80 NM\". At 1805 hours the pilot reported this position to the Rome ACC/FIC. After having directed the flight around some cumulonimbus the Pescara defence radar lost the aircraft at 1812 hours. At 1816 hours the pilot enquired whether the aircraft had been picked up by the Rome surveillance radar. Two minutes later he reported to Rome ACC/FIC that he was crossing the eastern edge of airway A 14 and requested a clearance to Rome NDB \"LJ\". At 1822 hours he reported having Rome in sight and requested authorization to descend from flight level 100. - Two minutes later, upon confirmation that Rome was in sight, the flight was cleared to proceed to Rome NDB and to descend to 6 000 ft. At 1828 hours the pilot reconfirmed that he had Rome in sight and requested clearance to descend further. The flight was then given instruction to contact Ciampino tower, but was unable to establish communication either on the tower frequency or on 120.1 or 124.1  MC/S and therefore came back on the Rome ACC/FIC frequency. At 1830 hours the pilot reported that he was unable to tune on Rome NDB and had to keep out of the clouds since his radio compass was not working properly. At that time the Rome 2 defence radar which had first picked up the flight around 1802 hours, lost its trace in the Arpino area. Around 1832 hours, on a request from Rome ACC/FIC, the pilot reported that he was in the vicinity of Mount Cavo, of which he could see the antennae. One minute later the flight lost visual contact with the ground and, since the pilot believed that his radio compass was out of order, he requested clearance to proceed on Ostia VOR. At 1835 hours he was cleared to Ostia VOR at 6 000 ft, but reported that his VOR was not giving reliable information and that he would fly on a heading of 270° and break over the sea. This was the last message of the aircraft. The aircraft was subsequently found on a very steep slope on the southeast side of Mount Serra Alta at an elevation of 1,630 m. All eight occupants were killed. \r\nCrew:\r\nErnesto Roggero , pilot,\r\nErminio Carlo Bonfanti, copilot,\r\nLuigi Politta, steward.\r\nPassengers:\r\nLeonbruno Angeloni, \r\nMarco Di Michele, \r\nMarvin Walter Gelber, \r\nNicolò Marcello,\r\nGuido Mancini.", "probable_cause": "It was determined that the probable cause of the accident was: \r\n- Significant errors by the pilot in estimating his own position with consequent presumed identification of lights in the Rome area and of the Mount Cavo antennae, which led him to: \r\n- Misjudge the effectiveness of the aircraft radio and navigational equipment,\r\n- Request clearance to descend to 6 000 ft and subsequently below the specified level in order to maintain at all costs visual contact with the ground, with the result that he crashed into the mountain because of inability to achieve the desired visual contact. \r\n- Particularly adverse weather conditions over the last segment of the route flown at night,\r\n- Failure to report to the various ATC units the departures from the flight route indicated in the PLN submitted prior to departure and in the subsequent PLN transmitted by the pilot after departure,\r\n- Added to the above, the unfortunate concurrence of a series of facts and circumstances that all played against the pilot."}