{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-286-orumiyeh-78-killed", "date": "Jan 9, 2011 at 1945 LT", "type": "Boeing 727-200", "operator": "IranAir", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tehran - Orumiyeh", "msn": "20945/1048", "yom": 1974, "flight_number": "IR277", "city": "Orūmīyeh", "zone": "West Azerbaijan", "country": "Iran", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 8, "pax_on_board": 96, "pax_fatalities": 70, "other_fatalities": 0, "total_fatalities": 78, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9019, "circumstances": "The aircraft departed Tehran-Mehrabad Airport at 1815LT with a delay of more than two hours due to poor weather conditions at destination. While descending to Orūmīyeh Airport by night, the crew encountered poor weather conditions with snow falls, visibility 800 metres and three ceilings at 1,500, 2,000 and 6,000 feet. After the crew was unable to intercept the ILS, the decision to initiate a go-around procedure was taken. Approaching the stall speed, the stick shaker activated and the aircraft probably encountered icing conditions. In a left bank angle estimated between 26 and 40°, the engine n°3 and 1 failed. At an altitude of 600 feet and at a speed of 96 knots, the flaps were retracted, causing the aircraft to stall and to impact the ground. The aircraft broke in three but there was no fire. 70 passengers and 8 crew members were killed while 27 other occupants were injured, some seriously. ", "probable_cause": "Bad weather conditions for the aircraft and inappropriate actions by cockpit crew to confront the situation is the main cause of the accident. The following contributing factors were identified:\r\n- The old technology of aircraft systems,\r\n- Absence of a suitable simulator for adverse weather conditions,\r\n- Failure to correctly follow the operating manual by the flight crew,\r\n- Inadequate cockpit resources management (CRM)."}