{"url": "https://www.baaa-acro.com/crash/crash-piaggio-p166al-1-albatross-near-marulan-1-killed", "date": "Feb 22, 1977 at 0755 LT", "type": "Piaggio P.166 Albatross", "operator": "G. R. Board", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Bankstown - Warracknabeal", "msn": "403", "yom": 1961, "flight_number": null, "city": "Marulan", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 12000, "captain_hours_type": 1200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot attended the Bankstown Briefing Office at about 0600 hours. He was briefed concerning the current weather conditions at Bankstown Airport, which were Instrument Meteorological Conditions (IMC) but were Improving to VMC; and the relevant meteorological forecasts which indicated, for his proposed route, that he might experience some difficulty in maintaining flight In Visual Meteorological Conditions (VMC). The pilot's licence was not endorsed to permit him to operate in other than VMC. He then submitted a flight plan for a flight from Bankstown Airport to Warracknabeal and return, proceeding over Marulan the estimated time interval thereto being 33 minutes, the flight to be conducted in accordance with the Visual Flight Rules (VFR) at altitudes not exceeding 5000 feet. The aircraft departed Bankstown Airport, in VMC, and established two way communication with Sydney Flight Service Unit (FSU). At 0748 hours the pilot advised the Sydney FSU that he was \"returning to Camden, estimating Camden at one five\". In response to a query the pilot advised \"weather okay\". No further communications were received from the aircraft. At about 0755 hours the aircraft was heard and observed flying in an easterly direction some 20 kilometres north-northeast of Marulan. There was low cloud and some light rain in the area. The aircraft was flying below the cloud base and was at a height of 500 feet to 200 feet above undulating terrain, proceeding towards rugged terrain which was gradually rising. Subsequently the aircraft proceeded over a ridge line out of the sight of witnesses. Shortly thereafter the engine noise ceased abruptly. The police were alerted and search and rescue action was initiated. The wreckage of the aircraft was located some eight hours later. The aircraft had crashed on a heavily timbered 12 degree upslope about 100 feet below a ridge line. At Impact the aircraft was in a nose down attitude and was banked some 45 degrees to the right. The right hand propeller was feathered and the engine had not been operating at impact. The left hand engine had been under power. The landing gear and flaps had been fully retracted. The available evidence Indicates that the gross weight of the aircraft was at or about the maximum permissible all up weight. Examination of the right hand engine revealed massive internal failure which had commenced with the failure of the right hand dowel In the Number 2 main crankcase bearing. It is probable that the dowel failed because of abnormal loads resulting from loss of bearing nip associated with crankcase fretting at the lower through bolt of the Number 2 bearing saddle. It is estimated that the engine had operated some 170 hours since issue of the last maintenance release on 26 October 1976.", "probable_cause": "The probable cause of the accident was that, in the conditions pertaining, the single engine performance of the aircraft was insufficient to ensure maintenance of adequate terrain clearance whilst flying over undulating terrain at a low eight. Internal structural failure of right hand engine, Lycomtng GSO480-BIC6 Serial number L3050-33. Left hand engine carburettor air temperature control valve detached from actuating shaft."}