{"url": "https://www.baaa-acro.com/crash/crash-avro-685-york-i-caravelas-3-killed", "date": "Jan 5, 1949", "type": "Avro 685 York", "operator": "BSAA", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "London – Lisbon – Bathurst – Natal – Rio de Janeiro – Santiago de Chile", "msn": "1301", "yom": 1946, "flight_number": null, "city": "Caravelas", "zone": "Bahia", "country": "Brazil", "region": "South America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During the takeoff roll at Rio de Janeiro, the tire on the right main gear burst. The crew continued the takeoff procedure and after departure, the copilot and the flight engineer proceeded to a visual control of the right main gear and did not notice anything unusual. After three hours and a half into the flight, the engine number three caught fire. The captain started an emergency descent and elected to land in Caravelas. On touchdown in a field, the aircraft went out of control and came to rest in flames. Three passengers were killed while 12 other occupants were injured. The aircraft was destroyed. ", "probable_cause": "Fire on board the aircraft while in flight. The secondary cause as the bursting of a tire of starboard wheel resulting in damage to the undercarriage and to the oil system installation, and which occurred when taking off. The tread of the burst tire tore off the hydraulic jack bracing struts, which were forced into the nacelle of the engine, causing damage to the oil system installation so that the oil emptied out, and resulting in possible further damage to the propeller feathering system. Owing to the lack of oil, caused by seepage, the connecting rods were torn out, contributing to an excessive increase in speed. In this way the uncontrolled propeller and the resulting overspeeding caused the engine to break apart, allowing the outbreak of fire, whose intensity was aggravated by the large quantity of oil round the nacelle of the n° 3 engine."}