{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-90-30-jakarta", "date": "Mar 9, 2009 at 1535 LT", "type": "McDonnell Douglas MD-90", "operator": "Lion%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ujung Pandang - Jakarta", "msn": "53573/2182", "yom": 1997, "flight_number": "LNI793", "city": "Jakarta-Soekarno-Hatta", "zone": "Banten", "country": "Indonesia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 166, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 25000, "captain_hours_type": 5000, "copilot_hours": 5000, "copilot_hours_type": 800, "aircraft_hours": 18695, "circumstances": "Lion Mentari Airline (Lion Air) as flight number LNI-793, departed from Sultan Hasanuddin Airport (WAAA), Makassar, Ujung Pandang, Sulawesi at 0636 UTC for Soekarno-Hatta International Airport (WIII), Jakarta. The estimated flight hour from Makassar to Jakarta was 2 hours. The crew consisted of two pilots and four flight attendants. There were 166 adult passengers. The copilot was the pilot flying for the sector, and the pilot in command (PIC) was the support/monitoring pilot. During the approach to runway 25L at Jakarta, the weather at the airport was reported as wind direction 200 degrees, wind speed 20 knots, visibility 1,000 meters, and rain. The PIC reported that he decided to take over control from the copilot. The PIC later reported that he had the runway in sight passing through 1,000 feet on descent, and he disengaged the autopilot at 400 feet. At about 50 feet the aircraft drifted to the right and the PIC initiated corrective action to regain the centreline. The aircraft touched down to the left of the runway 25L centerline and then commenced to drift to the right. The PIC reported that he immediately commenced corrective action by using thrust reverser, but the aircraft increasingly crabbed along the runway with the tail to the right of runway heading. The investigation subsequently found that the right thrust reverser was deployed, but left thrust reverser was not deployed. The aircraft stopped at 0835 on the right side of the runway 25L, 1,095 meters from the departure end of the runway on a heading of 152 degrees; 90 degrees to the runway 25L track. The main landing gear wheels collapsed, and still attached to the aircraft, were on the shoulder of the runway and the nose wheel was on the runway. The passengers and crew disembarked via the front right escape slide and right emergency exit windows. None of the occupants were injured \n", "probable_cause": "The aircraft was not stabilized approach at 100 feet above the runway."}