{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c-45g-expeditor-detroit-1-killed-0", "date": "Mar 11, 1999 at 0051 LT", "type": "Beechcraft C-45 Expeditor", "operator": "BAJ Aircraft Management Group", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Detroit - Detroit", "msn": "AF-447", "yom": 1958, "flight_number": null, "city": "Detroit-Metropolitan-Wayne County", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1305, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7073, "circumstances": "The aircraft declared an emergency following departure from runway 03R at Detroit Metropolitan Wayne County Airport, Romulus, Michigan. The aircraft was resting on a magnetic heading of 055 degrees located approximately 3,400 feet from and 1,900 feet to the left of the departure end and centerline of runway 03R at DTW. Inspection of the forward section of the fuselage door and surrounding fuselage, a circular impression with no exposure of the underlying metal was noted approximately 2 feet 6-1/2 inches from the door hinge line. The door was opened to a point nearly flush with the aircraft's fuselage. The door handle was found to match the circular impression in position and shape. There was no tearing or fracturing of the forward fuselage door pin tips or its door pin holes. Inspection of the door's latching mechanism revealed a brown colored nail connecting the handle and vertical latches. Both engine supercharger turbine wheels displayed scoring and deformation of the impeller blades in the plane of rotation. Aileron, elevator and rudder flight control continuity was established. The elevator trim was in the neutral position. The trailing edge flaps were in the retracted positions. Both engine oil screens showed no evidence of metal contamination. ", "probable_cause": "The aircraft control not maintained and the inadvertent stall by the pilot while maneuvering to the landing area. The open door was a contributing factor. "}