{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31p-350-mojave-redlands-2-killed", "date": "Oct 26, 1988 at 1900 LT", "type": "Piper PA-31 Cheyenne", "operator": "Charlie Gill Enterprises", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Imperial - Redlands", "msn": "31-8414021", "yom": 1984, "flight_number": null, "city": "Redlands", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 550, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 660, "circumstances": "The airport is next to Norton AFB. The weather on the dark moonless night was 1 mile visibility in fog and haze. The pilot completed an ILS to a low approach at Norton and received a special VFR clearance to proceed to Redlands. The circling MDA for Norton is 1,700 feet msl. Norton AFB elevation is 1,100 feet msl, and the Redlands Airport elevation is 1,572 feet msl. The circling MDA for Norton is 138 feet above the Redlands Airport elevation. The recorded radar data showed that the flight descended to 1,800 feet on the ILS, then the mode C varied between 1,700 and 1,600 feet. The last radar return was about 1 mile from the Redlands Airport at 1,600 feet msl. A witness on the airport saw the aircraft fly over runway 08 in a south to north direction, 'low and fast.' The witness heard the crash sounds immediately thereafter. Evidence at the accident site revealed the aircraft left wing contacted the ground in a 42° left bank in a slight nose down attitude. Few ground reference lights exist in the area and the pilot had minimum total night time. Both occupants were killed. ", "probable_cause": "The pilot's inadvertent selection of an inappropriate altitude for the attempted night special VFR circle to land maneuver. Contributing to the accident was the dark night, restricted visibilities and lack of ground reference lights. Also contributing to the accident was the pilot's limited total night experience. \r\nOccurrence #1: in flight collision with terrain/water\r\nPhase of operation: circling (ifr)\r\nFindings\r\n1. (f) weather condition - fog\r\n2. (c) proper altitude - not maintained - pilot in command\r\n3. Visual/aural perception - pilot in command\r\n4. (f) light condition - dark night\r\n5. (f) lack of total experience in type operation - pilot in command\r\n6. (f) in-flight planning/decision - poor - pilot in command\r\n7. (f) planned approach - inadequate - pilot in command"}