{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-232-istanbul", "date": "Apr 25, 2015 at 1041 LT", "type": "Airbus A320", "operator": "Turkish-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Milan – Istanbul", "msn": "2941", "yom": 2006, "flight_number": "TK1878", "city": "Istanbul-Atatürk", "zone": "Marmara Region (Marmara Bölgesi)", "country": "Turkey", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 91, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Milan-Malpensa Airport at 0700LT and proceeded to the east. Following an uneventful flight, the crew initiated the approach to Istanbul-Atatürk Airport Runway 05. At a height of 100 feet above the runway, the aircraft banked to the right, stalled and struck the runway surface. On impact, the right main gear was severely damaged and punctured the right wing. In such condition, the captain decided to abandon the landing manoeuvre and initiated a go-around procedure. The aircraft climbed to an assigned altitude of 3,800 feet then the crew declared an emergency and confirmed that the right engine was out of service. Few minutes later, the right engine caught fire. The crew followed a 20-minutes holding circuit over the bay of Marmara before a second approach to runway 35L. After touchdown, the right main gear collapsed, the aircraft slid for few dozen metres then veered off runway to the right, completed a 180 turn before coming to rest in a grassy area. All 97 occupants evacuated safely while the aircraft was damaged beyond repair. According to the operator, the loss of control during the last segment was caused by turbulences from a preceding Boeing 787 that landed on the same runway 05. ", "probable_cause": null}