{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1329-25-jetstar-ii-austin", "date": "Nov 27, 1998 at 1405 LT", "type": "Lockheed L-1329 JetStar", "operator": "Banair", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Houston - Austin", "msn": "5210", "yom": null, "flight_number": null, "city": "Austin-Robert Mueller", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8350, "captain_hours_type": 750, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5938, "circumstances": "During the landing roll, the nose gear settled onto the runway, and the aircraft veered hard to the right. Application of the left brake had no effect. The airplane skidded, exited the runway, struck a runway marker, and collapsed the nose landing gear. The steering actuator had failed, the hydraulic fluid was lost from the steering actuator, and the fuselage received structural damage. The steering actuator assembly, p/n 1501-4, had accumulated 5,938.0 hours since new and had not been repaired or overhauled. Examination of the nose gear steering actuator cylinder by the metallurgist revealed that the cylinder fracture was the result of fatigue cracking initiated by an abrupt machining transition from the 45 degree thread ring chamfer to the straight wall of the cylinder. The engineering drawings appear to depict the radius at the fatigue origin as a continuation of the 0.03 inch to 0.06 inch radius adjacent to the fracture. However, the drawing is not clear on the specific intent of the transition between the nearby radius and the internal threads for the nut. ", "probable_cause": "The steering actuator fatigue failure resulting from inadequate procedure documentation for the manufacturing process. "}