{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-049-46-26-constellation-wilmington-5-killed", "date": "Nov 18, 1947 at 1300 LT", "type": "Lockheed L-049 Constellation", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Wilmington - Wilmington", "msn": "2028", "yom": 1945, "flight_number": null, "city": "Wilmington-New Castle County", "zone": "Delaware", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 4431, "captain_hours_type": 736, "copilot_hours": 7680, "copilot_hours_type": 379, "aircraft_hours": 3256, "circumstances": "At 1210 the flight called the Wilmington-New Castle Tower and asked to be cleared for an instrument approach to runway one. The flight advised that they would fly law over the field on their first approach, and that they would then circle and land The approach was made, and the aircraft flew low over the field to the immediate right of runway one. After passing the north end of the runway. a climbing left turn was made to an altitude of 400 to 500 feet. The aircraft circled at that altitude until approximately one mile west of the south end of runway one, then it started a gliding left turn, toward the field. One-half mile south of the airport the turn was completed, and the aircraft flew a straight course on final approach toward runway one for landing. This last turn onto final approach was completed at an altitude of 200 to 300 feet. The landing gear was down, but the flaps were not extended. The descent on final approach continued normally until the aircraft had reached an altitude of approximately 50 feet above the ground, at which time it was 500 to 1,000 feet from the approach end of runway one. Then, the aircraft was observed to assume a nose-high attitude and to descend more rapidly. First contact with the ground was made 130 feet Prom the approach end of runway one, and 22 feet in front of a 5-foot embankment. The top of this embankment was level with the runway. Since the embankment was uniformly covered with sod, it was not discernible from the air. The extreme loads which were imposed upon the aircraft structure as it rolled into and over the rising embankment immediately after it had settled to the ground caused considerable damage to the landing gear, fuselage, and wings. Forced back into the air by the rise of the embankment, the airplane landed for the second time on the runway, skidding forward 1,270 feet. The right wing was torn from the fuselage as the aircraft turned over to an inverted position. Fuel spilled from ruptured gasoline tanks ignited, and the wreckage burst into flames.", "probable_cause": "The Board determines that the probable cause of this accident was the inadvertent landing of the aircraft short of the runway."}