{"url": "https://www.baaa-acro.com/crash/crash-cessna-414a-chancellor-bloomington-7-killed", "date": "Apr 7, 2015 at 0006 LT", "type": "Cessna 414 Chancellor", "operator": "Make it Happen Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Indianapolis - Bloomington", "msn": "414A-0495", "yom": 1980, "flight_number": null, "city": "Bloomington", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 12100, "captain_hours_type": 1150, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8390, "circumstances": "The twin-engine airplane, flown by an airline transport pilot, was approaching the destination airport after a cross-country flight in night instrument meteorological conditions. The destination airport weather conditions about 1 minute before the accident included an overcast ceiling at 200 ft and 1/2-mile visibility with light rain and fog. According to air traffic control (ATC) data, the flight received radar vectors to the final approach course for an instrument landing system (ILS) approach to runway 20. As shown by a post accident simulation study based on radar data and data recovered from the airplane's electronic horizontal situation indicator (EHSI), the airplane's flight path did not properly intercept and track either the localizer or the glideslope during the instrument approach. The airplane crossed the final approach fix about 360 ft below the glideslope and then maintained a descent profile below the glideslope until it leveled briefly near the minimum descent altitude, likely for a localizer-only instrument approach. However, the lateral flight path from the final approach fix inbound was one or more dots to the right of the localizer centerline until the airplane was about 1 nautical mile from the runway 20 threshold when it turned 90° left to an east course. The turn was initiated before the airplane had reached the missed approach point; additionally, the left turn was not in accordance with the published missed approach instructions, which specified a climb on runway heading before making a right turn to a 270° magnetic heading. The airplane made a series of pitch excursions as it flew away from the localizer. The simulation study determined that dual engine power was required to match the recorded flight trajectory and ground speeds, which indicated that both engines were operating throughout the approach. The simulation results also indicated that, based on calculated angle of attack and lift coefficient data, the airplane likely encountered an aerodynamic stall during its course deviation to the east. The airplane impacted the ground about 2.2 miles east-northeast of the runway 20 threshold and about 1.75 miles east of the localizer centerline. According to FAA documentation, at the time of the accident, all components of the airport's ILS were functional, with no recorded errors, and the localizer was radiating a front-course to the correct runway. Additionally, a post accident flight check found no anomalies with the instrument approach.An onsite examination established that the airplane impacted the ground upright and in a nose-low attitude, and the lack of an appreciable debris path was consistent with an aerodynamic stall/spin. Wreckage examinations did not reveal any anomalies with the airplane's flight control systems, engines, or propellers. The glideslope antenna was found disconnected from its associated cable circuit. Laboratory examination and testing determined that the glideslope antenna cable was likely inadequately connected/secured during the flight, which resulted in an unusable glideslope signal to the cockpit avionics. There was no history of recent maintenance on the glideslope antenna, and the reason for the inadequate connection could not be determined. Data downloaded from the airplane's EHSI established that the device was in the ILS mode during the instrument approach phase and that it had achieved a valid localizer state on both navigation channels; however, the device never achieved a valid glideslope state on either channel during the flight. Further, a replay of the recorded EHSI data confirmed that, during the approach, the device displayed a large \"X\" through the glideslope scale and did not display a deviation pointer, both of which were indications of an invalid glideslope state. There was no evidence of cumulative sleep loss, acute sleep loss, or medical conditions that indicated poor sleep quality for the pilot. However, the accident occurred more than 2 hours after the pilot routinely went to sleep, which suggests that the pilot's circadian system would not have been promoting alertness during the flight. Further, at the time of the accident, the pilot likely had been awake for 18 hours. Thus, the time at which the accident occurred and the extended hours of continuous wakefulness likely led to the development of fatigue. The presence of low cloud ceilings and the lack of glideslope guidance would have been stresses to the pilot during a critical phase of flight. This would have increased the pilot's workload and situational stress as he flew the localizer approach, a procedure that he likely did not anticipate or plan to conduct. In addition, weight and balance calculations indicated that the airplane's center of gravity (CG) was aft of the allowable limit, and the series of pitch excursions that began shortly after the airplane turned left and flew away from the localizer suggests that the pilot had difficulty controlling airplane pitch. This difficulty was likely due to the adverse handling characteristics associated with the aft CG. These adverse handling characteristics would have further increased the pilot's workload and provided another distraction from maintaining control of the airplane. Therefore, it is likely that the higher workload caused by the pilot's attempt to fly an unanticipated localizer approach at night in low ceilings and his difficulty maintaining pitch control of the airplane with an aft CG contributed to his degraded task performance in the minutes preceding the accident.", "probable_cause": "The pilot's failure to maintain control of the airplane during the instrument approach in night instrument meteorological conditions, which resulted in the airplane exceeding its critical angle of attack and an aerodynamic stall/spin. Contributing to the accident were pilot fatigue, the pilot's increased workload during the instrument approach resulting from the lack of glide slope guidance due to an inadequately connected/secured glide slope antenna cable, and the airplane being loaded aft of its balance limit.\n"}