{"url": "https://www.baaa-acro.com/crash/crash-learjet-25b-sanford-5-killed", "date": "Sep 8, 1977 at 2020 LT", "type": "Learjet 25", "operator": "Champion%20Home%20Builders", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sanford - Flint", "msn": "25-178", "yom": 1974, "flight_number": null, "city": "Sanford", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 9364, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 700, "circumstances": "About 2020 EST, on September 8, 1977, Champion Home Builders Company, Gates Learjet 25B, N999HG, crashed shortly after takeoff at Sanford, North Carolina. All five persons aboard were killed, and the aircraft was destroyed. The aircraft departed Sanford Airport about 2018 EST, for a flight to Flint, Michigan. In accordance with departure instructions from Fayetteville departure control, the flight was about 3 mi west of the airport, climbing through 3,000 ft, on a heading of 270°, when it disappeared from radar. There were no distress calls, but several witnesses west of the airport saw the aircraft on fire below the 600 feet suddenly dove to the ground. People in the immediate vicinity reported that the overcast ceiling. The flight completed a right turn to a northeasterly heading and aircraft was on fire before it crashed. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was one or more low-order explosions in the aircraft's aft fuselage determine conclusively the fuel and ignition sources of the initial explosion; which resulted in a fire and loss of control capability. The Safety Board could not however, gases from the aircraft's batteries or fuel leakage from fuel system components, or both, could have been present in the area of the initial explosion. "}