{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-70-dl-rio-de-janeiro-6-killed", "date": "Sep 12, 1954 at 2007 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Cruzeiro-do-Sul-11", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Rio de Janeiro – São Paulo", "msn": "19278", "yom": 1943, "flight_number": null, "city": "Rio de Janeiro-Santos Dumont", "zone": "Rio de Janeiro", "country": "Brazil", "region": "South America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 26, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft left Rio de Janeiro-Santos Dumont Airport at the end of the afternoon, bound for São Paulo-Congonhas Airport. While descending to Congonhas, the crew encountered below minima weather conditions and decided to return to Santos Dumont. While approaching Rio, the left engine suffered severe vibrations and was shut down and its propeller was feathered. As the aircraft was too high on approach, the crew elected to make a go around when the airplane stalled and crashed into the Guanabara Bay. Six passengers were killed while 24 other occupants were rescued. The aircraft was lost. ", "probable_cause": "It was determined that the aircraft stalled and crashed during an attempt to go around when the power on the remaining engine was inadvertently reduced by the flying crew. It was reported that the crew was devolved by the loss of power on the left engine during the approach and that he was forced to shot it down. When the aircraft stalled, the distance from the water surface was insufficient to expect a recovery. A lack of reference to instruments on part of the flying crew and a lack of visibility were considered as contributory factors. "}