{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-learstar-i-krumpendorf-3-killed", "date": "Aug 24, 1957 at 1958 LT", "type": "Lockheed 18 LodeStar", "operator": "Helmut Horten", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Stuttgart – Klagenfurt", "msn": "2606", "yom": 1943, "flight_number": null, "city": "Krumpendorf", "zone": "Carinthia", "country": "Austria", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was on his way to Klagenfurt with a load of flowers for the celebration of the Velden fest. On approach to Klagenfurt-Annabichl Airport, the twin engine aircraft lost its left wing, dove into the ground and crashed in a wooded area located in Krumpendorf, about 10 km west of runway 29 threshold. All three occupants were killed.", "probable_cause": "The accident was due to the breaking off of the left wing between the engine and the fuselage as a result of overstrain on the assembly, and fuel ignition followed. A stress failure was assumed after examination of the left wing fracture. This assumption was supported by the laboratory examination report of the Vienna Technische Hochschule. The summary of the report given by the Technical Testing and Research Laboratory of the Vienna Technische Hochschule indicates the fol- lowing: \"The Aviation Authority submitted two pieces of the wing spar originating from the crashed aircraft D-COCA. The pieces were U-shaped pressed profiles of light metal. The fracture surfaces of the profiles and the neighbouring areas showed large, permanent distortions which pre - ceded the fracture. The fracture, a bending failure, resulted from a single static and jolting overstress. Examinations showed that the fracture surfaces do not reveal any traces of a vibration failure.. .\" Since the fuselage and the right wing had been completely demolished, only the control linkage of the left wing could be tested. A limited operation of the aileron was still possible despite the partial distortion of the wing through impact. The left half of the elevator was broken at the attachment flange of the torsion rod. About 60% of the skin on the left half of the stabilizer was torn off on one side, probably due to interior pressure (rivet extraction) and showed traces of burns and soot on the side as well as on the outside."}