{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-414-08-hudson-iv-balmoral-station-2-killed", "date": "Oct 30, 1947", "type": "Lockheed L-414 Hudson", "operator": "John-Fairfax-Sons", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": null, "msn": "414-6046", "yom": 1941, "flight_number": null, "city": "Balmoral", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Crashed and burned on Balmoral Station south of Muswellbrook, while on a trial newspaper dropping flight. The aircraft was preparing to drop newspapers in an open area when it appeared to dive almost vertically into the ground. Both crew members were killed. \r\nCrew:\r\nGeoff Hoskins, pilot,\r\nEdward Conner, copilot.\r\nSource: http://www.adastron.com/lockheed/hudson/vh-smj.htm", "probable_cause": "The investigation attributed the accident to loss of control arising out of incorrect loading. This aircraft was destroyed before its Certificate of Registration was issued and thus the registration VH-SMJ was technically not taken up.\r\nVH-SMJ was not registered by this Department in that no Certificate of Registration had been issued, although an application, dated 19th May 1947, had been lodged at Mascot. It appears that this application was held at Mascot for some months and was finally forwarded to this Head Office with the Interim Certificate of Airworthiness. There is no indication as to when these documents were received at Head Office, but it seems likely that it was prior to the accident as the forwarding date on the Interim CofA is 24th October 1947. The fact that VH-SMJ flew without a CofR constitutes a breach of ANR No 108, but it is considered that no action should be taken as the operator, in making application, complied with the spirit of the Regulation. Also, the fact that the letters VH-SMJ had been allotted probably created the impression that the aircraft was actually registered."}