{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-60-duke-cheyenne-1-killed", "date": "Apr 21, 1995 at 1016 LT", "type": "Beechcraft 60 Duke", "operator": "Daniel J. Hommel", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cheyenne – Colorado Springs", "msn": "P-4", "yom": 1968, "flight_number": null, "city": "Cheyenne", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 683, "captain_hours_type": 143, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3462, "circumstances": "Shortly after takeoff, the pilot reported he had 'a problem...an overboost situation,' and wanted to return for landing. Instrument meteorological conditions prevailed, so the pilot was cleared for the ILS runway 26 approach. A witness saw the airplane emerge from the low overcast in a wings level descent, then pitch over to a near vertical attitude and impact a shopping center sign. The left turbocharger wastegate was found in the open (low boost) position, and the right turbocharger wastegate was found in the closed (high boost) position. The right turbocharger butterfly valve was severely eroded, the pin was missing, and the valve was free to rotate on the shaft. A hole was burnt through the right engine number 1 cylinder exhaust valve. Both propellers were in the low pitch-high rpm range. Both engines and turbochargers were original equipment and had not been overhauled in 21 years. A toxicology test showed 0.564 mcg/ml of sertraline (antidepressant) in the pilot's blood. Sertraline was not approved for use while flying an aircraft.", "probable_cause": "The pilot's failure to maintain aircraft control. Factors were the instrument weather conditions and the excessive workload imposed on the solo pilot attempting to deal with an emergency situation while flying in instrument meteorological conditions."}