{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-990-30a-5-moffett-afb-11-killed", "date": "Apr 12, 1973 at 1450 LT", "type": "Convair CV-990", "operator": "NASA", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Moffett - Moffett", "msn": "30-10-1", "yom": 1961, "flight_number": null, "city": "Moffett AFB", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was engaged in a local test flight at Moffett Airbase, carrying three crew members and eight NASA scientists in charge to test a survey equipment over the Monterey Bay. Following an uneventful mission, the crew started the approach and was cleared to land on runway 32R while seven miles out. In the region was also operated a US Navy Lockheed P-3C-125-LO Orion registered 157332 and that was completing a local training flight with a crew of six on board. After been cleared, the Orion's crew informed ATC he was joining the runway 32L approach path when the controller cleared the crew of the Convair to land at runway 32L. Shortly later, at an altitude of about 300 feet, the nose gear of the Convair struck the top of the Orion's tail. Both airplanes went out of control and crashed in flames on the Sunnyvale golf course located about 0,3 mile short of runway threshold. A crew member from the Orion was seriously injured while all 16 other occupants on both aircraft were killed. ", "probable_cause": "It was determined that the collision was the consequence of several errors on part of the approach controller. He firstly cleared the Convair's crew to land on runway 32R and the Orion's crew to land on runway 32L. But during the approach, after the Orion's crew confirmed he was joining the runway 32L approach path, the controller cleared the crew of the Convair to land on the same runway 32L. For reasons undetermined, the Convair's crew did not ask any question about this runway change. Also, none of the crew was able to sea and avoid each other. "}