{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-cape-girardeau", "date": "Feb 2, 2007 at 0930 LT", "type": "Beechcraft 200 Super King Air", "operator": "Hudson Timber Services", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rogers - Staunton", "msn": "BB-1638", "yom": 1998, "flight_number": null, "city": "Cape Girardeau", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4048, "captain_hours_type": 110, "copilot_hours": 2806, "copilot_hours_type": 28, "aircraft_hours": 1834, "circumstances": "The airplane was operated by a company pilot. A noncompany pilot, who had not attended or completed a training course or received a checkout for Raytheon Aircraft Company Beech King Air 200 airplanes, was asked by the pilot to accompany him on the flight so that the noncompany pilot could accumulate flight time. The flight only required one pilot. While the airplane was in cruise flight (27,000 feet mean sea level), the cockpit voice recorder (CVR) recorded the sound of the windshield fracturing. The CVR transcript indicated that the company pilot was not in the cockpit when the windshield fractured because he was emptying trash in the cabin. This action showed poor judgment considering the noncompany pilot was not qualified in the airplane. Although the windshield stayed in place, the company pilot stated that “within seconds” after it fractured, he depressurized the airplane because he was unsure about the windshield’s “integrity.” However, the Beech King Air Airplane Flight Manual (AFM) states to maintain cabin pressurization in the event of a fractured windshield and further states that the airplane can continue flight for up to 25 hours with the windshield fractured. During the on-scene examinations, an unapproved document (not derived from the AFM) that contained several checklists was found on the airplane. The company pilot stated that he used this document and that it “came with the airplane.” The document did not include a checklist addressing a cracked or shattered windshield. The company pilot most likely was not aware that the airplane should not have been depressurized nor that it could operate for 25 hours after the fracture occurred and, therefore, that the fractured windshield did not present an in-flight emergency. The CVR transcript revealed that, after depressurizing the airplane, the pilots attempted to use the oxygen masks but were unable to receive any oxygen. (The pilots most likely did not turn the oxygen on once they needed it because they either forgot as a result of the emergency or because they did not have time to do so before they lost consciousness.) According to the company pilot, during his preflight inspection of the airplane, the oxygen system was functional. He stated that, after the inspection, he turned the oxygen system ready switch to the OFF position because he wanted to “save” the oxygen, which was not in accordance with the Before Start checklist in the AFM. Post accident functional testing of the oxygen system revealed normal operation. The unapproved checklists document did not include the instruction to leave the oxygen system on. Regardless, the pilot stated that he knew the approved checklist stated to leave the oxygen system on but that he still chose to turn it off. The pilot exhibited poor judgment by using an unapproved, incomplete checklists document and by knowingly deviating from approved preflight procedures. About 1 minute after the pilots tried to get oxygen, the CVR recorded the last comment by either pilot. For about the next 7 minutes until it stopped recording, the CVR recorded the sounds of increased engine propeller noise, the landing gear and overspeed warning horns, and altitude alerts indicating that the airplane had entered an uncontrolled descent. (The CVR’s 4-g impact switch was found in the open position during the on-scene examination, indicating that the airplane experienced at least 4 acceleration of gravity forces.) Further, a plot of two radar data points, recorded after the last pilot comment, showed that the airplane descended from 25,400 feet to 7,800 feet within 5 minutes. Shortly thereafter, the pilots regained consciousness and recovered from the uncontrolled descent. The airplane was substantially damaged by the acceleration forces incurred during the uncontrolled descent and subsequent recovery. Examination of the windshield revealed that a dense network of fractures was located on the inner glass ply; however, the windshield did not lose significant pieces of glass and maintained its structural integrity. Therefore, the fractures did not preclude safe continued flight. Post accident examinations revealed evidence that the fracture initiated due to a design deficiency in the glass. The manufacturer redesigned the windshield in 2001 (the accident airplane was manufactured in 1998), and no known similar fractures have occurred in the newly designed windshield. The manufacturer chose not to issue a service bulletin for a retrofit of the new windshield design in airplanes manufactured before 2001 because the fracture of one pane of glass is not a safety-of-flight issue.", "probable_cause": "The company pilot’s poor judgment before and during the flight, including turning the oxygen system ready switch to the OFF position after he conducted the preflight inspection and using an unapproved checklist, which did not provide guidance for a fractured windshield and resulted in his depressurizing the airplane. Members Hersman and Sumwalt did not approve this probable cause. Member Hersman filed a dissenting statement, with which Member Sumwalt concurred. The statement can be found in the public docket for this accident."}