{"url": "https://www.baaa-acro.com/crash/crash-atr72-212-mt-dena-66-killed", "date": "Feb 18, 2018 at 0931 LT", "type": "ATR72-200", "operator": "Iran-Aseman-Airlines-22", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Tehran – Yasuj", "msn": "391", "yom": 1993, "flight_number": "EP3704", "city": "Mt Dena", "zone": "Isfahan", "country": "Iran", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 60, "pax_fatalities": 60, "other_fatalities": 0, "total_fatalities": 66, "captain_hours": 17926, "captain_hours_type": 12519, "copilot_hours": 1880, "copilot_hours_type": 197, "aircraft_hours": 28857, "circumstances": "Iranian ATR72 aircraft registered EP-ATS operated by Iran Aseman Airlines was assigned to perform a domestic scheduled passenger flight from Tehran to Yasuj on 07:55 local time. The aircraft took off from Tehran Mehrabad International Airport (0III) at 04:35 UTC. (08:05 LMT) and the flight was the first flight of the day for aircraft and the crew. The cruise flight was conducted at FL210 on airway W144 and no abnormal situation was reported by the crew and the flight was continued on Tehran ACC frequency till the time the first officer requested latest weather information of the destination by contact to Yasuj tower then requested to leave FL210 to FL170 from Tehran ACC. When the aircraft was descending to FL170 and crew calling YSJ tower the aircraft descending was continued to altitude of 15000 ft. The aircraft was approved to join overhead of the airport and perform “circling NDB approach “to land on RWY 31 at the destination aerodrome. Finally the aircraft collided with a peak lee of DENA Mountains about 8.5 miles at North far from the airport and involved accident on 06:01 UTC. The aircraft was completely destroyed as a result of collision with the mountain at the altitude of approximately 13,300 ft. ", "probable_cause": "The accident was happened due to many chains of considered causes but the “Human Factor” had main roll for the conclusion of the scenario. The Cockpit Crew action which has caused dangerous conditions for the flight is considered as main cause. Based on provided evidences, the errors of cockpit crew were as follows:\r\n- Continuing to the Yasouj airport for landing against Operation manual of the Company, due to low altitude ceiling of the cloud and related cloud mass. They should divert to alternate airport,\r\n- Descending to unauthorized altitude below minimum of the route and MSA,\r\n- Lack of enough CRM during flight,\r\n- Failure to complete the stall recovery (flap setting, max RPM),\r\n- Inappropriate use of Autopilot after Stall condition,\r\n- Inadequate anticipation for bad weather based on OM (Clouds, Turbulence, and Icing ...),\r\n- Quick action to switch off anti-ice system and AOA,\r\n- Failure to follow the Check lists and standard call out by both pilots.\r\nContributing Factors:\r\nThe contributive factors to this accident include but are not limited to the following:\r\n- The airline was not capable to detect systematic defectives about :\r\n- Effectiveness of crew training about Meteorology, OM, SOP,\r\n- Enough operational supervision on pilot behaviors,\r\n- The lack of SIGMET about Mountain Wave or Severe Mountain wave,\r\n- Unclear procedure for stall recovery in FCOM,\r\n- Lack of warning in aircraft manuals by manufacturer for flight crew awareness about mountain wave.\r\n- Lack of APM System to alert crew about performance degradation.\r\nOther Deficiencies and Short Comes:\r\nIn the process of the accident investigation, some detailed deficiencies and short comes were found and should be considered as latent conditions by related authorities:\r\n- AD accomplishment and related monitoring,\r\n- Sanction on aviation industries and effect on Flight safety,\r\n- Non-standard communication between ATC and crew,\r\n- Unclear definition of the Fully Qualified Pilot and qualified copilot in Aircrew regulation.\r\n- Weather forecast (TAF) in the airports based on annex 3 procedure in the Civil Aviation Organization for approving alternative method of compliance for aircraft AD,s\r\n- Search and rescue Coordination with local authorities for aviation accidents,\r\n- Time setting of aircraft flight data recording(FDR) either by technician or pilots."}