{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-32-zurich-46-killed", "date": "Nov 14, 1990 at 2011 LT", "type": "Douglas DC-9", "operator": "Alitalia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Milan - Zurich", "msn": "47641", "yom": 1974, "flight_number": "AZ404", "city": "Zurich-Kloten", "zone": "Zurich", "country": "Switzerland", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 40, "pax_fatalities": 40, "other_fatalities": 0, "total_fatalities": 46, "captain_hours": 10193, "captain_hours_type": 3194, "copilot_hours": 831, "copilot_hours_type": 621, "aircraft_hours": 43894, "circumstances": "On the 14th November 1990 ALITALIA flight 404, aircraft type DC-9-32 registration I-ATJA, took off from runway 36R at LIN bound for ZRH. The flight was a scheduled commercial flight. The clearance was to the destination airport Zürich, via a CANNE IC departure to Flight Level 120, the transponder code 0302. The PIC assumed the duties of assisting pilot and dealt with the radio-telephony. The First Officer was the handling pilot. The take-off was at 1836 hrs. The standard climb via CANNE towards Airway A9 to the cruising flight level of 200 was trouble free. About 2 minutes after reaching Flight Level 200 the crew listened to Zürich VOLMET. From this they gathered that the surface wind at Zürich was 240/08 kt. This led the PIC forsee a landing on runway 28. Having heard from the ATIS that the landing runway was 14, the crew still discussed a right hand circling approach for a landing on runway 28. The discussion continued considering a left hand circling to runway 28. At 1852.53 hrs, from a QNH of 1019 hPa the crew worked out a QFE of 970 hPa. During the descent, the crew discussed the approach procédure for runway 14, where the Copilot mentioned the Outer Marker height for runway 16. After the discussion about the setting of the navigation aids, they also discussed the procédure to be followed in the event of a communications failure. The crew were instructed that following radar vectors they should fly an ILS approach to runway 14. At 1900.01 hrs the Copilot said \"We perform a CAT JJ (approach)\". The PIC was in agreement because the navigation equipment had to be checked. Whilst verifying the décision height, it transpired that the Copilot was still Consulting the approach chart for runway 16. Further lengthy discussions about the setting of the required navigation aids followed. As the aircraft passed abeam Zürich descending to Flight Level 90, the PIC noted: \"We are by KLOTEN, FL 90. He is bringing us in high\". Clearance to descend to Flight Level 60 followed at 1902.28 hrs. At 1902.50 hrs ALITALIA 404 was instructed to fly heading 325. VHF NAV 1 was tuned to Trasadingen VOR (TRA), VHF NAV 2 to Kloten VOR (KLO). To define the fix at EKRON, the course 068 was also set. At 1904.32 hrs the PIC repeated \"The outer marker is at 1200 ft (QFE), it can be verified by 3.8 [NM] from Kloten. Rhein (RHI NDB) 5.6 [NM]...\". At 1905.15 hrs a new heading was required which the PIC confirmed. The identification of the ILS - 14 was registered on the CVR at 1905.32 hrs. At 1906.20 hrs, together with the approach clearance to runway 14, a new heading of 110, descent to 4000 ft and the QNH of 1019 hPa was given. The PIC confirmed this clearance, however the heading was read back as 120. The incorrect readback of the clearance by the PIC caused the Copilot some uncertainty of the required heading to be flown. The PIC confirmed the approach clearance and the cleared altitude 4000 ft to the COPI, whereby the COPI ordered \"RADIO APPROACH...\". At this point an altitude of about 5000 ft (QNH) was passed. One of the pilots asked the other whether he had a Glide Path indication. The aircraft position was just before interception of the Localiser passing an altitude of about 4700 ft (QNH) (according to radar and DFDR). It was already about 1300 ft below the Glide Path. Answering the question about the Glide Path, the other pilot replied (hardly understandable) \"On 1...I don't have....\" Consequently the PIC said: \"Good, so let's do it on 1\". The COPI then ordered \"RADIO 1\". The flaps were probably set to 15°. In the meantime, the aircraft had passed through the localiser and was now slightly east of it. About the same time as the PIC said \"Capture LOC capture glide path capture - so we are on the localiser, a little off track but...\" (translated from Italian) the aircraft descended through 4000 ft (QNH) (about 11.5 NM from the threshold runway 14). It was thus about 1200 ft below the glide path. The QFE 970 hPa was also set by the COPI. About 5 seconds later the Altitude Exit Alert was heard (Descent through 3700 ft [QNH]). The PIC cancelled the warning by setting 5000 ft (Go Around Altitude) on the Altitude Preselect. The PIC said to the COPI: \"There is another one (Finnair 863) in front quite close. You can reduce even further to 150 (kt) otherwise we'll end up with a \"go around\". A discussion followed about possible icing. After this the flaps were set to 25 during which no Landing Gear horn was heard. At this point the aircraft was established on the localiser. The altitude was about 3000 ft QNH - ca. 1200 feet below the glide path. The PIC: \"Outer Marker check is at 1250 ft [QFE]\". The height was now about 1600 ft QFE. 10 seconds after Flaps 25, the flaps were set to 50. The Outer Marker height of 1250 ft QFE was now passed. The PIC said \"Bravo\" followed by sounds of switching. At 8 NM final the PIC mentioned \"3.8 almost 4 miles\". At about 7 NM final, (15 seconds after the PIC's words \"Almost 4 miles\") the COPI asked \"... haven't we passed it?\". After a further 12 seconds the COPI asked once again \"Didn't we pass the outer marker?\" The height was now 670 ft QFE. The PIC's answer was \"No no it hasn't changed yet. At 6.6 NM final the PIC said \"Oh it shows 7 The crew was now ordered by Zürich ARR to change frequency to Zürich TWR. At 6.25 NM final the pilots conversed as follows: \"... That doesn't make sense to me \"Nor to me ...\". 2 seconds after this conversation the PIC called out \"Pull, pull, pull, pull! \". Simultaneously autopilot disconnection could be heard. The position was now about 500 ft AGL overhead Weiach - about 350 ft QFE. 2 seconds later the COPI called out \"GO AROUND\" the PIC responded with \"No no no no ... catch the glide\". At this point the DFDR shows a pitch change from -2° [AND] to +5.4° [ANU]. At the same time the thrust was increased from 1.3 to 1.7 EPR. The sink rate decreased from 1100 ft/min. to 190 ft/min. After 11 seconds (the pitch oscillated at +1° [ANU]) the PIC asked \"Can you hold it?\" to which the COPI replied \"Yes\". One second after the COPI's answer the Radio Altimeter warning (pip pip pip) indicating 200 ft/AGL could be heard. During this, the PIC said \"Hold on let's try to At 1911.18 hrs the aircraft Struck the north em slope of the Stadlerberg at a altitude of 1660 ft QNH. All 46 occupants were killed. ", "probable_cause": "The accident was caused by:\r\n- False indication of VHF NAV unit No 1 in the aircraft.\r\n- Probable altimeter misreading by the PIC.\r\n- No GPWS warning in the cockpit.\r\n- Pilots not aware of the possibility of incorrect indications in the NAV equipment in use (without flag-alarm).\r\n- Inadequate failure analysis by the pilots.\r\n- Non-compliance by the pilots with basic procédural instructions during the approach.\r\n- Unsuitable cooperation between the pilots during the approach.\r\n- COPI's initiated go-around procédure aborted by the PIC.\r\n- The Approach Controller not observing the leaving of the cleared altitude of 4000 ft QNH before the FAP. "}