{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-73-mallard-perth-2-killed", "date": "Jan 26, 2017 at 1708 LT", "type": "Grumman G-73 Mallard", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Demonstration", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Serpentine - Serpentine", "msn": "J-35", "yom": 1948, "flight_number": null, "city": "Perth", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 625, "captain_hours_type": 180, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 26 January 2017, the pilot of a Grumman American Aviation Corp G-73 amphibian aircraft, registered VH-CQA (CQA), was participating in an air display as part of the City of Perth Australia Day Skyworks event. On board were the pilot and a passenger. The pilot of CQA was flying ‘in company’ with a Cessna Caravan amphibian and was conducting operations over Perth Water on the Swan River, that included low-level passes of the Langley Park foreshore. After conducting two passes in company, both aircraft departed the display area. The pilot of CQA subsequently requested and received approval to conduct a third pass, and returned to the display area without the Cessna Caravan. During positioning for the third pass, the aircraft departed controlled flight and collided with the water. The pilot and passenger were fatally injured.", "probable_cause": "From the evidence available, the following findings are made regarding the loss of control and collision with water involving the G-73 Mallard aircraft, registered VH-CQA 10 km west-south-west of Perth Airport, Western Australia on 26 January 2017. These findings should not be read as apportioning blame or liability to any particular organisation or individual. Safety issues, or system problems, are highlighted in bold to emphasise their importance. A safety issue is an event or condition that increases safety risk and (a) can reasonably be regarded as having the potential to adversely affect the safety of future operations, and (b) is a characteristic of an organisation or a system, rather than a characteristic of a specific individual, or characteristic of an operating environment at a specific point in time.\r\nContributing factors:\r\n- The pilot returned the aircraft to the display area for a third pass in a manner contrary to the approved inbound procedure and which required the use of increased manoeuvring within a confined area to establish the aircraft on the display path.\r\n- During the final positioning turn for the third pass, the aircraft aerodynamically stalled at an unrecoverable height.\r\n- The pilot's decision to carry a passenger on a flight during the air display was contrary to the Instrument of Approval issued by the Civil Aviation Safety Authority for this air display and increased the severity of the accident consequence."}