{"url": "https://www.baaa-acro.com/crash/crash-casa-212-aviocar-200-falsterbo-4-killed", "date": "Oct 26, 2006 at 1326 LT", "type": "Casa 212 Aviocar", "operator": "Kustbevakning_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Ronneby – Malmö", "msn": "346", "yom": 1985, "flight_number": "KBV585", "city": "Falsterbo", "zone": "Skåne", "country": "Sweden", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 4424, "captain_hours_type": 4192, "copilot_hours": 638, "copilot_hours_type": 421, "aircraft_hours": 17048, "circumstances": "Kustbevakningen (The Swedish Coastguard), henceforth called KBV, intended on that particular day to perform two routine maritime surveillance tasks with flights over the southern Baltic Sea and along the south and west coasts of Sweden, including a flight over the Kattegatt. The flights would be carried out by the aircraft registered SE-IVF, with call sign 585. The crew consisted of two pilots and two system operators. The first flight of the day would take off from Ronneby, with Malmö/Sturup as the landing airport. According to the submitted flight plan the flight from Ronneby would depart north-east outwards across the southern tip of Öland, via reporting point KOLJA and onwards to a point south of Gotland. Thereafter the route would be via KOLJA back on a south-west course to a point south of Smygehamn in the southern Baltic Sea and then directly to Malmö/Sturup airport.\n\r\nThe take off from Ronneby\r\nWhen KBV 585 taxied out for take off, route clearance had been obtained for take off in accordance with the submitted flight plan. The flight would be undertaken in VFR (Visual Flight Rules) weather conditions. The flight plan did not state the desired altitude, so at the initiative of air traffic control KBV 585 was assigned the altitude band “1500 feet or lower” in connection with the flight clearance. Take off was at 11:09 on runway 19. Immediately after take off the crew requested a “360”, i.e. to make a complete turn from their current position. This request was accepted by air traffic control and KBV 585 performed a circuit at about 500 feet in a left turn around the airfield. No comments or explanations were offered by the crew during this manoeuvre. In an interview with SHK the air traffic controller stated that he thought that the aircraft had suffered a technical fault and/or the crew wanted to carry out some form of check. It later transpired that the reason for the extra circuit may have been to show off the aircraft to a practical work experience student who was at the KBV as part of work experience training. After the completed left hand circuit the pilots returned to their original flight plan and continued, with an initial climb to the south, to then turn left and follow the planned flight route.\n\r\nThe first phase of the flight\r\nDuring the continuing climb the pilots received an instruction to change radio frequency from Ronneby air traffic control tower to Ronneby control, i.e. the air traffic control section covering the Ronneby terminal area, that normally includes radar surveillance. As KBV 585 continued to climb, the air traffic controller noted that it continued to climb above the maximum altitude of 1500 feet that the stated flight clearance had included. At about 2000 feet while still climbing the pilots requested permission to climb to and maintain 2500 feet, which was granted. When the aircraft left the Ronneby terminal area the pilots changed radio frequency without reporting this to the air traffic control area controller. The air traffic controller on duty on that particular day at Ronneby stated that this was unusual behaviour by the KBV pilot, both to climb through the cleared altitude and to depart from the radio frequency without reporting it. The flight continued to the north-west in accordance with the flight plan. Apart from the routine tasking order concerning environmental and fishing surveillance, the tasking included instructions to search for traces from a previously sunken barge. The flight was performed without any problems being reported. During the flight the pilots were in radio contact both with air traffic controllers and the KBV coordination centre. As the aircraft was en route south-west after having turned at the southern tip of Gotland, the crew received a message from the coordination centre concerning a request they had received to perform a fly-by over Falsterbo. KBV has a base at the Falsterbo canal, which on that particular day was hosting a study visit by two school classes. Therefore a request came from the base to ask whether the pilots could consider performing a fly-by as they were on their way to Malmö/Sturup, so as to demonstrate the aircraft. The pilots accepted this and revised the final part of their flight plan so that a demonstration of the aircraft over the Falsterbo canal could be performed.\n\r\nThe fly-by over the KBV base\r\nAt 13:23 KBV 585 came in over the coast at Falsterbonäset on a north-northwesterly course along the canal. The aircraft then continued out over the sea and after a left turn returned to approach the base. The aircraft then performed another fly-by at low speed over the base and along the canal in the opposite direction, i.e. south-south-east, at low altitude. The route of the flight was partly over the canal, partly over the strip of beach and the buildings along the north-eastern shore. Beyond the far end of the canal the aircraft performed a 180 degrees left turn, first climbing and then descending. On its last approach to the base the aircraft came over the beach at the northeastern side of the canal, on a north-westerly course, which was later altered to north-north-westerly as it once again came over the canal.\n\r\nThe accident\r\nAs the aircraft neared the base once more it began wing tipping. After two or three wing tippings, by which time the aircraft was approximately above the bridge at the north-west entrance to the canal, a loud bang was heard and the entire left wing separated from the aircraft, to fall into the basin. The aircraft then rolled over onto its back and also fell into the basin, somewhat further out. The impact created a huge cascade of water. The remains of the aircraft and wing then quickly sank to the bottom. The whole sequence of events took place quickly and afterwards various pieces of wreckage could be seen floating on the surface at the point of impact. All on board were fatally injured. The accident took place at position 55° 25' N 012° 56' E; at sea level.", "probable_cause": "The accident was caused by an inadequate maintenance system in respect of inspections for fatigue cracks. Contributory to the crack formation has been an unsuitable design of the attachment of the wings to the aircraft fuselage. "}