{"url": "https://www.baaa-acro.com/crash/ground-collision-two-lockheed-l-382b-1c-hercules-ndola", "date": "Apr 11, 1968", "type": "Lockheed C-130 Hercules", "operator": "Zambian Air Cargoes", "flight_phase": "Taxiing", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cambridge - Benina - Entebbe - Ndola - Lusaka", "msn": "4109", "yom": 1966, "flight_number": null, "city": "Ndola", "zone": "Copperbelt", "country": "Zambia", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9000, "captain_hours_type": 140, "copilot_hours": 8000, "copilot_hours_type": 800, "aircraft_hours": 2339, "circumstances": "The aircraft departed from Cambridge, England, about mid-morning on 9 April 1968, and landed at Benina, where a night stop was made. The flight was continued on 10 April, with landings at Entebbe and Lusaka, where government-owned cargo was unloaded. On 11 April, the aircraft was due to be ferried to its normal base at Ndda, but the Air Turbine Motor (A.T.M) was found to be unserviceable. As the fault could not be ascertained and spares were not available, external power was used for initial engine start and all pre-taxi and taxi checks were carried out satisfactorily. On reaching the take-off holding point, reverse thrust checks were carried out and on returning to ground idle on No. 2 engine, the nacelle overheat light came on. On pulling the fire shut-off handle on No. 2 engine, the overheat light went out immediately. The Flight Engineer carried out a visual inspection of the engine and reported that there were no visible signs of fire. It was assumed that the overheat warning had been due to the tail wind and reverse thrust check, a possible occurrence under the prevailing conditions. A dry motorover was carried out to reduce Turbine Inlet Temperature (T.1.T) and a restart made. All indications were normal and a further reverse thrust check was carried out on engines 2 arid 3. All readinge were normal. The normal checks were carried out, engine run-up and pre-take-off checks made and the Captain briefed the crew regarding emergency in flight procedures. The take-off was completed and the flight to Ndola was without incident and, except for the A.T.M., all systems functioned normally. On approaching -Ndola, the \"field approach check and the \"pre-landing check\" were carried out. According to the statement of the Flight Engineer, all.systems were normal. A normal landing was made, using reverse thrust on all four engines. Towards the end of the taxi run, the First Officer advised the Captain that: \"Now we have no ATM\". The Captain gave orders to cut engines 1 and 4 when on the perimeter track and the aircraft proceeded on engines 2 and 3. On reaching the parking area, a right turn was commenced to enter the area. Shortly after this point, both co-pilot and engineer claim to have advised the Captain that No. 2 engine nacelle overheat warning light was on. The Captain momentarily considered whether the warning was genuine or spurious, decided to accept that it was genuine and called for No. 2 \"Fire T. Handle\" to be pulled on No. 2 engine was then shut down. When No. 2 engine was shut down, the aircraft was being marshalled and was commencing a turn to the left and approaching a parked Hercules aircraft, 9J-RBX, approximately 100 ft ahead. It was the intention that aircraft 9J-RCY be parked alongside 9J-RBX. Aircraft 9J-RCY was approaching the port side of 9J-RBX at an angle of about 45°, and was in the final turn to park alongside 9J-RBX when steering and brake pressures became exhausted. The nose wheel castored, this being seen by the ground crew around 9J-RBX, and 9J-RCY straightened up and collided with the port wing of 9J-RBX, No. 3 engine propeller cutting through some 12 ft of the wing. Fire broke out immediately", "probable_cause": "The collision resulted from failure to halt the aircraft when it was decided to shut down No. 2 engine. A contributory cause was that the crew lacked a ready understanding of the mechanics of the aircraft hydraulic systems. The aircraft was not being operated in accordance with the requirements of the Certificate of Airworthiness and there was thug a contravention of Section 23(1) of the Air Navigation Regulations, Had permission been requested to operate in accordance with the R.A.F. Flight Reference Cards an the delivery Flight, it is probable that, after the cards had been studied and in view of the fact that the Captain was used ta operating in accordance with the cards, the necessary action would no doubt have been taken to authorise their use for the one flight."}