{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-242-near-kabul-104-killed", "date": "Feb 3, 2005 at 1515 LT", "type": "Boeing 737-200", "operator": "Kam%20Air", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Herat - Kabul", "msn": "22075", "yom": 1980, "flight_number": "KMF904", "city": "Kabul", "zone": "Kabul", "country": "Afghanistan", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 97, "pax_fatalities": 97, "other_fatalities": 0, "total_fatalities": 105, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On February 3, 2005, a Boeing 737-242 aircraft (the \"Aircraft\") with Kyrgyz Republic registration EX-037, operated by Phoenix Aviation, was conducting Kam Air Flight 904 from Herat to Kabul. There were a total of 105 occupants on board the Aircraft, including eight crew members and ninety-seven passengers. The Aircraft was cruising at flight level 270 when it contacted Bagram Radar Approach Control (\"Bagram\") for descent and landing. The flight was normal until it failed to level at flight level 130 during the VOR/DME approach. At 1043:24 UTC, Bagram cleared the flight to descend at its discretion and to expect the VOR approach to runway 29. The prevailing weather was also passed on to the Aircraft. Visibility was reported 2 kilometers with snow, ceiling 2,200 feet broken. wind calm and altimeter setting QNH 1016. AT 1043:58 UTC, when the Aircraft was 35 miles west of the Kabul VOR. radar contact was established with Ba9ram. The Aircraft was advised by Bagram to cross the VOR at or above flight level 130 and cleared it for the VOR/DME approach to runway 29. At 1048:41 UTC the Aircraft reported flight level 130. Bagram again cleared the Aircraft for the VOR approach to runway 29 and advised the Aircraft to report procedure turn inbound. The crew replied that they would report proceeding inbound for the VOR approach to runway 29. This was the last transmission from the Aircraft. At about 1050:11 UTC, Bagram stated that radar contact had been lost with the Aircraft. Bagram and Kabul Air Traffic Control Tower attempted to locate the Aircraft through radar and radio communication, but were not successful. Search for the Aircraft was delayed and hampered due to a severe snowstorm in the region. The Aircraft was located approximately three days later by an International Security Assistance Force (ISAF) helicopter approximately 30 kilometers southeast of Kabul International Airport at N 36 27.900 E 69 30.185. The Aircraft was destroyed by force of impact from colliding with the mountain. All 105 occupants on board the Aircraft had received fatal injuries. Subsequently, all bodies were recovered and identified. The wreckage was found at the altitude of 9,960 feet (3,035 metres) on the summit of Mt Shapiri Ghar located about 30 km southeast of Kabul Airport. ", "probable_cause": "The accident occurred probably due to the premature descent by the aircraft below its minimum assigned altitude of 13,000 feet during approach in weather conditions below VFR requirements. The reason for descending below the minimum altitude could not be determined due to inadequate evidence. The investigation was severely affected due to non-availability of FDR and CVR data readouts. The investigation was finalized to the extent possible based on the limited evidence available. The investigation revealed that the aircraft did not proceed to the VOR as instructed by the air traffic controller and descended below the minimum assigned altitude prior to being established on any segment of the approach. As a result, the aircraft collided with a mountain. The cause of descending below the assigned altitude could not be determined due to inadequate data and evidence. "}