{"url": "https://www.baaa-acro.com/crash/crash-short-330-200-charleston-2-killed", "date": "May 5, 2017 at 0651 LT", "type": "Short 330", "operator": "Air-Cargo-Carriers-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Louisville – Charleston", "msn": "SH3029", "yom": 1979, "flight_number": "2Q1260", "city": "Charleston-Yaeger (Kanawha)", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4368, "captain_hours_type": 578, "copilot_hours": 652, "copilot_hours_type": 333, "aircraft_hours": 28023, "circumstances": "The flight crew was conducting a cargo flight in instrument meteorological conditions. Takeoff from the departure airport and the en route portion of the flight were normal, with no reported weather or operational issues.  As the flight neared Charleston Yeager International Airport (CRW) at an altitude of 9,000 ft, the captain and first officer received the most recent automatic terminal information service (ATIS) report for the airport indicating wind from 080º at 11 knots, 10 miles visibility, scattered clouds at 700 ft above ground level (agl), and a broken ceiling at 1,300 ft agl. However, a special weather observation recorded about 7 minutes before the flight crew's initial contact with the CRW approach controller indicated that the wind conditions had changed to 170º at 4 knots and that cloud ceilings had dropped to 500 ft agl. The CRW approach controller did not provide the updated weather information to the flight crew and did not update the ATIS, as required by Federal Aviation Administration Order 7110.65X, paragraph 2-9-2.  The CRW approach controller advised the flight crew to expect the localizer 5 approach, which would have provided a straight-in final approach course aligned with runway 5. The first officer acknowledged the instruction but requested the VOR-A circling instrument approach, presumably because the approach procedure happened to line up with the flight crew's inbound flightpath and flying the localizer 5 approach would result in a slightly longer flight to the airport. However, because the localizer 5 approach was available, the flight crew's decision to fly the VOR-A circling approach was contrary to the operator's standard operating procedures (SOP). The minimum descent altitude (MDA) for the localizer approach was 373 ft agl, and the MDA for the VOR-A approach was about 773 ft agl. With the special weather observation indicating cloud cover at 500 ft agl, it would be difficult for the pilots to see the airport while at the MDA for the VOR-A approach; yet, the flight crew did not have that information. The approach controller was required to provide the flight crew with the special weather report indicating that the ceiling at the arrival airport had dropped below the MDA, which could have prompted the pilots to use the localizer approach; however, the pilots would not have been required to because the minimum visibility for the VOR-A approach was within acceptable limits.  The approach controller approved the first officer's request then cleared the flight direct to the first waypoint of the VOR-A approach and to descend to 4,000 ft. Radar data indicated that as the flight progressed along the VOR-A approach course, the airplane descended 120 feet below the prescribed minimum stepdown altitude of 1,720 ft two miles prior to FOGAG waypoint. The airplane remained level at or about 1,600 ft until about 0.5 mile from the displaced threshold of the landing runway. At this point, the airplane entered a 2,500 ft-per-minute, turning descent toward the runway in a steep left bank up to 42º in an apparent attempt to line up with the runway.  Performance analysis indicates that, just before the airplane impacted the runway, the descent rate decreased to about 600 fpm and pitch began to move in a nose-up direction, suggesting that the captain was pulling up as the airplane neared the pavement; however, it was too late to save the approach. Postaccident examination of the airplane did not identify any airplane or engine malfunctions or failures that would have precluded normal operation.  Video and witness information were not conclusive as to whether the captain descended below the MDA before exiting the cloud cover; however, the descent from the MDA was not in accordance with federal regulations, which required, in part, that pilots not leave the MDA until the \"aircraft is continuously in a position from which a descent to a landing on the intended runway can be made at a normal descent rate using normal maneuvers.\" The accident airplane's descent rate was not in accordance with company guidance, which stated that \"a constant rate of descent of about 500 ft./min. should be maintained.\" Rather than continue the VOR-A approach with an excessive descent rate and airplane maneuvering, the captain should have conducted a missed approach and executed the localizer 5 approach procedure.  No evidence was found to indicate why the captain chose to continue the approach; however, the captain's recent performance history, including an unsatisfactory checkride due to poor instrument flying, indicated that his instrument flight skills were marginal. It is possible that the captain felt more confident in his ability to perform an unstable approach to the runway compared to conducting the circling approach to land.  The first officer also could have called for a missed approach but, based on text messages she sent to friends and their interview statements, the first officer was not in the habit of speaking up. The difference in experience between the captain and first officer likely created a barrier to communication due to authority gradient.  ATC data of three VOR-A approaches to CRW flown by the captain over a period of 3 months before the accident and airport security footage of previous landings by the flight crew 1 month before the accident suggest that the captain's early descent below specified altitudes and excessive maneuvering during landing were not isolated to the accident flight. The evidence suggests that the flight crew consistently turned to final later and at a lower altitude than recommended by the operator's SOPs.  The flight crew's performance on the accident flight was consistent with procedural intentional noncompliance, which—as a longstanding concern of the NTSB—was highlighted on the NTSB's 2015 Most Wanted List. The operator stands as the first line of defense against procedural intentional noncompliance by setting a positive safety attitude for personnel to follow and establishing organizational protections. However, the operator had no formal safety and oversight program to assess compliance with SOPs or monitor pilots, such as the captain, with previous performance issues. ", "probable_cause": "The flight crew's improper decision to conduct a circling approach contrary to the operator's standard operating procedures (SOP) and the captain's excessive descent rate and maneuvering during the approach, which led to inadvertent, uncontrolled contact with the ground. Contributing to the accident was the operator's lack of a formal safety and oversight program to assess hazards and compliance with SOPs and to monitor pilots with previous performance issues."}