{"url": "https://www.baaa-acro.com/crash/crash-rockwell-681bt-turbo-commander-sao-paulo-7-killed", "date": "Dec 16, 2000 at 2120 LT", "type": "Rockwell Turbo Commander 680/681", "operator": "Agropecuária J. Caetano", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "City", "schedule": "São Paulo – Maringá", "msn": "681-6071", "yom": 1972, "flight_number": null, "city": "São Paulo-Congonhas", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 5000, "captain_hours_type": 600, "copilot_hours": 2500, "copilot_hours_type": 200, "aircraft_hours": null, "circumstances": "After takeoff from runway 17 at São Paulo-Congonhas Airport, the crew was cleared to climb to 5,500 feet maintaining heading 270. Weather conditions were poor with clouds, atmospheric turbulences and strong winds. At an altitude of 5,300 feet, the aircraft lost height and descended to 4,700 feet, an altitude that was maintained for 17 seconds. Then the aircraft entered an uncontrolled descent and crashed in four houses located in the district of Vila Anhanguera, about 5,5 km southwest of the airport. The aircraft and all four houses were destroyed. All seven occupants were killed while on the ground, six people were injured, one seriously. ", "probable_cause": "The accident occurred in poor weather conditions. It was determined that during initial climb, the aircraft's attitude, speed and altitude varied suddenly and rapidly, causing the pilot flying a stressful situation insofar as he believed that artificial horizons presented technical problems. In such a situation, investigators consider probable the hypothesis that the pilot made inadequate corrections, exacerbating the abnormal situation in which he was operating. The following contributing factors were identified: \r\n- The crew were suffered fatigue because they had been on duty for more than 15 hours and were unable to observe satisfactory rest time at Congonhas airport,\r\n- This fatigue certainly affected the pilots in their decision-making,\r\n- The urge to return home and distrust of instruments in difficult flight conditions seriously compromised the performance of pilots and their ability to make decisions,\r\n- A direct contact with passengers was stressful as they were going through a period of mourning and were eager to return home to Maringá,\r\n- Weather conditions were unfavorable and contributed to the anxiety of the crew,\r\n- Poor assessment of these conditions by the pilots,\r\n- The working time of the pilots exceeded the limitations and the operator did not take into account adequate rest conditions for the crew, \r\n- The training of the captain in instrument flights in recent months was insufficient."}