{"url": "https://www.baaa-acro.com/crash/crash-embraer-erj-190-200lr-kupang", "date": "Dec 21, 2015 at 1746 LT", "type": "Embraer ERJ-190", "operator": "KalStar%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ende - Kupang", "msn": "190-00057", "yom": 2006, "flight_number": "KD676", "city": "Kupang", "zone": "East Nusa Tenggara", "country": "Indonesia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 120, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9800, "captain_hours_type": 598, "copilot_hours": 2997, "copilot_hours_type": 557, "aircraft_hours": 16862, "circumstances": "On 21 December 2015, an ERJ 190-200 (Embraer 195) aircraft, registered PK-KDC, was being operated by Kalstar Aviation on a scheduled passenger flight. The crew was scheduled to fly three sectors from I Gusti Ngurah Rai International Airport (WADD) Bali – H. Hasan Aroeboesman Airport (WATE) Ende – El Tari International Airport (WATT) Kupang – Sultan Hasanuddin International Airport (WAAA), Makassar. The aircraft departed Bali at 0734 UTC which was delayed for 74 minutes from the normal schedule, due to late arrival of the aircraft from the previous flight. On the flight from Bali to Ende, the Pilot in Command (PIC) acted as pilot monitoring (PM) and the Second in command (SIC) acted as pilot flying (PF). The aircraft landed in Ende at 0839 UTC. During transit, the PIC received a short message from a flight operations officer of Kalstar Aviation in Kupang which informed him that the visibility at Kupang was 1 km. Considering the weather forecast in the Terminal Aerodrome Forecast (TAFOR) showed that the visibility at Kupang would improve at the time of arrival, the PIC decided to depart to Kupang. Another consideration was the operating hours of Ende which would be closed at 0900 UTC. The operating hours of Ende was extended and the aircraft departed Ende at 0916 UTC, with flight number KD676. On board this flight were two pilots, three flight attendants, and 125 passengers. The PIC acted as PM and the SIC acted as PF. There was no departure briefing performed by the PF. After takeoff, the pilot set the Flight Management System (FMS) to fly direct to KPG VOR and climbed to a cruising altitude of Flight Level (FL) 175 (17,500 feet). During climbing, the PIC instructed the SIC to reduce the aircraft speed by 20 knots with the intention to wait for the weather improvement at Kupang. During cruising, the pilots monitored communication between El Tari Tower controller with another pilot. El Tari Tower controller advised that the visibility at Kupang was 1 km while the minima for approach was 3.9 km. At 0927 UTC, the pilot established communication with El Tari Tower controller and requested for direct to initial approach point SEMAU. At 0932 UTC, the aircraft was at 62 Nm, the aircraft started to descend which was approved to 10,000 feet. When the aircraft passed FL 150, the pilot requested to turn left to fly direct to the inbound track of the VOR/DME approach for runway 07 in order to avoid cloud formation which was indicated by magenta color on the aircraft weather radar. At 0941 UTC, the El Tari Tower controller informed that the visibility on runway 07 was 4 km and issued clearance for RNAV approach to runway 07 and requested that the pilot report when the runway was in sight. Both pilots discussed the plan to make an RNAV approach to runway 07, with landing configuration with flap 5 and auto-brake set to position low. At 0943 UTC, the pilot reported that the runway was in sight when passing 2,500 feet and the El Tari Tower controller informed that the wind was calm and issued a landing clearance. During the approach, the PF noticed that all Precision Approach Path Indicator (PAPI) lights indicated a white color, which indicated that the aircraft was too high for the approach. Recognizing that the aircraft was too high, the crew performed a non-standard configuration setting by extending the landing gear down first with the intention to increase drag. The landing gear was extended at approximately 7 Nm from the runway 07 threshold and afterwards selected the flaps to 1 and 2. The published approach procedure stated that the sequence for establishing landing configuration is by selecting flap 1, flap 2, landing gear down, flap 3 and flap 5. On final approach, the crew noticed the aural warning “HIGH SPEED HIGH SPEED”. The SIC also noticed that the aircraft speed was about 200 knots. The pilots decided to continue the approach considering the runway was 2,500 meters long and would be sufficient for the aircraft to stop with the existing conditions. The pilots compared the runway condition at Kupang with the condition at Ende which had 1,650 meter length runway. On short final approach, the aircraft was on the correct glide path and the speed was approximately 205 knots. The PF noticed the Enhanced Ground Proximity Warning System (EGPWS) warning of “TOO LOW TERRAIN” activated. The aircraft then touched down at approximately the middle of the runway. After touchdown, the PF immediately applied thrust reverser. Realizing that the aircraft was about to overrun the end of the runway, and with the intention to avoid the approach lights on the end of the runway, the PIC turned the aircraft to the right. The aircraft stopped approximately 200 meters from the end of runway 07. At 0946 UTC, the El Tari Tower controller saw the aircraft overrun, then pushed the crash bell and informed the Airport Rescue and Fire Fighting (ARFF).", "probable_cause": "Contributing Factors:\r\n- The steep authority gradient resulted in lack of synergy that contributed to least of alternation to correct the improper condition.\r\n- Improper flight management on approach resulted to the aircraft not fully configured for landing, prolong and high speed on touchdown combined with low brake pressure application resulted in insufficient runway for deceleration.\r\n- The deviation of pilot performance was undetected by the management oversight system."}