{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-10-los-angeles-2-killed", "date": "Mar 1, 1978 at 0925 LT", "type": "Douglas DC-10", "operator": "Continental%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Los Angeles - Honolulu", "msn": "46904", "yom": 1972, "flight_number": "CO603", "city": "Los Angeles", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 14, "crew_fatalities": 0, "pax_on_board": 186, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 29000, "captain_hours_type": 2911, "copilot_hours": 10000, "copilot_hours_type": 1249, "aircraft_hours": 21358, "circumstances": "On March 1, 1978, Continental Air Lines, Inc., Flight 603, a McDonnell Douglas DC-10-10 (N68045), was a scheduled flight from Los Angeles International Airport, California, to Honolulu, Hawaii. At 0857:18, Flight 603 called Los Angeles clearance delivery and was cleared for the route of flight which was to have been flown. About 2 min later, the flight received permission from Los Angeles ground control to push back from the gate. At 0901:37, Flight 603 was cleared by ground control to taxi to runway 6R. The runway was wet, but there was no standing water. At 0922:29, Los Angeles local control cleared Flight 603 to taxi into position on runway 6R and hold. At 0923:17, local control cleared Flight 603 for takeoff; however, the flightcrew did not acknowledge the instructions and did not comply with them. At 0923:57, local acknowledged the instructions. The captain stated that he delayed control, again, cleared the flight for takeoff. This time the flightcrew acknowledgment of the takeoff clearance because he believed that he had initially been given the clearance too soon after a heavy jet aircraft had made its takeoff. The flightcrew stated that acceleration was normal and that all engine instruments were in the normal range for takeoff. As the airspeed approached the V1 speed of 156 kns, the captain heard a loud \"metallic bang\" which was followed immediately by \"a kind of quivering of the plane.\" The flightcrew noticed that the left wing dropped slightly. A rejected takeoff was begun immediately; however, according to the digital flight data recorder (DFDR), the airspeed continued to increase to about 159 kns as the rejected takeoff procedures were begun. The captain stated that he applied full brake pressure while simultaneously bringing the thrust levers back to idle power. Reverse thrust levers were actuated and full reverse thrust was used. The flightcrew stated that they noted good reverse thrust. First, the aircraft moved to the left of the runway centerline and appeared tb the flightcrew to be decelerating normally. With about of deceleration had decreased, and they believed that the aircraft would 2,000 ft of runway remaining, the flightcrew became aware that the rate not be able to stop on the runway surface. The captain stated that he maintained maximum brake pedal force and full reverse thrust as he steered the aircraft to the right of the runway centerline in an effort \"to go beside the stanchions holding the runway lights\" immediately off of the departure end of runway 6R. He stated further that he encountered no problems with directional control of the aircraft throughout the rejected takeoff maneuver. The aircraft departed the right corner of the departure end of runway 6R. About 100 ft beyond the runway, the left main landing gear broke through the nonload-bearing tar-macadam (tarmac) surface and failed rearward. Fire erupted immediately from this area. The aircraft dropped onto the left wing and the No. 1 (left) engine and rotated to the left as it continued its slide along the surface. It stopped between two of the approach light stanchions for runway 24L about 664 ft from the departure end of runway 6R and about 40 ft to the right of the runway 6R extended centerline; it came to rest on a heading of 008°, in an 11° left wing low, 1.3° noseup attitude. When the aircraft came to a stop, the evacuation was begun immediately. Two passengers were killed while all other occupants were evacuated, some of them with serious injuries. ", "probable_cause": "The National Transportation Safety Board determined that the probable cause of the accident was the sequential failure of two tires on the left main landing gear and the resultant failure of another tire on the same landing gear at a critical time during the takeoff roll. These failures resulted in the captain's decision to reject the takeoff. Contributing to the accident was the cumulative effect of the partial loss of aircraft braking because of the failed tires and the reduced braking friction achievable on the wet runway surface which increased the accelerate-stop distance to a value greater than the available runway length. These factors prevented the captain from stopping the aircraft within the runway confines. The failure of the left main landing gear and the consequent rupture of the left wing fuel tanks resulted in an intense fire which added to the severity of the accident."}