{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-rangeley-2-killed", "date": "Dec 22, 2000 at 1716 LT", "type": "Beechcraft 200 Super King Air", "operator": "Mountain Air Service (Maine)", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Rangeley – Boston – Portland – Rangeley", "msn": "BB-958", "yom": 1982, "flight_number": null, "city": "Rangeley-Steven A. Bean", "zone": "Maine", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 15500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8845, "circumstances": "The pilot and passenger departed on a night IFR flight. Weather en route was a mixture of instrument and visual meteorological conditions. When the airplane was 17 miles southwest of its destination, the pilot was cleared for an instrument approach. At 9 miles, the pilot reported the airport in sight, and canceled his IFR clearance. The airplane continued to descend towards the airport on a modified left base until radar contact was lost at 3,300 feet msl. The pilot was in radio contact with his wife just prior to the accident. He advised her that he was on base for runway 32. Neither the pilot's wife, nor ATC received a distress call from the pilot. The airplane was located the next morning about 100 feet below the top of a mountain. The accident site was 7.9 miles from the airport, and approximately 1,200 feet above the airport elevation. Ground based weather radar recorded light snow showers, in the general vicinity of the accident site about the time of the accident, and satellite imagery showed that the airplane was operating under a solid overcast. A level path was cut through the trees that preceded the main wreckage. Examination of both engines and the airframe revealed no pre impact failures or malfunctions.", "probable_cause": "The pilot-in-command's failure to maintain sufficient altitude while maneuvering to land, which resulted in a collision with terrain. Factors in the accident were the dark night, mountainous terrain, snow showers, clouds, and the pilot's decision to cancel his IFR clearance."}