{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-nakina", "date": "Jan 3, 1997 at 1110 LT", "type": "Cessna 208B Grand Caravan", "operator": "Nakina", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nakina - Fort Hope", "msn": "208B-0389", "yom": 1994, "flight_number": null, "city": "Nakina", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3200, "captain_hours_type": 1300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At approximately 1110 eastern standard time (EST , the pilot commenced a scheduled cargo flight from Nakina, Ontario, to Fort Hope in a Cessna 208B Caravan, serial number 208B0389. The pilot reported that he selected the flaps to 20°, lined up on runway 09, and set the power at around 1,600 to 1,700 foot-pounds of torque. The torque redline is 1,865 foot-pounds. About 3/4 of the way through the take-off run, the aircraft began to yaw to the right, which the pilot initially compensated for by applying left rudder. As the airspeed increased and the nosewheel lifted off the runway, the right yaw became more pronounced, and the aircraft became more difficult to control. The aircraft became airborne at about 85 knots indicated airspeed (KIAS), with the pilot using left rudder and left aileron in his attempt to compensate for the yaw; however, he was not able to gain control of the aircraft. The aircraft touched down briefly on the runway, then became airborne again as the take-off continued. While flying at less than 20 feet above ground level over a small, frozen lake immediately off the end of the runway, the aircraft descended and struck the snow-covered surface of the lake. The aircraft was in a nose-high, right-wing-low attitude when it struck the ice. The aircraft flipped over and came to rest in an inverted position, approximately 1,000 feet past the end of the runway and 200 feet to the right of the extended right edge of the runway. The pilot received only minor injuries. He exited the aircraft and walked back to the flight office.", "probable_cause": "The pilot experienced directional control difficulties during the take-off run, probably because the rudder trim was set at the near full left position. Because the rudder trim indicator could be moved without affecting the actual rudder trim, it is probable that it did not reflect the actual position of the rudder trim."}