{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-kodiak-6-killed", "date": "Jan 5, 2008 at 1343 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Servant%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kodiak - Homer", "msn": "31-7952162", "yom": 1979, "flight_number": null, "city": "Kodiak", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 9437, "captain_hours_type": 400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13130, "circumstances": "The airline transport pilot and nine passengers were departing in a twin-engine airplane on a 14 Code of Federal Regulations Part 135 air taxi flight from a runway adjacent to an ocean bay. According to the air traffic control tower specialist on duty, the airplane became airborne about midway down the runway. As it approached the end of the runway, the pilot said he needed to return to the airport, but gave no reason. The specialist cleared the airplane to land on any runway. As the airplane began a right turn, it rolled sharply to the right and began a rapid, nose- and right-wing-low descent. The airplane crashed about 200 yards offshore and the fragmented wreckage sank in the 10-foot-deep water. Survivors were rescued by a private float plane. A passenger reported that the airplane's nose baggage door partially opened just after takeoff, and fully opened into a locked position when the pilot initiated a right turn towards the airport. The nose baggage door is mounted on the left side of the nose, just forward of the pilot's windscreen. When the door is opened, it swings upward, and is held open by a latching device. To lock the baggage door, the handle is placed in the closed position and the handle is then locked by rotating a key lock, engaging a locking cam. With the locking cam in the locked position, removal of the key prevents the locking cam from moving. The original equipment key lock is designed so the key can only be removed when the locking cam is engaged. Investigation revealed that the original key lock on the airplane's forward baggage door had been replaced with an unapproved thumb-latch device. A Safety Board materials engineer's examination revealed evidence that a plastic guard inside the baggage compartment, which is designed to protect the door's locking mechanism from baggage/cargo, appeared not to be installed at the time of the accident. The airplane manufacturer's only required inspection of the latching system was a visual inspection every 100 hours of service. Additionally, the mechanical components of the forward baggage door latch mechanism were considered \"on condition\" items, with no predetermined life-limit. On May 29, 2008, the Federal Aviation Administration issued a safety alert for operators (SAFO 08013), recommending a visual inspection of the baggage door latches and locks, additional training of flight and ground crews, and the removal of unapproved lock devices. In July 2008, Piper Aircraft issued a mandatory service bulletin (SB 1194, later 1194A), requiring the installation of a key lock device, mandatory recurring inspection intervals, life-limits on safety-critical parts of forward baggage door components, and the installation of a placard on the forward baggage door with instructions for closing and locking the door to preclude an in-flight opening. Post accident inspection discovered no mechanical discrepancies with the airplane other than the baggage door latch. The airplane manufacturer's pilot operating handbook did not contain emergency procedures for an in-flight opening of the nose baggage door, nor did the operator's pilot training program include instruction on the proper operation of the nose baggage door or procedures to follow in case of an in-flight opening of the door. Absent findings of any other mechanical issues, it is likely the door locking mechanism was not fully engaged and/or the baggage shifted during takeoff, and contacted the exposed internal latching mechanism, allowing the cargo door to open. With the airplane operating at a low airspeed and altitude, the open baggage door would have incurred additional aerodynamic drag and further reduced the airspeed. The pilot's immediate turn towards the airport, with the now fully open baggage door, likely resulted in a sudden increase in drag, with a substantive decrease in airspeed, and an aerodynamic stall.", "probable_cause": "The failure of company maintenance personnel to ensure that the airplane's nose baggage door latching mechanism was properly configured and maintained, resulting in an inadvertent opening of the nose baggage door in flight. Contributing to the accident were the lack of information and guidance available to the operator and pilot regarding procedures to follow should a baggage door open in flight and an inadvertent aerodynamic stall."}