{"url": "https://www.baaa-acro.com/crash/crash-lockheed-ec-121r-super-constellation-korat-8-killed", "date": "Sep 6, 1969 at 1224 LT", "type": "Lockheed C-121 Super Constellation", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Korat - Korat", "msn": "4491", "yom": 1957, "flight_number": "Batcat 19", "city": "Korat", "zone": "Nakhon Ratchasima (นครราชสีมา)", "country": "Thailand", "region": "Asia", "crew_on_board": 16, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 4, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 5 September 1969, an EC-121R, Number 67-21495, callsign \"Batcat 19\", with aircrew number 40, from the 554th Recon Sq, Korat RTAFB, was scheduled for a combat tactical mission directed by 7th AF Frag Order number 69-248, mission number 1334. Scheduled mission briefing time was 1400G, taxi time 1600G, and take-off time 1630G for a flight from Korat RTAFB to the combat zone and return.  The crew complement consisted of sixteen combat qualified aircrew members; however, pertinent aircrew members and their positions include only the Aircraft Commander/Pilot - Lt Col. John L. Jones; Co-Pilot - 1st Lt Donald D. Thompson and Flight Engineer - S/Sgt Billie J. Black. The pre-mission briefing consisted of a standard 553d Recon Wg briefing. Major items covered during the briefing were the Frag Order, Weather, Special Operations, Intelligence, Aircrew Instructions and Emergency Instructions. The Special Operations briefing, presented by the 553d Recon Wg Tactical Operations Center (TOC) Duty Controller, contained items relative to the mission to be flown.  These items, along with the Intelligence briefing, Aircrew instructions and Emergency instructions are considered normal and are not relevant to the accident. The weather briefing was conducted by the base duty forecaster utilizing slides and telephone; his voice was being piped into the briefing room by means of a speaker system connected through the telephone circuit.  This briefing was standard and contained specific forecast data for Batcat 19's take-off time.  Furthermore, it included enroute weather, fragged orbit weather, enroute return hazards, orbit alternates and recovery weather. The return hazards, valid from scheduled take-off time plus ten hours, were briefed as isolated thunderstorms and rain showers. Recovery weather at Korat RTAFB, valid 06/0515G was briefed as: variable winds at two knots, seven miles visibility, two-eights stratus at twelve hundred feet, five-eights altostratus at twelve thousand feet, seven-eights cirrus at twenty-five thousand feet, ceiling twelve thousand feet, altimeter setting 29.78 inches. Upon completion of the formal pre-mission briefing, the aircrew proceeded to the 554 Recon Sq, Squadron Operations Center (SOC) to obtain, inventory and sign for the required crew mission kits.  Each aircrew member then proceeded to the 553d Wing Life Support Unit and obtained his personal survival gear. From here, the aircrew boarded a crew bus and proceeded to their assigned aircraft to conduct the pre-flight. Pre-flight duties were normal using the prescribed checklists and no discrepancies were noted.  Mission programmed fuel load was 8,050 gallons. Calculated take-off weight was 134,516 pounds with the center of gravity (CG) 24.8% MAC. Engines were started at 1550G and at 1600G the aircraft was taxied to the runup area.  At completion of engine runup, the crew chief performed a \"Last Chance\" walk around inspection of the aircraft.  The maintenance inspection complete, Batcat 19 then called the 553d Wing TOC for his final release to proceed with the fragged mission.  Prior to granting Batcat 19 his release, the TOC Duty Controller contacted the duty forecaster to check for any existing significant weather hazards located within the immediate vicinity of the airport. Information received by the Duty Controller was transmitted to the aircraft commander along with the Wing release to contact Korat Tower for take-off. Take-off was initiated at 1625G.  During climbout, the take-off time and estimated time to the assigned combat orbit was passed to the 553d Wing TOC.  The flight proceeded as briefed. From time of take-off until reporting leaving the combat area Batcat 19 relayed a total of twelve operations normal reports to the 553d Wing TOC. The flight to and within the combat area was uneventful, except for structural and engine icing which was reported as being light to moderate in intensity. Due to these icing conditions, Batcat 19 changed altitude a total of six times. The aircraft was in actual weather throughout most of the flight. Batcat 19 reported leaving the combat area 06/0356G for return to Korat with an estimated time of arrival of 0515G. Route of flight was as planned during pre-mission briefing. A Meteorological (Met.) Watch was issued by Korat base weather station to the 553d Wing TOC by Autowriter at 0411G. The 553d Wing TOC acknowledged receipt by telephone (hotline) at 0415G. This Met. Watch was transmitted to Batcat 19 with a request that the aircraft commander call TOC when 55 miles out. Shortly thereafter, Batcat 19 passed his maintenance status, reporting only one discrepancy.  The Radio Maintenance Technician (RMT) verified the problem as the DME not \"locking on\". He had changed sets a number of times and finally disconnected one of the antenna's. The TACAN was working properly upon return to Korat. The radio operator then requested to secure the High Frequency radios and TOC approved. Batcat 19 had reported his position to be one hundred nautical miles from Korat, at flight level ten thousand five hundred feet, and had requested Korat weather. The 06/0431G weather passed by the TOC Controller was; wind, from two four zero degrees at six knots, visibility one and one quarter miles with rain; two-eights stratus at four hundred; and two-eights stratus at one thousand two hundred feet; altimeter setting 29.76 inches. A reported ceiling of eight thousand feet was not transmitted. Pressure altitude was given as eight hundred eighty feet.  Batcat 19 questioned the intensity of the rain and TOC remarked that, \"It's coming down in buckets out there\". The aircraft commander stated that the last report he had was for light rain. He asked for clarification, requested a current weather report and was advised the latest weather report had just been passed to him. In addition, the controller remarked; \"It's raining pretty hard outside\". The aircraft commander then requested 553d Wing release. He was advised that the 553d Wing Assistant Supervisor of Flying was enroute to the Control Tower; that there was nothing significant to report except for visibility and ceiling, and that he was released to Korat Approach Control for \"a descent down to minimums\". Shortly thereafter, TOC advised Batcat 19 that weather, \"just advised us that it is raining light to moderate\". In addition he was provided the latest two hour forecast for Don Muang, Bangkok International Airport. This forecast was transmitted as winds out of the southwest at eight knots, visibility six plus miles, four eights stratocumulus at thirty-five hundred, three-eights altocumulus at ten thousand, with ceiling of ten thousand. Batcat 19 then asked the ceiling for Korat. It was passed as eight hundred feet. This was an error made the TOC Controller since the ceiling reported by the weather station at 0431G, 0456G, 0512G and 0527G was eight thousand feet. There were no further radio communications between TOC and Batcat 19. Batcat 19 made initial contact with Korat Approach Control as he was approximately fifty nautical miles east of the airport. The aircraft received radar vectors and descended to twenty-three hundred feet indicated altitude for a precision radar approach. He was thirteen nautical miles northeast of runway 24 when in position to begin his approach. The aircraft, during the approach, drifted left of course, and at a point between one mile and two miles from Runway 24 executed a missed approach. When queried by the Ground Control Approach (GCA) final controller as to the cause of the left drift, Batcat 19 reported as \"We were just having a little trouble in the rain out here\". Batcat 19 remained under radar control, completed a right closed radar pattern, and received vectors to a point approximately eleven miles on the final approach course for runway 24. Unlike the first approach, but with the aircraft commander's concurrence, the approach lights were turned on to maximum brilliance along with the sequenced flashing lights (strobe). The second precision approach appeared routine, with the aircraft generally on course, holding slightly above glide path until approximately one nautical mile from touch down. At decision  height, the aircraft (blanked out words) dropping down through the glide path.  The aircraft initially impacted the approach lights three thousand feet from the end of runway 24 at 0524G. It then struck the ground and eventually came to rest 1400' from the runway. Total flight time was twelve hours and fifty-nine minutes. Air Rescue was advised of the crash and location of the wreckage through the primary crash alert system initiated by tower personnel. The helicopter crew responded immediately, taking-off at 0530G. Upon arriving at the crash site, the helicopter pilot found that it was extremely difficult to locate obstacles in the area due to poor visibility resulting from extremely heavy rain and smoke. Realizing that soft ground and concertina wire would hinder firefighting equipment in reaching the wreckage, the helicopter returned to the ramp where a Fire Suppression Kit (FSK)was obtained. The helicopter then returned to the crash site.  The FSK was expended on the forward part of the aircraft fuselage. The helicopter ground crew searched the wreckage for survivors with negative results. Later, four survivors, located northeast of the wreckage were airlifted to the east end of runway 24 overrun where they were transferred to an ambulance. Helicopter operations, with the approval of the Fire Chief, were terminated at 0630G. Response by fire department personnel was effected at 0525G. Vehicles dispatched to the crash scene included to P-2's, one 011A, two fifteen hundred gallon water distributors, one R-2, and the Assistant Fire Chief's pickup truck. Once it had been determined that the crash site was located off-base, a 530B pumper was dispatched to the scene.  Fire equipment was unable to gain access to the immediate crash site because of the terrain, very heavy rain, darkness, concertina wire, a petroleum oil lubricant (POL) line and large drainage ditch. In the meantime, the HH-43B (Pedro) helicopter had arrived at the scene with the suppression kit and had exercised fire control.  However, due to the limited amount of extinguishing agent available, the fire could not be extinguished completely. Fire department personnel gained access to the site utilizing ladders that were placed across the concertina wire and drainage ditch. Nine hundred fifty feet of two and one half inch hose was physically carried from the P-2 to the crash site. Working in conjunction with the helicopter, firefighters managed to extinguish the fire and evacuate some of the inured. Since communications were not available between the helicopter and ground operations, coordination was effected between the two units by means of Korat Tower acting as a communications relay terminal. By the time the fire fighters physically reached the site, a majority of the aircrew members had either been thrown clear or had managed to evacuate the burning wreckage. Therefore, most of the survivors were located by voice contact. The four survivors carried to safety by the helicopter were originally found northeast of the wreckage and some distance away. One survivor was found in a hole with water up to his waist; two were found walking around, apparently in shock. Two bodies were recovered from the wreckage. Five aircrew members were located, and assisted away from the crash scene by other rescue personnel along with the recovery of the other two fatalities.  Four Thai Nationals in the route of aircraft travel were fatally injured. Rescue and crash response were terminated at 0815G.\r\nThose crew members killed were: \r\nMaj Joyful J. Jenkins, \r\nS/Sgt Gunther H. Rehling,\r\nSgt Julius C. Houlditch,\r\nSgt Arnold Noel Jaco.\r\nSource: Larry Westin via https://www.westin553.net/batcatTXT01/catfatl2.txt", "probable_cause": null}