{"url": "https://www.baaa-acro.com/crash/crash-fairchild-hiller-fh-227b-machault-24-killed", "date": "Mar 4, 1988 at 0637 LT", "type": "Fairchild-Hiller FH-227", "operator": "TAT", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Nancy - Paris", "msn": "546", "yom": 1967, "flight_number": "IJ5230", "city": "Machault", "zone": "Seine-et-Marne", "country": "France", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 21, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": 10226, "captain_hours_type": null, "copilot_hours": 4431, "copilot_hours_type": null, "aircraft_hours": 33142, "circumstances": "Following an uneventful flight from Nancy-Essey Airport, the crew started the descent to Paris-Orly Airport and was cleared to reduce his altitude to 6,000 feet. At that time, weather conditions were marginal with poor visibility due to fog. Suddenly, the aircraft pitched down and entered an uncontrolled descent with a rate of 16,000 feet per minute during the last 20 seconds. Out of control, the aircraft struck the metallic pylon of a high voltage powerline and eventually crashed at an excessive speed of 630 km/h in an open field located in Machault, about 46 km southeast of Paris-Orly Airport. The aircraft disintegrated on impact and all 24 occupants were killed. ", "probable_cause": "It was determined that the electrical system failed in flight while the crew was flying under IFR mode in IMC conditions. Technical analysis and investigations were unable to determine with certainty the exact cause of the loss of control and the fatal descent. After eliminating various assumptions invalidated by the established facts and findings and after reviewing the results of flight tests conducted at its request, the commission assigned higher probability to the hypothesis that the electrical fault caused a loss of attitude reference and autopilot disconnect which would have occurred while the aircraft was configured 'out of trim' in a nose down attitude. In the absence of independent standby horizon, the crew had no usable attitude reference immediately available while the aircraft was in a high-speed dive.\r\nThe following findings were reported:\r\n- The loss of control occurred in icing conditions, \r\n- A third person (non crew) aged 18 was seating in the cockpit at the time of the accident, \r\n- The aircraft's speed upon impact was 100 km/h above the max allowable speed certification. "}