{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3dst-318-near-marshall-19-killed", "date": "May 17, 1953 at 1415 LT", "type": "Douglas DC-3", "operator": "Delta-Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Dallas – Shreveport – Atlanta", "msn": "2224", "yom": 1940, "flight_number": "DL318", "city": "Marshall", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 17, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 19, "captain_hours": 7120, "captain_hours_type": 7120, "copilot_hours": 2114, "copilot_hours_type": 803, "aircraft_hours": 39000, "circumstances": "Flight 318 departed Dallas, Texas, on a VFR Flight Plan at 1310, on time, for Atlanta, Georgia, with a scheduled stop at Shreveport, Louisiana. The crew consisted of Captain Douglas B. yolk, First Officer James P. Stewart and Stewardess Joanne Carlson; there were 17 passengers including one infant. The aircraft’s gross weight on departure from Dallas was 24,099 pounds, which was within the allowable weight of 25,200 pounds, and the center of gravity was within the prescribed limits. Flight 318 proceeded normally and at 1352 reported to the company station at Longview, Texas, that it was then west of Gladewater, Texas. Longview gave the flight the latest Shreveport weather which was dark scattered clouds at 1,000 feet, ceiling estimated 4,000 feet broken clouds, overcast at 20,000 feet, visibility 10 miles, thunderstorms, light rain showers, wind south 10. Remarks were thunderstorms south, occasional lightning cloud to cloud south. The flight was also advised by the company’s Longview operator that he had been watching thunderstorms east and southeast of the Longview field and suggested that the flight stay well to the north. Flight 318 answered “OK.” At 1408, in the vicinity of Marshall, Texas, the flight made a routine radio contact with Delta’s Shreveport station, during which it was given the Shreveport altimeter setting of 29.78. At this time the flight advised it was changing over to the Shreveport Control Tower frequency. At about 1412, four minutes later, Flight 318 called the Shreveport Control Tower, which cleared it to make a right-hard turn for landing approach to Runway 13 and gave the wind as southeast 10 miles per hour, Flight 318 acknowledged this message and requested the Shreveport weather which was transmitted as dark scattered clouds at 1,000 feet, ceiling estimated 4,000 feet, overcast at 20,000 feet, visibility 10 miles, thunderstorm, light rain shower. The tower also advised of a thunderstorm approximately 15 miles west of Shreveport. This transmission also was acknowledged by the flight. At 1416 the Shreveport Control Tower asked Flight 318 to give a position report. No reply was received, and a number of unsuccessful attempts were then made to contact the flight. At 1428 the tower was advised that an aircraft had crashed near Marshall, Texas. A passenger was seriously injured while 19 other occupants were killed. The aircraft was destroyed. ", "probable_cause": "The Board determines that the probable cause of this accident was:\r\n- the encountering of conditions in a severe thunderstorm that resulted in loss of effective control of the aircraft, and\r\n- the failure of the captain to adhere to company directives requiring the avoidance of thunderstorms when conditions would allow such action. \r\nThe following findings were pointed out:\r\n- The carrier had prepared adequate written instructions against the unnecessary traversing of thunderstorms,\r\n- The captain should have had knowledge of these company instructions,\r\n- While en route, close to and approaching the storm, it was suggested to the captain by company ground personnel that he stay well to the north to avoid the thunderstorm,\r\n- The captain flew directly into the storm without changing course or altitude,\r\n- The captain while on an airway proceeded from VFR into IFR weather without first obtaining an appropriate IFR clearance,\r\n- A very intense localized thunderstorm, accompanied by frequent cloud-to-ground lightning, hail, heavy rain, turbulence, and high winds, was entered by the flight,\r\n- The flight met extraordinary conditions within the storm and was forced to the ground,\r\n- The carrier’s dispatching, pilot briefing and weather dissemination, were satisfactory."}