{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-241-near-sao-jose-do-xingu-12-killed", "date": "Sep 3, 1989 at 2045 LT", "type": "Boeing 737-200", "operator": "Varig.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "São Paulo – Marabá – Belém", "msn": "21006", "yom": 1975, "flight_number": "RG254", "city": "São José do Xingu", "zone": "Mato Grosso", "country": "Brazil", "region": "South America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 48, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 6928, "captain_hours_type": 980, "copilot_hours": 884, "copilot_hours_type": 442, "aircraft_hours": 33373, "circumstances": "Following a wrong flight preparation and erroneous computer setting regarding the route, the crew computerized 027° instead of 270°. After takeoff from Marabá Airport at 1725LT, the crew was cleared to climb to FL290 and maintained heading of 270° for 40 minutes.  The flight was then cleared to descend to FL200 by Belém ACC. However, the crew failed to find navigational aids and lost radio contact. Course was changed to 090 degrees as the aircraft further descended down to FL40. The crew then followed a river, heading 165 degrees. Because of the sunset and haze the pilot's had difficulty navigating. Also, they failed to establish radio contact on several frequencies and failed to find navaids in the area. After the crew found the NDB, both engines stopped due to fuel exhaustion. The captain elected to make an emergency landing when the aircraft crashed in the jungle about 60 km from São José do Xingu. Rescue teams arrived on site 44 hours later. 42 occupants were injured while 12 passengers were killed. The aircraft was destroyed. It appeared that the computerized flight plan used a four digit representation of the magnetic bearing with the last digit being a tenth of a degree without any decimal separator. A course of '027.0' was presented as '0270'.", "probable_cause": "A. Human Factor\r\n1) Physiological aspect - Did not contribute to the accident.\r\n2) Psychological aspect - The following psychological variables contributed to the accident:\r\na) Misleading perception - In the reading of the plan and incorrect heading insertion by the commander.\r\nb) Reinforcement - In the reading and incorrect heading insertion by the co-pilot and heading conference placed by the commander.\r\nc) Marginal attention and level of attention - The non-recognition of conditions that would mean being far from the objective: request for \"VHF bridge\" when other aircraft were talking normally with the Control; \"reception\" of commercial stations, and non-receipt of destination NDB, etc.\r\nd) Predisposition - Maintaining the urge to go to the established objective (Belém).\r\ne) Predisposition duration - Maintenance of FL040 for a long time.\r\nf) Reinforcement of predisposition - Reception of boundaries when selecting Belem's radio frequencies.\r\ng) Attention Fixing - Permanent search for headings, radio contacts or river contours, as an alternative, to reach the fixed goal.\r\nh) Blocks - Delays in identifying the initial headings error and plotting itself in navigation.\r\ni) Geographical position error.\r\nB. Material Factor - Did not contribute to the accident.\r\nC. Operational Factor\r\n1) Poor supervision - Inadequate graphical representation of the Computer Flight Plan.\r\n2) Poor cockpit coordination - No supervision of cockpit activities. Actions were not supervised, but imitated.\r\n3) Poor support staff - Lack of radio contact by the operator's Flight Coordination with the aircraft in flight, after the significant landing delay in Belém, thus breaking the chain of events of the accident.\r\n4) Pilot aspect characterized by environmental influence - Difficulties of visualization due to sunset and dry fog: Radio aid markings received from great distances, originating from the ionospheric propagation of electromagnetic waves.\r\n5) Pilot aspect characterized by poor planning - Lack of route letters to cross the flight plan information.\r\n6) Pilot aspect characterized by poor judgment - Inadequate evaluation and use of radio-navigation equipment, resulting in the pursuit of markings without causing tuning and identification.\r\n7) Pilot aspect characterized by other operational factors - Operational doctrine firming."}