{"url": "https://www.baaa-acro.com/crash/crash-learjet-25d-gulf-mexico-2-killed", "date": "May 19, 1980 at 1205 LT", "type": "Learjet 25", "operator": "Northeast Jet", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "West Palm Beach - New Orleans", "msn": "25-271", "yom": 1979, "flight_number": null, "city": "Gulf of Mexico", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 15740, "captain_hours_type": 6062, "copilot_hours": 4116, "copilot_hours_type": 65, "aircraft_hours": 1200, "circumstances": "The aircraft crashed into the Gulf of Mexico while en route to New Orleans, Louisiana, from West Palm Beach, Florida. Only the pilot and copilot were on board the aircraft. About 2 1/2 minutes after the aircraft was reported at Flight Level 430 in the vicinity of the Covia Intersection on Airway J58, the Jacksonville, Florida, Air Route Traffic Control Center received an unusual staccato sound transmission over the frequency, followed 18 seconds later by a report from the copilot, \"Can't get it up...it's in a spin...\" About 33 seconds after the first staccato sounds, radio and radar contact with N125NE was lost about 104 miles west of Sarasota, Florida. Floating debris were located by a search aircraft and later recovered; the flightcrew was not found. There were no known witnesses to the crash. ", "probable_cause": "An unexpected encounter with moderate to severe clear air turbulence, the flightcrew's improper response to the encounter, and the aircraft's marginal controllability characteristics when flown at and beyond the boundary of its high altitude speed envelope, all of which resulted in the aircraft exceeding its Mach limits and a progressive loss of control from which recovery was not possible. Contributing to the accident was the disconnection of the Mach overspeed warning horn with an unauthorized cut-out switch which resulted in the absence of an overspeed warning that probably delayed the crew's response to the turbulence encounter, and the insonsistencies in aircraft flight manuals and flightcrew training programs regarding the use of spoilers to regain control."}