{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6a-shemya-6-killed", "date": "Jul 21, 1961 at 0211 LT", "type": "Douglas DC-6", "operator": "Alaska%20Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Everett – Travis – Anchorage – Shemya – Tachikawa", "msn": "45243", "yom": 1958, "flight_number": "CKA779", "city": "Shemya", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 13019, "captain_hours_type": 1118, "copilot_hours": 2061, "copilot_hours_type": 101, "aircraft_hours": 10600, "circumstances": "Flight CKA779 was a Military Air Transport Service (MATS) contract flight. It originated at Everett-Paine AFB, WA (PAE), on July 20, 1961, and proceeded to Fairfield-Travis AFB, CA (SUU). At Travis AFB 25,999 pounds of cargo was loaded. The flight then departed Travis and flew non-stop to Anchorage, Alaska. At Anchorage, the crew received weather and NOTAM information for the flight to Shemya AFB, AK (SYA), which did not include the approach or field lighting deficiencies. The stop at Shemya was for the purpose of servicing the aircraft before proceeding to Tachikawa AB, Japan for refueling. The flight took off from Anchorage at 19:40 and proceeded routinely toward Shemya. The flight made contact with Shemya Radio at 00:45. It was flying at FL100 between layers of clouds. At 01:28 the crew reported 100 miles east of Shemya, estimating Shemya at 01:55. Shemya Radio cleared the flight inbound to Shemya Homer and to descend and maintain 5,500 feet. At 01:45, the flight contacted Shemya GCA and radar contact was made approximately 18 miles north-northeast of Shemya, at 5,500 feet. The GCA controller transmitted the following weather information: \"Indefinite ceiling 200 feet; sky obscured, visibility one mile in fog; new altimeter 29.86.\" According to the GCA controller, the DC-6 intercepted the glide path for runway 10 properly and maintained a good course. When two miles from touchdown, it dropped approximately 10 to 25 feet below the glide path. At one mile out, the flight went an estimated 30 to 40 feet below the glide path, which was still well above the minimum safe altitude for the approach. When the flight, was over the approach lights, it started to descend rapidly. The aircraft struck an embankment, approx. 200 feet short of the threshold in a nearly level attitude, the nose wheel touching first, about 18 feet below the crest, very nearly aligned with the centerline of the runway. The aircraft slid up the embankment during impact and when it reached the crest, broke in two at the leading edge of the wings. The fuselage, wings, and tail section stopped and settled back on the slope. The powerplants, nose section, and the bulk of the cargo slid varying distances toward the runway and up on it for a distance of about 100 yards. Fire followed impact and the majority of the wreckage was consumed.", "probable_cause": "The absence of approach and runway lights, and the failure of the GCA controller to give more positive guidance to the pilot during the last stages of his approach."}