{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-14p-copenhagen-23-killed", "date": "Aug 15, 1957 at 0630 LT", "type": "Ilyushin II-14", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Moscow – Riga – Copenhagen", "msn": "1460 006 07", "yom": 1956, "flight_number": "SU103", "city": "Copenhagen", "zone": "Hovedstaden", "country": "Denmark", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 18, "pax_fatalities": 18, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": 14000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While descending to Copenhagen-Kastrup Airport, the crew encountered poor weather conditions with low clouds, fog and a limited visibility. At 0617LT, the airplane passed over the Kastrup Airfield at an altitude of 1,500 meters and ATC instructed the crew to start a new approach to runway 12. Due to language difficulties, the crew did not understand properly some of the instructions. Nevertheless, four minutes later, he started an approach to runway 12. Due to low visibility, the captain reduced his altitude in an attempt to establish a visual contact with the ground when the airplane hit the chimney of the Ørsted Electric Factory located 6,7 km short of runway 12. Upon impact, the right wing was sheared off and the airplane crashed into the Sydhavnen canal. The airplane sank by 5 meters depth and all 23 occupants were killed, among them one Danish, 2 British, one American and three West-German citizens. ", "probable_cause": "It was determined that the crew continued the approach under VFR in IFR conditions and that the pilot-in-command reduced his altitude below the minimum prescribed altitude to establish a visual contact with the ground until the right wing contacted an obstacle. Russian investigators considered that the ATC assistance was insufficient, that weather information transmitted to the crew was incomplete and that the landing clearance was given too early as the crew had two hours fuel reserve and that they should wait for weather improvement. "}