{"url": "https://www.baaa-acro.com/crash/crash-hesa-iran-140-100-tehran-40-killed", "date": "Aug 10, 2014 at 0921 LT", "type": "HESA IrAn-140-100", "operator": "Sepahan-Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tehran – Tabas", "msn": "90-05", "yom": 2008, "flight_number": "SPN5915", "city": "Tehran-Mehrabad", "zone": "Tehran City District", "country": "Iran", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 42, "pax_fatalities": 34, "other_fatalities": 0, "total_fatalities": 40, "captain_hours": 9478, "captain_hours_type": 2000, "copilot_hours": 572, "copilot_hours_type": 400, "aircraft_hours": 1405, "circumstances": "On August 10,2014, at 04:52 UTC daylight time, an AN-140-100 aircraft , Iranian registration EP-GPA ( MSN 90-05), operated by Sepahan Airlines flight # 5915, experienced engine number 2 shutdown just about 2 seconds before lift-off and crashed shortly after take-off nearby Mehrabad International Airport (THR), TEHRAN; IR. Of IRAN; the aircraft was on lift off from runway 29L. The airplane was completely destroyed by impact forces and post-crash fire. Fatality incorporates 34 of the 40 passengers; 4 of the 4 flight attendants, and 2 of the 2 flight crewmembers. The 11 passengers received serious injuries, which finally as a result of that accident there are 40 fatalities and 8 passengers recovered from injury. Sepahan Airline was operating under the provisions of CAO.IRI operational requirement for commercial air transport. Before the accident flight the airplane dispatch from Isfahan and arrived at Tehran about 03:30. The dispatcher and PIC perform the load calculation using the aircraft FM performance charts. Because of load limitation for 15° flap position, load sheet change and re-write with 10° flap position and re-calculated MTOM. The aircraft was enrouted to Airport Tabbas Visual meteorological conditions (VMC) prevailed, and an instrument flight rules (IFR) flight plan was filed. Figure 1 below is a map showing the location of the accident and the aircraft flight path. Figure 2 shows THR runway 29L SID and figure 3 show timeline of event in the flight path. According to overview of flight crew performance, it is indicated that the crewmembers were provided with the flight release paperwork, which included weather information, notices to airmen (NOTAM), and the flight plan. ", "probable_cause": "The accident investigation team determined that the main cause of this accident was combination of:\r\n1. Electronic engine control (SAY-2000) failure simultaneously with engine No: 2 shutdown, just about 2 seconds before aircraft lift-off.\r\n2. AFM Confusing performance chart resulted the pilots relying on performance calculation that, significantly over-estimate the aircraft MTOM.\r\nContributing Factors to the accident were:\r\n1. Aircraft flight manual unclear procedure, including the procedure for calculating maximum allowable take-off weight, VR and V2 and ambiguity in the climb segment definition and applications.\r\n2. Crew performance, including:\r\n- PIC rotated the aircraft at the speed of about 219 km/h (whereas 224 km/h is the speed recommended by the AFM table 4.2.3),\r\n- The crew failed to perform the manual propeller feathering procedure for the failed engine,\r\n- The PIC's decision to fly with the aircraft, notwithstanding, had about 190 kgf overweight,\r\n- Aircraft fuel was about 500 kg more than required fuel for the accident flight.\r\n3. The appearance of negative thrust from the unfeathered propeller blades at takeoff were not considered during the aircraft certification tests, as it was considered improbable. However, in\r\nthe accident flight the negative thrust did appear and affected the flight performance. "}