{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-near-boynton-beach-1-killed", "date": "Jun 8, 2013 at 1002 LT", "type": "Cessna 340", "operator": "Paul S. Soule Enterprises", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Fort Lauderdale – Leesburg", "msn": "340A-0435", "yom": 1978, "flight_number": null, "city": "Boynton Beach", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 16561, "captain_hours_type": 56, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4209, "circumstances": "Four minutes after taking off on an instrument flight rules flight, during an assigned climb to 4,000 feet, the pilot advised the departure air traffic controller that the airplane was having \"instrument problems\" and that he wanted to \"stay VFR\" (visual flight rules), which the controller acknowledged. As directed, the pilot subsequently contacted the next sector departure controller, who instructed him to climb to 8,000 feet. The pilot stated that he would climb the airplane after clearing a cloud and reiterated that the airplane was having \"instrument problems.\" The controller told the pilot to advise when he could climb the airplane. About 30 seconds later, the pilot told the controller that he was climbing the airplane to 8,000 feet, and, shortly thereafter, the controller cleared the airplane to 11,000 feet, which the pilot acknowledged. Per instruction, the pilot later contacted a center controller, who advised him of moderate-to-heavy precipitation along his (northbound) route for the next 10 miles and told him that he could deviate either left or right and, when able, proceed direct to an intersection near his destination. The pilot acknowledged the direct-to-intersection instruction, and the controller told the pilot to climb the airplane to 13,000 feet, which the pilot acknowledged. The pilot did not advise the center controller about the instrument problems. The airplane subsequently began turning east, eventually completing about an 80-degree turn toward heavier precipitation, and the controller told the pilot to climb to 15,000 feet, but the pilot did not respond. After two more queries, the pilot stated that he was trying to maintain \"VFR\" and that \"I have an instrument failure here.\" The controller then stated that he was showing the airplane turning east, which \"looks like a very bad idea.\" He subsequently advised the pilot to turn to the west but received no further transmissions from the airplane. Radar indicated that, while the airplane was turning east, it climbed to 9,500 feet but that, during the next 24 seconds, it descended to 7,500 feet and, within the following 5 seconds, it descended to just above ground level (the ground-based radar altitude readout was 0 feet). The pilot recovered the airplane and climbed it northeast-bound to 1,500 feet during the next 20 seconds. It then likely stalled and descended northwest-bound into shallow waters of a wildlife refuge. Weather radar returns indicated that the airplane's first descent occurred in an area of moderate-to-heavy rain but that the second descent occurred in light rain. The ceiling at the nearest recording airport, located about 20 nautical miles from the accident site, was 1,500 feet, indicating that the pilot likely climbed the airplane back into instrument meteorological conditions (IMC)before finally losing control. The investigation could not determine the extent to which the pilot had planned the flight. Although a flight plan was on file, the pilot did not receive a formal weather briefing but could have self-briefed via alternative means. The investigation also could not determine when the pilot first lost situational awareness, although the excessive turn to the east toward heavier precipitation raises the possibility that the turn likely wasn't intentional and that the pilot had already lost situational awareness. Earlier in the flight, when the pilot reported an instrument problem, the two departure controllers coordinated between their sectors in accordance with air traffic control procedures, allowing him to remain low and out of IMC. Although the second controller told the pilot to advise when he was able to climb, the pilot commenced a climb without further comment. The controller was likely under the impression that the instrument problem had been corrected; therefore, he communicated no information about a potential instrument problem to the center controller. The center controller then complied with the level of service required by advising the pilot of the weather conditions ahead and by approving deviations. The extent and nature of the deviation was up to the pilot with controller assistance upon pilot request. The pilot did not request further weather information or assistance with deviations and only told the center controller that the airplane was having an instrument problem after the controller pointed out that the airplane was heading into worsening weather. Due to impact forces, only minimal autopsy results could be determined. Federal Aviation Administration medical records indicated that the 16,560-hour former military pilot did not have any significant health issues, and the pilot's wife was unaware of any preexisting significant medical conditions. The wreckage was extremely fractured, which precluded thorough examination. However, evidence indicated that all flight control surfaces were accounted for at the accident scene and that the engines were under power at the time of impact. The airplane was equipped with redundant pilot and copilot flight instruments, redundant instrument air sources, onboard weather radar, and a storm scope. The pilot did not advise any of the air traffic controllers about the extent or type of instrument problem, and the investigation could not determine which instrument(s) might have failed or how redundant systems could have been failed at the same time. Although the pilot stated on several occasions that the airplane was having instrument problems, he opted to continue flight into IMC. By doing so, he eventually lost situational awareness and then control of airplane but regained both when he acquired visual ground contact. Then, for unknown reasons, he climbed the airplane back into IMC where he again lost situational awareness and airplane control but was then unable to regain them before the airplane impacted the water.", "probable_cause": "The pilot's loss of situational awareness, which resulted in an inadvertent aerodynamic stall/spin after he climbed the airplane back into instrument meteorological conditions (IMC). Contributing to the accident was the pilot's improper decision to continue flight into IMC with malfunctioning flight instrument(s). "}