{"url": "https://www.baaa-acro.com/crash/crash-casa-212-aviocar-300df-robinson-crusoe-island-21-killed", "date": "Sep 2, 2011 at 1748 LT", "type": "Casa 212 Aviocar", "operator": "Fuerza-Aerea-de-Chile", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Santiago - Robinson Crusoe Island", "msn": "443", "yom": 1994, "flight_number": null, "city": "Robinson Crusoe Island", "zone": "Región de Valparaíso", "country": "Chile", "region": "South America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 17, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Santiago de Chile-Comodoro Arturo Merino Benítez (Pudahuel) Airport on a special flight to Robinson Crusoe Island, carrying 17 passengers and a crew of four. The flight was organized by NGO's in cooperation with the Chilean National Television to see the progress of the reconstruction on the island of Robinson Crusoe following the 2010 earthquake. Among the occupants were members of the National Television and also from the Council of Culture. The famous Chilean television icon Felipe Camiroaga Fernández was among the passengers. Following an almost 3-hour flight, the crew completed a low pass over the runway 14 then started the approach to runway 32 from the sea. At an altitude of about 650 feet, the aircraft entered an uncontrolled descent, rolled to the left to an angle of 90° and impacted the sea. Debris were found floating on water and the main wreckage was later found about one km southeast from the airport. All 21 occupants were killed. \n\r\nPersonnel from the Chilean Air Force: \r\nLt Carolina Fernández Quinteros,\r\nLt Juan Pablo Mallea Lagos,\r\n1st Sgt Eduardo Jones San Martín,\r\n1st Cpl Eduardo Estrada Muñoz,\r\n2nd Cpl Flavio Oliva Pino,\r\n2nd Cpl Erwin Núñez Rebolledo,\r\nCdt Rodrigo Fernández Apablaza,\r\nJosé Cifuentes Juica.\n\r\nCouncil of Culture:\r\nGalia Diaz Riffo,\r\nRomina Irarrázabal Faggiani.\n\r\nChilean National Television: \r\nFelipe Camiroaga Fernández,\r\nRoberto Bruce Pruzzo,\r\nSylvia Slier Munoz,\r\nCaroline Gatica Aburto,\r\nRodrigo Cabezón de Amesti.\n\r\nMembers of the 'Desafío Levantemos Chile' NGO:\r\nFelipe Cubillos Sigall,\r\nSebastián Correa Murillo,\r\nCatalina Vela Montero,\r\nJoel Lizama Nahuelhual,\r\nJorge Palma Calvo,\r\nJoaquín Arnolds Reyes.", "probable_cause": "The accident was caused by the loss of control of the airplane while performing the tailwind leg through the channel between the islands of Robinson Crusoe and Santa Clara to an estimated height of 650 feet or less, during the circuit approach to Runway 32 in a very low trajectory (with little height difference above the runway), where very adverse airflow conditions were found, including wind shear, which exposed the crew to extreme flight conditions.\r\nAdverse airflow conditions were the results of a combination of different factors, including:\r\n- Very unstable atmosphere, with strong turbulence and possibly eventually powerful down gusts arising from the presence of open cells after a front passed,\r\n- The presence of the two counter-rotating vortexes in the Santa Clara Island downwind wake,\r\n- The presence of strong and gusty crosswinds that were very variable in strength and direction in a very short time."}