{"url": "https://www.baaa-acro.com/crash/crash-avro-652-anson-i-riverston-4-killed", "date": "Apr 28, 1939", "type": "Avro 652 Anson", "operator": "Royal-Australian-Air-Force-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Richmond - Richmond", "msn": "1027", "yom": 1937, "flight_number": null, "city": "Riverston", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Avro Anson A4-32 of 6 Squadron RAAF left Richmond airfield at 1240LT on a flight that was expected to last less than 3 hours. This was part of an Air Navigation course they were being trained in. The particular exercise for this flight was a wind finding direction course over the sea. The weather was clear and fine and weather conditions in no way contributed to the crash which ultimately happened. After leaving Richmond Airfield the Avro Anson was flown out to sea in the vicinity of Smith Head, Sydney. The crew maintained constant radio communication with the airfield and the flight proceeded without incident until approximately 1530LT. At 1527LT, a radio message was received from the aircraft to the effect that the aerial was being reeled in preparatory to landing. At that time the aircraft was within a few miles of the airfield and within a few minutes of landing. This was the last message received from the aircraft. At 1530LT Avro Anson A4-32 crashed into the ground. There were several eye witnesses. It would appear the aircraft was flying in normal level flight at about 1,000 feet when eye witnesses heard some spluttering from the engines along with the noises of backfiring and puffs of smoke were seen coming from the aircraft. The nose of the Avro Anson dropped to an angle of 30 degrees and it started to lose height. Eye witnesses then indicated they could hardly hear the noise of the engines but they then made a sudden roaring noise and the nose pulled up again. But then it went into a steeper dive and crashed directly into the ground with its engines roaring. All four crew who were performing a training flight were killed.\r\nCrew:\r\nMaxwell Leonard Hickson, pilot and navigator,\r\nLloyd George Harness, pilot,\r\nRaymond Duncan Knight, wireless operator, \r\nHarrie Clarke, fitter armourer.\n\r\nSource: http://www.ozatwar.com/ozcrashes/nsw164.htm", "probable_cause": null}