{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130h-hercules-eindhoven-34-killed", "date": "Jul 15, 1996 at 1802 LT", "type": "Lockheed C-130 Hercules", "operator": "Force-Aerienne-Belge", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rimini - Eindhoven", "msn": "4473", "yom": 1972, "flight_number": "610", "city": "Eindhoven", "zone": "North Brabant", "country": "Netherlands", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 37, "pax_fatalities": 30, "other_fatalities": 0, "total_fatalities": 34, "captain_hours": 2102, "captain_hours_type": 1436, "copilot_hours": 582, "copilot_hours_type": 138, "aircraft_hours": 10914, "circumstances": "The aircraft was chartered by the Dutch Air Force (Koninklijke Luchtmacht) to fly the Dutch Air Force's brass band from Italy back to the Netherlands. The transport plane arrived at Verona-Villafranca at 13:33. Forty passengers boarded the plane and at 15:04 the Hercules took off from Villafranca for a short flight to Rimini, where it landed at 15:31. Three passengers deplaned at Rimini and the Hercules was back in the air at 15:55 heading for Eindhoven. The Hercules descended into Eindhoven and contacted Eindhoven Tower at 18:00. Eindhoven Tower cleared the flight for the approach: \"Okay, you may continue descent for 1000, as number one in traffic, for a direct final course runway 04, QNH 1027.\" After reported the runway in sight, the Hercules was cleared to land: \"610 is cleared to land runway 04, the wind from 360° 10 knots.\" Possibly as a result of the presence of a large number of birds near the runway, the copilot initiated a go around. Birds were ingested by both left hand engines (n°1 and 2), causing both engines to lose power. For reasons unknown the crew shut down engine n°3 and feathered the propeller. The plane then turned left and crashed off the left side of the runway. Within seconds a fire erupted which was fed by the oxygen from the airplane's oxygen system. Some emergency exits in the main cabin were unreachable because of the fire while other exits could not be opened because of twisting of the fuselage. The fact that there were a large number of passengers on board the plane was not immediately clear tot the fire fighters. It took some 23 minutes before passengers were noted in the main cabin.", "probable_cause": "The accident was initiated, most probably as a reaction to observing birds, by the go-around which was made at a low altitude during which a flock of birds could no longer be evaded. \r\nThe accident became inevitable when:\r\n- Bird ingestion in the two left engines occurred due to which the power of these two engines was lost,\r\n- As a result of power loss, the aircraft became uncontrollable at a very low altitude and crashed.\r\nThe relative low experience of the crew was a contributing factor. "}