{"url": "https://www.baaa-acro.com/crash/crash-hawker-800xp-scottsdale", "date": "Mar 14, 2020 at 1600 LT", "type": "Hawker 800XP", "operator": "Gemini%20Air%20Group", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rogers – Scottsdale", "msn": "258747", "yom": 2005, "flight_number": null, "city": "Scottsdale", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9150, "captain_hours_type": 650, "copilot_hours": 10556, "copilot_hours_type": 52, "aircraft_hours": 4823, "circumstances": "The pilot stated that, upon landing, the airplane touched down on the runway centerline with light and variable wind conditions. The pilot recalled that the touchdown felt normal but that, during the landing roll, the airplane began to veer to the right. The pilot added full left rudder, but the airplane continued to veer off the runway surface and encountered large rocks located between the runway and taxiway. A postaccident operational check of the nosewheel steering system revealed no mechanical malfunctions or anomalies that would have precluded normal operation. The left nosewheel tire was not adequately inflated and was worn to the point at which the cord was exposed; the right nosewheel tire was within tolerances. Also, one-third of the rim was absent on the left nosewheel tire outer wheel half. The available evidence precluded a determination of whether the imbalance between the nosewheel tires contributed to the control problem on the runway. It could also not be determined if the left nosewheel tire damage occurred before the touchdown or as a result of the accident sequence.", "probable_cause": "The pilot’s inability to maintain directional control during landing for undetermined reasons, which resulted in a runway excursion. "}