{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154a-near-malabo-45-killed", "date": "Jun 1, 1976 at 0748 LT", "type": "Tupolev TU-154", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Luanda – Malabo – N’Djamena – Tripoli – Moscow", "msn": "75A102", "yom": 1975, "flight_number": "SU418", "city": "Malabo", "zone": "Bioko Norte Province (Malabo)", "country": "Equatorial Guinea", "region": "Africa", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 35, "pax_fatalities": 35, "other_fatalities": 0, "total_fatalities": 45, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2119, "circumstances": "While flying at an altitude of 4,200 metres from Luanda to Malabo, the crew received the last weather briefing for Malabo Airport and was cleared to descent for a landing on runway 05. ATC requested the crew to report once runway 05 in sight and the crew gave his ETA four minutes later at 0752LT. While approaching at an altitude of 750 metres and at a speed of 490 km/h, the airplane struck the south slope of Mt San Carlos located 48 km southwest of Malabo Airport. The wreckage was sighted by the pilot of the personal helicopter of the Equatorial Guinea President five days later, on June 6. SAR teams were dispatched and arrived on scene on June 18 only. The aircraft was totally destroyed by impact forces and a post crash fire and all 45 occupants have been killed. ", "probable_cause": "The exact cause of the accident could not be determined with certainty. ATC assistance was considered as good, all necessary information were transmitted to the crew and ATC was not the cause of the accident. The assumption that the aircraft radar was not operating at the time of the accident was not ruled out. Possible erroneous calculation on part of the crew may cause the aircraft to descent prematurely and to fly on the wrong path to runway 05. In consequence, the accident may be the result of a controlled flight into terrain. "}