{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6b2-h4-turbo-porter-near-ndundu-1-killed", "date": "Aug 9, 2008 at 2000 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "Associated-Mission-Aviation-2", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Wamena - Ndundu", "msn": "903", "yom": 1994, "flight_number": null, "city": "Ndundu", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4624, "captain_hours_type": 2275, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6321, "circumstances": "On the Saturday 9 August 2008, a Pilatus Porter PC-6 B2-H4 aircraft, registered PK-RCZ, operated by AMA (Association of Mission Aviation) on a charter flight from Wamena, Papua, to Taive II, Papua departed at 1000 UTC. The aircraft was to pick up a medical patient from Taive II. After landing and unloading cargo at Taive II, the aircraft departed from Taive II for NduNdu, Papua, at 1106 with an estimated time of arrival of 1113. The flight was to be operated in accordance with the visual flight rules (VFR), remaining clear of cloud and navigating visually. When the aircraft had not arrived by 1213, the Wamena authorities decided to search for the aircraft. Three operators assisted the search; Association of Mission Aviation (AMA), Mission Aviation Fellowship (MAF), and Yajasi. They all reported hearing PK-RCZ’s emergency locator transmitter (ELT) signal, but were unable to reach the crash site due to the weather conditions. At 2020 (0520 local time on Sunday 10 August), the aircraft wreckage was found at an elevation of 6,400 feet at the coordinates 03° 26’ 08” S, 138° 21’ 58” E, in the area of NduNdu Pass, on the aircraft’s planned track. The crash site was about 200 feet to the left (east) of the southerly track across the Pass, on the slope of an 11,000 foot mountain. The coordinates and elevation of the lowest point in the NduNdu Pass were\r\n03° 26’ 26” S, 138° 21’ 22” E and 5,700 feet. The pilot, the sole occupant, was fatally injured. \n", "probable_cause": "The pilot continued the flight into cloud and did not initiate action to maintain visual flight conditions. The sector of the flight across the mountain pass was not conducted in conformance with the visual flight rules, and the pilot was did ensure that the aircraft remained clear of the terrain."}