{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-200-pacific-ocean", "date": "Mar 16, 1995 at 0515 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Great%20Barrier%20Airlines", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Oakland – Honolulu – Majuro – Suva – Auckland", "msn": "207", "yom": 1969, "flight_number": null, "city": "Pacific Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1100, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed overweight for a 17-hour ferry flight. Early in the flight the crew experienced some fuel problems and decided to continue when they resolved the problem. The crew indicated the en route winds were close to forecast. The ferry fuel system is a simple 5- tank gravity fuel feed into the fore and aft main tanks. About 6 hours from destination, they realized the ferry tanks were not flowing into the main tanks as planned. They began manually transferring fuel from the rear ferry tank to the forward ferry tank, and shut down the right engine to reduce fuel consumption. This did not stop the negative fuel flow from the main tanks. At the time of ditching, the crew estimated the fuel remaining in the ferry tanks was about 170 gallons, most of which was in the 3 aft ferry tanks. An aero engineer calculated that the aircraft was at least 10 inches behind the maximum aft cg at the time of ditching, and suggested that the ferry fuel system was not managed to maintain the cg within the allowable limits, a task made more difficult with the rear fuselage cargo.", "probable_cause": "Intentional ditching due to the flightcrew's failure to properly manage the fuel system, and operation of the airplane in an excessively overweight condition. "}