{"url": "https://www.baaa-acro.com/crash/crash-britten-bn-2a-8-norman-islander-culebra-1-killed", "date": "Oct 6, 2013 at 0603 LT", "type": "Britten-Norman Islander", "operator": "Air%20Flamenco", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Vieques - Culebra", "msn": "239", "yom": 1971, "flight_number": null, "city": "Culebra Island", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1650, "captain_hours_type": 1100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 22575, "circumstances": "The commercial, instrument-rated pilot of the multiengine airplane was conducting a newspaper delivery flight in night visual meteorological conditions. After two uneventful legs, the pilot departed on the third leg without incident. Radar data indicated that, after takeoff, the airplane flew over open water at an altitude of about 100 to 200 ft toward the destination airport and then climbed to 2,400 ft. Shortly thereafter, the pilot performed a 360-degree left turn, followed by a 360-degree right turn while the airplane maintained an altitude of about 2,400 ft, before continuing toward the destination airport. Less than 2 minutes later, the airplane began a rapid descending left turn and then collided with water. The wreckage was subsequently located on the sea floor near the airplane's last radar target. Both wings, the cabin, cockpit, and nose section were destroyed by impact forces. The wreckage was not recovered, which precluded its examination for preimpact malfunctions. The airplane had been operated for about 25 hours since its most recent inspection, which was performed about 3 weeks before the accident. The pilot had accumulated about 1,650 hours of total flight experience, which included about 1,100 hours in the accident airplane make and model. Although the pilot conducted most of his flights during the day, he regularly operated flights in night conditions. The pilot's autopsy did not identify any findings of natural disease significant enough to have contributed to the accident. In addition, although toxicological testing detected ethanol in the pilot's cavity blood, it likely resulted from postmortem production.", "probable_cause": "The pilot's failure to maintain airplane control for reasons that could not be determined because the wreckage was not recovered."}