{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-65-queen-air-pioneer-6-killed", "date": "Jun 30, 1991 at 0911 LT", "type": "Beechcraft 65 Queen Air", "operator": "Richard E. Stahl", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Modesto – South Lake Tahoe", "msn": "LC-35", "yom": 1960, "flight_number": null, "city": "Pioneer", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 2830, "captain_hours_type": 27, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4958, "circumstances": "A Beech 65 collided with trees in mountainous terrain after an inflight loss of control. A pilot observed the airplane start a turn to the right, roll right and continued until inverted and enter into a spin. The aircraft was in a steep nose down attitude when it began its pull out. The engines were heard by a ground witness who initially mistook them for an approach motorcycle. The pilot initially flew the aircraft 45 days before the accident and logged 3.5 dual instruction hours. There was no record in the pilot's logbook of any additional flight training since the initial flight. The pilot satisfactorily completed a before in a Cessna 150 four days before the accident. Examination of the wreckage disclosed the right engine had broken exhaust valve, but the left propeller was feathered. There were no preexisting mechanical malfunctions or failures found with the left engine. The aircraft was destroyed and all six occupants were killed.  ", "probable_cause": "Improper emergency procedures by the pilot, when he inadvertently shut down the left engine after encountering a partial loss of power in the right engine. Factors related to the accident were: improper installation of the right engine's #6 exhaust valve seat by other maintenance personnel, fatigue failure of the #6 exhaust valve, and the pilot's lack of familiarity with the aircraft."}