{"url": "https://www.baaa-acro.com/crash/crash-atr42-300-near-balikpapan", "date": "Feb 11, 2010 at 1150 LT", "type": "ATR42-300", "operator": "Trigana%20Air2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Tanjung Redep - Samarinda", "msn": "50", "yom": 1987, "flight_number": "TGN162", "city": "Balikpapan", "zone": "East Kalimantan", "country": "Indonesia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 46, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12000, "captain_hours_type": null, "copilot_hours": 2000, "copilot_hours_type": null, "aircraft_hours": 34414, "circumstances": "On 11 February 2010, an Avions de Transport Regional ATR 42-300 aircraft, registered PK-YRP, was being operated by Trigana Air Service on a scheduled passenger service between Kalimarau Airport Berau (BEJ) and Samarinda (SRI) as flight TGN162. There were 52 persons on board; two pilots, one engineer, two flight attendants, one flight dispatcher and 46 passengers (43 adults, one child, and two infants). The aircraft departed from Berau at 0230 UTC1 and climbed to Flight Level 140. Balikpapan approach cleared the crew to track from en-route Way Point LOLOT direct to Samarinda. After transferring to Temindung Tower, Samarinda, the crew was cleared to track direct to left downwind for runway 04. The controller informed them that the wind was 060/12 knots. The crew did not report any abnormalities and the aircraft operation appeared to be normal. During the final approach for runway 04, the left ECU light illuminated followed by low oil pressure and torque indications. The Pilot in Command decided to go around, divert to Balikpapan, and carry out the QRH engine shut-down procedure. They commenced the climb to 4000 ft with the left engine inoperative. Approximately 16 Nm from Balikpapan Airport, while climbing through 3,800 feet, the right ECU light illuminated, immediately followed by low oil pressure and low torque indications. The right engine then failed. The crew broadcast a MAYDAY to Balikpapan Approach and decided to conduct a forced landing into a clear field in the Samboja area, about 16 Nm from the Balikpapan Airport. The PIC gave instructions to the Flight Attendant to prepare the passengers for an emergency landing. After the aircraft came to a stop the PIC initiated an evacuation.\n", "probable_cause": "The both engine were lack of fuel before flame out, it was indicated the fuel management was out of control during flight that might be a misleading of fuel quantity indication. The proper analysis could not be carried out due to both FDR and CVR were un-operated."}