{"url": "https://www.baaa-acro.com/crash/crash-pilatus-u-28a-cannon-afb-3-killed", "date": "Mar 14, 2017 at 1835 LT", "type": "Pilatus PC-12", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cannon - Cannon", "msn": "724", "yom": 2006, "flight_number": "Demise 25", "city": "Cannon AFB (Clovis)", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3400, "captain_hours_type": 3199, "copilot_hours": 448, "copilot_hours_type": 213, "aircraft_hours": null, "circumstances": "On 14 Mar 17, at 1835 local time (L), a U-28A, tail number 0724, crashed one-quarter mile south of Clovis Municipal Airport (KCVN), New Mexico (NM). This aircraft was operated by the 318th Special Operations Squadron, 27th Special Operations Wing, Cannon Air Force Base (AFB), NM. The aircraft was destroyed and all three crewmembers died upon impact. The Mishap Aircraft (MA) departed Cannon AFB at 1512L for tactical training over Lubbock, Texas, followed by pilot proficiency training at KCVN. The Mishap Crew (MC) entered Lubbock airspace at 1545L, completed their tactical training, and departed Lubbock airspace at 1735L enroute to KCVN. The MC entered the KCVN traffic pattern at 1806L, where they conducted multiple approaches and landings prior to executing the mishap maneuver, a practice turnback Emergency Landing Pattern (ELP). The MC entered the practice turnback ELP with 0° flaps led to increased aircraft nose-down attitudes and higher descent rates required to maintain a safe angle of attack versus a comparative 15° flap approach. In addition, 0° flap stall speeds are higher than 15° flap stall speeds – 15 to 25 knots higher for the range of bank angles flown by the MC during the practice turnback ELP. The MC was also late to achieve the bank angle required to enable the MA to align with the extended centerline for the runway resulting in an overshoot condition. The MC attempted to arrest their excessive nose-down attitude, descent rate, and shallow bank angle by pulling back on the aircraft yoke and increasing bank angle. The g-load from the MC pull back, coupled with the MA's increased bank angle, slowed the MA airspeed below 0° flap stall speed and it departed controlled flight. Subsequent power increase and flight control inputs would not have enabled the aircraft to recover from the stall within remaining altitude. After entering the stall, the MC increased power; however, it was not enough to overcome the MA descent rate. At no point during the practice turnback ELP did the MA performance reflect a MC intent to abort the maneuver. The MA impacted the ground with a 13° nose-high, 7° left-wing low attitude. The aircraft was destroyed upon impact and all three occupants were killed. \r\nCrew:\r\nCpt Andrew Becker, pilot,\r\n1st Lt Frederick Dellecker, copilot,\r\nCpt Kenneth Dalga, combat systems officer.", "probable_cause": "By a preponderance of the evidence, the Accident Investigation Board concluded the aircrew lost control of the aircraft when it entered a stall at low altitude during a turn back Emergency Landing Pattern procedure. There were no indications of mechanical malfunction. The board also surmised the crew delayed actions necessary to prevent the aircraft from entering the stall envelope and failed to accurately assess increasing risk throughout execution of the practice turn back Emergency Landing Pattern, thereby substantially contributing to the mishap.\n"}