{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-260-bahar-dar-35-killed", "date": "Sep 15, 1988 at 1305 LT", "type": "Boeing 737-200", "operator": "Ethiopian%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Addis Ababa - Bahar Dar - Asmara", "msn": "23914", "yom": 1987, "flight_number": "ET604", "city": "Bahar Dar", "zone": "Amhara", "country": "Ethiopia", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 98, "pax_fatalities": 35, "other_fatalities": 0, "total_fatalities": 35, "captain_hours": 19936, "captain_hours_type": 449, "copilot_hours": 9447, "copilot_hours_type": null, "aircraft_hours": 1377, "circumstances": "Ethiopian Airlines flight 604, a Boeing 737-200, was a scheduled service from Addis Ababa to Bahar Dar and Asmara. The first leg of the flight was uneventful. At 09:50, the engines were started normally and the airplane was taxied to its take-off position. The flight crew reported that In order to gain additional thrust they elected not to use engine bleed air during take-off. The airplane accelerated at a normal rate during the take-off roll and passed V1 (take-off-reject) speed. As the airplane passed V1 and very near VR (rotation speed) the flight crew saw a flock of pigeons lifting up from the left side. At this time the captain took over control from the copilot and pulled up. Almost immediately after rotation, the airplane struck the flock of pigeons at an airspeed of 146 knots and altitude of 5730 feet above mean sea level. Loud bangs were heard. The captain then called for gear up and the copilot complied. At approximately 100-200 ft. above the ground, both engines started backfiring. At this time, the flight crew reported that they experienced a considerable power loss and the airplane started mushing down at which time the captain \"fire walled\" the thrust levers. The engines reportedly responded and the airplane began to gain some altitude. The gain in attitude encouraged the captain to make a right turn away from Lake Tana and back to the take-off runway for landing. During the initial 32 seconds after the impact, the airplane had gained altitude from 5,730 feet to 6,020 feet and had accelerated from 146 knots to 154 knots. The crew report further indicated that both engines continued to surge and the exhaust gas temperature gauges (EGT) were reading at the top extreme and the engine pressure ratio (EPR) gauge readings were fluctuating at about 1.6. During this time the captain reported that the he reduced engine thrust to prolong the operational life of the engines. The frequency of the surges decreased with engines power reduction. The airplane entered an approximate 90 degree right turn. Altitude remained constant 6,020 feet while its airspeed increased from 154 knots to 162 knots. The airplane then began another right turn and entered the downwind leg of the return to runway 04. Altitude had increased to 6,410 feet and airspeed to 173 knots. On the downwind leg the aircraft further climbed to 7,100 feet. Then, within a timeframe of about five seconds, both engines lost power completely. The copilot pointed out a cleared area slightly ahead and to the right. The captain then turned towards the clearing and performed a gear-up landing. The aircraft broke up and a fire erupted. Out of the 104 occupants, 35 suffered fatal injuries.", "probable_cause": "The accident occurred because the airplane could not be safely returned to the runway after the internal destruction and subsequent failure of both engines to operate arising from multiple bird ingestion by both engines during take-off."}