{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b90-king-air-longmont", "date": "Jan 23, 1997 at 2050 LT", "type": "Beechcraft 90 King Air", "operator": "Fayard%20Enterprises", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Louisberg – Louisville – Vandalia – Longmont", "msn": "LJ-498", "yom": 1970, "flight_number": null, "city": "Longmont", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1310, "captain_hours_type": 42, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10530, "circumstances": "The pilot had made a refueling stop at Vandalia, Illinois. She did not observe the refueling process, but the FBO also operated a King Air and she felt he knew the proper procedure to follow. The airplane was reportedly serviced with 235 gallons of Jet-A fuel (total capacity is 384 gallons). The pilot flew between 7,500 and 10,500 feet. When the airplane was 45 minutes from its destination, the fuel transfer pump lights illuminated, indicating the wing tanks were empty. The nacelle tank gauges registered 3/4 full and the pilot determined she had sufficient fuel to complete the flight. When the airplane was three minutes from its destination, both engines flamed out and the pilot made a wheels up forced landing. When the salvage company recovered the airplane, they reported finding no evidence of fuel aboard. The pilot was provided and used performance charts for the Beech 65-A90 instead of the Beech B90.", "probable_cause": "Failure of the pilot to refuel the airplane, resulting in fuel exhaustion. Factors were the pilot's reference to similar but different aircraft performance charts, and the operator's failure to provide the pilot with the proper performance charts. "}