{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-palwaukee-4-killed", "date": "Jan 30, 2006 at 1829 LT", "type": "Cessna 421B Golden Eagle II", "operator": "H K Golden Eagle Inc.", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Olathe - Palwaukee", "msn": "421B-0884", "yom": 1974, "flight_number": null, "city": "Chicago-Executive (Palwaukee)", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1284, "captain_hours_type": 33, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5437, "circumstances": "The airplane was destroyed and the occupants fatally injured when it impacted the ground during approach to landing. Examination of the airplane, its engines and propellers, revealed no anomalies that were determined to have existed prior to impact. The propellers were found to have been in their normal operating range and neither propeller was in a feathered position. The quill shafts of both engines showed evidence of damage due to the production of torque. A sound spectrum examination of audio transmissions showed signatures that both engines were operating during the last two radio transmissions from the airplane. Based on radar data, communications and meteorological information obtained during the investigation, the airplane was operating in visual meteorological conditions below an overcast layer of clouds. The radar data showed the airplane as it approached the airport and as it entered a left hand traffic pattern for runway 34. Radio communications confirmed that the airplane had been cleared for a left hand traffic pattern to runway 34. The radar data showed the airplane as it made a turn to the left while its speed decreased to about 82 knots calibrated airspeed as of the last received radar return. This radar return was about 0.1 nautical miles from the accident site and 0.8 nautical miles and 216 degrees from the approach end of runway 34. The airplane owner's manual listed stall speeds ranging from 81 to 94 knots calibrated airspeed for airplane configurations including gear and flaps up to gear down and flaps 15 degrees, and bank angles from 0 to 40 degrees. Flap position could not be determined because the flap chain had separated from the flap drive motor. The owner's manual also listed an approach speed of 103 knots.", "probable_cause": "The pilot's failure to maintain airspeed during the landing approach which led to an inadvertent stall and subsequent uncontrolled descent and impact with the ground."}