{"url": "https://www.baaa-acro.com/crash/crash-angel-aircraft-corporation-model-44-angel-mareeba-2-killed", "date": "Dec 14, 2019 at 1115 LT", "type": "Angel Aircraft Corporation Model 44 Angel", "operator": "Anju Azul Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Mareeba - Mareeba", "msn": "004", "yom": 2008, "flight_number": null, "city": "Mareeba", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 20000, "captain_hours_type": 300, "copilot_hours": 5029, "copilot_hours_type": 0, "aircraft_hours": 1803, "circumstances": "On 14 December 2019, at 1046 Eastern Standard Time, an Angel Aircraft Corporation Model 44 aircraft, registered VH-IAZ, commenced taxiing at Mareeba Airport, Queensland. On board the aircraft were two pilots. The pilot in the left seat (‘the pilot’) owned the aircraft and was undertaking a flight review, which was being conducted by the Grade 1 flight instructor in the right seat (‘the instructor’). The planned flight was to operate in the local area, as a private flight and under visual flight rules. As the aircraft taxied towards the runway intersection, the pilot broadcast on the common traffic advisory frequency (CTAF) that VH-IAZ was taxiing for runway 28. The pilot made another broadcast when entering and backtracking the runway, then at 1058, broadcast that the aircraft had commenced the take-off roll. Witnesses who heard the aircraft during the take-off reported that it sounded like one of the engines was hesitating and misfiring. An aircraft maintainer who observed the aircraft take off, reported seeing black sooty smoke trailing from the right engine. The maintainer then watched the aircraft climb slowly and turn right towards the north. Another witness who heard the aircraft in flight soon afterwards, reported that it sounded normal for that aircraft, which had a distinctive sound because the engines’ exhaust gases pass through the propellers. Once airborne, the pilot broadcast that they were ‘making a low-level right-hand turn and then climbing up to not above 4,500 [feet] for the south-west training area.’ About 2 minutes later, the instructor broadcast that they were just to the west of the airfield in the training area at 2,500 ft and on climb to 4,000 ft, and communicated with a helicopter pilot operating in the area. After 8 minutes in the training area, the pilot broadcast that they were inbound to the aerodrome. At 1112, the aircraft’s final transmission was broadcast by the pilot, advising that they were joining the crosswind circuit leg for runway 28. Witnesses then saw the aircraft touch down on the runway and continue to take off again, consistent with a ‘touch-and-go’ manoeuvre, and heard one engine ‘splutter’ as the aircraft climbed to an estimated 100–150 ft above ground level. At about 1115, the aircraft was observed overhead a banana plantation beyond the end of the runway, banked to the right in a descending turn, before it suddenly rolled right. Witnesses observed the right wing drop to near vertical and the aircraft impacted terrain in a cornfield. Both pilots were fatally injured and the aircraft was destroyed.", "probable_cause": "Contributing factors:\r\n• The flight instructor very likely conducted a simulated engine failure after take-off in environmental conditions and a configuration in which the aircraft was unable to maintain altitude with one engine inoperative.\r\n• Having not acted quickly to restore power to the simulated inoperative engine, the pilots did not reduce power and land ahead (in accordance with the Airplane Flight Manual procedure) before the combination of low airspeed and bank angle resulted in a loss of directional control at a height too low to recover.\r\n• The instructor had very limited experience with the aircraft type, and with limited preparation for the flight, was likely unaware of the landing gear and flap retraction time and the extent of their influence on performance with one engine inoperative.\n\r\nOther factors that increased risk:\r\n• The pilot had not flown for 3 years prior to the accident flight, which likely resulted in a decay in skills at managing tasks such as an engine failure after take-off and in decision-making ability. The absence of flying practice before the flight review probably affected the pilot’s ability to manage the asymmetric low-level flight.\r\n• The aircraft had not been flown for more than 2 years and had not been stored in accordance with the airframe and engine manufacturers’ recommendations. This very likely resulted in some of the right engine cylinders running with excessive fuel to air ratio for complete combustion and may also have reduced the expected service life of both engines’ components.\r\n• The right-side altimeter was probably set to an incorrect barometric pressure, resulting in it over-reading the aircraft’s altitude by about 90 ft."}