{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-188a-electra-dawson-85-killed", "date": "May 3, 1968 at 1548 LT", "type": "Lockheed L-188 Electra", "operator": "Braniff", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Houston - Dallas - Memphis", "msn": "1099", "yom": 1959, "flight_number": "BN352", "city": "Dawson", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 80, "pax_fatalities": 80, "other_fatalities": 0, "total_fatalities": 85, "captain_hours": 10890, "captain_hours_type": 1380, "copilot_hours": 2568, "copilot_hours_type": 1820, "aircraft_hours": 20958, "circumstances": "Braniff Flight 352 departed Houston (HOU) at 16:11 for a flight to Dallas (DAL) and climbed to FL200. Some 25 minutes into the flight, the L-188A Electra was approaching an area of severe thunderstorm activity. The crew requested a descent to FL150 and a deviation to the west. ARTCC then advised the crew that other aircraft were deviating to the east. The Electra crew still thought it looked all right on the west and were cleared to descend to FL140 and deviate to the west. At 16:44 the flight was further cleared to descend to 5000 feet. At 16:47 the aircraft had apparently encountered an area of bad weather, including hail, and requested (and were cleared for) a 180° turn. Subsequent to the initiation of a right turn, the aircraft was upset. During the upset, N9707C rolled to the right to a bank angle in excess of 90° and pitched nose-down to approximately 40 degrees. A roll recovery maneuver was initiated and the aircraft experienced forces of 4,35 g. Part of the right wing failed and the aircraft broke up at an altitude of 6750 feet and crashed in flames a little later. There was no survivor among the 85 occupants.", "probable_cause": "The stressing of the aircraft structure beyond its ultimate strength during an attempted recovery from an unusual attitude induced by turbulence associated with a thunderstorm. The operation in the turbulence resulted from a decision to penetrate an area of known severe weather."}