{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-teterboro-4-killed", "date": "May 24, 1988 at 0316 LT", "type": "Learjet 35", "operator": "United Executive Jet", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Teterboro - Morristown", "msn": "35-148", "yom": 1978, "flight_number": null, "city": "Teterboro", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 8910, "captain_hours_type": 759, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4735, "circumstances": "Witnesses reported a normal takeoff. Radar indicated the aircraft turned right as cleared and began cruise at 1900 feet, heading northwest at 235 knots. 65 seconds after calling clear of the control zone the aircraft's radar track ended. The aircraft was fragmented by the impact with all flight control surfaces and aircraft extremities found at the impact site. Pitch trim was found in the normal cruise setting with gear, flaps, and spoilers in the retracted position. Examination of the engines indicated operation at impact. Aircraft struck the terrain in approx 80° nose down, wings level attitude and heading opposite to the previous direction of flight. In flight simulator tests, with the aircraft initially in level flight at 1,900 feet and then rolled inverted and the pitch control moved aft, the aircraft attitude was similar to the attitude at impact. There were two unauthorized passengers on board, one was the copilot's wife. The impact point was in a very small region of uncontrolled airspace very near the copilot's and relative's homes. The copilot was new to jet operations. The aircraft departed with several discrepancies uncleared. All four occupants were killed. ", "probable_cause": "Occurrence #1: in flight collision with terrain/water\r\nPhase of operation: maneuvering\r\nFindings\r\n1. (f) light condition - dark night\r\n2. (c) maneuver - attempted - pilot in command\r\n3. (c) judgment - poor - pilot in command\r\n4. (c) altitude - misjudged - pilot in command\r\n5. (f) lack of total experience in type operation - pilot in command\r\n6. (f) lack of total experience in type operation - copilot/second pilot\r\n7. Operation with known deficiencies in equipment - attempted - company maintenance personnel"}