{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-200-east-midlands", "date": "Jan 18, 1987 at 1415 LT", "type": "Fokker F27 Friendship", "operator": "British%20Midland%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "East Midlands - East Midlands", "msn": "10241", "yom": 1963, "flight_number": null, "city": "East Midlands", "zone": "Leicestershire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8345, "captain_hours_type": 2983, "copilot_hours": 5220, "copilot_hours_type": 572, "aircraft_hours": 38487, "circumstances": "The BMA Fokker F-27 aircraft was engaged on crew training at East Midlands Airport (EMA). The commander, who was an experienced training captain, occupied the right pilot's seat and a first officer undergoing training for conversion to captaincy occupied the left seat as handling pilot. Another captain refreshing on type sat on the jump seat behind the pilots' seats, the intention being that he should move into the left seat after the first officer's training period. The weather was: wind 150 degrees at 7 kts, visibility 4 km and cloud 7 oktas stratus, base 1000 feet. The surface temperature was 2 °C and the QNH 1030. The training session began with a practice abandoned takeoff after which the aircraft took off at 13:08 and flew three practice ILS approaches followed by touch-and-go landings on runway 09, climbing to 2000 feet above mean sea level (amsl) after each takeoff. The runway in use was then changed and the aircraft flew a simulated asymmetric ILS approach to runway 27 followed by a missed approach (go-around) with the left engine throttled back. The runway was then changed again and an ILS approach to runway 09 was flown with the left engine still throttled back. This approach was followed by a touch-and-go landing during which both engines were brought up to full power. Very soon after becoming airborne the training captain again simulated failure of the left engine and the aircraft was climbed to 2000 feet amsl. Soon after the aircraft levelled off, the handling pilot commented on the large amount of rudder required to counteract the simulated failure of the left engine after takeoff. The training captain then said that he was deliberately putting more drag on the left side than would have been the case if the propeller had auto-feathered so that the climb performance corresponded better with that of an aircraft with passengers on board. He went on to say that if the handling pilot could cope with that extra drag, he could expect to control the aircraft if the failed engine auto-feathered because the rudder pedal force would then not be quite so great. The crew then began a procedural NDB approach to runway 09, for which instrument screens were fitted in front of the handling pilot. It was intended that the aircraft should be landed after the NDB approach for the pilot in the jump seat to take over as handling pilot. Decision altitude for the approach was 740 feet and touchdown altitude was 305 feet. It was company practice for beacon passage to be identified by the movement of the radio compass needle and, as the aircraft passed about one third of a mile north of the marker beacon inbound, descending through approximately 1300 feet amsl, the handling pilot said \"Over the beacon now\". No audio signal from the marker beacon was heard on the cockpit voice recorder. The landing checklist was completed during the following 20 seconds, including confirmation that the undercarriage was down, fuel heaters were off, two blue propeller lights were illuminated and fuel was trimmed up. 48 seconds after passing the beacon the aircraft reached decision altitude, and the training captain asked the handling pilot \"How long and where is it?\", to which the handling pilot replied \"Got about a minute and ten seconds to go - should be straight in front\". 22 seconds later and some 36 seconds before impact the training captain said \"Why are we at 650 feet?\" and pointed out that the handling pilot had allowed the aircraft to descend below decision altitude when he was, for training purposes, still in IMC. The handling pilot responded by saying \"Intend going around then\", or words to that effect. The training captain then said \"Yes, well I'll let you see it now. There it is\". As the training captain was saying this, the sound of an engine power increase was heard on the CVR, and, about 25 seconds before impact, the rpm of one engine was increased to 14,800 rpm, a setting 200 rpm below maximum continuous power. 10 seconds later the training captain was heard to say \"Hang on, that's the - that's the field there. See it?\" The handling pilot then said \"Hold tight\", at which point, some 13 seconds before impact, the CVR recorded the sound of another engine increasing power to 14,800 rpm. A moment later the handling pilot said \"Haven't got it\", and the training captain said \"I've got it\". The F-27 yawed to the left before banking steeply to the right. The aircraft struck the ground on the northern side of the Castle Donington motor racing circuit in a nose-down attitude, banked to the left and with considerable left sideslip. After the accident an accumulation of mixed rime and glaze ice was found on the leading edges of the wings and tail surfaces which had formed rough-surfaced horns one inch high above and below the airflow stagnation point. No ice was found on the flaps or landing gear.", "probable_cause": "The probable cause of the accident was that the aircraft became uncontrollable at an airspeed well above both its stalling speed and minimum control speed because its flying and handling characteristics were degraded by an accumulation of ice. The decision by the training captain not to operate the airframe de-icing system was an underlying cause but he could not have been expected to foresee this at the time. A contributory factor was that the operating crew allowed the airspeed to fall below the normal approach speed during the latter stages of the approach."}