{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-molokai-20-killed", "date": "Oct 28, 1989 at 1837 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Aloha%20Island%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Kahului - Molokai", "msn": "400", "yom": 1973, "flight_number": "WP1712", "city": "Molokai", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 18, "pax_fatalities": 18, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": 3542, "captain_hours_type": 1668, "copilot_hours": 425, "copilot_hours_type": 189, "aircraft_hours": 19875, "circumstances": "De Havilland DHC-6, N707PV (Aloha Islandair flight 1712), collided with mountainous/hilly terrain near Halawa Bay, HI, while en route on a scheduled passenger flight at night from Maui to Molokai, HI. Impact occurred at an elevation of about 500 feet, shortly after the aircraft had descended over water, then crossed the shoreline. There was evidence that the captain had made a navigational error and mistakenly believed that he was circumnavigating the northern portion of Molokai Island. The aircraft crashed while on a heading that was parallel with the island's northern shoreline. Low clouds obscured the mountain tops in the area of the accident. There was also evidence of inadequate supervision of personnel, training and operations by Aloha Islandair management and insufficient oversight of Aloha Islandair by the FAA during a period of Aloha Islandair's rapid operational expansion. All 20 occupants were killed.  ", "probable_cause": "The airplane's controlled flight into terrain as a result of the decision of the captain to continue flight under visual flight rules at night into instrument meteorological conditions (IMC), which obscured rising mountainous terrain. Contributing to the accident was: the inadequate supervision of personnel, training, and operations by aloha islandair management and insufficient oversight of Aloha Islandair by the Federal Aviation Administration particularly during a period of rapid operational expansion."}