{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-krasnoyarsk-3-killed", "date": "Jan 20, 1995 at 1913 LT", "type": "Let L-410", "operator": "Abakan Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Krasnoyarsk - Abakan", "msn": "79 03 16", "yom": 1979, "flight_number": null, "city": "Krasnoyarsk-Yemelyanovo (Severny)", "zone": "Krasnoyarsk Krai", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 17, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After liftoff from runway 30 at Krasnoyarsk-Iemilianovo Airport, while climbing at a speed of 165 km/h, the aircraft encountered difficulties to gain height. It collided with 25 metres tall trees located about 1,000 metres past the runway end, rolled to the right and crashed in a wooded area, some 450 metres to the right of the extended centerline. Both pilots and a passenger were killed.  ", "probable_cause": "A two-fold decrease in the operating mode of the starboard engine during takeoff, caused by the actuation of the limiting system of the starboard engine and caused, most likely, with the achievement of MCR limit values, or with a failure that caused the system to be connected with the issuance of a false signal to reduce the speed of the gas generator. The activation of the system according to the MCR should have been preceded by its connection to work, which could have occurred as a result of an out-of-order connection of the limiter unit with the automatic protection circuit breakers AZRGK TSEBO turned off or when taking off with the AZRGK TSEBO turned on. The manifestation of a refusal in this flight could be facilitated by shortcomings in the activities of the ATB personnel of the Abakan aviation enterprise.  Also, the decision of the crew to takeoff while the total weight of the aircraft was 280 kilos above MTOW. "}