{"url": "https://www.baaa-acro.com/crash/crash-consolidated-lb-30-liberator-near-ngaoundere-8-killed", "date": "Feb 19, 1952 at 1430 LT", "type": "Consolidated LB-30 Liberator", "operator": "Société de Transports Aériens Alpes Provence - STAAP", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "N'Gaoundéré - N'Gaoundéré", "msn": "12", "yom": null, "flight_number": null, "city": "N'Gaoundéré", "zone": "Adamaoua", "country": "Cameroon", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 6087, "captain_hours_type": 395, "copilot_hours": 2698, "copilot_hours_type": 33, "aircraft_hours": 7465, "circumstances": "The crew was engaged in a local test flight after the engine number four was changed. The airplane left N'Gaoundéré Airport at 1250LT. The captain made profit of this flight to improve the skills of the copilot who should be promoted as captain. While cruising in good weather conditions, the aircraft banked left, dove into the ground and crashed about 37 km southwest of N'Gaoundéré. As the airplane failed to come back to its base, SAR operations were conducted and the wreckage was found in an isolated area a day later. All eight occupants have been killed. ", "probable_cause": "The accident was caused by a collision with trees and the airplane was banking substantially to the left. The cause of this could not be specified due to lack of evidence due to the destruction of the wreck. Certain facts for which a specific explanation could not be found were: \r\n- Extension of the duration of the flight,\r\n- Radio silence,\r\n- Stopping of engine number four, \r\n- Pitch of the propeller on engine three.\r\nAbove all these findings, it was established that the crew was flying at low height few minutes before the accident according to the testimony of farmer. The reason for this could not be determined with certainty. "}