{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-tampa-2-killed", "date": "Mar 18, 2016 at 1130 LT", "type": "Cessna 340", "operator": "Ninerxray Inc.", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tampa – Pensacola", "msn": "340A-0436", "yom": 1978, "flight_number": null, "city": "Tampa-Peter O’Knight", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5195, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3963, "circumstances": "The airline transport pilot and pilot-rated passenger were departing on an instrument flight rules (IFR) cross country flight from runway 4 in a Cessna 340A about the same time that a private pilot and pilot rated passenger were departing on a visual flight rules repositioning flight from runway 36 in a Cessna 172M. Visual meteorological conditions prevailed at the airport. The runways at the nontowered airport converged and intersected near their departure ends. According to a witness, both airplanes had announced their takeoff intentions on the airport's common traffic advisory frequency (CTAF), which was not recorded; the Cessna 340A pilot's transmission occurred about 10 to 15 seconds before the Cessna 172M pilot's transmission. However, the witness stated that the Cessna 172M pilot's transmission was not clear, but he was distracted at the time. Both occupants of the Cessna 172M later reported that they were constantly monitoring the CTAF but did not hear the transmission from the Cessna 340A pilot nor did they see any inbound or outbound aircraft. Airport video that captured the takeoffs revealed that the Cessna 172M had just lifted off and was over runway 36 approaching the intersection with runway 4, when the Cessna 340A was just above runway 4 in a wings level attitude with the landing gear extended and approaching the intersection with runway 36. Almost immediately, the Cessna 340A then began a climbing left turn with an increasing bank angle while the Cessna 172M continued straight ahead. The Cessna 340A then rolled inverted and impacted the ground in a nose-low and left-wing-low attitude. The Cessna 172M, which was not damaged, continued to its destination and landed uneventfully. The Cessna 340A was likely being flown at the published takeoff and climb speed of 93 knots indicated airspeed (KIAS). The published stall speed for the airplane in a 40° bank was 93 KIAS, and, when the airplane reached that bank angle, it likely exceeded the critical angle of attack and entered an aerodynamic stall. Examination of the Cessna 340A wreckage did not reveal any preimpact mechanical malfunctions that would have precluded normal operation. Because of a postcrash fire, no determination could be made as to how the radios and audio panel were configured for transmitting and receiving or what frequencies were selected. There were no reported discrepancies with the radios of the Cessna 172M, and there were no reported difficulties with the communication between the Cessna 340A and the Federal Aviation Administration facility that issued the airplane's IFR clearance. Additionally, there were no known issues related to the CTAF at the airport. Toxicological testing detected unquantified amounts of atorvastatin, diphenhydramine, and naproxen in the Cessna 340A pilot's liver. The Cessna 340A pilot's use of atorvastatin or naproxen would not have impaired his ability to hear the radio announcements, see the other airplane taking off on the converging runway, or affected his performance once the threat had been detected. Without an available blood level of diphenhydramine, it could not be determined whether the drug was impairing or contributed to the circumstances of the accident.", "probable_cause": "The intentional low altitude maneuvering during takeoff in response to a near-miss with an airplane departing from a converging runway, which resulted in an exceedance of the airplane's critical angle of attack and a subsequent aerodynamic stall.\n"}