{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900c-block-island-3-killed", "date": "Dec 28, 1991 at 2146 LT", "type": "Beechcraft 1900C", "operator": "Business%20Express", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Bridgeport - Bridgeport", "msn": "UB-049", "yom": 1985, "flight_number": null, "city": "Block Island", "zone": "Rhode Island", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 5628, "captain_hours_type": 2200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11265, "circumstances": "The purpose of the flight was to prepare two first officers for a captain upgrade flight. The instructor pilot disabled the student's attitude indicator during flight, and the student had difficulty maintaining airplane control. During a simulated instrument approach, while in the procedure turn, the instructor simulated an engine failure in addition to the attitude indicator failure. The student asked the instructor to take control of the airplane because he became disoriented, however, the instructor refused. The investigation revealed that the instructor would turn his own flight instrument lights to the 'dim' position when the student was flying so that he could not 'peek' at the operable attitude indicator. Examination of the wreckage revealed that the instructor's light rheostat was in the dim position. The accident occurred over the ocean, on a moonless night. Neither the operator, nor the FAA were aware that this instructor was using Block Island for training, or what training methods he was employing.  ", "probable_cause": "The instructor pilot's loss of altitude awareness and possible spatial disorientation, which resulted in the loss of control of the airplane at an altitude too low for recovery; and company management's lack of involvement in and oversight of its beechcraft 1900 flight training program. Contributing to the accident was the instructor pilot's exercise of poor judgment in establishing a flight situation and airplane configuration conducive to spatial disorientation that afforded the pilots little or no margin for error.  "}