{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-catawba-6-killed", "date": "Jul 1, 2017 at 0153 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Sky King Flying Service", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Waukegan – Winnipeg", "msn": "421C-0698", "yom": 1979, "flight_number": null, "city": "Catawba", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 2335, "captain_hours_type": 70, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The commercial pilot of the multi-engine airplane was conducting an instrument flight rules cross-country flight at night. The pilot checked in with air traffic control at a cruise altitude about 10,000 ft mean sea level (msl). About 31 minutes later, the pilot reported that he saw lightning off the airplane's left wing. The controller advised the pilot that the weather appeared to be about 35 to 40 miles away and that the airplane should be well clear of it. The pilot responded to the controller that he had onboard weather radar and agreed that they would fly clear of the weather. There were no further communications from the pilot. About 4 minutes later, radar information showed the airplane at 10,400 ft msl. About 1 minute later, radar showed the airplane in a descending right turn at 9,400 ft. Radar contact was lost shortly thereafter. The distribution of the wreckage, which was scattered in an area with about a 1/4-mile radius, was consistent with an in-flight breakup. The left horizontal stabilizer and significant portions of both left and right elevators and their respective trim tabs were not found. Of the available components for examination, no pre-impact airframe structural anomalies were found. Examination of the engines and turbochargers did not reveal any pre-impact anomalies. Examination of the propellers showed evidence of rotation at impact and no pre-impact anomalies. Review of weather information indicated that no convection or thunderstorms were coincident with or near the airplane's route of flight, and the nearest convective activity was located about 25 miles west of the accident site. Autopsy and toxicology testing revealed no evidence of pilot impairment or incapacitation. Given the lack of radar information after the airplane passed through 9,400 ft, it is likely that it entered a rapid descent during which it exceeded its design stress limitations, which resulted in the in-flight breakup; however, based on the available information, the event that precipitated the descent and loss of control could not be determined.", "probable_cause": "A loss of control and subsequent in-flight breakup for reasons that could not be determined\r\nbased on the available information."}