{"url": "https://www.baaa-acro.com/crash/crash-quest-kodiak-100-sentani-1-killed", "date": "May 12, 2020 at 0628 LT", "type": "Quest Kodiak 100", "operator": "Missionary%20Aviation%20Fellowship-2", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Jayapura - Mamit", "msn": "100-0026", "yom": 2009, "flight_number": null, "city": "Jayapura-Sentani", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1357, "captain_hours_type": 185, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4707, "circumstances": "On 12 May 2020, a Quest Kodiak 100 aircraft, registration PK-MEC, was being operated by Mission Aviation Fellowship (MAF) as a cargo flight from Sentani Airport (WAJJ), Jayapura, Papua with intended destination of Mamit Airstrip (WAVS) Tolikara, Papua. The pilot was the only person on board for this flight and the aircraft carried 694 kgs of cargo goods. At 0622 LT (2122 UTC), the pilot of PK-MEC aircraft requested clearance to the Sentani Tower controller to start aircraft engine and flying to Mamit at radial 241° with intended cruising altitude 10,000 feet. The Sentani Tower controller approved the request. At 0627 LT, on daylight condition, the aircraft took off from runway 12 of Sentani Airport, thereafter, the Sentani Tower controller advised to the pilot of PK-MEC to contact Jayapura Radar controller. At 0628LT, the pilot of PK-MEC declared “MAYDAY” on Jayapura Radar radio frequency. The Jayapura Radar controller tried to contact pilot of PK-MEC four times but no answer. At 0630 LT, the Jayapura Radar Controller requested the pilot of PK-RCE that was just took off from Sentani to visually observe the position of PK-MEC aircraft. Few minutes later, the pilot of PK-RCE reported to Jayapura Radar controller that some debris were seen on Sentani Lake and some boats were moving toward the debris location. The pilot of PK-RCE assumed that PK-MEC aircraft had crashed to the lake. The pilot fatally injured. The wreckages have been recovered including the Global Positioning System (GPS) data card.", "probable_cause": null}