{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900c-1-karachi-21-killed", "date": "Nov 5, 2010 at 0706 LT", "type": "Beechcraft 1900C", "operator": "JS%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Karachi - Bhit Shah", "msn": "UC-157", "yom": 1991, "flight_number": null, "city": "Karachi-Muhammad Ali Jinnah-Quaid-e-Azam", "zone": "Sindh (سنڌ سندھ)", "country": "Pakistan", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 19, "pax_fatalities": 19, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": 8114, "captain_hours_type": 1820, "copilot_hours": 1746, "copilot_hours_type": 1338, "aircraft_hours": 18545, "circumstances": "0C-1 aircraft Reg # AP-BJD was scheduled to fly chartered flight from Jinnah International Airport (JIAP), Karachi to Bhit Shah Oil Fields to convey 17 employees of M/s Eni company including one foreign national from Italy. The flight crew included two cockpit crew ie Captain and First Officer (FO), one JS (Air) ground crew (technician) and one Airport Security Force staff. The Mishap Aircraft (MA) took off from JIAP, Karachi at 02:04:31 UTC. The reported weather was fit for the conduct of ill-fated flight to Bhit Shah Oil Fields. After takeoff aircraft experienced Engine No 2 abnormal operation and cockpit crew decided to land back at JIAP Karachi after calling right hand downwind for runway 25R. While joining for right hand downwind for 25R the mishap aircraft could not sustain flight and crashed at a distance of around 1 nm from runway 07R beginning JIAP, Karachi. All souls (21) onboard got fatally injured as a result of aircraft ground impact and extensive post impact ground fire. ", "probable_cause": "Detailed investigation and analyses of the examinable evidence confirmed that the aircraft had developed some problem with its Engine No.2 (Right) immediately after takeoff which was observed by the cockpit crew as propeller feathering on its own. No concrete evidence could be found which would have led to the engine’s propeller malfunction as observed. The only probable cause of propeller feathering on its own could be the wear & tear of the beta valve leading to beta system malfunction. However, this anomaly at the most could have led to the non availability of one engine and making a safe landing with a single engine since the aircraft was capable of landing with a single engine operation. Some of the actions by the cockpit crew before takeoff and subsequent to the observed anomaly in the Engine No.2 were not according to the QRH / FCOM which aggravated the situation and resulted into the catastrophic accident. \r\nThe following factors contributed to the accident:\r\nThe aircraft accident took place as a result of combination of various factors which directly and indirectly contributed towards the causation of accident. \r\nThe primary cause of accident includes, inappropriate skill level of Captain to handle abnormal operation of engine No 2 just after takeoff, failure of cockpit crew to raise the landing gears after experiencing the engine anomaly, execution of remedial actions by FO before the attainment of minimum safe altitude of 400 ft AGL resulted in non conformance and non compliance of cockpit crew to OEM recommended procedures to handle such situations. \r\nThe lack of situational awareness and CRM failure directly contributed towards ineffective management of the flight deck by the cockpit crew. \r\nThe contributory factors include inadequate cockpit crew simulator training monitoring mechanism both at operator and CAA Pakistan levels in respect of correlation of previous / current performance and skill level of cockpit crew during the simulator training sessions along with absence of conduct of recurrent / refresher simulator training between two annual simulator checks in accordance with ICAO Annex-6 guidelines and CAA Pakistan (applicable ANOs) requirements for specific type of aircraft in a year. "}