{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dash-8-q402-busan", "date": "Aug 12, 2007 at 0938 LT", "type": "De Havilland DHC-8-400 (Dash-8)", "operator": "Jeju%20Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jeju - Busan", "msn": "4141", "yom": 2006, "flight_number": "JJA502", "city": "Busan-Gimhae", "zone": "Busan (부산)", "country": "South Korea", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 74, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8655, "captain_hours_type": null, "copilot_hours": 1213, "copilot_hours_type": null, "aircraft_hours": 1645, "circumstances": "On 12 August 2007, about 05:20, the flight crew showed up and prepared for the flight of Gimpo/Jeju/Gimhae/Gimpo at the crew lounge of the Gimpo Airport. For a flight duty of the flight 103 (Gimpo to Jeju section), the flight crew departed from the Gimpo Airport at about 06:50 and arrived at the Jeju Airport at about 08:15. For the flight 502 (Jeju to Gimhae section), they departed the Jeju Airport at 08:49. While the aircraft passing through an altitude of 9,500 feet), RUD CTRL caution lights and #2 RUD HYD caution lights illuminated. Accordingly, the pilots followed and carried out the procedures) of QRH (Quick Reference Handbook). Referring to the pilots’ statements, #2 RUD HYD caution lights illuminated constantly during the flight; however, RUD CTRL caution lights illuminated intermittently. As it reached a cruising altitude of 15,000 feet, the pilots notified the condition of malfunctions and actions taken according to the QRH to a mechanic stationed at the Gimhae Airport. The pilots received a clearance from the Gimhae Approach Control for ILS RWY 36L then circling approach to RWY 18R. At the final approach course of ILS DME RWY 36L, after visually identifying the runway, the captain received a clearance for conducting a circling approach on initial contact with the Gimhae Control Tower. Referring to the pilots’ statements and the data of Flight Data Recorder (hereinafter referred to as \"FDR\"), from 09:33:57 until 09:34:03 (for the time of turning from the final approach course of ILS to enter a downwind for circling approach), the caution lights of Elevator Feel, RUD CTRL, Pitch Trim and other warning lights illuminated on the caution and warning lights panel. However, the pilots stated that they couldn’t recall all the caution lights illuminated at the time, and did not take any measures considering the illuminating lights as \"nuisance.\") The first officer who was a pilot flying continued the circling approach, and aligned his aircraft with the runway 18R on the final approach course. After aligned with runway 18R, the aircraft heading was at 178 degrees magnetic. At that time, according to the ATIS information, the wind direction/speed was 130 degrees at 13 knots gusting to 18 knots, ceiling 4,000 feet, and it was mostly cloudy. According to FDR record, at 09:38:08, about 2 feet above the runway, the rudder started to be applied to the right side. Concurrently, the pilot moved the control wheel to the right. At that time, the aircraft heading changed from 174 degrees to 175 degrees. At 09:38:09, the main landing gear of the aircraft touched down on the runway, and the aircraft heading was at 174 degrees. From the point where the main landing gear touched down, the aircraft continued to drift left into the wind. Initially the pilots applied right rudder in an attempt to maintain runway center-line. Rather then apply left wing down, the control wheel input was toward the right. According to the Cockpit Voice Recorder (hereinafter referred to as \"CVR\"), at 09:38:11, as the captain kicked onto the rudder pedal and said, \"Why, why, Ah?\" and the first officer replied, \"it doesn’t respond.\") At 09:38:13, the nose landing gear touched down, and the pilots started to apply brakes. At 09:38:15, all of sudden, the deceleration rate dropped. According to the tire marks, the aircraft departed the left edge of the runway at 3,500 feet from the end of runway. At 09:38:19, the groaning sound of one of the pilots, \"Uh. Uh\" was recorded on CVR. After 09:38:15, the heading direction of the aircraft was increasing to the left. According to CVR, at 09:38:25, there was a recorded voice of the captain, \"Oh, no, Gosh,\"and then at 09:38:27, with a sound of crash, the captain’s screaming sound, \"Ah!\" was recorded. The aircraft collided into a concrete drainage ditch, which is located 340 feet away from the centerline of the runway 18R and 4,600 feet away from the end of runway, and then it came to rest. When the aircraft stopped in the concrete drainage ditch, the pilots shut off the right engine, declared emergency to the air traffic control tower, and instructed the passengers to perform emergency evacuation. ", "probable_cause": "The Aviation and Railway Accident Investigation Board determines that the cause of the runway excursion of the Flight 502 was that the rudder failure was not recognized by the pilots during flight and as well as during landing roll. Contributing to this accident was that:\r\n1) the rudder was failing to respond to the pilots' rudder pedal input and \r\n2) After departing from the runway, no appropriate alternative measure was taken to control the aircraft direction."}