{"url": "https://www.baaa-acro.com/crash/crash-pac-cresco-08-600-near-tully-1-killed", "date": "Aug 16, 2007 at 1513 LT", "type": "PAC Cresco 08-600 (08-750)", "operator": "Thunderbirds International", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Mountains", "schedule": "Ingham - Tully", "msn": "036", "yom": 2002, "flight_number": null, "city": "Tully", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": null, "total_fatalities": 1, "captain_hours": 397, "captain_hours_type": 138, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was ferrying the aircraft under the visual flight rules (VFR) from the operator’s base at Tully, Qld to Ingham and return. The flights, conducted in the private category without passengers, were to allow aircraft maintenance to be conducted at Ingham. The flight from Tully to Ingham was conducted in the morning, with no reported difficulties. At 1454 Eastern Standard Time, the pilot departed Ingham on the return flight to Tully. The aircraft did not arrive at Tully. It was not until the next day that the pilot and aircraft were reported missing. Australian Search and Rescue (AusSAR) was notified and a search, based on the last air traffic control radar observed position of an unidentified aircraft from a replay of recorded radar data together with witness reports from the area, was initiated. Searchers located the aircraft wreckage on the morning of 18 August. The aircraft had impacted mountainous terrain in a state forest 24 km south of Tully. The pilot was fatally injured and the aircraft was destroyed. ", "probable_cause": "Contributing safety factors:\r\n• The aircraft probably entered an area of weather that deteriorated below visual meteorological conditions and for which the pilot was not experienced or qualified.\r\n• The pilot probably became unsure of his position in poor visibility, leading to controlled flight into terrain, fatally injuring the pilot and destroying the aircraft. \r\nOther safety factors:\r\n• The aircraft had not been configured for poor visibility operations, possibly increasing the pilot’s difficulty in navigating.\r\n• The pilot did not submit any form of flight notification such as a SARTIME or Flight Note, as required for a flight in a designated remote area, resulting in a delay to the search and rescue response.\r\n• The operator did not have procedures to provide assurance that a search and rescue would be initiated in a timely way if one of their aircraft did not arrive at the planned destination. [Safety issue]\r\n• As a result of damage to the emergency locator beacon antenna, the beacon did not alert search and rescue organisations to the aircraft accident. \n"}