{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-76td-near-petropavlovsk-kamchatsky-20-killed", "date": "Apr 5, 1996 at 1444 LT", "type": "Ilyushin II-76", "operator": "Kras%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Novosibirsk - Petropavlovsk-Kamchatsky", "msn": "00934 98967", "yom": 1989, "flight_number": null, "city": "Petropavlovsk-Kamchatsky", "zone": "Kamchatka Krai", "country": "Russia", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7172, "circumstances": "The aircraft was completing a cargo flight from Novosibirsk to Petropavlovsk-Kamchatsky, carrying 11 passengers, nine crew members and a load of 57 tons of meat and detergent powder. Upon takeoff from Novosibirsk-Yeltsovka Airport, the total weight of the aircraft was 17 tons above MTOW. While descending to Petropavlovsk-Kamchatsky Airport in limited visibility due to low clouds, at an altitude of 900 metres, the aircraft disappeared from radar screens after it struck the slope of a mountain located about 40 km from runway 34R threshold. The aircraft disintegrated on impact and all 20 occupants were killed. The wreckage was found 300 metres below the summit. ", "probable_cause": "The accident was the consequence of a controlled flight into terrain. The following contributing factors were reported:\r\n- Following a wrong setting of the navigation system, the crew failed to follow the approach procedures and was not on the correct track for the airport, \r\n- ATC gave a premature clearance to the crew to descent while he was not aware of the exact position of the aircraft that was not yet on his radar, \r\n- Lack of visibility due to low clouds, \r\n- At the time of the accident, the aircraft was off course by 23 km."}