{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-63cf-anchorage-47-killed", "date": "Nov 27, 1970 at 1705 LT", "type": "Douglas DC-8", "operator": "Capitol%20Airways_0", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "McChord – Anchorage – Yokota – Cam Ranh Bay", "msn": "46060/472", "yom": 1969, "flight_number": "CL3/26", "city": "Anchorage-Ted Stevens Intl", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 10, "crew_fatalities": 1, "pax_on_board": 219, "pax_fatalities": 46, "other_fatalities": 0, "total_fatalities": 47, "captain_hours": 14650, "captain_hours_type": 5740, "copilot_hours": 13500, "copilot_hours_type": 2057, "aircraft_hours": 4944, "circumstances": "The airplane was completing a charter flight from McChord AFB to Cam Ranh Bay, Vietnam, with intermediate stops in Anchorage and Yokota, carrying 219 military personnels and 10 crew members. During the takeoff roll on runway 06R at Anchorage-Intl Airport, the airplane failed to gain sufficient speed and to get airborne. After V1 speed, the crew decided to abort the takeoff procedure but the airplane overran, struck a wooden barrier, an ILS structure, a 12-foot deep drainage ditch and came to rest in flames. A crew member and 46 passengers were killed while 182 other occupants were evacuated, 163 of them were wounded. The aircraft was destroyed by a post crash fire. ", "probable_cause": "The failure of the aircraft to attain the necessary airspeed to effect lift-off during the attempted takeoff. The lack of acceleration, undetected by the crew until after the aircraft reached V1 speed, was the result of a high frictional drag which was caused by a failure of all main landing gear wheels to rotate. Although it was determined that a braking pressure sufficient to lock all of the wheels was imparted to the brake system, the source of this pressure could not be determined. Possible sources of the unwanted braking pressure were either a hydraulic/brake system malfunction or an inadvertently engaged parking brake."}