{"url": "https://www.baaa-acro.com/crash/crash-learjet-25b-houston-2-killed", "date": "Jan 13, 1998 at 0810 LT", "type": "Learjet 25", "operator": "American Corporate Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Houston - Fargo", "msn": "25-170", "yom": 1974, "flight_number": null, "city": "Houston-George Bush-Intercontinental", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8777, "captain_hours_type": 2512, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8943, "circumstances": "The flight crew was positioning the airplane in preparation for a revenue flight when it crashed 2 nautical miles (nm) short of the runway during a second instrument landing system approach in instrument meteorological conditions. Except for the final 48 seconds of the 25- minute flight, the captain was the flying pilot, and the first officer was the nonflying pilot. When the airplane was about 0.5 nm inside the outer marker on the first approach, the compass warning flag on the captain's course deviation indicator appeared, indicating that the heading display was unreliable. The airplane deviated from the localizer centerline to the left but continued to descend. After about 1 minute, during which time the airplane's track continued to diverge from the localizer centerline, the flight crew executed a missed approach. The flight crew then unsuccessfully attempted to clear the compass flag by resetting circuit breakers. The captain directed the first officer to request a second approach. Contrary to company crew coordination procedures, the flight crew did not conduct an approach briefing or make altitude callouts for either approach. Although accurate heading information was available to the captain on his radio magnetic indicator, he experienced difficulty tracking the localizer course as the airplane proceeded past the outer marker on the second approach. The captain transferred control to the first officer when the airplane was 1.9 nm inside the outer marker. The airplane then began to deviate below the glideslope. The descent continued through the published decision height of 200 feet above ground level, and the airplane struck 80-foot-tall trees. Post accident testing revealed that the first officer's instruments were displaying a false full fly-down glideslope indication because of a failed amplifier in the navigation receiver. The glideslope deficiency was discovered 2 months before the accident by another flight crew. An FAA repair station attempted to resolve the problem and misdiagnosed it as \"sticking\" needles in the cockpit instruments. The operator was immediately advised of the problem. The operator's minimum equipment list for the airplane required that the problem be repaired within 10 days, but the operator improperly deferred maintenance on it for 60 days and allowed the unairworthy airplane to be flown by the accident flight crew. The airplane was not equipped with, nor was it required to be equipped with, a ground proximity warning system, which would have sounded 40 seconds before impact. ", "probable_cause": "The flight crew's continued descent of the airplane below the glideslope and through the published decision height without visual contact with the runway environment. Also, when the captain encountered difficulty tracking the localizer course, his improper decision to continue the approach by transferring control to the first officer instead of executing a missed approach contributed to the cause. \r\nIn addition, the following were factors to the accident: \r\n(1) American Corporate Aviation's failure to provide an airworthy airplane to the flight crew following maintenance, resulting in a false glideslope indication to the first officer; \r\n(2) the flight crew's failure to follow company crew coordination procedures, which called for approach briefings and altitude callouts; and \r\n(3) the lack of an FAA requirement for a ground proximity warning system on the airplane. "}