{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-15-dc-skymaster-pacific-ocean-3-killed", "date": "Sep 23, 1955 at 1941 LT", "type": "Douglas C-54 Skymaster", "operator": "Flying%20Tiger%20Line", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Travis – Honolulu – Wake Island – Tokyo", "msn": "10410", "yom": 1944, "flight_number": "FT7413-23", "city": "Pacific Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 5, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 13450, "captain_hours_type": 8895, "copilot_hours": 7603, "copilot_hours_type": 380, "aircraft_hours": 25590, "circumstances": "Trip 7413-23 originated at Travis Air Force Base, California, its destination Tokyo, Japan, with scheduled refueling stops at Honolulu and Wake Island. The cargo load of 15,33 pounds was properly secured and distributed relative to the center of gravity. The flight departed Travis Air Force Base at 0958 and arrived at Honolulu at 2211, September 23, 1955, without incident. The crew consisted of Captain A. J. Machado. First Off leer W. F. Gin, Copilot R. C. Hightower. and Navigators R. C. Olsen and D. Ventresca. No maintenance work was required at Honolulu and the aircraft was refueled to 3,016 gallons for the flight to Wake Island. There was no offloading or loading of cargo. Gross weight of the aircraft at the time of takeoff from Honolulu was 72.993 pounds; there was no change in the flight crew. The flight departed Honolulu at 0013, September 24, 1955, on an IFR (Instrument Plight Rules) flight plan to Wake Airport via Green 9, Rhumbline Track, to maintain 8,000 feet. Routine hourly position, fuel remaining and weather reports ware made to Honolulu ARTC (Air Route Traffic Center) as the flight progressed and at 0630 control of the flight was transferred to Wake Island ARTC. At 0633 an emergency was declared to Wake ARTC, the flight advising of loss of power in three engines and inability to return to Honolulu. The aircraft was ditched during darkness at approximately 0641 at position 20 degrees 20' N. latitude 175 degrees 45' W. longitude. Neither Wake nor Honolulu radio was able to maintain contact with the aircraft; therefore Air Search and Rescue was alerted and an extensive search was commenced using both aircraft and surface vessels. At approximately 1318 on September 25 the SS Steel Advocate sighted and picked up Captain Machado and Copilot Hightower who were floating in life jackets. The two survivors reported that Navigator Ventresca went down with the aircraft and First Officer Gin and Navigator Olsen died while in the water. Weather briefing at Honolulu indicated a low pressure trough to be crossed at about 165 degrees W. longitude; there were no fronts to be crossed. The forecast indicated that scattered cumulus clouds would prevail over the intended route with tops mostly 12,000 feet and lower. Review of the weather indicates no rain showers at the time and place of ditching. Sea swells in the ditching area wore probably 4 to 6 feet high with the sea surface intermittently in deep shadow and faintly illuminated by the moon, which was in its first quarter.", "probable_cause": "The Board determines that the probable cause of the accident was the lone of power in three engines due to incorrect fuel system management and faulty restarting methods which resulted in the ditching of the aircraft. The following findings were reported: \r\n- Weather or navigation was not a factor in the accident,\r\n- There was sufficient fuel aboard the aircraft to reach the destination,\r\n- Loss of power was experienced in three engines because of the positioning of fuel selectors on empty or nearly empty tanks,\r\n- The failure to restart the three engines was due to incorrect technique or improper method of using fuel selectors end associated controls."}