{"url": "https://www.baaa-acro.com/crash/crash-bae-4100-jetstream-41-rhodes", "date": "Feb 2, 2015 at 0736 LT", "type": "Bae Jetstream 41", "operator": "Sky%20Express-2_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Heraklion – Rhodes", "msn": "41075", "yom": 1995, "flight_number": "SEH100", "city": "Rhodes-Diagoras", "zone": "South Aegean / Νότιο Αιγαίο", "country": "Greece", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 16, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11117, "captain_hours_type": 3574, "copilot_hours": 3834, "copilot_hours_type": 1334, "aircraft_hours": 28327, "circumstances": "The Jetstream 41 aircraft, with registration number SX-DIA, operated by “SKY EXPRESS”, took off on 2nd February 2015 at 07:00 hrs. local time from the Airport of Heraklion ‘N. Kazantzakis’, performing the scheduled flight No. ‘SEH100’, the first in the day, destined for the Airport of Rhodes ‘Diagoras’. Pre-flight checks were completed with no findings and in this flight the Captain was designated as the Pilot Flying. A 3-member crew and 16 passengers were onboard. The flight crew reported for duty one hour prior to the time of flight and proceeded with all actions as laid down in the Company manual. The flight crew was also briefed that in the area of the Airport of Rhodes the winds were S-SE at 17 kt with Wind Gust 36 kt. At 07:23:54 hrs., approximately 12 min prior to landing, in the first contact of the flight crew with the Control Tower of the Airport of Rhodes, the flight crew was briefed by the Air Traffic Controller (ATC) with respect to the weather conditions at the area of the airport, variable winds prevailing with a direction from 20° to 160°, average wind direction from 110°, wind velocity 20 kt gusting 38 kt. As laid down in the airport procedures, ATC, given the weather conditions, alerted the fire service vehicles to be stationed in readiness at their designated positions on the taxiways. At 07:24:43 hrs. Rhodes ATC contacted the flight crew wishing to remind that as a result of the strong wind shear and turbulence, landing at the airport is not recommended under the circumstances. At 07:29:34 hrs. Rhodes ATC contacted again the flight crew informing that the wind is shifting from 40° to 260°, average wind direction from 120°, mean wind velocity 20 kt and wind gust 32 kt. At 07:32:36 hrs., at about 8nm to the airport, the ATC contacting again the flight crew informed that wind in the last ten minutes is shifting in all directions, with mean wind velocity 16 kt and wind gust 37 kt; ATC also reminded that under these conditions landing is not recommended. At 07:34:04 hrs., at about 4 nm to the airport, Rhodes ATC contacted again the flight crew informing that wind is shifting from 60° to 200°, mean wind velocity 15 kt, wind gust 32 kt and that runway 07 is free for landing. At 07:35:08 hrs. ATC again reports wind direction from 110°, 17kt. Communication between ATC and the flight crew was smooth without any problem, with the flight crew each time acknowledging the information provided by ATC. Given the prevailing winds, landing with 9° flaps and an airspeed of about 129 kt was selected. With the flight crew having performed all pre-landing checks prescribed in the manual and with the indicator lights for the ‘Down and Lock’ landing system being illuminated green, at about 07:36 hrs. the aircraft landed, with the right main landing gear touching down first. During deceleration immediately after touchdown, with the flight crew having performed all checks specified in the a/c manual and after ATC directed the aircraft to vacate the runway via taxiway ‘C’, the aircraft veered to the left and came to rest at the left edge of the runway without exiting the runway, with an eastward direction. With the fire service vehicle approaching the aircraft, the flight crew contacted the Control Tower of the airport stating that everything is ok, and then reporting inability to taxi when asked whether the aircraft is able to taxi; when asked whether a tire was burst, the flight crew confirmed that this is the case. At 07:37:49 hrs. the Fire Service advises the Control Tower of the airport that the fire truck sprays foam due to fuel leakage. At 07:41:08 hrs. the Control Tower, when so asked by the ‘follow me’ vehicle, inquired of the flight crew whether passengers could be disembarked and the answer was that getting off from the passenger door (forward left) would not be feasible given the presence of the fire-fighting foam on the runway, and that the rear right door (Emergency Exit) would be used instead. As reported by the Air Traffic Controller passengers were disembarked 15 minutes  after the incident, and the process lasted approximately 10 minutes. Upon a first visual inspection at the accident site and before the left wing of the aircraft was raised on jacks, it appeared that the left main landing gear folded back resulting in the aircraft’s left side dragging the runway (the left main landing gear and its housing into contact with the runway) and stopping at the left edge of the runway facing to the east.", "probable_cause": "- The decision to perform a landing following a non-stabilized approach. \r\n- Landing with a strong and variable wind, the speed and the crosswind component of which were in excess of the values specified by the standard operating procedures, the aircraft manufacturer and the recommendations for the said aerodrome in AIP GREECE. \r\n- The failure to adhere to CRM principles."}