{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-291-pekanbaru", "date": "Jan 14, 2002 at 1015 LT", "type": "Boeing 737-200", "operator": "Lion%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pekanbaru - Batam", "msn": "20363", "yom": 1969, "flight_number": "JT386", "city": "Pekanbaru-Sultan Syarif Kasim II-Simpang Tiga", "zone": "Riau", "country": "Indonesia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 96, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17266, "captain_hours_type": null, "copilot_hours": 3700, "copilot_hours_type": 2500, "aircraft_hours": 68133, "circumstances": "The flight was a second route of four routes on a first day of two days schedule flight for the crew. All crew have flight schedule on the previous day and returned to Jakarta. The first flight was from Jakarta to Pekanbaru with departure schedule on 08.00 LT  (01.00 UTC). All crew did the pre-flight check completely but did not check the audio warning and departed Jakarta on schedule. The flight was normal and landed in Pekanbaru on schedule. There was no problem reported. Transit in Pekanbaru for about 30 minutes and the flight was ready to continue the next flight to Batam. At 10.15 LT (03.05) the boarding process has been completed and all flight documents have ready. First Officer asked for start clearance and received weather information in Syarif Kasim Airport. The weather was fine, wind calm and clear. After start completed, the aircraft taxi to the beginning of runway 18. Flight crews have set the V1, VR, V2 and V2+15 speed bugs according to the load sheet. Take off power decide to use “reduced take off power” with assumed temperature 35o C while the actual temperature was 27° C. flight Attendant have completed the passenger briefing includes rearrange seat for the seats near the “over wing exit windows”. The checklist was done, but flight crews were not sure the indication of flap setting. When ready for take off, flight crew gave a warning to the flight attendants to take their seats. First Officer acted as “Pilot Flying”. PIC opened the power and adjusted to the required take off power setting. The aircraft rolled normal and there was no abnormal indication. PIC called “V1” and “ROTATE” at speed bugs value setting, and the First Officer rotated the control column and set to 150 ANU (Aircraft Nose Up) pitch. The aircraft’s nose was lifted up but the aircraft did not airborne. Flight attendant who was sitting at the rear felt that the nose was higher than normal. Officer also felt stick shaker, warning for approaching stall. First Officer suddenly noticed a warning light illuminated and cross-checked. He found than the warning came from the problem on the air conditioning system. Both pilots also felt pain in the ear. Recognizing this situation, PIC decided to continue the take off and called to the First Officer “disregard”. Realized that the aircraft did not airborne PIC added the power by moving power levers forward. The speed was increasing and passed the speed bug setting for V2+15 ( ± 158 KIAS) but the aircraft did not get airborne. PIC noticed that the runway end getting closer and he thought that the aircraft would not airborne, he decided to abort the take off and called “STOP”. PIC retarded the power levers to idle and set to reverse thrust, extended the speed brake and applied brake. Nose of the aircraft went down hard and made the front left door (L1) opened and 2 trolleys at front galley move forward and blocked the cockpit door. Flight crew turns the aircraft slightly to the right to avoid approach lights ahead. The aircraft moved out or the runway to the right side of the approach lights. After hit some trees the aircraft stopped at ± 275 meters from the end of runway on heading 285°. One passenger had serious injury and the rest had minor injury, all crew were safe and not injured. No one killed in this accident, while the aircraft considered total loss. ", "probable_cause": "Findings:\r\n1. The flight crews have proper qualification to fly the aircraft.\r\n2. The aircraft did not exceed its Maximum Take-Off Weight limitation specified in the AOM.\r\n3. Cockpit area microphone did not function at the time of the accident. Therefore, the only  sounds/conversations recorded were only when there were radio transmissions. \r\n4. FDR data show that the engines operated normally. \r\n5. FDR data show similar trajectory with an aircraft of the type and loading condition tried to take-off with zero flap.\r\n6. The aircraft flap system was found to function normally. Therefore, should the flap selector moved to non-zero position, the flap should move to the selected position. \r\n7. The crew did not perform Before Take-off Checklist as stated in the Boeing 737-200 Pilot’s Handbook, Chapter Normal Operating Procedures.\r\n8. The aural warning system, except its circuit breaker, function normally. Therefore, the cause of the absence of take-off warning is the wear out latch on the CB that caused it to open.\r\n9. The food trolley safety lock and food trolley safety strap on the front galley did not function properly that the trolley loose upon impact and blocking the cockpit door. \r\n10. The escape slides fail to deploy. All the slides have no expiration date or marked last inspection date-as regulated in CASR 121.309.\r\n11. Shear pins on the engines mounting function properly to separate the engine from the wing and therefore minimize the risk of fire in the accident.\r\nFinal Remarks:\r\nSince there is no indication that flaps system failure or flap asymmetry contributes in the  failure of flap to travel to take-off configuration, the most probable cause for the failure is the improper execution of take-off checklist. Failure of the maintenance to identify the real problem on the aural warning CB, causes the CB to open during the accident and therefore is a contributing factor to the accident."}