{"url": "https://www.baaa-acro.com/crash/crash-antonov-24rv-baia-mare-10-killed", "date": "Feb 22, 1996 at 1340 LT", "type": "Antonov AN-24", "operator": "Romanian%20CAA", "flight_phase": "Landing (descent or approach)", "flight_type": "Calibration", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bucarest – Satu Mare – Baia Mare", "msn": "7 73 108 03", "yom": 1977, "flight_number": null, "city": "Baia Mare", "zone": "Maramureș", "country": "Romania", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 2, "total_fatalities": 10, "captain_hours": 7402, "captain_hours_type": 1456, "copilot_hours": 383, "copilot_hours_type": 217, "aircraft_hours": 10437, "circumstances": "The aircraft, operated by the Romanian Civil Aviation Authority (Autoritatea Aeronautică Civilă Romănă) departed Bucharest-Băneasa Airport on a calibration flight to Satu Mare and Baia Mare Airports, carrying five passengers and three crew members. The goal of the operation was to calibrate the precision approach radar and the IFR equipment at both Satu Mare and Baia Mare Airports. The mission at Satu Mare was completed successfully and the crew continued to Baia Mare Airport located about 43 km to the east. Following three successful approaches, the crew initiated a fourth descent when he was informed by ATC about the deterioration of the weather conditions with snow falls and a reduced visibility to 3 km. On approach, the crew failed to realize his altitude was too low when the aircraft struck trees and crashed onto a house located about 7,5 km short of runway 28. The aircraft and the house were destroyed. All eight occupants were killed as well as two people in the house. A third people on the ground was injured. ", "probable_cause": "It was determined that the accident was the consequence of an incorrect execution of the turn to the magnetic heading of 276°. "}