{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-flagstaff-1-killed", "date": "Jan 11, 1995 at 1805 LT", "type": "Cessna 208B Grand Caravan", "operator": "FedEx", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Flagstaff - Phoenix", "msn": "208-0236", "yom": 1990, "flight_number": "FDX7551", "city": "Flagstaff", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10000, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2439, "circumstances": "A witness located near the departure end of the runway saw the airplane initially climb in a normal manner, then stay below the clouds and make a shallow bank 180-degree left turn and descend below a tree line. Tower tapes revealed that the pilot twice transmitted that he was \"coming back\" to the airport during which the background sound of the \"fuel selector off\" warning horn was heard. The pilot then informed the controller \"I've got to get back\", and no warning horn was heard. The airplane collided with trees and came to rest about 6,500 feet sse of the runway's end. Prior to departure, the airplane was refueled with 40 gals of jet a (20 gals per tank), which increased the total fuel load to 148 gals. The flight manual required that the fuel balance between the left and right tanks be kept within 200 pounds, and suggested turning off one fuel selector to correct unbalance situations. The condition of one fuel selector turned off will cause the \"fuel selector off\" warning horn to sound. Exam of the aircraft revealed no evidence of preimpact failures. Prop blade butt signatures indicated it was operating in the governing range, and engine power was being produced at impact.", "probable_cause": "The pilot's failure to properly configure the aircraft fuel system prior to takeoff, and his failure maintain an adequate terrain clearance altitude while maneuvering to return to the airport. Factors in the accident were the dark night lighting conditions, low ceilings, restricted visibility conditions, and the pilot's diverted attention which resulted from activation of the airplane's fuel selector warning horn system. "}