{"url": "https://www.baaa-acro.com/crash/crash-sud-aviation-se-210-caravelle-10r-funchal-36-killed", "date": "Dec 18, 1977 at 2014 LT", "type": "Sud-Aviation SE-210 Caravelle", "operator": "SATA-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Zurich – Geneva – Funchal", "msn": "200", "yom": 1965, "flight_number": "VS730", "city": "Funchal", "zone": "Madeira", "country": "Portugal", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 52, "pax_fatalities": 35, "other_fatalities": 0, "total_fatalities": 36, "captain_hours": 8088, "captain_hours_type": 4968, "copilot_hours": 3735, "copilot_hours_type": 3100, "aircraft_hours": 21134, "circumstances": "Flight VS730 was an international charter service from Zurich to Funchal with an intermediate stop at Geneva-Cointrin Airport, Switzerland. The flight crew consisted of two captain. A new captain was in the left-hand seat and was piloting the aircraft. The second captain who was seating in the right-hand seat was acting as pilot-in-command, pilot responsible for the initiation to Funchal, route check pilot and co-pilot. Initiation of the new captain was necessary because of the difficult approach and landing at Funchal. However, this initiation ought to have been made by day. The aircraft departed Geneva at 1626LT bound for Madeira Island. At 1938 the crew contacted Madeira control, reporting Rose Point at FL330; the aircraft was cleared to leave this flight level at 1941. The crew then asked for descent instructions and received clearance to descend to FL50; it was requested to contact control again when this level was reached or when overflying the Porto Santo (PST) NDB. At 1955 the crew reported being overhead the PST at FL85. The aircraft was instructed to continue its descent to FL50, then to contact Funchal approach control. At 1957 the crew contacted Funchal approach control, which stated that runway 06 was in service and cleared the aircraft to descend to 3,500 ft, the QNH being 1014.0 mb. After being cleared for the approach the crew descended below the 720 feet permitted during circling, even though they had lost sight of the runway. The pilots, had lost sight of the runway lights at the end of the downwind leg and at the beginning of the base leg, when the aircraft was already flying below 200 feet. The radio altimeter had probably been preset to 200 feet, but the pilots did not check its indications. The aircraft touched the water surface relatively smoothly in a flat attitude, bounced then touched the water surface two additional times and came to rest 4 km short of runway 06 threshold. The center of the fuselage fractured, causing water to enter the cabin. Few passengers were able to jump into water and the airplane sank by a depth of 600 metres two minutes after final impact. 17 bodies were never recovered as well as both CVR and VFR recording systems. ", "probable_cause": "The accident was caused by an involuntary ditching during the approach. The fact that the aircraft was flying below the descent plan may have been due to a lack of coordination between the pilots and a sensorial illusion on the part of the crew, when it was preoccupied with the search for visual runway references. The following findings were reported:\r\n- The captain in the left seat did not have sufficient experience to land by night at Funchal Airport (this was his first flight to Funchal), \r\n- Through good weather conditions, the crew continued the approach by attempting to establish a visual contact with the runway but without success, \r\n- This caused the aircraft to pass the descent height and to continue the approach below the minimum prescribed altitude until it impacted water, \r\n- A light signal activated on the cockpit panel but the crew failed to see it as he was trying to locate the runway, \r\n- Lack of crew coordination,\r\n- Sensorial illusion,\r\n- A crew composed by two captains was dispatched on the flight. Experience shown that such crew composition was not the best as the captain who was seating in the right seat has too little experience as copilot and was flying as an acting captain instead of copilot, \r\n- A possible malfunction of the altimeter was ruled out, \r\n- All instruments were functioning properly at the time of the accident. "}