{"url": "https://www.baaa-acro.com/crash/crash-sud-aviation-se-210-caravelle-10r-la-coruna-85-killed", "date": "Aug 13, 1973 at 1140 LT", "type": "Sud-Aviation SE-210 Caravelle", "operator": "Aviaco-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Madrid - La Coruna", "msn": "225", "yom": 1968, "flight_number": "AO116", "city": "La Coruna", "zone": "Galicia", "country": "Spain", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 79, "pax_fatalities": 79, "other_fatalities": 0, "total_fatalities": 85, "captain_hours": 8610, "captain_hours_type": 304, "copilot_hours": 6283, "copilot_hours_type": 997, "aircraft_hours": 13118, "circumstances": "The Caravelle aircraft took off from Madrid-Barajas Airport at 08:30 GMT and proceeded normally to La Coruña Airport. At 09:14 radio contact was made with La Coruña tower and the flight crew reported 3 minutes away. The tower controller informed the flight that weather at the airport was below minima and that improvement would be slow. The flight crew then decided to hold over Lima Romeo Alpha and said they would report when holding. Shortly thereafter they informed the tower that they would make an approach down to minima to get a more precise idea of the weather and would hold thereafter. The controller switched on the VASIS and at 09:21 informed the flight that visibility was around 350 m, although he could not see the VASIS at the threshold of runway 22. The flight then reported at 3000 feet beginning the approach. At 09:23 the controller reported a visibility of 600 m. At 09:24 the pilot said he would attempt to land, that he was 2200 feet on approach and had not yet entered clouds. At 09:28 ATC reported 800 m visibility, but that a light breeze was coming up and fog was again closing in from the sea. The crew reported to the tower that they had descended to minima. Since the ground could not be seen, they would therefore begin to hold. At 09:32 the flight crew reported holding at 6000 feet and requested to be informed of any change that might take place. At 09:34 the controller reported a visibility of 400 m, that the VASIS was still visible. The flight crew then tried to make another attempt to land. At 09:36 the flight crew reported passing the LRA VOR on approach. The controller answered that the lights of the VASIS were no longer visible and that some fog had collected over the runway threshold. The pilot then decided to resume holding. Weather gradually improved and at 10:20 ATC reported a horizontal visibility of 1500 m and a vertical visibility of 150 m which improved to 250-300 m within three minutes. The pilot acknowledged and said he was leaving 5000 feet for approach. At 10:31 the flight reported passing LRA. At 10:32 the flight reported discontinuing the approach and 6 minutes later the pilot said he was initiating another approach and would report over LRA. At 10:39 the pilot reported over LRA again. Shortly afterward the Caravelle contacted eucalyptus trees, struck the ground and crashed onto several houses. The aircraft was totally destroyed and none of the 85 occupants survived. There were no casualties on the ground. ", "probable_cause": "Pilot violation of the regulations and instructions governing flight over national territory, and the international standards in force in Spain."}