{"url": "https://www.baaa-acro.com/crash/crash-comp-air-ca-8-ray", "date": "Oct 15, 2015 at 1810 LT", "type": "Comp Air CA-8", "operator": "Paul R. Boak", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Anniston - Ray", "msn": "0652843", "yom": 2006, "flight_number": null, "city": "Ray", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 948, "captain_hours_type": 49, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The private pilot reported that, while on a left downwind in the airport traffic pattern after conducting a cross-country business flight, he extended the flaps 10 degrees. While on short final, he fully extended the flaps, and shortly after, the left wing dropped. The pilot attempted to correct the left wing drop by applying right aileron and rudder; however, the airplane did not respond. The pilot chose to conduct a go-around and increased engine power. The airplane subsequently pitched up, and the left turn steepened. The pilot subsequently reduced engine power, and the airplane began to descend. The airplane struck the ground short of the runway, and the left wing separated from the fuselage. The examination of the airframe, flight controls, and engine revealed no preimpact mechanical anomalies that would have precluded normal operation. Examination of the trim system revealed that the right aileron trim and the left rudder trim were in positions that would have resulted in a right turn and a left yaw. Further, a witness reported that the airplane appeared to be in a cross-controlled attitude while on final approach to the airport. It is likely that the pilot’s improper use of the trim led to a cross-controlled situation and resulted in the subsequent stall during the attempted go-around.", "probable_cause": "The pilot's improper use of the trim, which created a cross-controlled situation and resulted in an aerodynamic stall during the attempted go-around.\n"}