{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-c-145a-skytruck-walan-rabat", "date": "Dec 18, 2011 at 1502 LT", "type": "PZL-Mielec AN-28", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kandahar - Qalat - Walan Rabat - Qalat - Kandahar", "msn": "AJE003-19", "yom": 2009, "flight_number": null, "city": "Walan Rabat", "zone": "Zabul", "country": "Afghanistan", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3546, "captain_hours_type": 434, "copilot_hours": 982, "copilot_hours_type": 677, "aircraft_hours": 1164, "circumstances": "At 0939 hours Zulu time on 18 December 2011, an M-28, Tail Number 08-0319, departed Kandahar Air Base, Afghanistan on a mission to pick up four passengers at Qalat, Afghanistan, transport them to Walan Rabat short takeoff and landing zone, transport two additional personnel from Walan Rabat back to Qalat, then return to Kandahar Air Base. The mishap aircraft and crew were assigned or attached to the 318th Special Operations Squadron, 27th Special Operations Wing at Cannon Air Force Base, New Mexico, and were deployed to the 318th Expeditionary Special Operations Squadron at Kandahar Air Base, Afghanistan. After an uneventful stop at Qalat to onload four passengers and their bags, the mishap crew flew a 20-minute leg to Walan Rabat. Surface winds at Walan Rabat were 190 degrees at 14 knots gusting to 17 knots, 30 degrees off a direct tailwind for runway 34. Because the landing zone has a three percent upslope for runway 34, and a 1,500-foot mountain exists 1½ miles to the north, the pilot elected to land with a tailwind on runway 34, the preferred landing direction. Walan Rabat Landing Zone is a 1,756-foot long, 31-foot wide, semi-prepared dirt strip with poorly defined boundaries. The landing zone was marked with AMP-3 markings, commonly called a “box-and-one” with colored panels. The mishap pilot consulted a wind component chart and incorrectly calculated the tailwind component, mistakenly believing it was within the allowable limit for landing the M-28. The pilot flew a shallow 2½-3 degree approach due to the upsloping landing zone. At approximately 1,000 feet short of the landing zone, the mishap pilot visually acquired the AMP-3 markings and landed the mishap aircraft at 1032 zulu. After a firmer than normal landing, the aircraft veered to the right and departed the prepared surface. The nose gear encountered uneven terrain and collapsed, causing the mishap aircraft to flip tail-over-nose. The mishap crew and passengers then egressed the aircraft through the copilot’s window. There were no serious injuries to crew or passengers. The mishap aircraft, which was valued at approximately $12,300,000 was destroyed. There were no civilian casualties.", "probable_cause": "The AIB president found no clear and convincing evidence of the primary cause of the accident. He determined by a preponderance of evidence that the Landing Zone Condition, Cross-Monitoring Performance, Task/Mission-in-Progress Re-planning, Landing with an Excessive Tailwind, and Aircraft Engine Anomalies substantially contributed to the mishap, ultimately causing the mishap aircraft to veer off the prepared surface into rough terrain, resulting in the collapse of the nose landing gear and destruction of the aircraft."}