{"url": "https://www.baaa-acro.com/crash/crash-cessna-441-conquest-york-1-killed", "date": "Dec 22, 2011 at 1725 LT", "type": "Cessna 441 Conquest", "operator": "N48BS LLC", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Long Beach - York", "msn": "441-0125", "yom": 1980, "flight_number": null, "city": "York", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1409, "captain_hours_type": 502, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5995, "circumstances": "Toward the end of a 6 hour, 20 minute flight, during a night visual approach, the pilot flew the airplane to a left traffic pattern downwind leg. At some point, he lowered the landing gear and set the flaps to 30 degrees. He turned the airplane to a left base leg, and after doing so, was heard on the common traffic frequency stating that he had an \"engine out.\" The airplane then passed through the final leg course, the pilot called \"base to final,\" and the airplane commenced a right turn while maintaining altitude. The angle of bank was then observed to increase to where the airplane's wings became vertical, then inverted, and the airplane rolled into a near-vertical descent, hitting the ground upright in a right spin. Subsequent examination of the airplane and engines revealed that the right engine was not powered at impact, and the propeller from that engine was not in feather. No mechanical anomalies could be found with the engine that could have resulted in its failure. The right fuel tank was breeched; however, fuel calculations, confirmed by some fuel found in the right fuel tank as well as fuel found in the engine fuel filter housing, indicated that fuel exhaustion did not occur. Unknown is why the pilot did not continue through a left turn descent onto the final approach leg toward airport, which would also have been a turn toward the operating engine. The pilot had a communication device capable of voice calls, texting, e-mail and alarms, among other functions. E-mails were sent by the device until 0323, and an alarm sounded at 0920. It is unknown if or how much pilot fatigue might have influenced the outcome.\n", "probable_cause": "The pilot's failure to maintain minimum control airspeed after a loss of power to the right engine, which resulted in an uncontrollable roll into an inadvertent stall/spin. Contributing to the accident was the failure of the airplane's right engine for reasons that could not be determined because no preexisting mechanical anomalies were found, and the pilot's subsequent turn toward that inoperative engine while maintaining altitude.\n"}