{"url": "https://www.baaa-acro.com/crash/crash-short-330-300-liverpool", "date": "Jan 3, 1997 at 0042 LT", "type": "Short 330", "operator": "Titan-Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Exeter - East Midlands", "msn": "3023", "yom": 1978, "flight_number": null, "city": "Liverpool-John Lennon (ex Speke)", "zone": "Merseyside", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3015, "captain_hours_type": 900, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Exeter at 2237 hrs where the weather was fair with scattered cloud at 1500 feet. After climbing uneventfully through cloud to FL 90 the aircraft cruisedin clear, smooth air. In the cruise the co-pilot noticed that his vertical speed indicator was displaying a slight rate of climb although the aircraft was in level flight but this and a spurious hydraulic warning were the only anomalies. As the aircraft approached East Midlands airport the runway visual range there was below the approach minima and several aircraft were holding awaiting an improvement in the visibility. G-ZAPC descended to 2,500 ft and held in clear air over the Lichfield NDB for about 45 minutes until the fuel state dictated a diversion to Liverpool. On diversion the aircraft was initially cleared direct to the Whitegate NDB and then Wallasey VOR at FL 40. At this level the crew could see ground features in good visibility until they entered cloudas they descended through 3,500 feet whilst being radar vectored for an approach to Liverpool Airport. The cloud was stratiform in character and did not appear to contain precipitation or significant turbulence. At Liverpool airport the cloud base was 6/8at 1,100 feet, the visibility 12 km, the air temperature +1°Cand the surface wind was 060°/8 kt. There is an ILS localiser on Runway 09 but no glidepath transmitter so a LOC DME approach is normally flown. Although the DME antenna is mid-way along the runway, the DMErange is set to read zero at the runway displaced threshold. The pilot flies the localiser in azimuth and adjusts his height according to his pressure altimeter; the 3° glidepath commences at 1,610 feet QNH from 5 nm DME with check heights at 4, 3, 2 and 1 nm DME. On the north side of the runway 329 metres from the threshold there are 4 PAPI (Precision Approach Path Indicator)lights which are set to a glidepath of 3°. During the approach to Runway 09 at Liverpool all the anti-icing services were switched on and operating except for the wing de-icing boots which, having seen no ice on the wings,the commander decided not to employ, and the ice detector which he considered unreliable. The approach proceeded normally andthe aircraft descended out of cloud at about 1,100 feet having been in cloud for about 10 minutes. When the commander viewed the PAPIs at 1 DME\"all four lights had a pink tinge\". Thinking he might be slightly low relative to the approach glidepath, he asked the co-pilot to specify the correct height at 1 DME which was 410feet. At the time the commander's pressure altimeter, which was set to the QNH of 1019 mb, indicated that the aircraft was slightly high and so he made a small correction to the flight path which resulted in three red PAPI lights and one white light. The commander also decided to touch down slightly beyond the runway identifier numbers which are a few metres beyond the 'piano keys' that identify the threshold. The aircraft was cleared to land with a wind of \"Easterly at 10 kt\" and on short finals the commander asked for full flap. He then allowed the speed to bleed back from the approach speed of between 110 and 120 KIAS towards the threshold speed of 90 KIAS without moving the throttles from their approach power setting. According to both crew members and the passenger who was seated in the 'jump seat', the aircraft crossed over the end of runway at between 88 and 90 KIAS. Some 20 to 30 feet above the runway the commander noticed that the flight controls felt 'sloppy' as if the aircraft's speed was unusually low but there was no hint of a stall warning or stick shaker activation. At much the same time all three persons on board felt the aircraft sink rapidly; the commander pulled back on the control column but he was unable to arrest the high rate of descent and the aircraft struck the runway very hard. The right wing dropped as the right main gear collapsed and the aircraft veered to the right off the runway onto the grass. The ground was frozen hard and the aircraft came to a halt without incurring further significant damage. The crew informed ATC that they were unhurt before securing the aircraft whilst ATC activated the airport's emergency services. On leaving the aircraft the commander inspected the wings for ice accretion. He noticed a thin layer of clear,watery ice along the leading edges across the pneumatic de-icing boots from top to bottom. The ice layer could be wiped off with one finger and was no more than one eight of an inch thick. Throughout the flight there had been no visible signs of ice accretion on the wings or the windscreen wiper. Consequently, the commander had not increased the threshold speed to compensate for ice accretion.", "probable_cause": "From the available evidence it appears probable that the aircraft developed a high rate of descent from a height of 20 to 30 feet above the runway without producing a stall warning. The following causal factors were considered: wind shear; wake turbulence; pitot-static system errors; low airspeed during the final stages of the approach; and significant ice accretion on the airframe. Wind shear was discounted because numerous wind readings showed the normal slight variation in direction but a consistent wind speed, and there were no obstacles such as hangars upwind of the threshold. Wake turbulence was discounted because the preceding aircraft had landed 19 minutes before GZAPC. The pitot-static systems were checked to be leak free and all relevant instruments were shown to be accurate. It was also established that all pitot head, static plate and stall warning heaters were serviceable. A favourable comparison of the approach profile with those of the preceding four aircraft indicated that there was no evidence of static pressure errors. The calculated airspeeds from radar were consistent with thespeeds reported by the crew for the initial approach suggesting that itot errors were not significant. Thus, unless icing, for example, had affected these systems at a late stage of the approach,erroneous instrument readings were considered unlikely.  The final approach was flown at about the correct airspeed but there was a trend within the radar data,for the last mile of the approach, for the airspeed to reduce towards the stalling speed. However the data was too coarse to provide exact speeds and the stall warning system did not activate. The likelihood of significant airframe icing was discounted for several reasons including: the commander's statement; photographs taken of the aircraft shortly after the accident which showed no signs of significant ice accretion; no lumps of ice were found on the runway; and the airframe was icefree when examined by the AAIB despite overnight sub-zero temperatures. There was, therefore, no positive conclusion as to the cause and it remains a possibility that some or all of the above factors, to a small extent, may have combined to produce a high rate of descent while the aircraft was some 20to 30 feet above the runway. "}