{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-82-mt-san-pietro-180-killed", "date": "Dec 1, 1981 at 0853 LT", "type": "McDonnell Douglas MD-82", "operator": "Inex%20Adria", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Ljubljana - Ajaccio", "msn": "48047/998", "yom": 1981, "flight_number": "JP1308", "city": "Mt San Pietro", "zone": "Corse-du-Sud", "country": "France", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 172, "pax_fatalities": 172, "other_fatalities": 0, "total_fatalities": 180, "captain_hours": 12123, "captain_hours_type": 188, "copilot_hours": 4213, "copilot_hours_type": 288, "aircraft_hours": 683, "circumstances": "The McDonnell Douglas MD-82 departed Ljubljana at 0741LT on a charter flight to Ajaccio, carrying 173 passengers and a crew of seven. Following an uneventful flight at FL330, the crew descended at FL190 at 0835LT then the copilot's son entered the cockpit and was allowed to take the observer's seat.  Further descent instructions and radar vectors were obtained and at 08:47 the flight transferred to the Ajaccio Approach controller. The controller cleared the flight to the AJO VOR at FL110 and to report when overhead the VOR. He also passed on weather information and the reported that runway 21 was the runway in use. At 0849LT the crew reported over the AJO VOR. The controller cleared the flight to descend to 3,300 feet on the 247 radial of the AJO VOR. Three minutes later the flight radioed: \"Rolling inbound out of six thousand\". By that time the airplane had descended below the minimum holding altitude of 6,800 feet for that area. He then reported: \"Turning inbound to Ajaccio because at the moment we are in cloud.\" The controller then replied: \"Roger, 1308, report Charlie Tango on final, surface wind two eight zero degrees, twenty knots.\" There was no response from flight 1308. Flight 1308 was flying a holding pattern to lose altitude, but the controller believed the aircraft was going to make a direct descent to begin the final approach. Hence the reference to the Charlie Tango (CT) NDB beacon. The GPWS warning sounded in the cockpit and the crew increased engine power to gain altitude. 13 seconds later, at a speed of 285 knots, the left wing struck the Punta di Junca and was partially torn off. The aircraft rolled to the left and crashed seven seconds later in steep cliffs located 700 meters below, about 32 km southeast of Ajaccio-Campo dell’Oro Airport. The aircraft was totally destroyed and all 180 occupants were killed. ", "probable_cause": "The Committee considers that the cause of this accident was that the descent undertaken by the crew led the aircraft to find itself in clouds below the instruments safety altitude for that part of the flight path. The Committee noted that when the crew, alerted by the GPWS, tried to regain altitude, the maneuver proved to be insufficient to overcome the effect of strong descending air currents due to relief and strong wind, present in the area where the aircraft was flying at that time. The following contributing factors were reported:\r\n- The committee felt that the crew did not show the necessary rigor when preparing its approach. It does not appear that a logical order has guided the crew in the revision and memorization of various parameters, including the safe altitude and the maximum speed of the holding circuit, which in any case, did not catch the attention of the crew in an appropriate manner. In addition, the presence of a young child on the observer seat cockpit, until the end of the flight was a dispersion factor of attention;\r\n- The misunderstandings which have developed in the exchange of messages between the captain and the approach controller could disrupt, at certain times, the working conditions of the crew. The controller consequently did not have an accurate representation of the progress of the aircraft in the performance of its procedure and, therefore, did not intervene when two messages \"call you inbound on radial two forty seven\", and then \"rolling inbound out of six thousand\" would have told him, if he had better interpreted them, an ambiguous situation for the first and abnormal and dangerous for the second;\r\n- The advice to the commission on vectoring habits and on habits supposedly used by some national air traffic services to systematically take into account the safety altitudes in formulating control permissions, leads to the suspicion that some crew have a slightest concern about the safe altitudes;\r\n- Airspeed of the aircraft was greater than the maximum speed of the holding pattern and crew did not adopt the correction factors adapted to altitude wind they had encountered during the previous segment th flight. This led to the airplane overfly an area where, although it is included in the protected area of the holding pattern, the upper air movements were particularly important;\r\n- The symbolic representation of the holding pattern on the approach chart used by the crew corresponds to a path, with no wind, and an aircraft which would have approximately 150 knots indicated airspeed. It calls not evident attention to Airmen on the actual dimensions of the actually travelled circuits in flight, nor therefore on altitude over the terrain reliefs."}