{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-kotzebue", "date": "Mar 2, 2003 at 1504 LT", "type": "Cessna 208B Grand Caravan", "operator": "Bering%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Shungnak - Kotzebue", "msn": "208B-0890", "yom": 2001, "flight_number": null, "city": "Kotzebue-Ralph Wien Memorial", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 25600, "captain_hours_type": 4200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2082, "circumstances": "Prior to departing on an air taxi flight, the airline transport certificated pilot obtained a weather briefing and filed a VFR flight plan for a trip from his home base, to several remote villages, and return. The area forecast contained an AIRMET for IFR conditions and mountain obscuration due to clouds and light snow. The terminal forecast contained expected conditions that included visibilities ranging from 3 to 3/4 mile in blowing snow, a vertical visibility of 500 feet, and wind speeds from 14 to 22 knots. During the filling of the flight plan, an FAA flight service station specialist advised that VFR flight was not recommended. The pilot acknowledged the weather information and departed. When the pilot took off on the return flight from an airport 128 miles east of his home base, the pilot reported that the visibility at his base was greater than 6 miles. As he neared his home base, the visibility had decreased and other pilots in the area were requesting special VFR clearances into the Class E surface area. The pilot requested a special VFR clearance at 1441, but had to hold outside the surface area for other VFR and IFR traffic. At 1453, a METAR at the airport included a wind 080 of 26 knots, and a visibility of 1 mile in blowing snow. While holding about 7 miles north of the airport, the pilot provided a pilot report that included deteriorating weather conditions east of the airport. Once the pilot was cleared to enter the surface area at 1458, he was provided with an airport advisory that included wind conditions of 25 knots, gusting to 33 knots. While the pilot was maneuvering for the approach, a special aviation weather observation at 1501 included a wind condition of 26 knots, and a visibility of 3/4 mile in blowing snow. The pilot said he established a GPS waypoint 4 miles from the runway and descended to 1,000 feet. He continued inbound and descended to 300 feet. At 1 mile from the airport, the pilot said he looked up from the instrument panel but could not see the airport. He also stated that he was in a whiteout condition. The airplane collided with the snow-covered sea ice, about 1 mile from the approach end of the runway threshold at 1504.", "probable_cause": "The pilot's continued VFR flight into instrument meteorological conditions, and his failure to maintain altitude/clearance above the ground, resulting in a collision with snow and ice  covered terrain during the final approach phase of a VFR landing. Factors in the accident were whiteout conditions and snow-covered terrain."}