{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-lake-boulene-3-killed", "date": "Jul 12, 2019 at 1616 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Jim Duggan", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Mountains", "schedule": "St-Mathias - La Minerve - Barrage Goin - Weakwaten", "msn": "1123", "yom": 1957, "flight_number": null, "city": "Lake Boulène", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1028, "captain_hours_type": 314, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15040, "circumstances": "At approximately 1000LT on 12 July 2019, a private de Havilland DHC-2 Mk. 1 Beaver floatplane (registration C‑GRHF, serial number 1123) took off from the St-Mathias Water Aerodrome (CSV9), Quebec, with only the pilot on board, for a series of visual flight rules (VFR) flights. The aircraft landed at approximately 1130 on Désert Lake in La Minerve, Quebec, and came alongside a private dock where 3 individuals were waiting to board and fly to a fishing lodge. Once the baggage was stowed on the aircraft, the pilot provided a safety briefing to the passengers, who were all wearing a personal flotation device. The aircraft took off from Désert Lake at approximately 1215, bound for the Barrage Gouin Water Aerodrome (CTP3), Quebec, where the aircraft was scheduled to be refuelled. The aircraft landed at approximately 1430. Once the refuelling was complete, the aircraft took off once again around 1528, headed northwest to Weakwaten Lake, Quebec, where the fishing lodge was located. After approximately 48 minutes of flight, at around 1616, the aircraft collided with trees and struck the ground. There was no post-impact fire. The emergency locator transmitter was activated by the force of impact, and began transmitting a signal on frequency 121.5 MHz. This signal was detected by the flight crew of a commercial airliner at 1705 and reported to air traffic services. At 1850, the Joint Rescue Coordination Centre in Trenton dispatched a CC130 Hercules aircraft to try to locate the distress signal. The occurrence aircraft was found in a densely wooded area at 2032. Two search and rescue technicians were parachuted to rescue the aircraft occupants. Three of the 4 occupants received fatal injuries. The survivor was evacuated and transported to the hospital in Chibougamau, Quebec.", "probable_cause": "Controlled flight into terrain following the pilot's decision to continue the flight at a relatively low speed and in a nose-up attitude, which reduced his field of vision."}