{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-31-philadelphia", "date": "Jun 23, 1976 at 1712 LT", "type": "Douglas DC-9", "operator": "Allegheny-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Providence – Windsor Locks – Philadelphia – Nashville – Memphis", "msn": "47333/481", "yom": 1969, "flight_number": "AL121", "city": "Philadelphia", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 102, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 25000, "captain_hours_type": 6000, "copilot_hours": 11000, "copilot_hours_type": 6000, "aircraft_hours": 21320, "circumstances": "Allegheny Airlines Flight 121, a Douglas DC-9-31, suffered a landing accident on the Philadelphia International Airport, Pennsylvania. Of the 106 persons onboard, 86 persons were injured; there were no fatalities. The captain of Flight 121 had conducted an instrument approach to runway 27R in visual conditions as a thunderstorm passed over the airport in a north-northeasterly direction. When near the threshold the captain initiated a go-around from a low altitude and entered rain of increasing intensity. Shortly thereafter the aircraft was seen descending in a nose-up attitude with the landing gear retracted. After striking tail first on a taxiway about 4,000 feet beyond the threshold of runway 27, the aircraft slid about 2,000 feet and stopped. The wreckage came to rest about 6,000 feet beyond the threshold and about 350 feet to the right of the centerline of runway 27R.", "probable_cause": "The aircraft's encounter with severe horizontal and vertical wind shears near the ground as a result of the captain's continued approach into a clearly marginal severe weather condition. The aircraft's ability to cope under these conditions was borderline when flown according to standard operating procedures; however, if the aircraft's full aerodynamic and power capability had been used, the wind shear could probably have been flown through successfully. Contributing to the accident was the tower controller's failure to provide timely below-minimum RVR information."}