{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-linz", "date": "Feb 13, 2004 at 0615 LT", "type": "Cessna 414 Chancellor", "operator": "Charter-Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Linz - Stuttgart", "msn": "414-0825", "yom": 1975, "flight_number": null, "city": "Linz-Hörsching", "zone": "Upper Austria", "country": "Austria", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2527, "captain_hours_type": 830, "copilot_hours": 522, "copilot_hours_type": 250, "aircraft_hours": 4463, "circumstances": "The twin engine aircraft departed Linz-Hörsching Airport on a taxi flight to Stuttgart with five passengers and two pilots on board. During the takeoff roll on runway 27, at a speed of 105 knots, the crew started the rotation. Immediately after liftoff, the aircraft adopted a high nose attitude with an excessive angle of attack. It rolled to the left, causing the left gear door and the left propeller to struck the runway surface, followed shortly later by the right propeller. After the speed dropped, the aircraft stalled and crash landed on the runway. It slid for few dozen metres and came to rest 2,752 metres past the runway threshold. All seven occupants were evacuated, one passenger suffered serious injuries. The aircraft was damaged beyond repair. ", "probable_cause": "The loss of control immediately after liftoff was the consequence of an aircraft contaminated with ice, resulting in an excessive weight, a loss of lift and a consequent stall. The following factors were identified:\r\n- Poor flight preparation, \r\n- The crew failed to follow the SOP procedures prior to takeoff, \r\n- The aircraft has not been deiced prior to takeoff, increasing the total weight of the aircraft by 231 kilos, 8% above the MTOW, \r\n- This situation caused the CofG to be out of the permissible limits, \r\n- Poor judgment on part of the crew when the undercarriage were lowered. "}