{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-188c-electra-ardmore-83-killed", "date": "Apr 22, 1966 at 2030 LT", "type": "Lockheed L-188 Electra", "operator": "American%20Flyers%20Airline", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Monterey - Ardmore - Columbus", "msn": "1136", "yom": 1961, "flight_number": "AFA280D", "city": "Ardmore", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 93, "pax_fatalities": 78, "other_fatalities": 0, "total_fatalities": 83, "captain_hours": 16247, "captain_hours_type": 1247, "copilot_hours": 12355, "copilot_hours_type": 1155, "aircraft_hours": 4019, "circumstances": "The aircraft departed Monterey Airport, California, on a charter flight to Columbus, Georgia, with an intermediate stop at Ardmore Municipal Airport, Oklahoma, carrying 93 US soldiers and a crew of five on behalf of the Military Air Command. Following an uneventful flight from Monterey, the crew started the descent to Ardmore Municipal Airport by night and marginal weather conditions. An ADF instrument approach to runway 08 was abandoned and the crew decided to follow a visual approach to runway 30. While descending to runway 30 in poor visibility, the captain (also PIC) suffered a heart attack. The aircraft commenced an uncontrolled descent slightly banked to the right until it struck the ground and disintegrated about 1,5 mile short of runway 30. All five crew members and 75 passengers were killed while 18 others were seriously injured. Few hours later, three of the survivors died from their injuries.  ", "probable_cause": "The Board determined the probable cause of this accident was the incapacitation, due to a coronary insufficiency, of the pilot-in-command at a critical point during visual, circling approach being conducted under instrument flight conditions. The Board was concerned by the fact that the pilot-in-command has an established medical history of cardiovascular disease and diabetes mellitus, both of which are disqualifying for the issuance of a first-class medical certificate, and that he deliberately falsified his application for this certificate."}