{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-500tp-malibu-meridian-vero-beach-2-killed", "date": "Apr 9, 2001 at 1208 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "LK Aero Corporation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Vero Beach - Daytona Beach", "msn": "46-97040", "yom": 2001, "flight_number": null, "city": "Vero Beach", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1514, "captain_hours_type": 33, "copilot_hours": 378, "copilot_hours_type": null, "aircraft_hours": 45, "circumstances": "Witnesses observed N262MM taxi to runway 29 left and the pilot perform what appeared to be a normal engine runup. The airplane then taxied onto runway 29 left for takeoff. The wind was from the east, making the takeoff with a tail wind. During the takeoff, the engine seemed to operate at a steady level, but appeared to be low on power. The flight lifted off about halfway down the runway and the landing gear was retracted. The airplane climbed slowly and turned slowly to the left. The airplane then entered a 60-80 degree left bank followed by the airplane rolling level and the wings rocking back and forth. The airplane was now on a southerly heading and the nose dropped. The airplane then collided with trees about 15-20 feet above the ground, fell to the ground, and burst into flames. Witnesses stated they saw no smoke or flames coming from the airplane prior to impact with the trees. At the time of the accident the landing gear was retracted and the engine was running. Transcripts of recorded communications show that at 1205:40, the local controller instructed the flight to taxi into position and hold on runway 29 left. At 1206:43, N262MM was cleared for takeoff and a north bound departure was approved. At 1208:03, the passenger transmitted \"we need to land we have to turn around\". The local controller cleared the flight to return to the airport when able. At 1208:20, the passenger transmitted \"two mike mike we're going down we're going down\", followed by \"over the golf (unintelligible)\". The local controller responded \"copy over the golf course\". No further transmissions were received from the flight. Analysis of background noise contained on the ATC recordings show that at the time the passenger on N262MM transmitted to controllers that they were ready for takeoff and when he acknowledged the takeoff clearance, the propeller was rotating at 1,261 and 1,255 respectively. When the passenger transmitted to controllers after takeoff, that they needed to land, the propeller was rotating at 1,980 rpm. When the passenger transmitted we have to turn around, shortly after the above transmission, the propeller was rotating at 2,017 rpm. When the passenger made his last transmission stating they were going down, the propeller rpm was 1,965. The maximum propeller speed at takeoff is 2,000 rpm. Additional evidence was found indicating electrical arcing and progressive fatigue cracking in the engine’s P3 line, which could result in a rapid rollback of engine power. Simulator testing showed that a P3 line failure would result in the engine decelerating from full takeoff power (2,000 propeller rpm) and stabilizing at an idle power setting in less than 9 seconds. However, the sound spectrum analysis of the first radio transmission indicated the propeller rpm was 1,980, and two subsequent radio transmissions, the last of which was made 17 seconds after the initial transmission, detected the propeller rpm at near takeoff speed. Thus, there was no evidence of dramatic rpm loss, making the P3 line failure an unlikely cause of the accident. Postcrash examination of the aircraft structure, flight controls, engine, and propeller, showed no evidence of failure or malfunction. Witnesses indicated the flight used about 3,650 feet of runway for takeoff or about half of the 7,296 foot long runway. Charts contained in the Piper PA-46-500TP, Pilot's Operating Handbook, indicated that for the conditions at the time of the accident, the airplane should have used about 2,000 feet of runway for the ground roll during the takeoff with no wing flaps extended. The charts also show that the airplane indicated stall speed at 60 degrees of bank angle with the landing gear and wing flaps retracted is 111 knots.", "probable_cause": "The pilot's excessive bank angle and his failure to maintain airspeed while returning to the airport after takeoff due to an unspecified problem resulting in the airplane stalling and colliding with trees during the resultant uncontrolled descent."}