{"url": "https://www.baaa-acro.com/crash/crash-cessna-441-conquest-anchorage", "date": "Aug 28, 2005 at 2129 LT", "type": "Cessna 441 Conquest", "operator": "Security%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cordova - Anchorage", "msn": "441-0329", "yom": 1983, "flight_number": null, "city": "Anchorage-Ted Stevens Intl", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17000, "captain_hours_type": 50, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11049, "circumstances": "The airline transport pilot was landing a retractable landing gear-equipped turboprop airplane on a 10,900 foot long, by 150 foot wide paved runway. According to the pilot, while on approach to land, he selected 10 degrees of wing flaps, and then selected the landing gear selector switch to the down position, which was followed by \"three greens\", indicating the landing gear was down, locked, and safe for landing. He said that after touchdown, during the initial landing roll, the landing gear retracted, and the airplane slid on the underside of the fuselage. The airplane veered to the right of the runway centerline, and the right wing collided with numerous runway edge lights. A post crash fire ensued when the right wing's fuel tank was breached. The airplane received structural damage to the underside of the fuselage, and the right wing was destroyed. Propeller strike marks originated in the vicinity of the accident airplane's touchdown point, and extended to the airplane's final resting point, about 2,200 feet from initial contact. A postaccident inspection of the airplane by the IIC and another NTSB air safety investigator, disclosed no evidence of any pre accident mechanical malfunction of the landing gear assembly or its associated operating systems. The airplane was placed on jack stands and hydraulic pressure was supplied to the airplane's hydraulic system using a hydraulic ground power unit. The airplane's landing gear retraction system was cycled numerous times, with no mechanical anomalies noted. ", "probable_cause": "The pilot's failure to lower the airplane's landing gear during landing, which resulted in an inadvertent wheels up landing.\n"}