{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-222-charlotte", "date": "Oct 25, 1986 at 2008 LT", "type": "Boeing 737-200", "operator": "Piedmont%20Airlines2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Newark - Charlotte - Myrtle Beach", "msn": "19073", "yom": 1968, "flight_number": "PI467", "city": "Charlotte-Douglas", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 114, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10000, "captain_hours_type": 2500, "copilot_hours": 4100, "copilot_hours_type": 500, "aircraft_hours": 41714, "circumstances": "During arrival, Piedmont flight 467 was vectored for an ILS runway 36R approach. At 2001 cdt (approximately 7 minutes before landing), all arriving flights were advised the weather was (in part): 400 feet overcast, visibility 2 miles with light rain and fog, wind from 090° at 8 knots. Runway 05/32 was out of-svc at that time. Flight 467 was vectored for right turns (from north and west) onto final approach. At 2002:42, the ATC final controller told another flight (same frequency) that there was a 20 to 25 knots right crosswind on final approach. When flight 467 was cleared for landing at 2005:36, the surface wind was reported from 100° at 4 knots. The aircraft was not configured for landing until just before touchdown and the copilot did not alert the captain of the deviation. The aircraft landed approximately 3,200 feet from the threshold and the captain was unable to stop on the wet runway. After departing the runway, the aircraft hit an ILS antenna and a culvert, then went thru a fence and stopped beside railroad tracks. Reportedly, the captain added 20 knots to approach speed for possible wind shear and delayed spoiler option after touchdown. There was evidence of hydroplaning and poor frictional quality on last 1,500 feet of runway. Three passengers received back injuries; both pilots and one flight attendant had minor injuries.  ", "probable_cause": "The captain's failure to stabilize the approach and his failure to discontinue the approach to a landing that was conducted at an excessive speed beyond the normal touchdown point on a wet runway. Contributing to the accident was the captain's failure to optimally use the airplane decelerative devices. Also contributing to the accident was the lack of effective crew coordination during the approach. Contributing to the severity of the accident was the poor frictional quality of the last 1,500 feet of the runway and the obstruction presented by a concrete culvert located 318 feet beyond the departure end of the runway."}