{"url": "https://www.baaa-acro.com/crash/crash-casa-nurtanio-cn-235m-200-pic-du-pioulou-7-killed", "date": "Dec 17, 2003 at 1035 LT", "type": "Casa-Nurtanio CN-235 (IPTN)", "operator": "Armee-de-lAir-2", "flight_phase": "Flight", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "Mountains", "schedule": "Toulouse - Toulouse", "msn": "C-043", "yom": 1990, "flight_number": "COTAM 1492", "city": "Pic du Pioulou", "zone": "Ariège", "country": "France", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 3053, "captain_hours_type": 2683, "copilot_hours": 1319, "copilot_hours_type": 924, "aircraft_hours": 4925, "circumstances": "Based at Creil AFB (BA110), the aircraft was dispatched at Toulouse-Francazal AFB on December 15 for a period of three days to conduct local missions with paratroopers. Undel callsign Cotam 1492, the aircraft departed Toulouse-Francazal Airport at 0952LT with 12 paratroopers and four crew members on board on behalf of the Escadron de Transport 01.062 Vercors. At 1017LT, while approaching the drop zone of Tour du Crieu at an altitude of 12,000 feet, nine skydivers left the cabin. Then the captain informed ground he want to conduct a low flight over the Pyrenees mountains for a period of 10-15 minutes before returning to the base. At 1025LT, the aircraft entered the Ariege valley between Foix and Tarascon then the Vicdessos valley. Approaching Suc-et-Sentenac at 1034LT, the aircraft turn to the right and started to climb to pass over the Pic du Pioulou. The climb was started at an altitude of 3,700 feet (600 feet above ground) with a rate of climb of 3,000 feet per minute and a speed of 170 knots. Due pass the Pic du Pioulou (7,200 feet high), the aircraft should climb at least 3,500 feet on a distance of 4,500 metres with an average slope of 23,4% which is over the aircraft capabilities. While climbing with a speed of 100 knots, the stick shaker activated and the stall warning sounded. The speed continued to drop and the aircraft nosed up, reaching an angle of attack of 55°. At a speed of 55 knots, the aircraft stalled, rolled to the left and crashed on the slope of the Pic du Pioulou at an altitude of 1,830 metres. The aircraft was destroyed by impact forces and all seven occupants (four crew members and three paratroopers) were killed. \r\nCrew:\r\nCpt Charles Edouard Bardinet, \r\nAsp Mallory Bernard,\r\nAdj David Roux,\r\nAdj/C Serge Kaczala,\r\nCap/C Mickael Larivière,\r\nCap/C Jérôme Garcia,\r\nCpt Aude Tessier. ", "probable_cause": "The accident, which occurred in a delicate aeronautical environment (mountain flying) sees its causes primarily related to the human factor. It occurred during the execution of an unscheduled and unprepared flight phase, by decision of the captain during the flight. Meanwhile, several factors point to an improvable rigor in actions performed by some crew members of this unit. A decision to change the mission in flight combines several errors that led to the accident:\r\n- Overconfidence of the crew, unaccustomed to mountain flying, which engaged in a topography of which they underestimated the difficulty, the insidiously, because gradually, increasing slope,\r\n- A lack of decision in the cockpit that originated in the establishment of a \"soft consensus\" itself resulting from functions, qualifications and personalities of various crew members,\r\n- Incorrect assessment of the situation and the capabilities of the aircraft with regards to the topography,\r\n- A lack of reaction in a degraded situation."}