{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-100-muncho-lake-1-killed", "date": "Jul 8, 2007 at 1235 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Liard%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Muncho Lake – Prince George", "msn": "108", "yom": 1968, "flight_number": null, "city": "Muncho Lake", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 22000, "captain_hours_type": 6000, "copilot_hours": 10800, "copilot_hours_type": 105, "aircraft_hours": null, "circumstances": "At approximately 1235 Pacific daylight time, the Liard Air Limited de Havilland DHC-6-100 Twin Otter (registration C-FAWC, serial number 108) was taking off from a gravel airstrip near the Northern Rockies Lodge at Muncho Lake on a visual flight rules flight to Prince George, British Columbia. After becoming airborne, the aircraft entered a right turn and the right outboard flap hanger contacted the Alaska Highway. The aircraft subsequently struck a telephone pole and a telephone cable, impacted the edge of the highway a second time, and crashed onto a rocky embankment adjacent to a dry creek channel. The aircraft came to rest upright approximately 600 feet from the departure end of the airstrip. An intense post-impact fire ensued and the aircraft was destroyed. One passenger suffered fatal burn injuries, one pilot was seriously burned, the other pilot sustained serious impact injuries, and the other two passengers received minor injuries. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The take-off was attempted at an aircraft weight that did not meet the performance capabilities of the aircraft to clear an obstacle and, as a result, the aircraft struck a telephone pole and a telephone cable during the initial climb.\r\n2. A take-off and climb to 50 feet performance calculation was not completed prior to take-off; therefore, the flight crew was unaware of the distance required to clear the telephone cable.\r\n3. The southeast end of the airstrip was not clearly marked; as a result, the take-off was initiated with approximately 86 feet of usable airstrip behind the aircraft.\r\n4. The take-off was attempted in an upslope direction and in light tailwind, both of which increased the distance necessary to clear the existing obstacles.\r\nFindings as to Risk:\r\n1. Operational control within the company was insufficient to reduce the risks associated with take-offs from the lodge airstrip.\r\n2. The take-off weight limits for lodge airstrip operations were not effectively communicated to the flight crew.\r\n3. Maximum performance short take-off and landing (MPS) techniques may have been necessary in order to accomplish higher weight Twin Otter take-offs from the lodge airstrip; however, neither the aircraft nor the company were approved for MPS operations.\r\n4. The first officer’s shoulder harness assembly had been weakened by age and ultraviolet (UV) light exposure; as a result, it failed within the design limits at impact.\r\n5. The SeeGeeTM calculator operating index (OI) values being used by Liard Air Twin Otter pilots was between 0.5 and 1.0 units greater than the correct SeeGeeTM OI values; therefore, whenever the SeeGeeTM calculator was used for flight planning, the actual centre of gravity (c of g) of the aircraft would have been forward of the calculated CofG. \r\n6. There are no airworthiness standards specifically intended to contain fuel and/or to prevent fuel ignition in crash conditions in fixed-gear United States Civil Aviation Regulation 3 and United States Federal Aviation Regulation 23 aircraft. \n"}