{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-carlsbad-2-killed", "date": "Jul 3, 2007 at 0606 LT", "type": "Beechcraft 90 King Air", "operator": "Southwest Consulting Group", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Carlsbad - Tucson", "msn": "LW-64", "yom": 1973, "flight_number": null, "city": "Carlsbad", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1177, "captain_hours_type": 284, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9032, "circumstances": "The airport is on a plateau, and the surrounding terrain is lower than the runway. After departing runway 24, the airplane collided with the top conductor of a telephone line an estimated 2,500 feet from the departure end of the runway. The airport elevation was 331 feet msl and the estimated elevation of the line was 245 feet. The debris path was along a magnetic bearing of 270 degrees. Both left and right engines displayed contact signatures to their internal components that were characteristic of the engines producing power at the time of impact. Fire consumed the cabin and cockpit precluding a meaningful examination of instruments and systems. An aviation routine weather report (METAR) issued about 13 minutes before the accident stated that the winds were calm, visibility was 1/4 mile in fog; and skies were 100 feet obscured. An examination of the pilot's logbook indicated that the pilot had a total instrument flight time of 268 hours as of June 21, 2007. In the 90 prior days he had flown 11 hours in actual instrument conditions and logged 20 instrument approaches.", "probable_cause": "The pilot's failure to maintain clearance from wires during an instrument takeoff attempt. Contributing to the accident were fog, reduced visibility, and the low ceiling."}