{"url": "https://www.baaa-acro.com/crash/crash-antonov-26b-ust-kuyga", "date": "Dec 27, 2002", "type": "Antonov AN-26", "operator": "Dauriya", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yakutsk - Ust-Kuyga", "msn": "109 09", "yom": 1981, "flight_number": null, "city": "Ust-Kuyga", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17609, "circumstances": "Following an uneventful cargo flight from Yakutsk, the crew started the approach to Ust-Kuyga on a polar night with an OAT of -51° C. On final approach, at a distance of 1,150 metres from the runway threshold, the aircraft deviated to the right by 150 metres. The captain was instructed by ATC to initiate a go-around but he decided to continue the approach. Unstable, the aircraft's speed dropped to 210 km/h and on the last segment, it lost height, causing the right main gear to struck the runway surface. On impact, the right main gear was torn off, followed shortly later by the nose gear. Out of control, the aircraft slid for few dozen metres before coming to rest. All six occupants escaped uninjured and the aircraft was damaged beyond repair. ", "probable_cause": "The following findings were identified:\r\n- Wrong approach configuration on part of the crew,\r\n- The aircraft was unstable on approach, \r\n- The approach' speed of 210 km/h was insufficient (20 km/h below the prescribed speed), \r\n- On the last segment, the aircraft rolled to the right following improper actions from the crew, \r\n- The crew failed to initiate a go-around and ignored ATC instructions, \r\n- The configuration adopted by the crew resulted in the aircraft making a deliberate descent to the right of the approach pattern."}