{"url": "https://www.baaa-acro.com/crash/crash-boeing-kc-97g-29-do-stratotanker-hamilton-10-killed", "date": "Jun 29, 1964", "type": "Boeing KC-97 Stratotanker", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Aerial photography", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Hamilton - Hamilton", "msn": "16804", "yom": 1952, "flight_number": null, "city": "Hamilton", "zone": "All Bermuda", "country": "Bermuda", "region": "North America", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 29 June 1964, a Douglas HC-54 (serial number 42-72590, of the USAF 57th Air Rescue Squadron) and a Boeing HC-97 (serial number 52-2773, USAF 55th Air Rescue Squadron) were involved in an aerial photography mission near Kindley Air Base, Bermuda. To support the NASA Gemini program, it was necessary to train pararescue personnel in the delivery and installation of flotation collars on the Gemini' space capsule. This required placing personnel performing temporary duty at Bermuda where water jumps were to be conducted. In conjunction with this training, a requirement existed to support preparation of a film concerning the \"pararescue\" mission. Since the two requirements appeared compatible, they were combined into one mission. The HC-97 took off at 11:05 local time, and the HC-54 took off at 11:10. The weather was 2,000 feet scattered clouds, 2,500 feet scattered clouds, visibility 9 miles, and winds variable at 8 knots. Both aircraft arrived in the drop area and because of the clouds, decided to fly the mission at 1,700 feet (below the clouds). Aboard each aircraft were, photographers and pararescuemen. There were also photographers aboard the boats in the drop area to photograph the drop from the surface. As they had briefed before the flight the aircraft established themselves in proper positions. The first run had the HC-97 taking photos as the HC-54 (which was slightly forward and below) began deploying the pararescuemen. Right-hand patterns were flown, and photos were to be shot with the sun behind the cameras, and at an angle that would not reveal any of the land surface in the photos. After a few passes over the drop area with the pararescuemen being deployed from the HC-54, the aircraft changed positions. This placed the HC-54 slightly ahead and below and to the left of the HC-97. After flying one dry run and again in the right-hand pattern, two pararescuemen deployed from the HC-97. Seconds later, the two aircraft collided. The HC-54D suddenly banked to the right, colliding with the HC-97G, hitting the wing or midsection of the HC-97G and sheering both its wing and the tail section, and both aircraft immediately plunged towards the water. The three boats in the area immediately began a search for any survivors. Both aircraft were destroyed, and there were no survivors.\r\nSource: Facebook page Bermuda Air Collision", "probable_cause": "The primary cause of the accident was undetermined, but Air Force investigators concluded that probable cause was an incapacitation of the HC-54 pilot. An autopsy revealed cardiovascular issues which may have caused acute chest pains."}