{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049-super-constellation-mcchord-afb", "date": "Sep 6, 1953 at 0231 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "Northwest%20Airlines2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Seattle – Chicago", "msn": "4014", "yom": 1952, "flight_number": "NW008", "city": "McChord AFB", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 26, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10863, "captain_hours_type": 263, "copilot_hours": 4230, "copilot_hours_type": 206, "aircraft_hours": 4509, "circumstances": "Northwest Airlines' Flight 8 departed Seattle-Tacoma Airport at 0148, September 6, 1953, for a nonstop flight to Chicago, Illinois. Gross weight on takeoff was 105,839 pounds; maximum allowable for takeoff was 116,740; maximum allowable for landing was 98.500 pounds. The location of the center of gravity was within prescribed limits. Weather at Seattle-Tacoma Airport during takeoff was: ceiling 200 feet and one-fourth mile visibility. Just after the aircraft became airborne No. 3 propeller oversped. Attempts by the flight engineer to correct this condition were unsuccessful and feathering was started one and one-half minutes later. However, the propeller continued to rotate at about 400 r.p.m. The flight's takeoff alternate was Yakima, Washington (a distance of 122 miles), but due to high terrain en route the captain elected to request clearance to proceed to Portland, Oregon (a distance of 132 miles), at 5,000 feet. This clearance was granted immediately. Using METO 2 power the aircraft reached 5,000 feet, well above the overcast, about 14 minutes after takeoff. Near the end of this climb the oil temperature of No. 4 engine was exceeding limits and the oil supply was being rapidly reduced. The flight engineer attempted to lower the temperature by fully opening the oil cooler flap. Temperature, however, remained high and the oil quantity continued to dwindle fast. Accordingly, the No. 4 propeller was feathered at about 0205 at the order of the captain who then declared an emergency and elected to land at McChord Air Force Base. Radio communication was established with McChord and arrangements made for a GCA approach after a short delay in establishing a frequency. No. 3 propeller had not feathered fully and was still windmilling at approximately 400 r.p.m. Meanwhile the captain had requested \"takeoff\" flaps, but the flaps would not extend hydraulically, and the copilot went to the cabin to crank them down. He stated that he turned the crank about 15-20 turns, at which point he found that it would no longer turn freely, whereupon he backed it to its original position. He was then called back to the cockpit to assist the captain in controlling the aircraft. Control difficulty had been continuously experienced with the aircraft yawing sharply and dropping a wing. The captain had placed the trim controls approximately in neutral, believing that he had a better feel and control of the aircraft without them at the recommended minimum speed of 130 knots. The aircraft, which had re-entered the overcast at about 2,000 feet, was then several miles from McChord Field under GCA direction on its first approach when its position and heading became such that the GCA operator directed a box pattern be flown to establish a proper approach. The second approach was executed in accordance with the directed pattern and the final approach was in line with Runway 34. The landing gear control was not actuated for gear extension until the aircraft broke out of the overcast at an altitude estimated at between 500 and 800 feet on a GCA controlled straight-in approach to Runway 34. At this time the captain ordered that No. 3 be unfeathered but it would not unfeather and continued to windmill. Only the right main gear extended fully and locked, as Indicated by its green light, but the landing was then committed. Shortly after touchdown retraction of the unlocked nose and left main gears allowed the aircraft to veer off the runway to the left. It then skidded sideways to its right, folding the right main gear inward, and the No. 2 engine was torn free. The aircraft came to rest on a heading of 212 degrees some 3,000 feet from the point of touch and about 7,000 feet short of the far end of the 10,000-foot runway. At about that time a gasoline fire started and spread rapidly over the ground below the airplane. Previously alerted fire apparatus, already standing by, kept the fire from spreading while all passengers and four of the crew left quickly by the main cabin door, the door sill being five or six feet above the ground. The flight engineer and the captain left by the cockpit crew door after ascertaining the cabin to be empty. All 32 occupants ware clear within an estimated two minutes. There were no fatalities although several persons were treated for burns at the McChord Air Force Base Hospital.", "probable_cause": "The Board determines that the probable cause of this accident was a sequence of mechanical failures resulting in an emergency landing under adverse weather conditions with insufficient hydraulic pressure in the secondary system to extend fully the landing gear in the time available. A contributing factor was the design of the hydraulic system which did not permit use of the available pressure in the primary system for that purpose. The following findings were pointed out:\r\n- Shortly after takeoff the aircraft lost the use of No. 3 engine due to an overspeeding propeller, and continued windmilling,\r\n- Weather conditions at Seattle-Tacoma were satisfactory for takeoff but were below landing minimums and the captain elected to proceed to Portland,\r\n- After reaching cruising altitude No. 4 propeller was feathered because of high engine oil temperature and depletion of oil supply,\r\n- After losing the use of No. 4 engine, the captain declared an emergency and set up a GCA approach to McChord Air Force Base,\r\n- A malfunction of the landing gear selector valve prevented normal use of the diminished hydraulic pressure to extend the flaps,\r\n- A GCA instrument approach to McChord was necessary because of weather conditions. The captain decided that he would extend the gear only after breaking out under the low overcast,\r\n- The short time interval between breaking out and touchdown was insufficient for extension and locking of all three landing gears with the existing hydraulic pressure,\r\n- After touchdown the unlocked and partially extended left main and nose gears were forced up into their wheel wells with complete loss of control of the aircraft's ground movement, and fire occurred after rupture of the fuel tanks,\r\n- The functional failure of No. 3 propeller governor was due to foreign metallic particles,\r\n- The reason for the loss of oil supply for No. 4 engine was undetermined,\r\n- The landing gear selector valve was improperly seated, resulting in insufficient hydraulic pressure."}