{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-cooplacurripa-1-killed", "date": "Dec 19, 1994 at 1940 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Walcha%20Aerial%20Services", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Cooplacurripa - Cooplacurripa", "msn": "1617", "yom": 1966, "flight_number": null, "city": "Cooplacurripa", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 800, "captain_hours_type": 350, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was operating from an agricultural airstrip 600 feet above mean sea level, spreading superphosphate over moderately steep undulating terrain. The duration of each flight was 6-7 minutes. The accident flight was the seventh and probably intended to be the last for the day. A witness, who was situated under the flight path, reported that the aircraft was tracking east-north-east in what appeared to be normal flight. Her attention was distracted for a few moments and when she next saw the aircraft it was in a near vertical dive with the upper surface of the wings facing her. The aircraft then struck the hillside and burst into flames. Examination of the wreckage did not reveal any pre-existing defect which may have contributed to the accident. Impact marks on the propeller indicated that the engine was operating at impact. The superphosphate load remained in the hopper and the emergency dump system actuating lever was in the closed position. Inspection indicated that the dump system was serviceable prior to impact. Calculations indicated that at the time of the accident the aircraft, although heavily loaded, was operating within the flight manual maximum weight limitation. A light north-easterly wind was observed at the airstrip. However, at the accident site, which was about 250 feet higher, the wind was a moderate west-north-westerly. Sky conditions were clear with a visibility of 30 km. The aircraft probably experienced windshear and turbulence as it encountered a quartering tailwind approaching the ridgeline. The result would have been a reduction in climb performance and it is likely that the pilot attempted to turn the aircraft away from the rising terrain. During the turn it appears that the aircraft stalled and that the pilot was unable to regain control before it struck the ground.", "probable_cause": "The reason the pilot did not dump the load when the climb performance was reduced could not be determined.\r\nThe following factors were determined to have contributed to the accident:\r\n1. Shifting wind conditions conducive to windshear and turbulence were present in the area.\r\n2. The aircraft was climbing at near to maximum allowable weight.\r\n3. Control of the aircraft was lost with insufficient height available to effect a recovery."}