{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-10f-memphis", "date": "Jul 28, 2006 at 1125 LT", "type": "Douglas DC-10", "operator": "FedEx", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Seattle - Memphis", "msn": "46625/169", "yom": 1975, "flight_number": "FDX630", "city": "Memphis", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11262, "captain_hours_type": 4402, "copilot_hours": 854, "copilot_hours_type": 244, "aircraft_hours": 73283, "circumstances": "The approach and landing were stabilized and within specified limits. Recorded data indicates that the loads experienced by the landing gear at touchdown were within the certification limits for an intact landing gear without any pre-existing cracks or flaws. The weather and runway conditions did not affect the landing. The application of braking by the accident crew, and the overall effect of the carbon brake modification did not initiate or contribute to the landing gear fracture. Post-accident modifications to the MD-10 carbon brake system were implemented due to investigative findings for the purposes of braking effectiveness and reliability. Post accident emergency response by the flight crew and ARFF was timely and correct. The left main landing gear (LMLG) outer cylinder on the accident airplane had been operated about 8 ½ years since its last overhaul where stray nickel plating likely was introduced in the air filler valve hole. Nickel plating is a permissible procedure for maintaining the tolerances of the inner diameter of the outer gear cylinder, however the plating is not allowed in the air filler valve bore hole. Literature and test research revealed that a nickel plating thickness of 0.008\" results in a stress factor increase of 35%. At some point in the life of the LMLG, there was a load event that compressively yielded the material in the vicinity of the air filler valve hole causing a residual tension stress. During normal operations the stress levels in the air filler valve hole were likely within the design envelope, but the addition of the residual stress and the stress intensity factor due to the nickel increased these to a level high enough to initiate and grow a fatigue crack on each side of the air filler valve hole. The stresses at the air filler valve hole were examined via development of a Finite Element Model (FEM) which was validated with data gathered from an instrumented in-service FedEx MD-10 airplane. The in-service data and FEM showed that for all of the conditions, the stress in the air filler valve hole was much higher than anticipated in the design of the outer cylinder. Fatigue analysis of the in service findings and using the nickel plating factor resulted in a significantly reduced fatigue life of the gear cylinder compared with the certification limits. During the accident landing the spring back loads on the LMLG were sufficient to produce a stress level in the air filler valve hole that exceeded the residual strength of the material with the fatigue cracks present.", "probable_cause": "The failure of the left main landing gear due to fatigue cracking in the air filler valve hole on the aft side of the landing gear. The fatigue cracking occurred due to the presence of stray nickel plating in the air filler valve hole. Contributing to this was the inadequate maintenance procedures to prevent nickel plating from entering the air filler valve hole during overhaul."}