{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-h18-tatum-1-killed", "date": "Jul 1, 2002 at 1315 LT", "type": "Beechcraft H18", "operator": "Eureka Operating Company", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Taos - Odessa", "msn": "BA-724", "yom": 1965, "flight_number": null, "city": "Tatum", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 30000, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6466, "circumstances": "A witness reported hearing the distinctive sound of a radial engine just before the crash, and right after that a loud crashing noise. The witness observed a large cloud of dust forming, subsequently saw the plane parts scattering from west to east across the pasture, and then observed the fuselage come to rest. A second witness saw the airplane hit the ground and a cloud of dust form about one-quarter of a mile long and as high as a highline wire. The witness said that after the dust settled he saw scattered plane parts, a highline wire down, and a wing part spilling fuel. The witness also stated that the airplane was traveling from west to east and looked horizontal at impact At 12:59:57, approximately 10 minutes prior to the time of the accident, air traffic control radar identified a target 8 nautical miles northwest of the accident site at an altitude of 5,500 feet mean sea level (MSL). However, this target could not be positively identified as the accident airplane. A postmortem examination of the pilot by a Medical Investigator reported significant natural disease findings included coronary atherosclerosis (hardening and narrowing of the arteries), and chronic thyroiditis (inflammation of the thyroid gland). Both of these diseases can cause sudden cardiac problems including an arrhythmia or heart attack.", "probable_cause": "The failure of the pilot to maintain clearance."}