{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-14p-brest-1-killed", "date": "Sep 26, 1960", "type": "Ilyushin II-14", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow – Moguilev – Minsk – Brest", "msn": "1460 007 04", "yom": 1956, "flight_number": "SU607", "city": "Brest", "zone": "Brest voblast", "country": "Belarus", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 1, "pax_on_board": 21, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6363, "circumstances": "The airplane departed Minsk Airport at 1245LT bound for Brest. While cruising at an altitude of 9,000 feet, the crew noted that the oil temperature on the right engine increased while the temperature of the second breech dropped. In such situation, the captain decided to shot down the right engine, feathered its propeller and continued to Brest. At 1405LT, he notified his situation to ATC and started the descent to Brest Airport in marginal weather conditions. On final approach, at an altitude of 40 meters, the undercarriage and flaps were lowered when the captain was instructed to go around. For unknown reason, he continued the approach and the right main gear touched down 390 meters past the runway threshold. The left main gear touched down 73 meters farther and after a course of 930 meters, the airplane overran and collided with the ILS antenna before coming to rest in flames. All 21 passengers were injured while five crew members were seriously wounded. The board mechanic died from his injuries five hours later. The aircraft was destroyed. ", "probable_cause": "The right engine has to be shut down in flight because of the failure of the second cylinder due to a manufacture defect. Following poor techniques on part of the captain, the approach configuration on one engine was wrong and the third turn on final was completed too late. Marginal weather conditions, a wet runway surface and a limited visibility were considered as contributing factors. "}