{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-near-joinville-2-killed", "date": "Sep 13, 1996 at 2226 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Helisul", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Porto Alegre - Joinville", "msn": "110-048", "yom": 1975, "flight_number": null, "city": "Joinville", "zone": "Santa Catarina", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7794, "captain_hours_type": 594, "copilot_hours": 1592, "copilot_hours_type": 872, "aircraft_hours": null, "circumstances": "The crew departed Porto Alegre on a night cargo flight to Joinville. The JNV NDB beacon and the next PP NDB were selected by the crew to start the descent to Joinville Airport, with a minimum safe altitude fixed at 770 feet. After the aircraft passed over JNV beacon, the ADF system was unable to find the PP NDB as it was inoperative so the aircraft initiated a turn heading 051° towards the PP beacon located near São Paulo-Congonhas Airport. The crew did not notice the change of heading and continued the descent when few minutes later, the aircraft struck a hill and crashed. Both pilots were killed. ", "probable_cause": "The following findings were reported: \r\n- Possible crew fatigue that diminished their performances, \r\n- Possible psychological and organizational diminution, \r\n- Possible inadequate supervision of the operator in flight planning, and non-compliance with procedures in force, \r\n- Following a lack of crew resources management, the crew failed to follow the standard descent procedures,\r\n- Poor approach planning on part of the crew, \r\n- It is possible that the crew did not observe sufficient rest time, \r\n- It is also possible that there was an intentional disobedience by the crew of ATC rules and operational standards, in relation to the use of the GPS equipment during the descent, even though this was not approved for such procedure."}