{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-56-24-lodestar-marlborough-1-killed", "date": "Nov 5, 1954 at 1942 LT", "type": "Lockheed 18 LodeStar", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Plain, Valley", "schedule": "LaGuardia – Boston", "msn": "2353", "yom": 1943, "flight_number": null, "city": "Marlborough", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 8700, "captain_hours_type": 200, "copilot_hours": 1600, "copilot_hours_type": 600, "aircraft_hours": 1500, "circumstances": "At approximately 1845, N9201H departed LaGuardia Airport, New York, on a VFR (Visual Flight Rules) flight to Logan Airport, Boston, Massachusetts. The crew consisted of Captain John K. MacKenzie and Copilot Whitney H. Welch. The passengers were Robert W. Mudge, Raymond J. Halloran, both airline pilots, and Mathew C. Abbott, an electrical engineer. Climbing to an altitude of 3,500 feet m. s. l. (mean sea level), the flight proceeded toward Boston. Approximately 12 miles southeast of Hertford, Connecticut, the right engine became very rough and backfired frequently. The captain was unable to correct this condition and later feathered the right propeller when in the vicinity of Willimantic, Connecticut. A wide right turn was made from a northeasterly to a northwesterly heading toward Bradley Field, Windsor Locks, Connecticut. Communication was established with Bradley Field and the flight was cleared for a straight-in approach to runway 33. The aircraft descended to 2,500 feet m. s. l. during the turn and thereafter continued descending on a northwest heading until it struck trees and crashed. Nearby residents quickly reached the scene, gave assistance and notified authorities. The Bradley Field 1930 weather was: Scattered clouds at 4,500 feet, visibility 15 miles plus, temperature 40 degrees, dewpoint 32, wind northwest 6 m. p. h. La Guardia weather at the time of departure was: Ceiling unlimited, visibility 15 miles plus. Conditions en route were clear with excellent visibility. The twin engine airplane was the property of Mr. John Fox. ", "probable_cause": "The Board determines that the probable cause of this accident was that after failure of the right engine, accepted single-engine procedure was not followed, which resulted in the aircraft losing altitude and striking the ground. The following findings were reported:\r\n- Weather was not a factor in the accident,\r\n- A structural failure occurred in the power section of the right engine that necessitated feathering of the right propeller,\r\n- Failure to attain single-engine performance resulted in loss of altitude,\r\n- Mechanical difficulties in the left engine reduced power but remaining available power was sufficient for single-engine performance."}