{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-ketchikan-1-killed-0", "date": "Jul 23, 2010 at 0727 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Pacific%20Airways", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Thorne Bay - Ketchikan", "msn": "1387", "yom": 1959, "flight_number": null, "city": "Ketchikan", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5300, "captain_hours_type": 4500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 21065, "circumstances": "The pilot had been advised by the Federal Aviation Administration flight service station (FSS) specialist to remain clear of the destination airport until the specialist could issue a special visual flight rules clearance. Instrument meteorological conditions prevailed at the airport, with a strong southeasterly wind. About 8 minutes after initial contact, the FSS specialist attempted to contact the pilot to issue the clearance but received no response. A witness about 0.5 mile southeast of the accident site said he saw the accident airplane flying very low over the treetops. He said the weather conditions consisted of low clouds, rain, and gusty southeasterly wind estimated at 30 to 40 knots. He said that, as the airplane passed overhead, it turned sharply to the left. As he watched the airplane, the wings rocked violently from side to side, and the nose pitched up and down. As the airplane passed low over hilly, tree-covered terrain, it rolled to the right, the right wing struck a large tree and separated, and the airplane descended behind a stand of trees. Pilots flying in the accident area reported strong wind with significant downdrafts and turbulence. A postaccident examination of the airplane did not disclose any preimpact mechanical malfunctions. Given the lack of mechanical deficiencies and the reports of turbulence and downdrafts, as well as the witness’ account of the airplane’s physical movements, it is likely that the pilot encountered significant terrain-induced turbulence and downdrafts while flying at low altitude. The area surrounding the accident site and portions of the pilot's earlier flight path were bordered by large areas of open and protected water, several of which were suitable for landing the float-equipped airplane.\n", "probable_cause": "The pilot’s decision to continue the flight toward his destination in significant turbulence and downdrafts, and his subsequent failure to maintain control of the airplane while flying low over rising terrain.\n"}