{"url": "https://www.baaa-acro.com/crash/ground-fire-antonov-12bp-leipzig", "date": "Aug 9, 2013 at 0208 LT", "type": "Antonov AN-12", "operator": "UAA-Ukraine-Air-Alliance", "flight_phase": "Parking", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Leipzig - Mineralnye Vody", "msn": "9 3 469 04", "yom": 1969, "flight_number": null, "city": "Leipzig-Halle", "zone": "Saxony", "country": "Germany", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 8 August 2013 at 1914 hrs the airplane, arriving from Stockholm, Sweden, landed at Leipzig/Halle Airport. After the landing it taxied to apron 2 to stand 207. On board the airplane were the Pilot in Command (PIC), the co-pilot, one flight engineer, one navigator, one radio operator, and two flight mechanics. The driver of the fueling vehicle stated that the airplane was refuelled between 0058 and 0121 hrs with 22,809 l fuel. The flight engineer stated that approximately at the same time the loading had occurred and was completed at about 0140 hrs. Between 2330 and 0100 hrs the airplane was loaded with 48,960 one-day-old chickens. They had a total mass of 3,061 kg. Take-off for the flight to Mineralye Vody, Russia, was planned for 0215 hrs. At 0201 hrs the engine start-up clearance was issued and the APU started. After the APU was running, engine No 1, outer left, was started. Once engine No 1 had reached idle speed the start-up for engine No 4, outer right, was begun. During engine start-up of engine No 4 the crew noticed a dull bang and the airplane jerked. The co-pilot, who monitored the APU instruments during engine start-up, had observed rotary speed oscillations and a temperature rise. A short time later the APU fire warning indication illuminated. The crew shut off the two already running engines and triggered the APU fire extinguisher system. One photo (see Appendix) shows a glaring light on the left fuselage side. At this time propellers 1 and 4 were turning; propellers 2 and 3 stood still. Video recordings show fire in the area of the left main landing gear. The co-pilot stated that the PIC had then opened the cockpit door. Flames were already visible in the cargo compartment. The PIC stated that he sent one of the flight mechanics outside for a check. He left the aircraft through the emergency exit located in the floor of the cockpit. After he had left the airplane, he immediately reported that the APU was burning. Subsequently, the three fire extinguishers located in the cockpit were handed down. In addition, the flight engineer and the second flight mechanic left the airplane; they confirmed the fire. Together the three men tried to extinguish the fire with on-board fire extinguishers. The PIC instructed the radio operator to report the situation to the tower. At 0207:45 hrs the radio operator reported the fire and requested the fire brigade. Around 0208 hrs the fire was noticed by other witnesses. They stated that the area of the left main landing gear was burning and that in this area on the left side below the fuselage some liquid leaked on to the ground. At 0208:01 hrs the tower alerted the fire station east. Half a minute later the fire station west was alerted. At 0209:00 hrs the tower announced the location of the fire. At 0212:06 hrs the first fire truck reached the airplane and undertook the first extinguishing attempt with foaming agent. The crew members evacuated the airplane through the front emergency exit located in the floor of the cockpit. Then they left the danger zone and retreated to a grassy area about 50 m in front of the airplane.", "probable_cause": "The fire originated in the APU and propagated rapidly to the cargo compartment. The fire was not contained within the APU chamber. The propagation and severity of the fire were aided by the leaking fuel from the fuselage bottom tanks and the burning light metal alloy components of the APU. "}