{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61p-aerostar-ted-smith-601p-moscow-1-killed", "date": "Apr 23, 2002 at 1343 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Columbine Farm", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Lamar - Liberal", "msn": "61-0760-8063377", "yom": 1980, "flight_number": null, "city": "Moscow", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 17725, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2442, "circumstances": "The airplane was destroyed during an attempted forced landing following an in-flight fire in cruise flight. The pilot was reported to be flying the airplane to an airport in order to have maintenance work performed on the right engine due to a boost problem. It was reported that the pilot had another mechanic at another airport look at the airplane. A work order for a transient airplane was found that indicated work performed on the right engine turbocharger system about 1 month before the accident. The work order shows that the wastegate oil filter was found clogged and collapsed and that it was cleaned, straightened and reinstalled. The pilot operated the airplane with a right engine boost problem. The boost problem with the right engine is evidenced by the previous work order, the excessive amount of runway used during takeoff, the reported smoke from the right engine after takeoff, and the airplane not climbing as expected after takeoff. Due to the reduced power from the right engine, the pilot was required to apply left brake in order to maintain directional control during takeoff, as evidenced by the blued left brake disk with metal transfer into the relief holes and slots. As a result of the pilot using left brake during takeoff, a fire erupted in the left wheel well, which spread to the aft fuselage. This is evidenced by the sooting, fire, and heat damage to the wheel well, the carpet above the wheel well, and aft fuselage. The fuselage immediately behind the baggage compartment had extensive fire damage. The damage in this area included blistered paint on the upper surface, and a two foot square section of the left fuselage skin that was burned away. The area that was burned away was in the vicinity of the hydraulic fluid reservoir. The aluminum hydraulic fluid reservoir was not found, only the steel filler neck, mounting screws, and cap were found. No evidence of fire was found within the right main landing gear wheel well or in the engine compartments. A witness reported seeing the airplane flying south and trailing smoke then banking to the left making a complete circle before descending and ultimately impacting the ground.", "probable_cause": "The pilot's intentional operation of the airplane with a known engine boost problem resulting in the improper use of brakes to maintain directional control during takeoff, the brake system fire, and the loss of control for undetermined reasons during the emergency landing. A factor was the loss of engine power due to a restricted wastegate filter."}