{"url": "https://www.baaa-acro.com/crash/crash-antonov-12bp-naryan-mar-8-killed", "date": "Dec 11, 1997 at 1657 LT", "type": "Antonov AN-12", "operator": "Russian%20Air%20Force.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "5 3 434 04", "yom": 1965, "flight_number": null, "city": "Naryan-Mar", "zone": "Nenets Autonomous Okrug", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 8, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Mil Mi-8 registered RA-24247 just landed at Naryan-Mar Airport after completing a local flight with eight passengers and three crew members on board. Its crew was instructed to vacate via taxiway 4. Following an uneventful flight, the crew of the Antonov AN-12 was cleared to land on the same runway two minutes later. After touchdown, the aircraft collided with the helicopter. Both aircrafts were destroyed and while all nine people on board the Antonov were injured, among the 11 people on board the helicopter, eight were killed and three were injured. At the time of the accident, the visibility was reduced to 500 metres. ", "probable_cause": "The airport of Naryan-Mar is controlled by both civil and military services. The helicopter has been cleared to land by civil ATC and less than two minutes later, the aircraft was cleared by military ATC to land on the same runway. A lack of coordination between both ATC services was identified as the separation between both landings was insufficient. Nevertheless, it was also reported that the crew of the Antonov failed to follow ATC message after the controller in the tower instructed the crew to initiate a go-around procedure. The crew misinterpreted this order thinking ATC was referring to the lack of visibility and not to the presence of another aircraft on the runway.   "}