{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049c-super-constellation-carmel-4-killed", "date": "Dec 4, 1965 at 1619 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "Eastern-Airlines-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Boston – Newark", "msn": "4526", "yom": 1953, "flight_number": "EA853", "city": "Carmel", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 49, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 11508, "captain_hours_type": 1947, "copilot_hours": 8090, "copilot_hours_type": 899, "aircraft_hours": 32883, "circumstances": "Trans World Airlines, Inc., Flight 42, (TW 42), a Boeing 707, N748TW, and Eastern Air Lines, Inc., Flight 853, (EA 853), a Lockheed 1049C, N6218C, were involved in a midair collision over the Carmel, New York VORTAC while en route to the New York City area at approximately 1619 e.s.t., December 4, 1965. TW 42 departed San Francisco, California, and was approaching the New York area from the northwest for an approach and landing at the John F. Kennedy International Airport. The flight was on an IFR flight plan at an assigned altitude of 11,000 feet mean sea level (m.s.l.). EA 853 departed Boston, Massachusetts, and was approaching the New York area from the northeast for an approach and landing at the Newark Airport. This flight was on an IFR flight plan at an assigned altitude of 10,000 feet m.s.l. As EA 853 was approaching the Cannel VORTAC on a southwesterly heading, the first officer saw TW 42 at his two o'clock position. Because he believed the jet was at his altitude and on a collision course he called \"Look Out\" and grasped the control wheel to assist the captain in a pull up. At approximately the same time, the captain of TW 42 observed EA 853 at his ten o'clock position on what he believed to be a collision course. He rolled into a right turn and pulled back on the yoke. He decided this maneuver would not clear EA 853 and he, assisted by his first officer, attempted to reverse the turn by rolling to the left and pushing on the yoke. The aircraft collided at an altitude of approximately 11,000 feet m.s.l. While cruising at an altitude of some 10,000 feet over Carmel on approach to Newark, the four engine aircraft collided with a TWA Boeing 707-131B registered N748TW. While the crew of the B707 was able to complete an emergency landing at JFK Airport despite the fact that a piece of 7.5 meters from the left wing was torn off, the crew of the Constellation first lost control of his aircraft but then regain control and was able to make an emergency landing in a prairie located on Titicus mountain, near Carmel. Three passengers died, plus the Constellation's pilot, Captain Charles J. White, who had returned to the aircraft's cabin to help the last passenger.", "probable_cause": "Misjudgment of altitude separation by the crew of EA853 because of an optical illusion created by the up-slope effect of cloud tops resulting in an evasive manoeuvre by the EA853 crew and a reactionary evasive manoeuvre by the B707 crew as well."}