{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b60-duke-duette-2-killed", "date": "Mar 4, 2017 at 1330 LT", "type": "Beechcraft 60 Duke", "operator": "David B. Mutchler", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Sarasota - Sarasota", "msn": "P-425", "yom": 1977, "flight_number": null, "city": "Duette", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1120, "captain_hours_type": 200, "copilot_hours": 20900, "copilot_hours_type": 165, "aircraft_hours": 3271, "circumstances": "The private pilot, who had recently purchased the airplane, and the flight instructor were conducting an instructional flight in the multi-engine airplane to meet insurance requirements. Radar data for the accident flight, which occurred on the second day of 2 days of training, showed the airplane maneuvering between 1,000 ft and 1,200 ft above ground level (agl) just before the accident. The witness descriptions of the accident were consistent with the airplane transitioning from slow flight into a stall that developed into a spin from which the pilots were unable to recover before the airplane impacted terrain. Examination of the wreckage did not reveal evidence of any preexisting mechanical malfunctions or anomalies that would have precluded normal operation of the airplane. After the first day of training, the pilot told friends and fellow pilots that the instructor provided non-standard training that included stall practice that required emergency recoveries at low airspeed and low altitude. The instructor used techniques that were not in keeping with established flight training standards and were not what would be expected from an individual with his extensive background in general aviation flight instruction. Most critically, the instructor used two techniques that introduced unnecessary risk: increasing power before reducing the angle of attack during a stall recovery and introducing asymmetric power while recovering from a stall in a multi-engine airplane; both techniques are dangerous errors because they can lead to an airplane entering a spin. At one point during the first day of training, the airplane entered a full stall and spun before control was regained at very low altitude. The procedures performed contradicted standard practice and Federal Aviation Administration guidance; yet, despite the pilot's experience in multi-engine airplanes and in the accident airplane make and model, he chose to continue the second day of training with the instructor instead of seeking a replacement to complete the insurance check out. The spin encountered on the accident flight likely resulted from the stall recovery errors advocated by the instructor and practiced on the prior day's flight. Unlike the previous flight, the accident flight did not have sufficient altitude for recovery because of the low altitude it was operating at, which was below the safe altitude required for stall training (one which allows recovery no lower than 3,000 ft agl). ", "probable_cause": "The pilots' decision to perform flight training maneuvers at low airspeed at an altitude that was insufficient for stall recovery. Contributing to the accident was the flight instructor's inappropriate use of non-standard stall recovery techniques."}