{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-santa-maria", "date": "Nov 22, 1992 at 1321 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Farroll Equipment Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lake Tahoe - Santa Maria", "msn": "421C-0204", "yom": 1976, "flight_number": null, "city": "Santa Maria", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4512, "captain_hours_type": 503, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4384, "circumstances": "Twelve minutes after departure, the left engine began to run rough and vibrate. The pilot said he could not correct the problem and shut the left engine down. No emergency was declared and the pilot told ATC that he would continue to his destination, 210 nm and 1.5 hours away. The pilot overflew 5 airports with runways over 5,000 feet long and a mountain range. The pilot executed a VOR approach and entered an extended downwind pattern. On short final the pilot executed a go around because he did not get any gear down indications. He then maneuvered for a downwind landing on runway 12. The aircraft hit the ground 100 yards short of the runway, then collided with a ditch and the airport fence. An FAA inspector said there were three clear tire tracks from the point of touchdown to the ditch, where the gear was sheared off. He found no problems with the gear system. Exam of the left engine revealed a left magneto internal failure due to lack of lubrication and wear, which caused cylinder cross firing. ", "probable_cause": "1) The internal failure of the left engine, left magneto due to inadequate maintenance and non compliance with the manufacturers service bulletins and recommendations, and \r\n2) The failure of the pilot to attain the proper touchdown point during the landing attempt. \r\nFactors in the accident were the inability of the pilot to shut off the left magneto and the false landing gear indications, both for undetermined reasons."}