{"url": "https://www.baaa-acro.com/crash/crash-antonov-12tb-near-yeniseysk-11-killed", "date": "Aug 24, 1979 at 0156 LT", "type": "Antonov AN-12", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Mountains", "schedule": "Norilsk - Krasnoyarsk", "msn": "9 3 464 07", "yom": 1969, "flight_number": "SU22200", "city": "Yeniseysk", "zone": "Krasnoyarsk Krai", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 10, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 18235, "circumstances": "The aircraft departed Norilsk Airport in the late evening of August 23 on a cargo flight (SU22200) to Krasnoyarsk, carrying 10 passengers, a crew of six and a load of cargo consisting of six containers for a total weight of 1,920 kilos. Two hours and 18 minutes into the flight, while cruising by night at an altitude of 7,800 meters, all four engines failed simultaneously due to fuel contamination. The crew declared an emergency and initiated a descent to Yeniseysk Airport. On approach, due to low speed, the airplane lost height then struck tree tops and crashed in flames in a hilly and wooded terrain located 17,9 km short of runway. Five passengers were seriously injured while 11 other occupants, among them all six crew members, were killed. ", "probable_cause": "It was determined that all four engines failed simultaneously as the fuel was contaminated with water. It was also reported that the refueling system at Norilsk Airport was contaminated with water and that it had not been drained or controlled before being used. Analysis of fuel samples at the crash site showed a concentration of water and sediments between 37% and 88%. Finally, several passengers boarded without valid ticket and only upon captain permission, in violation with published procedures. "}