{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61p-aerostar-ted-smith-601-northampton", "date": "Sep 7, 2000 at 0755 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "IEG Venture Management", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Northampton – Poughkeepsie", "msn": "61-0792-8063404", "yom": 1980, "flight_number": null, "city": "Northampton", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4280, "captain_hours_type": 2641, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3595, "circumstances": "The airport consisted of a single runway oriented on a heading of 140/320 degrees. A taxiway oriented on a 120 degree heading intersected the runway at its midpoint. The pilot reported that the visibility was 500-1,000 feet with fog at the time of departure. Before he took off, the pilot asked his passenger to walk the length of the runway to observe any obstructions, due to the reduced visibility. The pilot then taxied to the run-up pad, set the heading of his HSI to 120 degrees, and initiated the takeoff. When the airspeed reached 80 knots, the pilot realized he had initiated the takeoff on the taxiway instead of the runway. He aborted the takeoff and attempted to maneuver the airplane to the runway. The airplane crossed the runway, impacted a tree, and came to rest upright in a cornfield. The weather reported at the time of the accident at an airport 9 miles away was: wind from 320 degrees at 2 knots; visibility 1/16 mile with fog; sky partially obscured; ceiling 200 feet overcast. ", "probable_cause": "The pilot's improper preflight planning which resulted in an attempted takeoff from a taxiway. A factor in the accident was the fog. "}