{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-600-north-myrtle-beach-5-killed", "date": "Sep 20, 1998 at 1331 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Henry K. Sagel", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "North Myrtle Beach – Donegal Springs", "msn": "60-0641-7961203", "yom": 1979, "flight_number": null, "city": "North Myrtle Beach", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 1, "total_fatalities": 5, "captain_hours": 1321, "captain_hours_type": 474, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3413, "circumstances": "After takeoff while over the departure end of the runway, deep gray colored smoke was observed by the tower controller trailing the right engine. The pilot was alerted of this and advised the controller the flight was returning. Witnesses reported seeing smoke trailing the right engine and that the airplane rolled to the left, pitched nose down, impacted trees, and then the ground. A fatigue crack was detected in the exhaust aft of the No. 6 cylinder of the right engine; and incomplete fusion of a weld repair was also noted. Heat damaged components from the right engine were replaced and the engine was started and found to operate normally. A foreign object of undetermined origin was found in the intake area of the No. 3 cylinder. Analysis of the voice tape revealed both engines/propellers were operating near full rated rpm when the pilot acknowledged the transmission that smoke was trailing the right engine, one engine/propeller rpm then decreased to about 2,160 rpm. Examination of the flight controls revealed no evidence of preimpact failure or malfunction. Flap positions at impact could not be determined. Calculations indicate that the airplane was approximately 55 pounds over the maximum certificated takeoff weight at takeoff. ", "probable_cause": "The pilot's failure to maintain airspeed (Vs) during a single engine approach resulting in an inadvertent stall. Factors contributing to the accident were a fatigue crack in the exhaust pipe in the right engine, the aircraft weight and balance was exceeded, degraded aircraft performance and the pilot's diverted attention. "}