{"url": "https://www.baaa-acro.com/crash/ground-accident-douglas-dc-9-51-minneapolis", "date": "May 10, 2005 at 1936 LT", "type": "Douglas DC-9", "operator": "Northwest%20Airlines2", "flight_phase": "Taxiing", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Columbus - Minneapolis", "msn": "47716/822", "yom": 1976, "flight_number": "NW1495", "city": "Minneapolis-Saint Paul", "zone": "Minnesota", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 94, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10811, "captain_hours_type": 6709, "copilot_hours": 3985, "copilot_hours_type": 3985, "aircraft_hours": 67268, "circumstances": "The DC-9 was taxiing to the gate area when it collided with a company A319 that was being pushed back from the gate. Prior to arriving at the destination airport, the DC-9 experienced a loss of hydraulic fluid from a fractured rudder shutoff valve located in the DC-9's right side hydraulic system. The left side hydraulic system had normal hydraulic pressure and quantity throughout the flight. The flightcrew elected to continue to the scheduled destination and declared an emergency while on approach to the destination airport. After landing, the emergency was negated by the flight crew and the airplane taxied to the gate. Flight data recorder information indicates the left engine, which provides power for the left hydraulic system, was shut down during taxi. The captain stated he did not remember shutting the left engine down, and that if he had, it would have been after clearing all runways. The first officer stated that he was unaware that the left engine was shut down. Upon arrival at the gate with the left engine shut down and no hydraulic pressure from the left system and a failure of the right hydraulic system, the airplane experienced a loss of steering and a loss of brakes. The flightcrew requested company maintenance to chock the airplane since they were unable to use brakes to stop the airplane. The crew said they were going to keep the \"...engines running in case we have to use reversers...\" The airplane began to roll forward and the captain applied reverse thrust but the reversers did not deploy. The airplane impacted the A319 with a speed of approximately 15.65 miles per hour to 16.34 miles per hour. Evacuation of the DC-9 was completed approximately 5:22 minutes after the collision and evacuation of the A319 occurred approximately 13:08 minutes after the collision. Examination of the left hydraulic system revealed no anomalies and examination of the right hydraulic system revealed a fractured rudder shutoff valve that displayed features consistent with fatigue. Following the accident, the airplane manufacturer issued a service letter pertaining to the replacement of the rudder shutoff valve based upon reliability information that was reported to them. The number of reports was greater than that of the Federal Aviation Administration's Service Difficulty Reports database, and less than the operators records.", "probable_cause": "The Captain's decision to shutdown the left engine during taxi with no hydraulic pressure on the right side hydraulic system to effectively operate the brakes, steering, or thrust reversers. A factor was the fatigue fracture of the rudder shutoff valve which resulted in the loss of right side hydraulic pressure."}