{"url": "https://www.baaa-acro.com/crash/crash-tupolev-ant-9-zaporozhie-9-killed", "date": "Jun 27, 1937 at 0850 LT", "type": "Tupolev ANT-9 (PS-9)", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Simferopol – Zaporozhie – Moscow", "msn": "177", "yom": 1934, "flight_number": null, "city": "Zaporozhie", "zone": "Zaporizhia Oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 9, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2268, "circumstances": "A NKPO PL-5 registered CCCP-I93 departed Zaporozhie Airport on a flight to Moscow with two passengers and two crew members. Few minutes after takeoff, for unknown reasons, the crew decided to return tp Zaporozhie. In the mean time, an Aeroflot Tupolev ANT-9 was ready for a flight to Moscow, the second leg of a schedule service from Simferopol to Moscow, carrying nine passengers and two crew members. For unknown reasons, the crew of the PL-5 decided to land without permission as well as the crew of the ANT-9 started the takeoff procedure on the same runway without permission. Both airplanes collided on the runway and burst into flames. Three passengers on board the ANT-9 were injured while 8 others occupants were killed. Few hours later, one of the survivor died from his injuries. On board the PL-5, two people were killed and two others were injured. ", "probable_cause": "The collision was the consequence of a series of omissions, errors and violations on part of both crews who failed to follow the published procedures, starting a landing manoeuvre and a take off manoeuvre without any clearance. Poor flight supervision and organisation by the airport authority was considered as a contributing factor. "}