{"url": "https://www.baaa-acro.com/crash/crash-martin-404-grand-canyon", "date": "Nov 16, 1979 at 1452 LT", "type": "Martin 404", "operator": "Nevada%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Grand Canyon - Las Vegas", "msn": "14173", "yom": 1952, "flight_number": "KS2504", "city": "Grand Canyon-National Park", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 41, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13000, "captain_hours_type": 1500, "copilot_hours": 9600, "copilot_hours_type": 100, "aircraft_hours": 30451, "circumstances": "On November 16, 1979, Nevada Airlines, Inc., Flight 2504, a Martin 404 (N40438), was a chartered flight from Las Vegas, Nevada, to Grand Canyon National Park Airport, Tusayan, Arizona, and return. About 0935 / Flight 2504 departed Las Vegas to carry a French tour group to the Grand Canyon for a sightseeing tour. There were 41 passengers and a crew of 3 aboard for the roundtrip.  The crew and passengers reported that the trip from Las Vegas to Tusayan was routine. After a scenic flight over the Grand Canyon, a landing was made at Tusayan after about 1 hr 10 min of flight time. No fuel, oil, or antidetonate (ADI) fluid was taken on, and no baggage was placed aboard at Tusayan. Takeoff for the return flight was started at 1450 from runway 3. The copilot was to make the takeoff from the right seat. The weather was clear, visibility unlimited, and winds were from 040° at 15 kns. The crew stated that all pretakeoff checklist items were completed and that the takeoff roll was normal. The captain said that he checked the engine instruments at V speed, takeoff safety speed, as the aircraft was rotated for takeoff and \"everything was normal.\" He said he raised the landing gear and, almost immediately thereafter, sensed a loss of power from the left engine. He said he took control of the aircraft from the copilot and noticed that the left engine autofeather light was illuminated and the feather button depressed. About 1451:20, the tower local controller stated, '...do you want to come back?\" The captain-said he told the copilot to advise the tower that the flight had lost an engine and was returning to the airport. At 1451:50, the copilot told the tower, '... we're (sic) lost an engine and we want to come back around.\" The local controller cleared the aircraft as requested. There was no reply from Flight 2504. The captain stated that he noticed a 200-fpm rate of climb when the aircraft reached the departure end of the runway. He said that after passing the runway the aircraft encountered a downdraft and turbulence which overcame the single engine climb performance of the aircraft. He said that, as the engine failure emergency checklist was being accomplished, he made a slight left turn to avoid a radio tower along the flightpath. The copilot stated that the aircraft passed to the left of and below the top of the tower; the top of the tower is 6,739 feet, about 100 feet above the ground. Even though she was aware of an engine problem, the flight attendant stated that she was not aware that an engine had failed. She said she was not warned by the cockpit crew about the impending crash. The passengers recalled hearing no unusual noises during the takeoff; however, several of them saw the left propeller stop shortly after the aircraft left the ground. Several passengers stated that, once the aircraft was airborne and after the left engine had failed, they experienced a \"rocking\" movement of the aircraft. One passenger, a pilot who was seated at the front of the cabin, said he was aware that the left propeller had been feathered and that, immediately thereafter, the aircraft began to descend. None of the passengers interviewed, were aware that the aircraft was going to crash until they heard the noise of a tree strike. They said there was no warning given by the crew. Several witnesses on the ground stated that they saw the aircraft flying low with the left propeller stationary. Some reported that the landing gear was up. No witnesses reported smoke, fire, or any other problems with the aircraft before impact. The airport tower personnel stated that they saw the left propeller stop when the aircraft was abeam of their position in the tower and slightly below the top of the tower. The tower is located about 6,000 ft from the beginning of Flight 2504's takeoff roll. Tower personnel stated that the aircraft never climbed over 100 ft above the ground level. They said the aircraft banked slightly to the left and descended into the trees. They activated the crash notification circuit when they realized an accident was inevitable. The captain stated that he \"was making it except for the downdrafts,\" and he noticed that the airspeed had decreased to 105 knots; V2 was about 101,5 knots. He said that when he saw that the temperature of the right engine cylinder head was rising rapidly toward the maximum limit, he reduced the manifold pressure about 2 inHg to avoid engine failure. However, he said the inability of the aircraft to climb and the proximity of the terrain required that he return the right engine to full power and select a forced-landing area. The captain stated that, since terrain surrounding the airport was heavily wooded, he headed for the clear area north of the field. He said that when he realized that he would not clear two tall trees before reaching the clear area, he lowered the nose slightly and \"flew through the trees.\" The cockpit struck one of the trees, shattering the captain's windshield. The captain said the aircraft lost about 20 kns of airspeed when it struck the trees and the aircraft began to roll to the left; minimum control speed with the left engine inoperative was about 91 kns. He further reduced the power on the right engine, rolled the wings level, and rotated the aircraft so that it would strike the ground in a nose-high altitude. Both pilots said they hit the ground three times, with each impact becoming progressively more severe. The aircraft came to rest about 850 ft beyond the point where the first trees were struck. The crashpath was oriented on a heading of 355°, and the fuselage came to rest on a heading of 070°. A fire broke out on the right side of the aircraft as it slid to a stop. The fire originated near the cockpit, which had twisted to the left about 120°. Three crew members and seven passengers were seriously injured while 34 other occupants escaped with minor injuries. The aircraft was written off.  ", "probable_cause": "The unwanted autofeather of the left propeller just after take-off and an encounter with turbulence and downdrafts, a combination which exceeded the aircraft's single-engine climb capability which had been degraded by the high density altitude and a turn to avoid an obstacle in the flight path. Also, the available climb margin was reduced by the rising terrain along the flight path. The cause(s) for the unwanted autofeather of the left propeller could not be determined."}