{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-10-mexico-city-73-killed", "date": "Oct 31, 1979 at 0542 LT", "type": "Douglas DC-10", "operator": "Western%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Los Angeles - Mexico City", "msn": "46929/107", "yom": 1973, "flight_number": "WA2605", "city": "Mexico City-Benito Juarez", "zone": "Federal District of Mexico City", "country": "Mexico", "region": "Central America", "crew_on_board": 11, "crew_fatalities": 9, "pax_on_board": 77, "pax_fatalities": 63, "other_fatalities": 1, "total_fatalities": 73, "captain_hours": 31500, "captain_hours_type": 2248, "copilot_hours": null, "copilot_hours_type": 354, "aircraft_hours": 24614, "circumstances": "The airplane had taken off from Los Angeles International Airport, California, for Mexico City, at 0140LT on 31 October 1979. The Mexico centre had cleared the crew to approach Mexico City via Tepexpan, subsequently instructing the aircraft crew to change frequency to the control tower. The tower operator informed the crew that the runway in use was 23 Right and provided the crew with information on the weather conditions prevailing at Mexico City International Airport, and landing data. When the aircraft was on final approach, the control tower operator repeated that the runway in use was 23 Right and drew the attention of the pilot to the fact that he was left of the flight path he should be following to land on the runway in use. The pilot acknowledged the information and the fact that he was slightly to the left. The transcription of the magnetic tape which contains the communications between the control tower operator and the crew of aircraft N-903WA reveals that et one point the control tower operator asked the pilot whether he could see the approach lights on his left, to which the pilot replied \"negative\". The data obtained from the aircraft's flight recorder shows that the crew was making an instrument approach. The instrument landing procedure authorized in the aeronautical information publication (AIP) for Runway 23 Left with transition to 23 Right specifies that if the pilot does not have the runway in sight at 600 ft during an instrument landing approach, he must break off the approach and climb to 8 500 ft. In this case the crew continued with the landing procedure, ignoring the requirement to call out the altitude values and the decision minimum, and descended until the landing gear touched down off-centre of Runway 23 Left, which was closed to all operations. On the transcription of the cockpit voice recorder the pilot-in-command is heard to have said that he was on the flight path to Runway 23 Left, just before the left landing gear wheels touched down on the grass to the left of Runway 23 Left and the right landing gear wheels on the runway shoulder. The aircraft did not enter the runway until it had travelled some 100 m. According to the flight recorder data and the wheel traces at the site of the accident, the crew re-applied power for the go-around procedure and lifted the aircraft nose by 100-210. Now airborne, the aircraft's right landing gear collided with a truck located on the left shoulder of the runway which was closed for repairs. The impact left a distinct mark in the left-hand side of the vehicle's bonnet corresponding exactly to the shape and size of the aircraft's wheel. The collision with the truck, which was loaded with 10 tonnes of earth, removed the right landing gear leg with part or sections of the main gear beam to which it is attached, bursting three of the four tires. The two front tires came off the wheels, whose hubs disintegrated, scattering pieces away from the aircraft. The horizontal shaft which carries the two front wheels and the associated brake units also broke off and were projected forward over a distance of over 400 m. After breaking off, the right landing gear leg struck the right tailplane and elevator, severing the two almost completely. This caused the landing gear leg complete with the two rear tires, wheels and brake units to be thrown about 70 m beyond the point of collision with the truck. The left side panel of the truck's dumper body, the only part to break off, was thrown to the left of the runway; this panel bore traces of tires about halfway along its top edge. The inner right-hand section of the wing flaps also struck the dumper body, which removed the complete section; this was found to the right of the aircraft's flight path some 40 m beyond the final location of the dumper body. The underside of the flap was full of earth and the fractures in the structure contained earth from the truck. The right-hand side panel of the dumper body also bore evidence of having been struck by a metal object. The truck broke up completely and parts of it were scattered over a considerable distance on and off the runway, the area covered being some 400 m long by 100 m wide. Three seconds before the collision with the truck the engine throttles were opened. The collision occurred under these conditions and in spite of the violence of the impact the aircraft remained airborne and flew on, although lift was precarious due to the loss on the right side of the tailplane complete with elevator and the inner section of the wing flap. The aircraft was banked to the right and this inclination increased so much that when the aircraft was approximately 1 500 m from the threshold of Runway 23 Left, the outer section of the right wing flap struck the cab of an excavator which was parked parallel to the right-hand edge of Runway 23 Left. The impact completely destroyed the cab and parts of the trailing edge of the wing flap were found embedded in the twisted framework of the excavator. The aircraft continued, veering to the right and increasing its bank angle towards that side until the right wing tip was scraping Taxiway \"A\", leaving a deep score in the pavement, damaging a telephone manhole and destroying some taxiway edge lights. A severed section of the right wing was found deeply embedded in the ground at this point and the first signs of the fire which burned the nearby grass were also in this area. The distance from the marks left by the landing gear in the grass and on the runway shoulder 167 m from the threshold of Runway 23 Left, to the score made in Taxiway \"A\" by the right wing tip, is approximately 2 500 m, and over this entire distance the aircraft left no mark or trace on the ground, except a few metres beyond the excavator. From this point a score of constant depth and width had been made in the grass over a distance of about 70 m, possibly by something suspended underneath the aircraft. Small fragments of glass fibre, the material used for the trailing edges of the aircraft's control surfaces, were found along this score. The evidence above proves that the aircraft had remained airborne from the time it collided with the truck until reaching Taxiway \"A\", as confirmed by the flight recorder data. After the traces left by the right wing tip on Taxiway \"A\", scores of varying depths were made in Taxiway \"Ptt by the aileron and the outer section of the right flap. A few metres further on the right wing collided with the corner of the PCV repair hangar, knocking down a pillar, a cross tie and part of the roof corner. Various aircraft components were found inside the hangar, e.g. the flap guides and hinges, sections of the leading edge of the right aileron, etc., besides the fuel which was spilled from the fractured wing onto a PCV under repair and on parked cars and vans. The collision of the right wing with the PCV repair hangar hardly interrupted the aircraft along its flight path and it finally crashed against the front of a building, which was demolished by the impact. This was the main impact, during which the tail fin complete with rudder and engine No. 2, the tail unit and the left tailplane with its elevator broke off, together with what remained of the right tailplane and elevator removed earlier by the right landing gear leg. The left wing was also severed at its attachment to the centre section and was thrown more than 200 m, turning over in the process and falling on a house outside the airport; part of this house was burned out. Engines No. 1 and 3 broke away from the wings and were destroyed by the impact and fire. 16 people were injured while 72 occupants, including nine crew members were killed as well as one people in the building. ", "probable_cause": "The accident was the consequence of the combination of the following factors:\r\n- Non-compliance with the meteorological minima for the approach procedure, as cleared,\r\n- Failure to comply with the aircraft's operating procedures during the approach phase,\r\n- Landing on a runway closed to traffic,\r\n- During the final approach to the runway assigned and having reached a height of 800 feet above the ground, the aircraft flew into a fog bank which concealed it from the control tower operator,\r\n- The aircraft's crew did not comply with the procedural minima for the approach for which it had been cleared, in that the crew descended below the minima without reporting the runway in sight or initiating a go-around procedure,\r\n- The crew never reported to the control tower operator that the runway was in sight and no landing clearance was therefore given,\r\n- The data obtained from the cockpit voice recorder revealed that the crew did not comply with the operational procedures laid down in the relevant manuals, in particular the requirement to call out the altimeter readings during the final approach phase. "}