{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-243f-kathmandu-5-killed", "date": "Jul 7, 1999 at 1951 LT", "type": "Boeing 727-200", "operator": "Hinduja%20Cargo%20Services", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Katmandu – New Delhi – Sharjah", "msn": "22168", "yom": 1981, "flight_number": "LCI8533", "city": "Kathmandu-Tribhuvan", "zone": "Bagmati", "country": "Nepal", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 43000, "circumstances": "The aircraft departed Kathmandu-Tribhuvan Airport on a cargo flight to Sharjah with an intermediate stop in New Delhi, carrying five crew members and a load of 21 tons of woolen carpets. After takeoff from runway 20, the crew continued to climb but failed to realize his altitude was insufficient. The aircraft struck the slope of Mt Champadevi located 11 km southwest of the airport and disintegrated on impact. All five crew members were killed. ", "probable_cause": "The accident occurred as the crew after take off did not adhere to the published Standard Instrument Departure (SID) procedure for runway 20 at Kathmandu, Nepal.\r\nThe following contributory factors were identified: \r\n- Incomplete departure briefing given by P1 while other cockpit activities were in progress, \r\n- The unexpected airspeed decay to V 2 -3 during initial right climbing turn South of the VOR which occurred while P2 was busy with ATC, \r\n- The improper power and climb profile used by P1 after rolling the aircraft out on a southwest heading following the initial airspeed loss, \r\n- The inadequate intra cockpit crew coordination and communication as the aircraft proceeded to and across the KTM VOR 4 DME arc before recommencing a shallow right turn, and\r\n- The incorrect and slow response to the initial and subsequent GPWS activation prior to the collision with the terrain."}