{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-near-urozhayny-2-killed", "date": "Jan 6, 1987 at 1403 LT", "type": "PZL-Mielec AN-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Postal (mail)", "survivors": "No", "site": "Plain, Valley", "schedule": "Jezqazğan – Kara-Kengir – Kurgazyn – Amangeldy – Sary-Kengir – Dzhetukoshur – Jezqazğan", "msn": "1G164-29", "yom": 1975, "flight_number": "SU607X", "city": "Urozhayny", "zone": "Karagandy", "country": "Kazakhstan", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6596, "circumstances": "The single engine airplane departed Jezqazğan at 1139LT on a mail flight tour with several en route stops in Kara-Kengir, Kurgazyn, Amangeldy, Sary-Kengir, Sary-Su and Dzhetukoshur, carrying two pilots and a load of 368 kilos of mail. Weather conditions were considered as good upon departure. Two hours later, while leaving Kurgazyn, weather conditions were poor and the captain did not want to continue but was forced by the head of flight. While cruising to the north, the crew encountered poor visibility with ceiling down to 120 meters, foggy conditions and later some blizzard. Too low, the aircraft struck the ground and crashed in a snow covered field located 34 km north of Urozhayny. The captain was killed upon impact while the copilot was slightly injured. He elected to establish a contact with ATC but all radio systems were down. He took refuge in the main cabin and eat candies and nuts and staid in such conditions (OAT near zero) for about five days before being rescued. He died from hypothermia at hospital on January 13.", "probable_cause": "The decision of the crew, ATC and head of flight to continue the flight was incorrect considering the deterioration of the weather conditions. It was determined that the crew did not receive any weather information prior to departure as there were no information available for this area. The accident occurred in below minimums weather conditions. "}