{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-d18s-bimini", "date": "Feb 2, 2000 at 1407 LT", "type": "Beechcraft D18", "operator": "Florida-Air-Cargo", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Miami - Nassau", "msn": "A-828", "yom": 1952, "flight_number": null, "city": "Bimini", "zone": "Bimini", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On February 2, 2000, about 1407 eastern standard time, a Beech D18S, N122V, registered to South Florida Aircraft Leasing, Inc., operated by Florida Air Cargo, Inc., was ditched in the Atlantic Ocean, approximately 47 miles east of Bimini, Bahamas. Visual meteorological conditions prevailed at the time and a visual flight rules (VFR) flight plan was filed for the 14 CFR Part 135 non-scheduled, international, cargo flight. The airplane was substantially damaged and the commercial-rated pilot was not injured, one passenger sustained minor injuries. The flight originated about 1305 from the Opa Locka Airport, Opa Locka, Florida. The pilot stated that the flight departed with all five fuel tanks full of fuel and departed with the left fuel selector positioned to the \"main tank\" position. The flight continued and approximately 10 minutes after takeoff, he switched the left fuel selector to the auxiliary position and remained on that tank for approximately 35 minutes. When the flight was approximately 20 miles east of Bimini, he switched the left fuel selector to the main tank position where it remained for 5 minutes before he added climb power. While about 45 miles east of Bimini, climbing through 2,300 feet with a good rate of climb, the left manifold pressure dropped to 27 inches and the propeller rpm dropped to 1,300. He turned to fly to Bimini, broadcast a mayday call, and reported no unusual vibration; the fuel pressure and oil pressure gauges indicated normal. He repositioned the fuel selector but the left engine would not restart. He then feathered the left propeller and secured the engine but was unable to maintain altitude with full power applied to the right engine. The airplane was ditched in a slight left wing low attitude and the left engine separated from the airframe. Both occupants exited the airplane, remained in the water for 47 minutes, then were spotted by a U.S. Coast Guard Falcon airplane. They were rescued by a pleasure boat and transported to the east coast of Florida.", "probable_cause": null}