{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dash-8-103-batsfjord", "date": "Jun 14, 2001 at 1608 LT", "type": "De Havilland DHC-8-100 (Dash-8)", "operator": "Wideroe_1", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Alta – Båtsfjord", "msn": "247", "yom": 1990, "flight_number": "WF954", "city": "Båtsfjord", "zone": "Finnmark", "country": "Norway", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 24, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 21890, "captain_hours_type": 321, "copilot_hours": 3400, "copilot_hours_type": 1000, "aircraft_hours": 23935, "circumstances": "The twin engine aircraft departed Alta Airport at 1522LT on a regular schedule service to Båtsfjord, carrying 24 passengers and a crew of three. Following an uneventful flight, the crew started a LOC/DME approach to runway 21. Shortly after passing the missed approach point, the pilot-in-command lost visual contact with the runway so the captain took over controls and continued the approach. The airplane became unstable and the crew encountered control problems due to difficulties to disengage the autopilot system. This caused the aircraft to lose height during the last segment and it landed hard, causing the right main gear to collapse upon impact. The aircraft slid for few dozen metres then veered off runway to the right and came to rest in a grassy area 23 metres to the right of the runway. All 27 occupants evacuated safely while the aircraft was damaged beyond repair. ", "probable_cause": "The following factors were identified:\r\n- The crew deviated from the prescribed procedure,\r\n- The crew deviated from the company Standard Operating Procedure,\r\n- The crew failed to comply with CRM requirements as described in the company Flight Operations Manual,\r\n- The crew continued the approach after passing the minimum altitude without adequate visual reference with the runway,\r\n- The crew did not consider 'go around' when passing Decision Point without adequate, visual references to the runway,\r\n- The crew did not consider 'go around' during a landing with apparent flight control problems,\r\n- The crew completed the landing despite the fact that the aircraft was not in a stabilised configuration,\r\n- The non-stabilised landing with a high descent rate overloaded the right undercarriage fuse pin to a point at which it collapsed,\r\n- The public address system did not function when used by the commander for evacuation."}