{"url": "https://www.baaa-acro.com/crash/crash-consolidated-pby-5a-catalina-greenland-0", "date": "Jan 27, 1943", "type": "Consolidated PBY Catalina", "operator": "US%20Navy", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Mountains", "schedule": null, "msn": null, "yom": null, "flight_number": null, "city": "Greenland", "zone": "All Greenland", "country": "Greenland", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "This accident occurred while flying over Greenland Ice Cap at an altitude of 4500-ft indicated. This should have given a clearance of 1000-ft according to charts of the area. Weather and snow covered terrain resulted in poor depth perception. Without realizing they were close to the ice, as a horizon was visible and were not on instruments, they suddenly made contact on the upgrade of a 400-ft slope. the pilot immediately applied throttles in an attempt to get into air but was unsuccessful due to the slope. Further attempts to swing plane around in order to take-off down grade were unsuccessful as plane sank into snow and ice. Block and tackle was dropped, but that also proved unsuccessful. The Ice Cap presents an unbroken pure white surface and when the prominent cost of landmarks are not visible, depth perception is extremely difficult, analagons to flying over glassy water in low visibility. It is considered that the fundamental cause of this accident was the almost lack of depth perception. This plane and its crew were strained on the ice cap for fifteen days, but were in constant touch with there base by radio. A plane dropped supplies and salvage equipment. On the 14th day a Danish Rescue party reached them. On the fifteenth day they abandoned there plane, all confidential publications, the IFF, SBAE and RADAR being destroyed. They returned by foot to the rescue party's came and on the sixteenth day returned to the NORTH STAR. Except for extreme cold, none of the crew suffered any ill effects. \nCrew:\nLt R. W. Shepard, pilot,\nLt A. H. Gilster, copilot,\nAP2c M. V. Egert,\nAmm2c N. J. Richey Jr.,\nAmm3c W. Blankenship,\nRm1c J. J. Rutowski,\nRm3c E. R. Herbert.\nSource: http://www.warcovers.dk/greenland/crash270143.htm", "probable_cause": "It is considered that the fundamental cause of this accident was the almost lack of depth perception."}