{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-850-corfu-2-killed", "date": "Oct 2, 2020 at 1144 LT", "type": "Socata TBM-850", "operator": "N965DM LLC", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Manchester - Buffalo", "msn": "527", "yom": 2009, "flight_number": null, "city": "Corfu", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 960, "captain_hours_type": 239, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1181, "circumstances": "The airplane was in cruise flight at FL280 when the instrument-rated pilot failed to contact air traffic control (ATC) following a frequency change assignment. After about 25 minutes, and when 30 miles east of the destination airport, the pilot contacted ATC on a frequency other than the one that was assigned. He requested the instrument landing system (ILS) approach at his intended destination, and the controller instructed the pilot to descend to 8,000 ft and to expect vectors for the ILS approach at the destination airport. The controller asked the pilot if everything was “okay,” to which the pilot replied, “yes sir, everything is fine.” The controller then observed the airplane initiate a descent. About 2 minutes later, the controller asked the pilot where he was headed, and the pilot provided a garbled response. The controller instructed the pilot to stop his descent at 10,000 ft, followed by an instruction to stop the descent at any altitude. The pilot did not respond, and additional attempts to contact the pilot were unsuccessful. The airplane impacted terrain in a heavily wooded area 17 miles from the destination airport. Rhe aircraft disintegrated on impact and both occupants were fatally injured. ", "probable_cause": "The pilot’s failure to maintain control of the airplane for undetermined reasons during the descent to the destination airport."}