{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-near-simbai", "date": "Nov 9, 1997 at 1000 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Royal%20Australian%20Army", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Mountains", "schedule": "Koinambe - Simbai", "msn": "706", "yom": 1980, "flight_number": null, "city": "Simbai", "zone": "Madang", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2206, "captain_hours_type": 576, "copilot_hours": 2460, "copilot_hours_type": 900, "aircraft_hours": 18096, "circumstances": "The flight was one of a series being conducted by No. 173 Surveillance Squadron, 1st Aviation Regiment operating a de Havilland Canada DHC-6 (Twin Otter) aircraft as Exercise Highland Pursuit 2/97. The purpose of the exercise was to provide training for three No. 173 Squadron pilots in tropical mountainous operations in Papua New Guinea (PNG). All trainees were qualified on the aircraft type. The training pilot was the pilot in command. He had extensive experience in flying Twin Otter and other aircraft types in PNG as a civilian pilot and had also flown de Havilland Canada DHC-4 (Caribou) aircraft in PNG as a military pilot. Passengers were not carried on the flight. The plan for 9 November 1997 was to fly from Madang and return via a number of airstrips where landing and take-off exercises would be conducted. A flight plan was submitted to Madang Flight Service. At 0915 PNG time, the aircraft arrived at Koinambe where each trainee conducted landing and take-off practice. During this time, the training pilot occupied the right cockpit seat while the trainees, in turn, flew the aircraft from the left cockpit seat. The crew had flight-planned to track direct from Koinambe to Simbai. However, before departing Koinambe, they assessed that this would not be possible because of haze and cloud on track. The training pilot, who was still occupying the right control position, suggested that they could follow the Jimi River north-west from Koinambe and then one of its tributaries towards Simbai. This involved a right turn off the Jimi River about 37 km from Koinambe to follow the valley that passed about 2 km south of Dusin airstrip and then tracked south-east towards Simbai. The navigating pilot, in the left cockpit seat, suggested that, instead of following the tributary off the Jimi River as suggested by the training pilot, they should follow the valley which extended north-east off the Jimi River from a position about 17 km north-west of Koinambe. This was a shorter route than that suggested by the training pilot. The training pilot agreed that the route could be attempted. Neither during this discussion, nor at any earlier time, was there any reference to the elevation of the Bismarck Range. (The increase in ground elevation from the Jimi River to the Bismarck Range, a straight-line distance of about 17 km, is approximately 7,400 ft.) The crew was using an Operational Navigation Chart (ONC) 1:1,000,000-scale chart for in-flight navigation. After departing Koinambe, the crew began following the Jimi River, flying at about 1,000 ft above ground level (AGL). The training pilot had intended to remain in the right cockpit seat for the short flight to Simbai. However, to gain the maximum benefit from flying time during the exercise, he had adopted the practice of having trainees occupy both cockpit seats during the en-route sectors of the exercise. He would then monitor the progress of the flight from either between the cockpit seats or the aircraft cabin. In this instance, he vacated the right seat for a trainee who then became the flying pilot for the sector. The navigating pilot then made the required radio calls, one on VHF radio and the other (which was unsuccessful at the first attempt) on HF radio to Madang Flight Service to report the departure of the aircraft from Koinambe. A short time later, the navigating pilot became unsure of the aircraft's position. The flying pilot then conducted several left orbits while the navigating pilot obtained a Global Positioning System (GPS) fix and plotted the position on the ONC chart. He indicated on the chart, and received agreement from the training pilot, that he had identified the aircraft's position. The flying pilot then resumed tracking along the river. During this time the training pilot was in the cabin of the aircraft. He was wearing a headset which was equipped with an extension lead to enable him to communicate with the cockpit crew. He was frequently checking the aircraft's position through the cabin side windows. A short time later, the navigating pilot indicated what he believed to be the valley where the aircraft was to turn towards Simbai. The flying pilot turned the aircraft into this valley. He estimated that the aircraft was flying about 500 ft above the treetops at this time. The crew did not conduct a heading check to confirm that they were in the correct valley. When the aircraft was well into the valley, the training pilot heard over the intercom the flying and navigating pilots discussing the progress of the flight. He sensed some unease in their voices and moved forward from the aircraft cabin to a position between the cockpit seats. He immediately realised that the aircraft was at an excessive nose-high pitch angle and in a position from where it could not outclimb the terrain ahead or turn and fly out of the valley. The flying and navigating pilots ensured that the engine and propeller controls were set to full power and maximum RPM and selected 10 degrees flap. However, the training pilot assessed that impact with the trees was imminent. He ensured that the trainee seated in the cabin was strapped into his seat and then positioned himself on the floor aft of, and against, the cabin bulkhead. The stall warning activated at that time and, almost immediately, the aircraft crashed through the trees to the ground. When the crew had not reported to flight service by 1004, communication checks were initiated. An uncertainty phase was declared at 1023 when there was no contact with the crew. At 1045, this was upgraded to a distress phase after the pilot of a helicopter operating in the area reported that the aircraft was not on the ground at Simbai airstrip. The pilot of the helicopter was tasked with tracking from Simbai to Koinambe in an attempt to locate the aircraft. At 1127, the helicopter pilot reported receiving a strong emergency locator transmitter signal and, shortly after, located the accident site in a valley about 9 km south of Simbai.", "probable_cause": "The following factors were identified:\r\n1. There had been a significant loss of corporate knowledge, experience and risk appreciation within the Army concerning the operation of Twin Otter type aircraft in tropical mountainous areas.\r\n2. No training needs analysis for the exercise had been conducted.\r\n3. The tasking and briefing of the training pilot were incomplete.\r\n4 The training pilot did not adequately assess the skill development needs of the trainees.\r\n5. The supervision of the flight by the training pilot was inadequate.\r\n6. The scale of chart used by the crew was not appropriate for the route they intended to fly."}