{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-51-puerto-ordaz", "date": "Sep 26, 2011 at 0922 LT", "type": "Douglas DC-9", "operator": "Aeropostal-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Caracas – Puerto Ordaz", "msn": "47738/830", "yom": 1976, "flight_number": "VH342", "city": "Puerto Ordaz", "zone": "Bolívar", "country": "Venezuela", "region": "South America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 125, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14000, "captain_hours_type": null, "copilot_hours": 275, "copilot_hours_type": null, "aircraft_hours": 71817, "circumstances": "The aircraft departed Caracas-Maiquetía-Simón Bolívar Airport on a schedule service to Puerto Ordaz, carrying 125 passengers and a crew of 5. On this flight, the copilot was the PIC with the captain acting as instructor and a second copilot who was seating in the jump seat and acting as an observer. During the takeoff roll from Caracas Airport, the liftoff was completed quickly, causing the base of the empennage to struck the runway surface (tail strike). Nevertheless, the captain decided to proceed to Puerto Ordaz. On final to Puerto Ordaz, the approach speed was too low (123,8 knots). The aircraft sank and landed hard, causing the fuselage to be bent at the aft cabin, just prior to the tail, and both engine pylons to fail and to break from the fuselage. The aircraft was brought to a stop on the main runway and all 130 occupants evacuated safely. ", "probable_cause": "The accident investigators, taking into account the characteristics of the accident and the evidence collected in the course of the investigation, considered the Human Factor as the reason for this accident, being able to demonstrate convincingly the following causes:\r\n- There was a breach of the provisions in Chapter 4 (flight operations policies), paragraph 6 (sterile cabin) of the Operations Manual of the airline due to carrying out activities that were not related to the conduct of the flight.\r\n- Lack of situational awareness of the Flight Instructor, the observer pilot and the first officer.\r\n- The captain performed other duties, adding to the duties already being accomplished in his role as a flight instructor."}