{"url": "https://www.baaa-acro.com/crash/crash-short-360-300-oshawa", "date": "Dec 16, 2004 at 2001 LT", "type": "Short 360", "operator": "Air-Cargo-Carriers-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Toledo – Oshawa", "msn": "3748", "yom": 1988, "flight_number": "SNC2917", "city": "Oshawa", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5300, "captain_hours_type": 1000, "copilot_hours": 800, "copilot_hours_type": 400, "aircraft_hours": null, "circumstances": "Air Cargo Carriers, Inc. Flight SNC2917, a Short Brothers SD3-60 aircraft (registration N748CC, serial number SH3748), was on a charter cargo flight from Toledo, Ohio, USA, to Oshawa, Ontario, with two pilots on board. The crew conducted an instrument flight rules approach to Oshawa Municipal Airport in night instrument meteorological conditions. At approximately 2000 eastern standard time, the aircraft landed on Runway 30, which was snow-covered. During the landing roll, the pilot flying noted poor braking action and observed the runway end lights approaching. He rejected the landing and conducted a go-around procedure. The aircraft became airborne, but it started to descend as it flew over lower terrain, striking an airport boundary fence. It continued until it struck rising terrain and then a line of forestation, where it came to an abrupt stop. The flight crew exited the aircraft and waited for rescue personnel to render assistance. The aircraft was substantially damaged, and both pilots sustained serious injuries. There was no post-crash fire.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The crew planned and executed a landing on a runway that did not provide the required landing distance.\r\n2. The flight crew most likely did not reference the Aircraft Flight Manual performance chart “Effect of a Slippery Surface on Landing Distance Required” to determine that landing the aircraft on the 4000-foot, snow-covered runway with flap-15 was inappropriate.\r\n3. After landing long on the snow-covered runway and applying full reverse thrust, the captain attempted a go-around. He rotated the aircraft to a take-off attitude and the aircraft became airborne in ground effect at a slower-than-normal speed.\r\n4. The aircraft had insufficient power and airspeed to climb and remained in ground effect until striking the airport perimeter fence, rising terrain, and a line of large cedar trees.\r\n5. The flight crew conducted a flap-15 approach, based on company advice in accordance with an All Operator Message (AOM) issued by the aircraft manufacturer to not use flap-30. This AOM was superseded on 20 October 2004 by AOM No. SD006/04, which cancelled any potential flap-setting prohibition.\r\nOther Finding:\r\n1. The flight crew members were not advised that the potential Airworthiness Directive announced in the original AOM was not going into effect and that the use of flap-30 was acceptable, as relayed in the follow-up AOM."}