{"url": "https://www.baaa-acro.com/crash/crash-boeing-kc-135a-bn-stratotanker-wichita-30-killed", "date": "Jan 16, 1965 at 1030 LT", "type": "Boeing KC-135 Stratotanker", "operator": "United%20States%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Refuelling", "survivors": "No", "site": "City", "schedule": "McConnell - McConnell", "msn": "17513", "yom": 1958, "flight_number": "501", "city": "Wichita", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 23, "total_fatalities": 30, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff from McConnell AFB, while climbing to a height of 500-700 feet, the captain sent a first distress call while the aircraft experienced a large amount of yaw. The crew elected to return for a safe landing and began to dump large quantities of fuel from the aircraft's refueling tanks. Shortly after this, the aircraft made a hard bank to the left, and began to enter a roll. Out of control, the airplane dove into the ground and crashed at the intersection of Piatt and 20th Street, just three minutes after takeoff, some 7 miles north-northwest of the airbase. The aerial refueling aircraft was loaded with 31,000 US gallons of jet fuel and the crash resulted in a large explosion and subsequent fire, which engulfed dozens of homes. The accident killed all seven crew members on board the aircraft and 23 people on the ground. In addition, 27 other people on the ground sustained injuries, three of which were serious. It was reported that the crew entry door was jettisoned and a B-52 Stratofortress bomber, which took off prior to the KC-135, may have blown a detached drag chute from an F-105 Thunderchief against the departing aircraft.", "probable_cause": "Ten months after the accident, the U.S. Air Force issued an official accident report which stated that the crash was caused by \"a rudder control system malfunction\" which was impossible for the crew to overcome."}