{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-409-hong-kong", "date": "Nov 4, 1993 at 1136 LT", "type": "Boeing 747-400", "operator": "China-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Taipei - Hong Kong", "msn": "24313", "yom": 1993, "flight_number": "CI605", "city": "Hong Kong-Kai Tak", "zone": "Hong Kong", "country": "China", "region": "Asia", "crew_on_board": 22, "crew_fatalities": 0, "pax_on_board": 274, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12469, "captain_hours_type": 3559, "copilot_hours": 5705, "copilot_hours_type": 908, "aircraft_hours": 1969, "circumstances": "China Airlines' scheduled passenger flight CAL605 departed Taipei (TPE), Taiwan at 02:20 for the 75-minute flight to Hong Kong-Kai Tak (HKG). The departure and cruise phases were uneventful. During the cruise the commander briefed the co-pilot on the approach to Hong Kong using the airline's own approach briefing proforma as a checklist for the topics to cover. The briefing included the runway-in-use, navigation aids, decision height, crosswind limit and missed approach procedure. He paid particular attention to the crosswind and stated that, should they encounter any problem during the approach, they would go-around and execute the standard missed approach procedure. The commander did not discuss with the co-pilot the autobrake setting, the reverse thrust power setting or their actions in the event of a windshear warning from the Ground Proximity Warning System (GPWS). Weather reports indicated strong gusty wind conditions, rain and windshear. On establishing radio contact with Hong Kong Approach Control at 03:17, the crew were given radar control service to intercept the IGS approach to runway 13 which is offset from the extended runway centreline by 47°. After intercepting the IGS localiser beam, the pilots changed frequency to Hong Kong Tower and were informed by the AMC that the visibility had decreased to 5 kilometres in rain and the mean wind speed had increased to 22 kt. Two minutes before clearing CAL605 to land, the air traffic controller advised the crew that the wind was 070/25 kt and to expect windshear turning short final. During the approach the pilots completed the landing checklist for a flaps 30 landing with the autobrakes controller selected to position '2' and the spoilers armed. The reference airspeed (Vref) at the landing weight was 141 kt; to that speed the commander added half the reported surface wind to give a target airspeed for the final approach of 153 kt. Rain and significant turbulence were encountered on the IGS approach and both pilots activated their windscreen wipers. At 1,500 feet altitude the commander noted that the wind speed computed by the Flight Management Computer (FMC) was about 50 kt. At 1,100 feet he disconnected the autopilots and commenced manual control of the flightpath. A few seconds later at 1,000 feet he disconnected the autothrottle system because he was dissatisfied with its speed holding performance. From that time onwards he controlled the thrust levers with his right hand and the control wheel with his left hand. Shortly afterwards the commander had difficulty in reading the reference airspeed on his electronic Primary Flying Display (PFD) because of an obscure anomaly, but this was rectified by the co-pilot who re-entered the reference airspeed of 141 kt into the FMC. Shortly before the aircraft started the visual right turn onto short final, the commander saw an amber 'WINDSHEAR' warning on his PFD. A few seconds later, just after the start of the finals turn, the ground proximity warning system (GPWS) gave an aural warning of \"GLIDESLOPE\" which would normally indicate that the aircraft was significantly below the IGS glidepath. One second later the aural warning changed to \"WINDSHEAR\" and the word was repeated twice. At the same time both pilots saw the word 'WINDSHEAR' displayed in red letters on their PFDs. Abeam the Checkerboard the commander was aware of uncommanded yawing and pitch oscillations. He continued the finals turn without speaking whilst the co-pilot called deviations from the target airspeed in terms of plus and minus figures related to 153 kt. At the conclusion of the turn both pilots were aware that the aircraft had descended below the optimum flight path indicated by the optical Precision Approach Path Indicator (PAPI) system. The air traffic controller watched the final approach and landing of the aircraft. It appeared to be on or close to the normal glidepath as it passed abeam the tower and then touched down gently on the runway just beyond the fixed distance marks (which were 300 metres beyond the threshold) but within the normal touchdown zone. The controller was unable to see the aircraft in detail after touchdown because of water spray thrown up by it but he watched its progress on the Surface Movement Radar and noted that it was fast as it passed the penultimate exit at A11. At that time he also observed a marked increase in the spray of water from the aircraft and it began to decelerate more effectively. The commander stated that the touchdown was gentle and in a near wings level attitude. Neither pilot checked that the speed brake lever, which was 'ARMED' during the approach, had moved to the 'UP' position on touchdown. A few seconds after touchdown, when the nose wheel had been lowered onto the runway, the co-pilot took hold of the control column with both hands in order to apply roll control to oppose the crosswind from the left. The aircraft then began an undesired roll to the left. Immediately the commander instructed the co-pilot to reduce the amount of applied into-wind roll control. At the same time he physically assisted the co-pilot to correct the aircraft's roll attitude. Shortly after successful corrective action the aircraft again rolled to the left and the commander intervened once more by reducing the amount of left roll control wheel rotation. During the period of unwanted rolling, which lasted about seven seconds, the aircraft remained on the runway with at least the left body and wing landing gears in contact with the surface. After satisfactory aerodynamic control was regained, the co-pilot noticed a message on the Engine Indicating and Crew Alerting System (EICAS) display showing that the autobrake system had disarmed. He informed the commander that they had lost autobrakes and then reminded him that reverse thrust was not selected. At almost the same moment the commander selected reverse thrust on all engines and applied firm wheel braking using his foot pedals. As the aircraft passed abeam the high speed exit taxiway (A11), the commander saw the end of the runway approaching. At that point both he and the co-pilot perceived that the distance remaining in which to stop the aircraft might be insufficient. At about the same time the co-pilot also began to press hard on his foot pedals. As the aircraft approached the end of the paved surface the commander turned the aircraft to the left using both rudder pedal and nose wheel steering tiller inputs. The aircraft ran off the end of the runway to the left of the centreline. The nose and right wing dropped over the sea wall and the aircraft entered the sea creating a very large plume of water which was observed from the control tower, some 3.5 km to the northwest. The controller immediately activated the crash alarm and the Airport Fire Contingent, which had been on standby because of the strong winds, responded very rapidly in their fire vehicles and fire boats. Other vessels in the vicinity also provided prompt assistance. After the aircraft had settled in the water, the commander operated the engine fuel cut-off switches and the co-pilot operated all the fire handles. The commander attempted to speak to the cabin crew using the interphone system but it was not working. The senior cabin crew member arrived on the flight deck as the commander was leaving his seat to proceed aft. The instruction to initiate evacuation through the main deck doors was then issued by the commander and supervised by the senior cabin crew member from the main deck. Ten passengers were injured, one seriously. ", "probable_cause": "The accident was the consequence of the combination of the following factors:\r\n- The commander deviated from the normal landing roll procedure in that he inadvertently advanced the thrust levers when he should have selected reverse thrust.\r\n- The commander diminished the co-pilot's ability to monitor rollout progress and proper autobrake operation by instructing him to perform a non-standard duty and by keeping him ill-informed about his own intentions.\r\n- The copilot lacked the necessary skill and experience to control the aircraft during the landing rollout in strong, gusty crosswind conditions.\r\n- The absence of a clearly defined crosswind landing technique in China Airline's Operations Manual deprived the pilots of adequate guidance on operations in difficult weather conditions."}