{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-charleston-4-killed", "date": "Dec 22, 2006 at 1335 LT", "type": "Cessna 340", "operator": "Ray Baxter Armistead", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Rock Hill – Charleston", "msn": "340A-0796", "yom": 1979, "flight_number": null, "city": "Charleston-Executive (Johns Island)", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1504, "captain_hours_type": 129, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3828, "circumstances": "According to an airport employee at the Charleston Executive Airport (JZI), Charleston, South Carolina, the pilot contacted the JZI UNICOM radio frequency to request an airport advisory. The airport employee informed the pilot that the \"winds were from 180 at 12 knots gusting to 17.\" The pilot then responded that he would be landing on runway 18, and was advised by the employee that there was no \"runway 18.\" The pilot then stated that he would land on runway 27, and shortly thereafter said that he would land on runway 22. The employee said that out of curiosity he stepped outside to witness the approach of the airplane. He said that the airplane was southwest of the airport moving northeast perpendicular to runway 22, at an altitude of approximately 500 feet. He watched as the airplane was on a left base for runway 22. He said that the airplane overshot the runway and began a \"tight, low right turn\" away from the airport. Shortly thereafter, the airplane stalled and completed two revolutions before it was lost from his sight. Examination of the airframe, flight controls, engine assemblies and accessories revealed no evidence of a pre-crash mechanical failure or malfunction. A forensic toxicology test was performed on specimens from the pilot by the FAA Bioaeronautical Sciences Research Laboratory, Oklahoma City, Oklahoma. The specimens contained, Tramadol (also known by the trade name Ultram), which is used for the management of moderate to severe pain. The level of Tramadol found in the pilot's blood on post-mortem toxicology testing was at least twice that of maximal regular doses of the substance. Single doses have been shown to cause mild impairment of psychomotor abilities in healthy volunteers. Diphenhydramine was also found in the blood of the pilot. The pilot may have been impaired, at that time, due to the use of Tramadol or Diphenhydramine or both.", "probable_cause": "The pilot's failure to maintain airspeed during a turn from base to final, resulting in an inadvertent stall/spin. Contributing to the accident was the impairment of the pilot due to the combination of drugs found in his toxicological report."}