{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049g-super-constellation-manhattan", "date": "May 28, 1963 at 1746 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "Standard%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Daggett – Manhattan ", "msn": "4541", "yom": 1954, "flight_number": "ST388C", "city": "Manhattan", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 64, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16200, "captain_hours_type": 3287, "copilot_hours": 9000, "copilot_hours_type": 2500, "aircraft_hours": 19008, "circumstances": "Flight 388C was a nonstop flight from Daggett, California, to Manhattan, Kansas. The crew consisted of Captain David R Brown, First Officer Joseph A. Merlo, Flight Engineer Peter H. Raymon, Stewardesses Sandra R. wise, and Ann H. Allen, and Pilot/Observer Penrod Rideout who was assigned to this flight to observe operating procedures preparatory to transitioning to L-1049 type aircraft. The aircraft was serviced with fuel and oil at the company's maintenance base in Long Beach, California, and departed for Daggett at 1210. The only maintenance required prior to departure was the replacement of the Y-lead, high tension ignition leads, and spark plugs of cylinders Nos. 12 and 13 on the No. 3 engine. Upon arrival at Daggett at 1245, Federal Aviation Agency (TAA) and Military Air Transport Service (MATS) inspectors conducted a visual ramp inspection of the aircraft and interrogation of the crew. The only discrepancy noted was small area of corrosion on the underside of the aft fuselage in the vicinity of the lavatory service area. Sixty-four U. S. Army personnel boarded at Daggett and were briefed by a stewardess regarding emergency exit locations, emergency equipment and procedure The aircraft required no servicing or maintenance and there were no carry-over maintenance items reported. Takeoff gross weight was computed to be 116,520 pounds. This weight and the center of gravity (e.g.) were both within prescribed limit. Following an uneventful flight, the crew started the descent to Manhattan Municipal Airport when the observer/pilot, who was standing between the captain's and first off seats, recalled that shortly after entering the final approach he observed the propeller rpm increase approximately 100 rpm and then return to the setting of 2400 rpm, This fluctuation occurred three times. Then, following extension of full flaps, he observed the captain reduce power to approximately inches hg and almost immediately the rate of descent increased and the aircraft yawed  to the right. The aircraft, was at an altitude of approximately 75 feet a.g l. when he observed the No 3 propeller reverse indicating the light 3 come on and shouted, \"No. 3 is in reverse\". This shouted warning was concurrent with the application of engine power and was not heard by the captain. None of the other flight crew members saw the reverse light illuminate. Persons on the ground who witnessed the accident generally agreed that the approach appeared normal until the aircraft reached a point approximately 1/3 of a mile from the airport. It was then observed to settle abruptly and contact the ground several hundred feet short of the runway. Initial impact occurred in a wheat field, 546 feet from the approach end of runway 21. At, this point the aircraft was in a right bank of approximately 15 degrees and aligned slightly to the right of the runway centerline The aircraft bounced once, then continued through the wheat field on all three landing gears until it struck an earth embankment. 3-1/2 feet high, located 176 feet from the end of the runway. This impact sheared the right main landing gear and the nose gear from the aircraft. The right wing separated from the fuselage when the aircraft contacted the end of the runway. The aircraft slid a distance of 774 feet down the runway during which time the left main landing gear failed followed by separation of the left wind. The fuselage came to rest on a heading of approximately 270 degrees, 72 feet from the right side of the runway. There were no fatalities and only one passenger was seriously injured. The aircraft was totally destroyed by a post crash fire. ", "probable_cause": "The Board determines the probable cause of this accident was the inflight reversal of the No. 3 propeller due to a propeller power unit malfunction resulting from improper maintenance practices and inspection procedures."}