{"url": "https://www.baaa-acro.com/crash/crash-bae-125-700a-jackson-hole", "date": "Dec 20, 2000 at 0126 LT", "type": "BAe 125", "operator": "Million%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Austin – Jackson Hole", "msn": "257051", "yom": 1979, "flight_number": null, "city": "Jackson Hole", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 18120, "captain_hours_type": 1540, "copilot_hours": 3600, "copilot_hours_type": 1078, "aircraft_hours": 8348, "circumstances": "The airplane was flying a full instrument landing system (ILS) approach to runway 18 at a high altitude airport (elevation 6,445 feet), in a mountainous area, at night. The control tower was closed for the night. The airport was located in a national park, and, therefore, the runway lights were not left on during the night. During non-tower operation hours, the procedure for turning on the runway lights called for the pilot to key the microphone multiple times on the Common Traffic Advisory Frequency (CTAF), which was the tower frequency. The copilot of the accident airplane made multiple attempts to turn on the runway lights using the UNICOM frequency, which had been the CTAF until about 6 months before the accident. The captain continued his landing approach below approach minimums without the runway lights being on. While in the landing flare, the captain reported that strong cross-winds and blowing snow created a \"white-out\" weather condition. The airplane touched down 195 feet left of the runway centerline in snow covered terrain between the runway and taxiway. Two ILS Runway 18 approach plates were found in the airplane. One was out of date and showed the UNICOM frequency as the CTAF. The other was current and showed the tower frequency as the CTAF. All four occupants escaped uninjured, among them the actress Sandra Bullock and the musician Bob Schneider. ", "probable_cause": "The pilot's failure to follow IFR approach procedures and perform a missed approach when the runway was not in sight below approach minimums. Contributing factors were the copilot's failure to follow current ILS approach procedures and use the correct frequency to turn on the runway lights, the snowy whiteout conditions near the ground, and the dark night light conditions."}