{"url": "https://www.baaa-acro.com/crash/crash-ami-dc-3-65tp-kidron-2-killed", "date": "Jan 21, 2019 at 0912 LT", "type": "Douglas DC-3", "operator": "Priority%20Air%20Charter_0", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kidron - Akron", "msn": "20175", "yom": 1944, "flight_number": null, "city": "Kidron-Stoltzfus", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 15457, "captain_hours_type": 5612, "copilot_hours": 9969, "copilot_hours_type": 12, "aircraft_hours": 37504, "circumstances": "The two pilots departed in a turbine powered DC-3C at maximum gross weight for a repositioning flight. The airplane was part of a test program for new, higher horsepower engine installation. Soon after liftoff and about 3 seconds after decision speed (V1), the left engine lost total power. The propeller began to auto-feather but stopped feathering about 3 seconds after the power loss. The airplane yawed and banked to the left, descended, and impacted terrain. Recorded engine data indicated the power loss was due to an engine flameout; however, examination of the engine did not determine a reason for the flameout or the auto-feather system interruption. While it is plausible that an air pocket developed in the fuel system during the refueling just before the flight, this scenario was not able to be tested or confirmed. It is possible that the auto-feather system interruption would have occurred if the left power lever was manually retarded during the auto-feather sequence. The power loss and auto-feather system interruption occurred during a critical, time-sensitive phase of flight since the airplane was at low altitude and below minimum controllable airspeed (Vmc). The acutely transitional phase of flight would have challenged the pilots' ability to manually feather the propeller quickly and accurately. The time available for the crew to respond to the unexpected event was likely less than needed to recognize the problem and take this necessary action – even as an immediate action checklist/memory item.", "probable_cause": "The loss of airplane control after an engine flameout and auto-feather system interruption during the takeoff climb, which resulted in an impact with terrain."}