{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-benton-harbor-3-killed", "date": "Aug 4, 2002 at 1335 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Danny L. Williamson", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sioux Falls – Benton Harbor", "msn": "46-36317", "yom": 2001, "flight_number": null, "city": "Benton Harbor", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2408, "captain_hours_type": 165, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 187, "circumstances": "The single-engine airplane experienced a loss of engine power during cruise flight at flight level 190 (19,000 feet) and impacted the terrain while performing a forced landing to a nearby airport. Visual meteorological conditions prevailed at the time of the accident with clear skies and unrestricted visibilities. The pilot reported the loss of engine power about 16 minutes prior to the accident and requested clearance to the nearest airport. Air traffic control (ATC) issued vectors to the Southwest Michigan Regional Airport (BEH). About 10 minutes prior to the accident, the airplane was positioned approximately 1.3 nm north of BEH at 13,500 feet. The pilot elected to follow ATC vectors verses circling down over BEH. ATC provided vectors for runway 27 at BEH. Witnesses to the accident reported seeing the airplane \"spiraling down and crashing into the ground.\" The wreckage was located on the extended runway 27 centerline, about 1.12 nm from the runway threshold. The distribution of the wreckage was consistent with a stall/spin accident. Approximately four minutes before the accident, the airplane was on a 9.5 nm final approach at 6,700 feet. Between 9.5 and 5.3 nm the airspeed fluctuated between 119 and 155 knots, and the descent rate varied between 1,550 and 2,600 feet/min. Between 5.3 nm and the last radar return at 1.5 nm the airspeed dropped from 155 to 78 knots. According to the Pilot Operating Handbook (POH) the accident airplane should be flown at best glide speed (92 knots) after a loss of engine power. An average engine-out descent rate of 700 feet/min is achieved when best glide speed is maintained during engine-out descents. An engine teardown inspection revealed that the crankshaft was fractured at the number five crankpin journal. Visual examination of the crankshaft (p/n 13F27738, s/n V537920968) showed a fatigue-type fracture through the cheek, aft of the number five crankpin journal. The exact cause of the crankshaft failure could not be determined, due to mechanical damage at the fatigue initiation point. The fracture features for the accident crankshaft was consistent with 14 previous failures of the same part number. The engine manufacturer determined the failures were most likely due to the overheating of the steel during the forging process.", "probable_cause": "The pilot's failure to maintain airspeed above stall speed resulting in a stall/spin. Additional causes were the pilot not maintaining best glide airspeed and optimal glidepath following the loss of engine power. A factor to the accident was the engine failure due to the fatigue failure of the crankshaft."}