{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-oklahoma-city-2-killed", "date": "Jul 23, 1999 at 1113 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Mark H. Johnson", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Oklahoma City – San Angelo", "msn": "61-0315-085", "yom": 1976, "flight_number": null, "city": "Oklahoma City-Wiley Post", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1500, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2945, "circumstances": "During takeoff, the twin-engine airplane was observed to roll left, pitch nose down, and impact terrain shortly after the pilot reported to ATC that he had a problem. Witnesses reported that the left engine was producing black smoke during the takeoff roll. One witness stated that the airplane had slowed to approximately 60-70 mph prior to rolling to the left. A mechanic, who worked on the airplane prior to the accident, stated that the pilot reported being unable to maintain manifold pressure (MP) with the left engine. The mechanic found that the left engine's rubber interconnect boot, which routes induction air between the turbocharger controller elbow and the fuel servo, was 'gaping open.' The mechanic reseated the boot and tightened the clamp. The pilot flew the airplane and reported no problems. During a second flight, the pilot reported that the left engine was again unable to maintain MP. Prior to the accident flight, the pilot informed the mechanic that the 'hose had slid off again' and that it had been reinstalled and he 'felt sure it was o.k.' A witness stated that he saw the pilot working on the left engine the morning of the accident. At the accident site, the left engine's interconnect boot was found disconnected. The clamp securing the boot was not located. No other preimpact anomalies were found with the engines, propellers, turbochargers, or fuel servos. ", "probable_cause": "The pilot's failure to maintain the minimum controllable airspeed. A factor was the disconnected rubber interconnect boot, which resulted in the partial loss of left engine power. "}