{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-200-fort-franklin-7-killed", "date": "Oct 9, 1984 at 1730 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Nahanni Air Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Norman - Fort Franklin", "msn": "115", "yom": 1968, "flight_number": "NAS097", "city": "Fort Franklin", "zone": "Northwest Territories", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 23645, "circumstances": "The aircraft departed Fort Norman at 16:51 and arrived overhead Fort Franklin at approximately 17:15. Because Fort Franklin was shrouded in fog, a local resident contacted the pilot on a portable VHF transceiver and advised him that there was little or no visibility. The pilot replied that he did not think he would be able to land. The resident drove to the airstrip and contacted the pilot again when he heard the aircraft returning. He advised the pilot that visibility was 200-300 feet. The pilot then asked if this was the vertical or horizontal visibility. At that moment the Twin Otter struck a 200-foot-high telecommunications tower while in controlled level fight. Part of the right wing broke off and the aircraft slowly rolled over before striking the ground. The decision of the pilot to continue the approach in foggy weather were possibly influenced by the effects of stress and a greater than usual personal need to complete the flight. The stress was probably caused by the fact that the pilot had been involved in four accidents since March 1984. Although he was a very experienced pilot, his previous employer terminated his employment on 31 August 1984. In their opinion, his ability to make operational decisions was in question. The pilot was hired by Nahanni Air Services one month later.", "probable_cause": "The following findings were reported: \r\n- The weather at Fort Franklin was unsuitable for the flight,\r\n- The flight was continued into weather below that which is required for VFR flight,\r\n- An approach to the aerodrome was attempted using the radar altimeter to provide terrain clearance,\r\n- The pilot descended to an altitude below the height of the telecommunications tower,\r\n- A lack of official weather observations and of communications facilities at Fort Franklin deprived the pilot of reliable local weather information on which to base his decisions,\r\n- There exists in the more remote areas of Canada a different attitude with regard to the assessment of risk in flight operations; it is likely that this attitude influenced the decisions and actions of the pilot,\r\n- The operational decisions of the pilot may have been influenced by the effects of stress and a greater than usual personal need to complete the flight,\r\n- Company management may have had a better appreciation of the risk potential associated with the recent events in the pilot's life, if they had more awareness of the effects of stress on performance."}