{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-27-islander-port-hope-simpson-1-killed", "date": "Jun 7, 2009 at 0830 LT", "type": "Britten-Norman Islander", "operator": "Strait-Air.png", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Lourdes-de-Blanc-Sablon - Port Hope Simpson", "msn": "424", "yom": 1975, "flight_number": null, "city": "Port Hope Simpson", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 13500, "captain_hours_type": 600, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was tasked with a medical evacuation flight to take a patient from Port Hope Simpson to St. Anthony, Newfoundland and Labrador. The aircraft departed the company’s base of operations at Forteau, Newfoundland and Labrador, at approximately 0620 Newfoundland and Labrador daylight time. At approximately 0650, he made radio contact with the airfield attendant at the Port Hope Simpson Airport, advising that he was four nautical miles from the airport for landing. The weather in Port Hope Simpson was reported to be foggy. There were no further transmissions from the aircraft. Although the aircraft could not be seen, it could be heard west of the field. An application of power was heard, followed shortly thereafter by the sound of an impact. Once the fog cleared about 30 minutes later, smoke was visible in the hills approximately four nautical miles to the west of the Port Hope Simpson Airport. A ground search team was dispatched from Port Hope Simpson and the wreckage was found at approximately 1100. The sole occupant of the aircraft was fatally injured. The aircraft was destroyed by impact forces and a severe post-crash fire. There was no emergency locator transmitter signal.", "probable_cause": "Finding as to Causes and Contributing Factors:\r\n1. The aircraft departed controlled flight, likely in an aerodynamic stall, and impacted terrain for undetermined reasons.\r\nOther Finding:\r\n1. The lack of onboard recording devices prevented the investigation from determining the reasons why the aircraft departed controlled flight. "}