{"url": "https://www.baaa-acro.com/crash/crash-lockheed-p2v-7-near-stockton-3-killed", "date": "Apr 25, 2009 at 1004 LT", "type": "Lockheed P-2 Neptune", "operator": "Neptune-Aviation-2", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": "Missoula - Alamogordo", "msn": "726-7286", "yom": 1958, "flight_number": "Tanker 42", "city": "Stockton", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 7334, "captain_hours_type": 916, "copilot_hours": 15075, "copilot_hours_type": 350, "aircraft_hours": 3554, "circumstances": "The multi-engine fire bomber, which was not carrying retardant, was established at its cruise altitude while en route to a fire base where it would be used as part of the effort to fight a local fire. While en route, the flight crew encountered a forecast area of instrument meteorological conditions, whereupon they began a series of descents to lower altitudes in order to stay in visual flight rules (VFR) conditions beneath the clouds. During the last few minutes of their flight, the flight crew had descended to an altitude that was less than 1,300 feet above ground level (agl) over nearly level terrain. As they approached rapidly rising terrain at the end of the broad open valley they had been flying over, they inadvertently entered instrument meteorological conditions (IMC). Soon thereafter, while still in a nearly wings-level attitude, the airplane impacted a ridge about 240 feet below its top. The First Officer, who was flying at the time, had asked the Captain about ten minutes prior to the impact if their altitude was high enough to clear the upcoming terrain, but the Captain did not respond, and the First Officer did not challenge the Captain about the issue. Witnesses in the area reported low clouds with ceilings about 200 feet above ground level with a visibility of one-quarter mile or less, with rain and fog. One of the witnesses reported momentarily viewing the airplane flying \"very low,\" while the others reported only being able to hear the airplane.\n", "probable_cause": "The flight crew's failure to maintain terrain clearance during low altitude flight in low ceiling and visibility conditions. Contributing to the accident was the flight crew's failure to adequately monitor their location with respect to the rising terrain environment ahead, and, their lack of crew resource management communication as a crew.\n"}