{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-captains-flat-1-killed", "date": "Dec 6, 1979", "type": "De Havilland DHC-2 Beaver", "operator": "Aerial%20Agriculture", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Captains Flat - Captains Flat", "msn": "1567", "yom": 1964, "flight_number": null, "city": "Captains Flat", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While completing a local topdressing flight, the pilot lost control of the airplane that crashed in a field. The airplane was destroyed and the pilot, sole on board, was killed. It seems that the aircraft was working and part-way through an agricultural procedure turn, pulling probably 2G+ as normal, when the fin attachment bolts failed. The investigation concluded that apparently the fin and rudder had rolled through about 90 degrees and rested (horizontally) on the tailplane and elevator. The pilot would have been immediately deprived of vertical and directional control at that instant. Being at low altitude, there would have been no means of recovering, even if some vertical control could have been achieved. The wreckage was beyond economic repair and the aircraft was written off at that time. However, the investigation did lead to fleet-wide inspection of all fin attachment bolts and some worn/cracked bolts were revealed. An Airworthiness Directive was immediately issued and all the DHC-2 Beavers were grounded until the inspections and bolt replacements had been completed. While the Beaver was built as a rugged bush aircraft, it was subjected to repeated overload operations from rough agricultural airstrips and subjected to high aerodynamic G forces in every day of agricultural operations.\r\nSource: Geoff Goodall. ", "probable_cause": "Loss of control after the fin attachment bolts failed in flight. "}