{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-milwaukee-6-killed", "date": "Jun 4, 2007 at 1600 LT", "type": "Cessna 550 Citation II", "operator": "Marlin-Air", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Milwaukee - Detroit", "msn": "550-0246", "yom": 1981, "flight_number": null, "city": "Milwaukee", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 14000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4402, "circumstances": "On June 4, 2007, about 1600 central daylight time, a Cessna Citation 550, N550BP, impacted Lake Michigan shortly after departure from General Mitchell International Airport, Milwaukee, Wisconsin (MKE). The two pilots and four passengers were killed, and the airplane was destroyed. The airplane was being operated by Marlin Air under the provisions of 14 Code of Federal Regulations Part 135 and departed MKE about 1557 with an intended destination of Willow Run Airport, near Ypsilanti, Michigan. At the time of the accident flight, marginal visual meteorological conditions prevailed at the surface, and instrument meteorological conditions prevailed aloft; the flight operated on an instrument flight rules flight plan.", "probable_cause": "The pilots’ mismanagement of an abnormal flight control situation through improper actions, including failing to control airspeed and to prioritize control of the airplane, and lack of crew coordination. Contributing to the accident were Marlin Air’s operational safety deficiencies, including the inadequate checkrides administered by Marlin Air’s chief pilot/check airman, and the Federal Aviation Administration’s failure to detect and correct those deficiencies, which placed a pilot who inadequately emphasized safety in the position of company chief pilot and designated check airman and placed an ill-prepared pilot in the first officer’s seat."}