{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-fargo", "date": "Nov 30, 2018 at 1353 LT", "type": "Cessna 550 Citation II", "operator": "Dirt%20Dynamics", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Williston - Fargo", "msn": "550-0146", "yom": 1980, "flight_number": null, "city": "Fargo-Hector", "zone": "North Dakota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1513, "captain_hours_type": 253, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7180, "circumstances": "The commercial pilot was conducting a cross-country, business flight with 10 passengers onboard the 8-passenger airplane. He reported that air traffic control cleared the flight for an instrument landing system (ILS) approach to the runway. While descending, the airplane entered instrument meteorological conditions (IMC) at 3,100 ft mean sea level (msl), and ice started to accumulate on the wing's leading edges, empennage, and windshield. The pilot activated the pneumatic deice boots multiple times during the approach and slowed the airplane to 120 knots. The airplane then exited the clouds about 400 ft above ground level (agl), and the pilot maintained 120 knots as the airplane flew over the airport fence; all indications for landing were normal. About 100 ft agl, the airplane started to pull right. He applied left correction inputs, but the airplane continued to pull right. He applied engine power to conduct a goaround, but the airplane landed in grass right of the runway, sustaining damage to the wings and landing gear. Witnesses and passengers reported that the airplane stalled. During examination of the airplane immediately after the accident, about 1/2 to 1 inch of mixed ice was found on the right wing's leading edge, the vertical and horizontal stabilizers, and the angle of attack probe. Ice was also observed on the windshield. The flaps were found in the \"up\" position. Flight control continuity was established. Although the airplane was originally certificated for two-pilot operation, the pilot was flying the airplane under a single-pilot exemption. The pilot received a logbook endorsement indicating that he had received single-pilot training and was properly qualified under the single-pilot exemption. However, he\r\nhad not met the turbine flight time qualifications (1,000 hours) to be properly authorized to conduct the flight under the single-pilot exemption because he only had 500 hours. A review of cockpit voice recorder information indicated that, although the pilot verbalized that the landing gear was \"all green,\" followed by stating \"check, check, check,\" he did not verbalize all the approach or landing checklist items nor did he make any audible comments about activating the pneumatic deice boots or windshield anti-ice. A review of radar data for the flight indicated that, during the last 2 minutes of flight, while the airplane was on final approach to the runway, the indicated airspeed got as low as 99 knots. The last recorded radar return indicated that the airplane had an airspeed of 104 knots at 900 ft msl. The pilot's lack of minimum flight experience required to fly the airplane without a copilot likely led to task saturation as he flew the airplane entered IMC and icing conditions while on an ILS approach. He subsequently failed to lower the flaps during the approach, which resulted in a no-flap approach instead of a full-flap landing. The ice on the leading edges of the wings, the no-flap approach, and the low airspeed likely led to the exceedance of the airplane's critical angle of attack, which resulted in an aerodynamic stall.", "probable_cause": "The pilot's failure to lower the flaps during the approach and maintain sufficient airspeed while flying in instrument meteorological and icing conditions and the accumulation of ice on the wings' leading edges, which resulted in the exceedance of the airplane's critical angle of attack and subsequent aerodynamic stall. Contributing to the accident was the pilot's lack of proper qualification to operate the airplane under a single-pilot exemption due to his lack of total turbine time, which led to task saturation and his failure to properly configure the flaps for landing."}