{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-54f-ottawa-3-killed", "date": "May 19, 1967 at 1837 LT", "type": "Douglas DC-8", "operator": "Air%20Canada.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Montreal - Ottawa", "msn": "45653/178", "yom": 1963, "flight_number": null, "city": "Ottawa-Macdonald-Cartier", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 19400, "captain_hours_type": 3700, "copilot_hours": 20748, "copilot_hours_type": 8, "aircraft_hours": 9670, "circumstances": "The aircraft was on a conversion training flight from Montreal to Ottawa with three pilots on board. The aircraft departed Montreal at 1802 hours Eastern Standard Time on an instrument flight plan which was cancelled on reaching the Ottawa area. A hydraulic failure simulation was then carried out following which a touch-and-go landing on runway 32 was accomplished at 1825 hours. According to the recorded data the touch-and-go was accomplished with the ailerons in the manual mode, the flaps were raised to the 250 position during the landing roll and the ailerons were restored to the power mode during the turn following take-off while on a heading of about 260°. After about two minutes of flight on the downwind leg, No. 4 engine was retarded to flight idle and was kept at that setting for about two and a quarter minutes. During this period an average of about 30 left wing down bank was maintained, except at a point about halfway through that period the aircraft banked slowly 180 to the left, followed by a sharp reversal to 100 bank to the right. The length of the downwind leg was consistent with a planned two-engine asymmetric landing. Power was restored to No. 4 engine just before a left turn on to the base leg was started. During that turn No. 4 engine was again retarded to flight idle,then restored to normal power. No. 1 engine was then retarded to flight idle for about 20 seconds, then restored to normal power. The flaps remained at the 250 setting. While turning on to final approach, the pilot-in-command advised the tower that he was as yet undecided whether a landing would be carried out. When the aircraft had passed the UP beacon, about 84 miles from the runway threshold and approximately 200 sec from impact, rudder power was selected to the manual mode and power was reduced on all four engines. No. 4 engine was then retarded to the flight idle position and the other three engines advanced to approach power. About 171 sec before impact, the pilot-in-command advised the control tower that the aircraft would be making a full stop landing. The landing gear was extended 155 sec before impact and 120 sec before impact No. 3 engine was retarded to flight idle: at the same time power was increased on Nos. 1 and 2 engines. At that time the aircraft was at a height of 1 150 ft above the ground and its indicated airspeed was fairly steady around 165 kt. From 109 to 92 sec before impact, the aircraft turned to the right through 340 on to a heading of 3370. Power was reduced, bank applied and the aircraft returned to approximately the runway heading. The flaps were extended to 350, 69 sec before impact. At 54 sec before impact, the rudder was restored to the power mode for less than 6 sec and then returned to the manual mode. Through the period from 69 to 25 sec the rate of descent was relatively constant at about 700 ft/min with the aircraft tending to undershoot, and the airspeed decreasing from 163 to 152 kt. Power on Nos. 1 and 2 engines was progressively increased from 25 sec before impact until near maximum power was reached 8 sec before impact, following which they were retarded to flight idle. A yaw to the right had started 19 sec before impact and 12 sec before impact the throttles were advanced on engines 3 and 4 and they began to spool up. At 9 sec before impact and when some 200 ft above the ground, the left wing down condition could no longer be maintained and the aircraft entered a roll to the right. The roll rate to the right increased rapidly as did the yaw rate. The roll continued until the aircraft struck the ground in an inverted nose low attitude, 1 995 ft short of the threshold of runway 32 and 575 ft NE of its extended centre line. The accident occurred at 1837 hours. The aircraft was destroyed and all three crew members were killed. ", "probable_cause": "Failure to abandon a training manoeuvre under conditions which precluded the availability of adequate flight control. The following findings were reported:\r\n- The decision to attempt an asymmetric approach with the rudder in the manual mode was improper,\r\n- The information available to the crew in the Air Canada DC-8 Manual, concerning two engine operating procedures, was inadequate,\r\n- The aircraft was tending to undershoot the runway,\r\n- Control was lost when power to the left engines was increased late in the approach, at an airspeed too low for effective rudder control,\r\n- The faulty check valve closed during the flight at least 54 seconds prior to impact."}