{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-sturt-meadows-station-10-killed", "date": "Dec 16, 1988 at 1015 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Broughton Air Services", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Perth – Bellevue Mine – Kalgoorlie – Leinster – Nevoria Mine", "msn": "782", "yom": 1980, "flight_number": null, "city": "Sturt Meadows Station", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": 6249, "captain_hours_type": 134, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2827, "circumstances": "The aircraft had been chartered for a return flight from Perth to Bellevue Mine, Kalgoorlie and Nevoria Mine. The aircraft departed Perth on 15 December and arrived at Bellevue Mine after an uneventful flight. The following morning the pilot telephoned Kalgoorlie Flight Service Unit (FSU) and obtained brief details of expected winds for the flight to Kalgoorlie, as well as a forecast of the weather for the aircraft's arrival. He then submitted details of the flight to the flight service officer (FSO), at the same time commenting that there was some adverse weather in the Bellevue Mine area. The flight plan indicated that the pilot intended to climb to flight level (FL) 195 after take-off, with a time interval of 27 min to pass Leonora and a further 22 min to reach Kalgoorlie. The flight plan was amended after take-off to include a brief stop at Leinster. At 0940 hours the aircraft departed for Leinster, 5 km from Bellevue Mine. (This short flight was conducted to pick up passenger baggage.) At 0957 hours the pilot reported to the Kalgoorlie FSU that the aircraft had departed Leinster at 0955 hours and was climbing to FL 195. At 1008 hours he requested traffic information for a climb to FL 210 and, after being advised that there was no traffic, replied that he was climbing to that level. He also remarked that there were some big clouds in the area. No further communications were received from the aircraft. At approximately 1015 hours the aircraft crashed on Sturt Meadows Station. The crash site was approximately 1200 ft above sea level. All 10 occupants were killed.", "probable_cause": "It is probable that the pilot did not have an adequate understanding of the operations of the MU-2B-60 aircraft at high altitude. The meteorological conditions were conducive to the formation of ice on aircraft flying in cloud above the freezing level. It is probable that loss of control occurred above the freezing level on climb to an amended altitude of FL 210. "}