{"url": "https://www.baaa-acro.com/crash/crash-antonov-2r-kozlovets-2-killed", "date": "Apr 11, 2006 at 1555 LT", "type": "Antonov AN-2", "operator": "Kapoli Air", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Kozlovets - Kozlovets", "msn": "1174 473 17", "yom": 1962, "flight_number": null, "city": "Kozlovets", "zone": "Veliko Tarnovo", "country": "Bulgaria", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9798, "circumstances": "The aircraft commander came at the airstrip at village of Kozlovets at about 09:00 and accepted the aircraft from the aircraft technician, refueled with 400 l gasoline (according the record in monthly book) and after that moved the aircraft to the chemical charge stand, where the aircraft was loaded with 1350 l of chemical (herbicide). According the technician’s information, the first flight started at 09:15. The crew was incomplete. There was no copilot onboard. After the fourth (at 11:00) and after the tenth flight (at 13:30) the aircraft was refueled with 200 l of gasoline. At the airstrip after the 11th flight for AW two outsiders climbed on board with aircraft commander’s permission, who were not crew members and the twelfth flight was performed with them. One person, 11-year schoolboy, took the right-hand seat in the cockpit and the other person stayed upright between the two pilot seats. The aircraft took-off from the temporary airstrip and headed for treatment of an agricultural field, situated behind a height relatively to the place of the temporary airstrip. After the end of spraying of the first plot during the left-hand turn at very low altitude the aircraft collided with the ground in a heading of 310°. As a result of the collision the construction was destroyed, the aircraft turned around the left hand wing to 180° from the flight direction, a spilling of fuel and oil emerged and a fire blow up, which destroyed the fore part of aircraft fuselage. The commander and the person standing between the pilot seats received fatal injuries and the child in the right-hand pilot seat was seriously injured and was hospitalized in the town of Pleven. ", "probable_cause": "Main cause:\r\nDemonstrated self-sufficiency and lack of self-discipline by the aircraft commander, leaded to violation of the flight rules during AW, defined in Aerial Works Instruction, due to which the\r\ncomplicated flight conditions became dangerous and in the specific circumstances the situation created developed to a catastrophic one.\r\nImmediate cause:\r\nCollision with the terrain.\r\nThe commission considered that for the occurrence contributed the following contributory factors:\r\n1. Negligence of the requirements for available regular flying staff by AO for the established by AOM flight conditions for minimum crew during AW.\r\n2. Degraded level of control by AO on the activities, character and quality of the aerial work performed.\r\n3. Lack of in-depth analysis of the personal and professional abilities of the flight personnel of the AO and passivity displayed in cases directly influencing the safe performing of the flights. \r\nDuring the process of the cause about the accident the commission disclosed also the following deficiencies:\r\n1. Formal attitude of the inspector during the fulfillment of the control list of the aircraft commander for the flight proficiency and navigation check.\r\n2. Lack of record in the aircraft engine technical book for installation of a plug n°105975 into the altitude corrector during the technical measures for PSSE.\r\n3. The reason for replacement of the cylinder n°1, 4 and 9 wasn’t registered in the technical documentation. "}