{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-philadelphia", "date": "Mar 22, 2006 at 0155 LT", "type": "Learjet 35", "operator": "Bankair", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Philadelphie – Charlotte", "msn": "35-046", "yom": 1976, "flight_number": null, "city": "Philadelphia", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2900, "captain_hours_type": 1300, "copilot_hours": 1600, "copilot_hours_type": 700, "aircraft_hours": 18040, "circumstances": "During the takeoff roll, after the pilot disengaged the nose gear steering, the airplane began to turn to the right. The copilot noticed fluctuations with the engine indications, and called for an abort. Power was reduced to idle, and the pilot corrected to the left using left rudder pedal and braking. The airplane turned to the right again, and the pilot corrected to the left. The airplane continued to turn left, and departed the left side of the runway, tail first, and was substantially damaged. The airplane had accrued 18,040.3 total hours of operation. It was powered by two turbofan engines, each equipped with an electronic fuel computer. Examination of the left engine's wiring harness revealed that the outer shielding on the fuel computer harness assembly was loose, deteriorated, and an approximate 3-inch section was missing. Multiple areas of the outer shielding were also chaffed, the ground wire for the shielding was worn through, and the wiring was exposed. Testing of the wiring to the fuel computer connector, revealed an intermittent connection. After disassembly of the connector, it was discovered that the connector pin's wire was broken off at its crimp location. Examination under a microscope of the interior of the pin, revealed broken wire fragments that displayed evidence of corrosion. Simulation of an intermittent electrical connection resulted in N1 spool fluctuations of 2,000 rpm during engine test cell runs. According to the airplane's wiring maintenance manual, a visual inspection of all electrical wiring in the nacelle to check for security, clamping, routing, clearance, and general condition was to be conducted every 300 hours or 12 calendar months. Additionally, all wire harness shield overbraids and shield terminations were required to be inspected for security and general condition every 300 hours or 12 calendar months, and at every 600 hours or 24 calendar months. According to company maintenance records, the wiring had been inspected 6 days prior to the accident.", "probable_cause": "The operator's inadequate maintenance of the fuel computer harness which resulted in engine surging and a subsequent loss of control by the flight crew during the takeoff roll."}