{"url": "https://www.baaa-acro.com/crash/crash-fairchild-hiller-fh-227d-ambato", "date": "Oct 28, 1997 at 1617 LT", "type": "Fairchild-Hiller FH-227", "operator": "AeroGal", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Quito - Ambato", "msn": "573", "yom": 1968, "flight_number": null, "city": "Ambato", "zone": "Tungurahua", "country": "Ecuador", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Quito-Mariscal Sucre Airport, the crew started the descent to Ambato Airport in good weather conditions but was stressed by the presence of another aircraft in the approach area. On approach, the aircraft was too high on the glide and its speed was 100 knots, about 12 knots above the reference speed. This caused the aircraft to land too far down the runway 19, about 900 metres past the runway threshold (Ambato's runway 19 is 2,000 metres long). After touchdown, the crew decided to initiate a go-around procedure and increased engine power. The aircraft adopted a high angle of attack, causing the base of the empennage to struck the runway surface. Out of control, the aircraft continued, overran and came to rest in a ravine located 60 metres past the runway end. All seven occupants escaped with minor injuries and the aircraft was damaged beyond repair. ", "probable_cause": "The following findings were reported:\r\n- Wrong approach configuration as the aircraft was too high on the glide with an excessive speed, \r\n- The aircraft landed too far down the runway, reducing the landing distance available, \r\n- Poor flight planning,\r\n- Poor crew coordination, \r\n- The copilot failed to calculate properly the approach and landing speeds, \r\n- The captain was not aware of the total weight of the aircraft upon landing, \r\n- The operator failed to train the crew according to the specificities related to Ambato Airport, \r\n- The operator failed to prepare documentation required for the operations at Ambato Airport, \r\n- When the crew initiated the go-around procedure, the aircraft' speed was insufficient, and the input on the control column was sudden, causing the base of the empennage to struck the runway surface. "}