{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-30cf-boston-2-killed", "date": "Jan 23, 1982 at 1936 LT", "type": "Douglas DC-10", "operator": "World-Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Oakland - Newark - Boston", "msn": "47821/320", "yom": 1980, "flight_number": "WO30H", "city": "Boston-Logan", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 12, "crew_fatalities": 0, "pax_on_board": 200, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 18091, "captain_hours_type": 1969, "copilot_hours": 8600, "copilot_hours_type": null, "aircraft_hours": 6327, "circumstances": "Following a non-precision instrument approach to runway 15R at Boston-Logan International Airport, the airplane touched down about 2,800 feet beyond the displaced threshold of the 9,191-foot usable part of the runway. About 1936:40, the airplane veered to avoid the approach light pier at the departure end of the runway and slid into the shallow water of Boston Harbor. The nose section separated from the fuselage in the impact after the airplane dropped from the shore embankment. Of the 212 persons on board, 2 persons are missing and presumed dead. The other persons onboard evacuated the airplane safely, some with injuries.\n", "probable_cause": "The minimal braking effectiveness on the ice-covered runway; the failure of the Boston-Logan International Airport management to exercise maximum efforts to assess the condition of the runway to assure continued safety of landing operations; the failure of air traffic control to transmit the most recent pilot reports of braking action to the pilot of Flight 30H; and the captain's decision to accept and maintain an excessive airspeed derived from the auto throttle speed control system during the landing approach which caused the aircraft to land about 2,800 feet beyond the runway's displaced threshold. Contributing to the accident were the inadequacy of the present system of reports to convey reliable braking effectiveness information and the absence of provisions in the Federal Aviation Regulations to require: \r\n- Airport management to measure the slipperiness of the runways using standardized procedures and to use standardized criteria in evaluating and reporting braking effectiveness and in making decisions to close runways.\r\n- Operators to provide flight crews and other personnel with information necessary to correlate braking effectiveness on contaminated runways with aircraft stopping distances, and \r\n- Extended minimum runway lengths for landing on runways which adequately take into consideration the reduction of braking effectiveness due to ice and snow."}