{"url": "https://www.baaa-acro.com/crash/crash-bombardier-global-express-e-11a-near-sharana-afb-2-killed", "date": "Jan 27, 2020 at 1309 LT", "type": "Bombardier Global Express/XRS", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Kandahar - Kandahar", "msn": "9358", "yom": 2009, "flight_number": null, "city": "Sharana AFB", "zone": "Parwan", "country": "Afghanistan", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4736, "captain_hours_type": 1053, "copilot_hours": 1343, "copilot_hours_type": 27, "aircraft_hours": null, "circumstances": "On 27 January 2020, at approximately 1309 hours local time (L), an E-11A, tail number (T/N) 11-9358, was destroyed after touching down in a field in Ghanzi Province, Afghanistan (AFG) following a catastrophic left engine failure. The mishap crew (MC) were deployed and assigned to the 430th Expeditionary Electronic Combat Squadron (EECS), Kandahar Airfield (KAF), AFG. The MC consisted of mishap pilot 1 (MP1) and mishap pilot 2 (MP2). The mission was both a Mission Qualification Training – 3 (MQT-3) sortie for MP2 and a combat sortie for the MC, flown in support of Operation FREEDOM’S SENTINEL. MP1 and MP2 were fatally injured as a result of the accident, and the Mishap Aircraft (MA) was destroyed. At 1105L, the MA departed KAF. The mission proceeded uneventfully until the left engine catastrophically failed one hour and 45 minutes into the flight (1250:52L). Specifically, a fan blade broke free causing the left engine to shutdown. The MC improperly assessed that the operable right engine had failed and initiated shutdown of the right engine leading to a dual engine out emergency. Subsequently, the MC attempted to fly the MA back to KAF, approximately 230 nautical miles (NM) away. Unfortunately, the MC were unable to get either engine airstarted to provide any usable thrust. This resulted in the MA unable to glide the distance remaining to KAF. With few options remaining, the MC maneuvered the MA towards Forward Operating Base (FOB) Sharana, but did not have the altitude and airspeed to glide the remaining distance. The MC unsuccessfully attempted landing in a field approximately 21 NM short of FOB Sharana. ", "probable_cause": "The Accident Investigation Board (AIB) President found by a preponderance of the evidence that the cause of the mishap was the MC’s error in analyzing which engine had catastrophically failed (left engine). This error resulted in the MC’s decision to shutdown the operable right engine creating a dual engine out emergency. The AIB President also found by a preponderance of the evidence that the MC’s failure to airstart the right engine and their decision to recover the MA to KAF substantially contributed to the mishap."}