{"url": "https://www.baaa-acro.com/crash/crash-boeing-kc-135r-stratotanker-near-chaldovar-3-killed", "date": "May 3, 2013 at 1448 LT", "type": "Boeing KC-135 Stratotanker", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Refuelling", "survivors": "No", "site": "Mountains", "schedule": "Bishkek - Bishkek", "msn": "18725/708", "yom": 1964, "flight_number": null, "city": "Chaldovar", "zone": "Chuy Province", "country": "Kyrgyzstan", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 3 May 2013, at approximately 1448 hours local time (L), a KC-135R, tail number 63-8877, assigned to the 22d Expeditionary Air Refueling Squadron, 376th Air Expeditionary Wing, Transit Center at Manas, Kyrgyz Republic, crashed in the foothills of mountains located 6 miles south of Chaldovar, Kyrgyz Republic. The mishap crew (MC), which consisted of the mishap pilot (MP), mishap co-pilot (MCP), and mishap boom operator (MBO), perished during the accident. The mishap aircraft (MA) exploded inflight, impacted the terrain at three main locations, and burned. The MA was completely destroyed with total loss to government property estimated at $66.3 million. Upon impact, approximately 228 cubic meters of soil were contaminated with jet fuel, and three distinct craters containing a burn pattern were created. The MA’s mission was to refuel coalition aircraft in Afghanistan and then return to the Transit Center at Manas. Immediately after takeoff, the MA experienced an unexpected rapid heading change from the direction of flight known as a crab. During climb, nearly continuous rudder hunting caused the MA’s nose to hunt slowly left and right about one degree in both directions. The MP commented on the lateral control challenges and possible series yaw damper (SYD) malfunction but continued the mission without turning off either the SYD or rudder power. Approximately nine minutes into the flight, the MA began a series of increasing yaw and roll oscillations known as a dutch roll, which was undiagnosed by the MC. The MCP attempted to decrease these oscillations using manual aileron controls, as well as two brief attempts with the autopilot. The manual corrective inputs kept the oscillations from growing. The autopilot use further exacerbated the situation, and the oscillations intensified. After the second autopilot use, the MP assumed control of the MA and used left rudder to start a left turn. A subsequent series of alternating small rudder inputs, caused by the MA’s dutch roll-induced acceleration forces varying the MP’s foot pressure on the rudder pedals, sharply increased the dutch roll oscillations. Within 30 seconds, the MP made a right rudder input to roll out of the turn, exacerbating the dutch roll condition. The cumulative effects of the malfunctioning SYD, coupled with autopilot use and rudder movements during the unrecognized dutch roll, generated dutch roll forces that exceeded the MA’s design structural limits. The tail section failed and separated from the aircraft, causing the MA to pitch down sharply, enter into a high-speed dive, explode inflight and subsequently impact the ground at approximately 1448L. \r\nCrew:\r\nCpt Victoria Ann Pinckney, \r\nCpt Mark Tyler Voss,\r\nT/Sgt Herman Mackey III.", "probable_cause": "The board president found, by clear and convincing evidence, the cause of the mishap was the MA’s tail section separating due to structural overstress as a result of the MC’s failure to turn off either the SYD (Series Yaw Damper) or the rudder power and oscillating dutch roll-induced acceleration forces translating through the MP’s feet as the MP used rudder during the unrecognized dutch roll condition. Additionally, the board president found, by a preponderance of evidence, that the dutch roll was instigated by the MA’s malfunctioning Flight Control Augmentation System that caused directional instability or rudder hunting which substantially contributed to this mishap. Other substantially contributing factors include insufficient organizational training programs, crew composition, and cumbersome procedural guidance."}