{"url": "https://www.baaa-acro.com/crash/crash-cessna-441-conquest-ii-climax-2-killed", "date": "Nov 9, 2015 at 1016 LT", "type": "Cessna 441 Conquest", "operator": "Legal Airways", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Lakeland - Cairo", "msn": "441-0164", "yom": 1980, "flight_number": null, "city": "Climax", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1150, "captain_hours_type": 150, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 18422, "circumstances": "The purpose of the flight was for the commercial pilot/owner to pick up passengers at the destination airport and return to the departure airport. The airplane was 33 miles from its destination in cruise flight at 3,300 ft mean sea level (msl) and above a solid cloud layer when the pilot declared to air traffic control (ATC) that he had the destination airport \"in sight\" and cancelled his instrument flight rules (IFR) clearance. During the 13 minutes after cancellation of the IFR clearance, the airplane's radar track made an erratic sequence of left, right, and 360° turns that moved the airplane away from the destination airport in a westerly direction. The altitudes varied between about 4,000 and 900 ft msl. Later, the pilot reestablished communication with ATC, reported he had lost visual contact with the airport, and requested an instrument approach to the destination airport. The controller then provided a sequence of heading and altitude assignments to vector the airplane onto the approach, but the pilot did not maintain these assignments, and the controller provided several corrections. The pilot expressed his inability to identify the initial approach fix (IAF) and asked the controller for the correct spelling. The radar target then climbed and subsequently entered a descending right turn at 2,500 ft msl and 180 knots ground speed near the IAF, before radar contact with the airplane was lost. Although a review of airplane maintenance records revealed that the airplane was overdue for several required inspections, examination of the wreckage revealed signatures  consistent with both engines being at high power at impact, and no evidence of any preimpact mechanical anomalies were found that would have precluded normal operation. Examination of the airplane's panel-mounted GPS, which the pilot was using to navigate the flight, revealed that the navigation and obstruction databases were expired. During a weather briefing before the flight, the pilot was warned of low ceilings and visibility. The weather conditions reported near the destination airport about the time of the accident also included low ceilings and visibilities. The restricted visibility conditions and the high likelihood of inadvertent entry into instrument meteorological conditions were conducive to the development of spatial disorientation. The flight's erratic track, which included altitude and directional changes inconsistent with progress toward the airport, were likely the result of spatial disorientation. After reestablishing contact with ATC and being cleared to conduct an instrument approach to the destination, the airplane's flight track indicated that the pilot was not adequately prepared to execute the controller's instructions. The pilot's subsequent loss of control was likely the result of spatial disorientation due to his increased workload and operational distractions associated with his attempts to configure his navigation radios or reference charts. Postaccident toxicological testing of samples obtained from the pilot revealed the presence of ethanol; however, it could not be determined what percentage was ingested or produced postmortem. The testing also revealed the presence of amphetamine, an opioid painkiller, two sedating antihistamines, and marijuana. Although blood level quantification of these medications and drugs could not be made from the samples provided, their combined effects would have directly impacted the pilot's decision-making and ability to fly the airplane, even if each individual substance was only present in small amounts. Based  in the reported weather conditions at the time the pilot reported the airport in sight and canceled his IFR clearance, he likely was not in a position to have seen the destination airport even though he may have been flying between cloud layers or may have momentarily observed the ground. His decision to cancel his IFR clearance so far from the destination, in an area characterized by widespread low ceilings and reduced visibility, increased the pilot's exposure to the hazards those conditions posed to the successful completion of his flight. The pilot showed other lapses in judgment associated with conducting this flight at the operational, aircraft, and the personal level. For example, 1) the pilot did not appear to recognize the significance of widespread low ceilings and visibility along his route of flight and at his destination (nor did he file an alternate airport even though conditions warranted); 2) the accident airplane was being operated beyond mandatory inspection intervals; and 3) toxicological testing showed the pilot had taken a combination of multiple medications and drugs that would have likely been impairing and contraindicated for the safe operation of an airplane. The pilot's decision-making was likely affected by the medications and drugs.", "probable_cause": "The pilot's loss of airplane control due to spatial disorientation. Also causal to the accident was the pilot's impairment by the combined effects of multiple medications and drugs. "}