{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-new-delhi-10-killed", "date": "Dec 22, 2015 at 0938 LT", "type": "Beechcraft 200 Super King Air", "operator": "BSF-logo.png", "flight_phase": "Takeoff (climb)", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "City", "schedule": "New Delhi - Ranchi", "msn": "BB-1485", "yom": 1994, "flight_number": null, "city": "New Delhi-Indira Gandhi", "zone": "National Capital Territory of Delhi", "country": "India", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 964, "captain_hours_type": 764, "copilot_hours": 891, "copilot_hours_type": 691, "aircraft_hours": 4766, "circumstances": "Beechcraft Super King Air B-200 aircraft, VT-BSA belonging to BSF Air Wing was involved in an accident on 22.12.2015 while operating a flight from IGI Airport, New Delhi to Ranchi. The flight was under the command of a CPL holder with another CPL holder as Second-in-Command. There were ten persons on board including two flight crew members. As per the scheduling procedure of the Operator, the flying programme for 22.12.2015 was approved by the ADG (Logistics) on the recommendation of the DIG (Air) for VT-BSA on 21.12.2015. The programme included names of the flight crew along with the following sectors: from Delhi to Ranchi ETD 0800 ETA 1030 and from Ranchi to Delhi ETD 1300 ETA 1600. The task was as per instructions on the subject dated 23rd July 2015. As per the weight & load data sheet there were 8 passengers with 20 Kgs. of baggage in the aft cabin compartment. The actual take-off weight shown was 5668.85 Kgs as against the maximum take-off weight of 5669.9 Kgs. Fuel uplifted was 1085 Kgs. The aircraft was taken out of hangar of the Operator at 0655 hrs on 22.12.2015 and parked outside the hangar for operating the subject flight. At around 0745 hrs, the passengers reached the aircraft who were mainly technical personnel supposed to carry out scheduled maintenance of Mi-17 helicopter of the Operator at Ranchi. They were carrying their personnel baggage along with tools and equipment required for the maintenance. At around 0915 hrs the flight crew contacted ATC Delhi and requested for clearance to operate the flight to Ranchi. The aircraft was cleared to Ranchi via R460 and FL210. Runway in use was given as 28. At 0918 hrs the doors were closed and the flight crew had started carrying out the check list. After the ATC issued taxi clearance, the aircraft had stopped for some time after commencing taxiing. The pilot informed the ATC that they will take 10 minutes delay for further taxi due to some administrative reasons. The taxi clearance was accordingly cancelled. After a halt of about 6 to 7 minutes, the pilot again requested the ATC for taxi clearance and the same was approved by the ATC. Thereafter, the aircraft was given take-off clearance from runway 28. The weather at the time of take-off was: Visibility 800 meters with Winds at 100°/03 knots. Shortly after take-off and attaining a height of approximately 400 feet AGL, the aircraft progressively turned left with simultaneous loss of height. It had taken a turn of approximately 180o and impacted some trees before hitting the outside perimeter road of the airport in a left bank attitude. Thereafter, it impacted 'head on' with the outside boundary wall of the airport. After breaking the outside boundary wall, the wings impacted two trees and the aircraft hit the holding tank of the water treatment plant. The tail portion and part of the fuselage overturned and went into the water tank. There was post impact fire and the portion of the aircraft outside the water tank was destroyed by fire. All passengers and crew received fatal injuries due impact and fire. The ELT was operated at 0410 hours UTC (0940 hours IST). The fire fighting team reached the site and extinguished the fire. The bodies were then recovered from the accident site. 08 bodies were recovered from the holding tank of the water treatment plant and bodies of both pilots were recovered from the heavily burnt portion of the cockpit lying adjacent (outside) to the wall of the holding tank of the water treatment tank.", "probable_cause": "The accident was caused due to engagement of the autopilot without selecting the heading mode by the flight crew just after liftoff (before attaining sufficient height) in poor foggy conditions and not taking corrective action to control the progressive increase in left bank; thereby, allowing the aircraft to traverse 180° turn causing the aircraft to lose height in a steep left bank attitude followed by impact with the terrain."}