{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-620-cheyenne-ii-cascais-5-killed", "date": "Apr 17, 2017 at 1204 LT", "type": "Piper PA-31 Cheyenne", "operator": "Symbios", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Cascais – Marseille", "msn": "31T-8020091", "yom": 1980, "flight_number": null, "city": "Cascais", "zone": "Estremadura - Lisbon District", "country": "Portugal", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 1, "total_fatalities": 5, "captain_hours": 4900, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8323, "circumstances": "On April 17th, at 11:04 UTC, the aircraft turboprop Piper PA-31 Cheyenne II, registration HBLTI, private property, took off from runway 17 of the Cascais aerodrome (LPCS) bound to Marseille airport (LFML), IFR private flight, with 1 pilot and 3 passengers on board. According to several eyewitness testimonies, after takeoff, the Swiss twin-engine started to put the left wing down and consequently to turn left while climbing slowly to about 300’ feet of altitude. The left bank1  increased and the speed decreased leading the aircraft to stall. The aircraft entered a steep dive and impacted the ground next to a logistics dock of a local supermarket, located southeast of the airfield. The crash occurred 700 m from the end of the departure runway. Following the impact, the aircraft exploded and caught fire affecting a logistic dock, a house and a truck. The aircraft was destroyed by impact force and the post-collision fire, all the four occupants were killed. The driver of the truck affected by the explosion of the plane was also killed. The fuselage, wings, the engines and propellers were severely damaged by the impact force and post-impact fuel-fed fire. The structural damage to the aircraft was consistent with the application of extensive structural loads during the impact sequence, and the effects of the subsequent fire. No pre-crash structural defects were found. All aircraft parts and control surfaces were located at the site. The flaps and the landing gear were found retracted at the time of impact.", "probable_cause": "- The pilot’s failure to maintain the airplane control following the power loss in the left critical engine. The root cause for the left engine failure could not be determined due to the extensive impact damages and intensive fire. \r\nContributing factors:\r\n- Lack of proper pilot training especially concerning the emergency scenario of critical engine failure immediately after takeoff. "}