{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-marsh-harbour-9-killed", "date": "Aug 25, 2001 at 1845 LT", "type": "Cessna 402", "operator": "Blackhwak International Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Marsh Harbour – Miami-Opa Locka", "msn": "402B-1014", "yom": 1975, "flight_number": null, "city": "Marsh Harbour", "zone": "Central Abaco", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The fatal aircraft, Registration N8097W was operated by Blackhawk International Airways and the listed owner was Skystream Inc; whose corporate address was the same as Mr. Gilbert Chacón’s Pembroke Pines, Florida home address. Blackhawk International Airways was owned by Gilbert Chacón and his son Erik, who founded the company in 1991. Blackhawk International Airways was authorized by the FAA as a part 135 Single Pilot Operation. Mr. Gilbert Chacon was the only pilot authorized by the FAA for Blackhawk International Airways. Once Morales acted as pilot- in-command of the Cessna 402B aircraft, this made Blackhawk International Airways a multi pilot operation. This was a clear violation of the FAA regulations. Mr. Morales was not signed off by the FAA to fly for Blackhawk International Airways, nor was Blackhawk International Airways signed off as a multi pilot operation. There were no FAA reports of any enforcement actions or service difficulty reports against the fatal aircraft. However, the FAA did report four administrative actions against Blackhawk International Airways, three for technical violations and the most recent for maintenance failures. The agency (FAA) issued a letter of correction on April 28, 2000, citing Blackhawk's failure to comply with manufacturer’s recommended maintenance programs and FAA programs for its aircraft's engines or other parts. Blackhawk failed to have a person in charge of maintenance with an appropriate certificate and used unsanctioned techniques and equipment for repairs. The Manager of the Palm Beach County Park Airport at Lantana, Florida stated that a last minute change resulted in the accident aircraft being dispatched to Marsh Harbour, Abaco, Bahamas. The Cessna 404 aircraft which was originally scheduled to conduct this flight, was fuelled, but subsequently changed to a Cessna 402B aircraft by the owner Mr. Gilbert Chacon. This charter flight from Lantana, Florida to the island of Marsh Harbour, Abaco, in the Bahamas, was operated under Visual Flight Rules (VFR).The accident occurred on August 25, 2001 shortly after the aircraft departed Marsh Harbour International Airport for the return trip to Opa Locka, Florida (USA). The flight number was not known. At the time of the accident, Blackhawk International Airways was not authorized by the Bahamas Aviation Authority to conduct commercial operations in the Bahamas. A determination could not be made as to whether or not the pilot filed a flight plan. No records existed to verify whether radio communications were established with Air Traffic Control (ATC) during the flight from Lantana, Florida to Marsh Harbour, Abaco, Bahamas. The flight was a 165 mile journey that was estimated to take one (1) hour to complete. The aircraft was not required to have a cockpit voice recorder. Witnesses reported the pilot and members of the group being transported, argued about the number of passengers and the amount of bags to be loaded on the aircraft. Witnesses also reported seeing eight (8) passengers board the aircraft. Two of the largest passengers (believed to be weighing approximately 300 pounds each,) were observed being seated in the rear of the aircraft. One witness reported that the pilot personally loaded the aircraft. Witnesses also reported that the pilot experienced problems starting the engines. Eye witness statements placed the time of departure of the flight for Opa Locka, Florida at approximately 1845 EDT. The aircraft became airborne from the 5,000 x 50 feet runway (Runway 27) between 2,500 to 2,800 feet. It climbed in a steep nose high attitude to approximately 40 feet above the runway, banked left, pitched nose down and impacted marshy terrain in a left wing, nose low attitude. The aircraft was destroyed and all nine occupants were killed, among them the US singer Aaliyah Dana Haughton. ", "probable_cause": "Findings and Probable Cause:\r\n- Aircraft overweight. Pilot did not determine if the aircraft was within operating limitations. The aircraft’s weight was estimated to be 941 lbs over the maximum allowable takeoff weight. The weight of the un-recovered bag was not added to the weight and balance calculations. The center of gravity was estimated to be 4.4 inches aft of the maximum aft allowable center of gravity envelope).\r\n- Pilot Unqualified. Pilot was not qualified under Part 135 for the aircraft in which he was flying.\r\n- Documents Falsification. Pilot falsified logbook to reflect more flight time than he actually had accumulated. Review of pilot logbook revealed in several instances, pilot added as much as 1,000 hours to his total flight and multi engine times. Hundreds of day and night landings were falsified to meet qualification requirements. Pilot falsified aircraft information (types and registration numbers) reporting them to be Cessna C402 aircraft, when FAA database clearly lists the aircraft in question as aircraft other than Cessna C402. Pilot may not have completed a weight and balance report. (No evidence existed that showed he had completed a load manifest or weight and balance and performance calculations). Pilot failed to comply with prescribed Weight and Balance and Performance limitations in Pilot’s Operating Handbook. (The aircraft’s weight was estimated to be 941 lbs over the maximum allowable takeoff weight. The weight of the un-recovered bag was not added to the weight and balance calculations. The center of gravity was estimated to be 4.4 inches aft of the maximum aft allowable center of gravity envelope)). Pilot may not have followed “before takeoff” checklist in Pilot’s Operating Handbook.\r\n- Fuel Selectors: “Left Engine – Left Main Tank, Right Engine – Right Main Tank”. Field investigation immediately following the accident revealed both fuel tank selectors were found selected to the right main tank. The left fuel valve was found in the left position, though the cable was separated from the valve. Impact damage may have changed the pre-impact settings, thereby rendering the observed positions as unreliable.\r\n- Aircraft Flight Controls (secondary control surfaces – trim tabs) were found to be out of normal range required for takeoff. The aileron trim tab was found selected all the way to the right. The rudder trim tab was found selected to the left and the elevator trim tab was found in the full nose down position. Impact damage may have changed the pre-impact settings, thereby rendering the observed positions as unreliable. \r\n- According to Pilot’s Operating Handbook (POH) normal takeoff is 0˚ flaps. (The flap selector handle was selected to 15˚with the indicator at approximately the 15˚position. The wing flap push rods were bent, indicating partial extension at impact). \r\n- Blackhawk International Airways was not authorized to assign this pilot as a pilot in command because they did not have the authority to use a second pilot. Blackhawk International Airways was authorized as a single pilot operation with Mr. Gilbert Chacon as the only authorized pilot. \r\n- Blackhawk International Airways reportedly hired Mr Morales two days prior to the fatal accident, although they did not have the authority to use a second pilot. Further, they did not exercise due diligence in ensuring pilot’s qualification prior to assigning duty as pilot in command.\r\n- There were no FAA reports of any enforcement actions or service difficulty reports against the fatal aircraft. However, the FAA did report four administrative actions against Blackhawk, three for technical violations and the most recent for maintenance failures. The agency issued a correction letter April 28, 2000, citing Blackhawk's failure to comply with manufacturer recommended maintenance programs and FAA programs for its aircraft's engines or other parts, Blackhawk failed to have a person in charge of maintenance with an appropriate certificate and used unsanctioned techniques and equipment for repairs.\r\n- Results of disassembly report confirms that no discrepancies existed that would have precluded normal operation of both left and right engines prior to impact.\r\n- Forensic Report showed traces of benzoylegonine (a metabolite of cocaine) in the urine and traces of ethanol in the stomach contents of the pilot. \r\n- On July 7, 2001, Morales was arrested by the Broward Sheriff's Office in an area of Pompano Beach known for drug sales. A deputy who pulled over Morales' 1993 Volkswagen Fox for running a stop sign said he found pieces of crack cocaine and other paraphernalia in the car. According to the deputy, Morales said he was in the area to buy powder cocaine for a friend.\r\n- In November 2000, Morales was arrested by Fort Lauderdale police after he tried to \"return'' $345 worth of stolen aviation parts to a local distributor. Instead of giving Morales cash, store employees called police, who were investigating a string of airplane burglaries. Mr. Morales was charged with dealing in stolen property after detectives found that a receipt in his bag belonged to the burglary victim who actually bought the parts. An additional charge of grand theft was tacked on when detectives recovered other stolen items."}