{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-100-mactan-12-killed", "date": "Feb 28, 1967 at 1918 LT", "type": "Fokker F27 Friendship", "operator": "Philippine%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Manila - Mactan", "msn": "10147", "yom": 1960, "flight_number": "PR345", "city": "Mactan", "zone": "Cebu", "country": "Philippines", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 15, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 8000, "captain_hours_type": 1180, "copilot_hours": 1758, "copilot_hours_type": 1116, "aircraft_hours": 15956, "circumstances": "Flight 345 was a scheduled domestic flight from Manila to Mactan. It departed Manila at 1720 hours on an IFR clearance direct to Mactan, via Amber 1 at flight level 130. At 1908 hours the flight reported to Mactan Control Approach that it was descending through FL 70. It was cleared to FL 50, given an altimeter setting of 29.81 in Hg and requested to report at FL 60. At 1909 hours the flight requested a visual descent from FL 50 to 30 and at 1913 hours it reported commencing a VOR approach to runway 04. At 1917 hours the flight reported on final and Mactan Approach cleared the flight to land, giving the wind as 330'15 kt. The flight acknowledged the clearance and this was the last communication from the aircraft. Whilst on a long final approach commenced from a height of 1 500 feet approximately 4 miles from the runway threshold, the aircraft suddenly assumed a nose-high attitude and additional power was applied. A crew member then came out of the cockpit and spoke in the direction of a number of supernumerary crew travelling in the passenger compartment instructing them to move forward. Moments later a flight attendant came from the cockpit and instructed everybody to move forward. Before all the passengers could comply, the air- craft started banking alternately to the right and left, descending in a tail low attitude and crashed at approximately 1918 hours 0.9 miles before the threshold of runway 04. At 1919 hours the aerodrome controller observed a fire near-the approach end of runway 04 and alerted the emergency services. All four crew members and eight passengers were killed, seven others survived. ", "probable_cause": "The Board determined that the probable cause of the accident was a loss of control at a low altitude. The contributory factor was the distribution of load which placed the centre of gravity aft of the rear centre of gravity limit. The following finsings were reported:\r\n- No evidence of malfunction or failure of the aircraft or its engines prior to impact was found. Evidence revealed that the aircraft struck the ground in a left wing low attitude with the landing gear extended and the flaps retracted. The elevator trim tab was found in a full nose-down position,\r\n- The aircraft was loaded in such a way that the centre of gravity was located beyond the aft limit. "}