{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-i-great-falls-2-killed", "date": "May 19, 1998 at 1536 LT", "type": "Piper PA-31 Cheyenne", "operator": "Bruce L. Erickson", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Great Falls - Great Falls", "msn": "31-8004036", "yom": 1980, "flight_number": null, "city": "Great Falls", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2347, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2226, "circumstances": "The flight was on a practice nondirectional beacon (NDB) approach to Great Falls runway 34 in visual conditions. Abeam the final approach fix, the aircraft was 4 miles right of course. Upon being advised of this by ATC, the pilot corrected back to final with a 60-degree intercept angle, rolling out on course 3 miles from the runway. When the pilot called missed approach, the local controller (a trainee) instructed the pilot to make a 360-degree right turn to enter right downwind for runway 3, and the pilot acknowledged. The controller trainee then amended this instruction to a 180-degree right turn to enter right downwind for runway 21, then to a 180- degree right turn to enter right downwind for runway 3. The crew did not acknowledge the amended instruction. Controllers then observed the airplane had crashed. Witnesses reported the airplane entered a steep descent from a right turn and impacted the ground at a steep angle. The flight was described as recurrent training required by the owner's insurance; however, the second aircraft occupant's airline transport pilot and flight instructor certificates had been revoked, and he held only a private pilot certificate. Investigators found no evidence of aircraft malfunctions. ", "probable_cause": "The flight crew's failure to maintain aircraft control. "}