{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-merion-3-killed", "date": "Apr 4, 1991 at 1210 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Lycoming Air Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "City", "schedule": "Williamsport – Philadelphia", "msn": "61-0844-8162153", "yom": 1981, "flight_number": null, "city": "Merion", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1876, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2739, "circumstances": "Piper Aerostar 601, N3645D, was arriving as Bell 412 (helicopter), N78S, was departing. N3645D reported the aircraft's nose gear indicator light did not illuminate to verify the nose gear was down and locked. Crew of N78S heard the communication and saw N3645D as they crossed beneath N3645D's approach path. They reported N3546D's nose gear appeared to be extended. N3645D flew past the tower and tower personnel also reported the nose gear appeared to be extended. As N3645D was cleared to turn downwind, N78S offered to join for a closer look. Captain of N3645D accepted the offer. During joinup, N78S converged from left rear, then reported they would pass around the right side and look at everything as they went by. They reported that everything looked ok. Moments later, the two aircrafts collided and crashed to the ground. No mechanical reason was found that would have resulted in the accident. None of the pilots had training for flight in close proximity to another aircraft. There were indications the captain of N3645D lacked training in aircraft systems and that his employer (the operator) lacked surveillance by the FAA. The emergency procedure section of the Aerostar flight manual lacked info on emergency gear extension. All three occupants were killed as well as both pilots on board the helicopter. Four other people on the ground were injured, one seriously.  ", "probable_cause": "The poor judgement by the captain of the airplane to permit the inflight inspection after he had determined to the best of his ability that the nose landing gear was fully extended, the poor judgment of the captain of the helicopter to conduct the inspection, and the failure of the flightcrew of the helicopter to maintain safe separation. Contributing to the accident was the incomplete training and checking that the flightcrew of N3645D received from lycoming air service and the faa principal operations inspector assigned to the operator."}