{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-214-bacolod-3-killed", "date": "Mar 22, 1998 at 1941 LT", "type": "Airbus A320", "operator": "Philippine%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Manila - Bacolod", "msn": "708", "yom": 1997, "flight_number": "PR137", "city": "Bacolod", "zone": "Negros Occidental", "country": "Philippines", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 124, "pax_fatalities": 0, "other_fatalities": 3, "total_fatalities": 3, "captain_hours": 5048, "captain_hours_type": 74, "copilot_hours": 2886, "copilot_hours_type": 147, "aircraft_hours": 1240, "circumstances": "Flight PR137 was a regular scheduled passenger flight and departed Manila for Bacolod at 18:40. The airplane departed with the thrust reverser of engine n°1 inoperative. At 19:20, PR137 called Bacolod Approach Control and reported passing FL260 and 55 DME to Bacolod . The crew then requested landing instructions and was instructed to descend to FL90 after passing Iloilo and descend to 3,000 feet for a VOR runway 04 approach. Wind was 030° at 08 kts, altimeter 1014 mbs, transition level at FL60 and temperature at 28°C. At 19:28, the flight requested to intercept the final approach to runway 04 and Approach Control replied \"PR 137 visual approach on final\". At 19:37, Bacolod Tower cleared the flight to land at runway 04 and the clearance was acknowledged by the pilot. The approach was flown with the Autothrust system was engaged in SPEED mode. The thrust lever of engine no.1 was left in Climb detent. Upon touchdown the first officer called out \"no spoilers, no reverse, no decel\". Engine no.2 was set to full reverse thrust after touchdown, but the engine no .1 thrust lever was not retarded to idle and remained in the climb power position. Consequently, the spoilers did not deploy. Because one engine was set to reverse, the autothrust system automatically disengaged. With the autothrust disengaged, no. 1 engine thrust increased to climb thrust. Due to the asymmetrical thrust condition, the A320 ran off the right side of the runway. At this speed, rudder and nosewheel steering are ineffective. Engine no.2 was moved out of reverse up to more than 70 percent N1 and the airplane swerved back onto the runway. The A320 continued past the runway end. The aircraft hit the airport perimeter fence and then jumped over a small river. It continued to slice through a hallow block fence where it went through several clusters of shanties and trees. No fire ensued after the crash.", "probable_cause": "The probable cause of this accident was the inability of the pilot flying to assess properly the situational condition of the aircraft immediately upon touch down with n°1 engine reverse inoperative, thereby causing an adverse flight condition of extreme differential power application during the landing roll resulting in runway excursion and finally an overshoot. Contributory to this accident is the apparent lack of technical systems knowledge and lack of appreciation of the disastrous effects of misinterpreting provisions and requirements of a Minimum Equipment List (MEL)."}