{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-i-swikshak-1-killed", "date": "Sep 21, 2006 at 1315 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Alaska%20Sportsman%27s%20Lodge", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Kodiak - Igiugig", "msn": "405", "yom": 1952, "flight_number": null, "city": "Swikshak Lagoon", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4770, "captain_hours_type": 1860, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11613, "circumstances": "The airline transport pilot was departing to the north from a narrow stream in a float-equipped airplane with lodge guests aboard, on a Title 14, CFR Part 91 flight. Northerly winds between 25 and 35 knots, were reported at the time of the accident. The accident pilot reported that after departure, he turned left, and a strong downdraft \"threw the airplane to the ground.\" The passengers said that the airplane started its takeoff run directly into the strong winds, but shortly after becoming airborne, the pilot made a steep turn to the left, about 150 feet above the ground. The passengers indicated that as the airplane continued to turn left, it began to shudder and buffet, then abruptly descended nose low into the marsh-covered terrain. During the impact, the right wing folded, and the airplane's fuselage came to rest on its right side. One of the occupants, seated next to the right main cabin door, was partially ejected during the impact sequence, and was pinned under the fuselage and covered by water. Rescue efforts by the pilot and passengers were unsuccessful. In the pilot's written statement to the NTSB, he reported that there were no pre accident mechanical anomalies with the airplane, and during the on-site examination of the wreckage by the NTSB investigator-in-charge, no pre accident mechanical anomalies were discovered. ", "probable_cause": "The pilot's failure to maintain adequate airspeed while maneuvering to reverse direction, which resulted in an inadvertent stall and an uncontrolled descent. Factors associated with the accident were the inadvertent stall and wind gusts. "}