{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-pawtucket", "date": "Nov 7, 1996 at 0900 LT", "type": "Cessna 340", "operator": "John Manera", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nantucket – Pawtucket", "msn": "340A-0749", "yom": 1979, "flight_number": null, "city": "Pawtucket-North Central State", "zone": "Rhode Island", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3213, "captain_hours_type": 153, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2058, "circumstances": "The pilot was conducting the localizer approach to runway 15 when the aircraft overran the runway and struck an obstacle. According to the pilot, a loss of power occurred in both engines as he attempted to do a missed approach, and the airspeed subsequently decreased from 105 to 80 knots. The pilot reported that he pushed the nose over to avoid a stall, broke out of the clouds over the mid-point of the runway, landed long and continued off the end of the runway into terrain and a tower structure. A witness reported the 'aircraft broke out of the clouds just above the trees north of runway 5 and west of runway 15. Reportedly, the aircraft as being banked from a right to left to get aligned with runway 5, flaps appeared to be up, and the gear was down. The witness said the engines sounded to be at idle and at high rpm, and the aircraft appeared to be 50 feet above the ground at midfield when it went out of sight behind hangar.' The weather observed at the time of the accident was in part: ceiling 100 feet overcast, visibility 0.5 mile with fog and rain. The published landing minimums for the approach was ceiling 400 feet and visibility 0.75 mile. Recorded radar data of the flight indicated a descent below the minimum descent altitude at a constant airspeed. Both engines started immediately and ran during a postaccident check of the aircraft. ", "probable_cause": "Failure of the pilot to comply with the published instrument approach procedure, by continuing the ILS approach below the decision height, rather than performing a missed approach; and his failure to attain a proper touchdown point for the continued landing. Factors relating to the accident were: weather below approach minimums, wet runway, and hydroplaning conditions. "}