{"url": "https://www.baaa-acro.com/crash/crash-bae-146-200a-stord-4-killed", "date": "Oct 10, 2006 at 0732 LT", "type": "BAe 146", "operator": "Atlantic%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stavanger – Stord – Molde", "msn": "E2075", "yom": 1987, "flight_number": "FLI670", "city": "Stord-Sørstokken", "zone": "Hordaland", "country": "Norway", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 1, "pax_on_board": 12, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 5000, "captain_hours_type": 1500, "copilot_hours": 1000, "copilot_hours_type": 250, "aircraft_hours": 39828, "circumstances": "At 0724 hours, Flesland approach gave clearance for FLI670 to start to descend to 4,000 feet. Three minutes later, it was cleared to leave controlled airspace and transfer to Sørstokken's frequency. In the meantime, the AFIS duty officer at Stord airport had visual contact with the plane and obtained confirmation of its position from Flesland approach. Based on aerodrome data, wind direction and wind speed, temperature and the aircraft's landing weight, the crew found it acceptable to plan for a visual approach and landing on runway 33. This would shorten the approach. They assumed that landing on runway 33 would involve a small tailwind component. The AFIS duty officer was informed of the decision to land on runway 33. The AFIS duty officer confirmed that the wind was 110° 6 kt. When asked, the crew also stated that there were 12 passengers on board. 1.1.6 The approach proceeded as normal. The landing gear was extended and the flaps were extended stepwise. At 07:31:12 hours, the aircraft was 2 NM from the threshold for runway 33 at a height of 800 ft and with a ground speed of 150 kt. The flaps were then extended to 33° and, according to radar data, the ground speed dropped to 130 kt. At 07:31:27 hours, the AFIS duty officer repeated the 'runway free' message and described the wind as 120° 6 kt. The cockpit voice recorder (CVR) tells us that at 07:31:43 hours the first officer then confirmed that the plane was stabilised and held a speed of plus 5 (kt). Six seconds later, the first officer announced that the speed was plus 3 (kt). At 07:31:51 hours, the CVR recorded that a warning sound (ping) was emitted by the aircraft's audible warning  Accident Investigation Board Norway system. The commander later told AIBN that he aimed for three red and one white on the PAPI (Precision approach path indicator). The first officer then announced twice that the speed was correct (bug speed). From the aircraft cockpit voice recorder (CVR) it is documented that the pilots kept a speed over threshold at Vref. According to the aircraft flight manual (AFM) correct airspeed is Vref =112 kt. According to data from the ground radar the aircraft's ground speed was 120 kt  on passing the threshold for runway 33. The flight commander has stated that when the aircraft was approximately 50 ft above the runway, he lowered the thrust levers as normal to the 'Flight Idle' position. At 07:32:14 hours, sounds from the CVR indicated that the wheels touched the runway. Both pilots have stated that the landing took place a few metres beyond the standard landing point, and that it was a ‘soft’ landing. Next, the following occurred (times are stated in seconds\r\nafter nose wheel touchdown):\r\n- 1 second: 'and spoilers' announced by first officer\r\n- 1.5 seconds: sound of spoiler lever being moved to aft position (LIFT SPLR)\r\n- 4 seconds: 'no spoilers' announced by first officer (standard phrase in accordance with the airline's standard operating procedures (SOP) when spoiler indicator lights does not come on)\r\n- 6.6 seconds: sound of brake selector switch being turned\r\n- 7.9 seconds: audio signal (single chime) from the aircraft's warning system\r\n- 12.8 seconds: The first screeching noises from the tyres are audible\r\n- 12.8 – 22.8 seconds: Varying degrees of screeching noises from the tyres can be heard\r\n- 22.8 seconds: The aircraft leaves the runway, at the same time as the AFIS duty officer activates the crash alarm.\r\n- 26 seconds: The cockpit voice recorder stops recording sound.\r\nThe first officer has informed the AIBN that, after landing, he verified that the commander moved the thrust levers from 'Flight Idle' to 'Ground Idle', at the same time as the nose of the aircraft was lowered. He also saw that the commander moved the spoiler lever from 'AIR BRAKE' (air brake fully engaged) to 'LIFT SPLR' (spoilers deployed). The first officer expected the two spoiler indicator lights (SPLR Y and SPLR G, see section 1.6.6.3) to come on after approximately three seconds. He was therefore surprised when this did not happen. In accordance with the airline's procedures, the first officer then verified, among other things, that hydraulic pressure and other instruments showed normal values and that the switches in question were set to the correct positions. The commander has explained to the AIBN that, when the speed had dropped to  approximately 80 kt, he kept his left hand on the nose wheel steering and his right hand on the thrust levers. The first officer then took over the control wheel. The commander has stated that he felt that the brakes were working until they were about half way down the runway, after which the expected retardation did not occur. The aircraft had then got so far down the runway that it was too late to abort the landing. The commander applied full force on both brake pedals, without achieving a normal braking action. In an attempt to improve retardation he moved the brake selector lever from the 'Green' position to the 'Yellow' position, but this did not help. He then moved the lever to the 'Emergency Brake' position, whereby the aircraft's anti-skid system was disconnected. At that point the commander realised that it was impossible to stop the aircraft, even by continuously applying full pressure on the brake pedals, and that the aircraft would probably run off the runway. He considered that it was not advisable to let the aircraft run off the runway towards the steep area to the left of the aircraft or towards the rocks on the right. His local knowledge told him that the best alternative was therefore to steer the aircraft towards the end of the runway. In a last attempt to stop the aircraft, he steered it towards the right half of the runway and then manoeuvred it with the intent to skid sideways towards the left. The commander hoped that skidding would increase friction and hopefully help to reduce the speed of the aircraft. The aircraft left the runway in a skid a few metres to the left of the centerline. The commander believed that he would have been able to stop the aircraft had the runway been longer by approximately 50-100 metres. The first officer believed that the aircraft had a speed of approximately 5-10 km/h when it left the edge and that they would have been able to stop had the runway been 10-15 metres longer. The AFIS duty officer has stated that he followed OY-CRG visually during parts of the approach and landing. He believed that the aircraft may have flown a little higher and faster than normal during the final approach. The duty officer was not quite sure about where the aircraft touched down, but he estimated that it was within the first third of the runway. For a moment during the rollout OY-CRG was obscured for the AFIS duty officer behind an aircraft of the same type (OY-RCW) from Atlantic Airways that was parked at the apron (see Figure 2). When the AFIS duty officer again got the aircraft in sight, he realised that something was not right. The aircraft had a greater speed than normal. He saw that the aircraft towards the end turned into the right half and then turned back towards the left half of the runway. The duty officer observed the plane leave the runway in a skid at approximately 45° in relation to the runway direction. The duty officer immediately triggered the crash alarm. The AFIS duty officer has stated that the speed of the aircraft was moderate enough for him to hope for a while that it would be able to stop before reaching the end of the runway. He suggested that the aircraft would perhaps have been able to stop had the runway been another 50 metres long. He felt that it was unreal when the aircraft's tail fin moved high into the air and he witnessed the aircraft disappear off the end of the runway. The AFIS duty officer had previously seen blue smoke coming from the main wheels of other aircraft of the same type during braking. He observed a great deal of dampness and smoke emanating from the back of the main wheels of OY-CRG during rollout. The spray, which was about 30% higher than the top of the main wheels, appeared to form a triangle behind the wheels. The spray was of a white colour, extended considerably higher than during previous landings and continued along the length of the runway. He did not register whether the aircraft's spoilers were deployed or not, but he saw that the aircraft continued to produce wake vortices during rollout. When smoke started rising from the crash site, he saw that the fire crews were already on their way. In accordance with procedure, the fire and rescue service at Stord airport are on standby beside the fire engines when aircraft take off and land at the airport. The duty officer and three firemen were therefore in position at the fire station and observed the landing. The duty officer believed that the aircraft touched down in the standard place, possibly a little further along the runway than usual. Everything appeared to be normal until an estimated five to ten seconds after touchdown, when they noticed that the speed of the aircraft was higher than usual. When OY-CRG passed the taxiway to the south, the duty officer and firefighter n°1 both heard that the aircraft was beginning to brake heavy, because of the extremely loud noises emitted by the aircraft’s tyres and brakes. The duty officer had heard similar noises on some other occasions, but only for a second or two as aircraft were brought to a full stop or passed painted areas of the runway. In the case of OY-CRG the noises were persistent. They also observed that the wings continued to produce wake vortices during rollout, something they had not seen before. They realised that the aircraft would need assistance and prepared to respond. The last that the duty officer saw of the aircraft was when it skidded with its nose pointing an estimated 45° towards the left and banked violently to the right as it left the runway. In his opinion, the speed of the aircraft at that point was approximately 30-70 km/h (16-38 kt). When the aircraft disappeared over the edge of the runway and the crash alarm was activated, the airport's two fire engines were on their way to the site. The passengers interviewed by the AIBN provided varying descriptions of the approach and landing, but none of them noticed any braking action after touchdown. All the passengers have confirmed that the aircraft swayed from side to side when nearing the end of the runway. They heard the 'screeching' of brakes and the aircraft turned leftwards. One person observed blue smoke coming from the wheels. One person believed that one of the engines on the left increased its speed. Most passengers felt that the speed was relatively low when the aircraft tipped over the edge of the runway. The cabin crew seated at the back of the cabin have stated that the flight proceeded as usual until the landing at Stord airport, apart from the fact that, shortly before landing, she heard a relatively loud whistling noise. She said that she has heard similar noises during other flights, but not so loud. She assumed that the noise came from the seal around the door to her left. She did not otherwise register anything out of the ordinary until the aircraft left the runway. ", "probable_cause": "The AIBN sees this accident as the accumulated effect of three factors – the aircraft design, the airport and operational factors, which, seen as a whole, may have been unacceptable at the time of the accident.\r\nThe accident:\r\na) The approach and landing were normal, within those variations that may be expected.\r\nb) None of the aircraft's six lift spoilers were deployed when the commander operated the spoiler lever.\r\nc) The AIBN has found two possible explanations for the spoilers not being deployed:\r\n1. A mechanical fault in the spoiler lever mechanism. \r\n2. Faults in two of the four thrust lever micro switches. A fault in one switch may have been hidden right up until a further switch failed.\r\nd) The crew received a warning that the spoilers were not deployed.\r\ne) The commander noticed that the aircraft was not decelerating as expected. He did not associate this with the fault in the spoilers and assumed that the problem was due to a fault in the brakes. He therefore applied the emergency brakes.\r\nf) The emergency brakes do not have anti-skid protection and the wheels locked, so that in combination with the damp runway reverted rubber hydroplaning occurred. Consequently the friction against the runway was significantly reduced. \r\ng) The runway was not grooved. The AIBN believes that reverted rubber hydroplaning will not occur, or will be significantly reduced, on grooved runways.\r\nh) The aircraft was travelling at approximately 15-20 kt when it left the runway and slid down the slope.\r\ni) The AIBN considers that, on its own, the failure of the spoilers to extend would not have caused a runway overrun. The aircraft might have stopped within the landing distance available with a good margin if optimum braking had been used.\r\nj) The aircraft sustained serious damage as a result of the uneven terrain and the abrupt stop at the bottom of the slope.\r\nThe fire:\r\na) The aircraft was seriously damaged during the excursion, so that fuel leakage and immediate ignition occurred, most probably due to an electrical short circuit.\r\nb) The fire escalated rapidly, because it was supplied with large quantities of fuel from the tanks in the aircraft's wings.\r\nc) The inner left engine continued to run at high speed for more than five minutes after the aircraft crashed. This set the surrounding air in motion, so that the fire received a good supply of oxygen.\r\nSurvival aspects:\r\na) The AIBN considers that, in principle, all those involved had a chance of surviving the accident resulting from the excursion. \r\nb) Flames spread to the cabin after a very short time.\r\nc) The rapid spread and intensity of the fire left very short time margins during the evacuation.\r\nd) The survivors evacuated via the left cockpit window and the left rear door. The other doors could not be opened or could not be used as a result of the fire.\r\ne) The reinforced cockpit door prevented evacuation via the cockpit. Two persons were found dead in the cabin, behind this door.\r\nf) The fire and rescue service were quick to arrive at the end of the runway.\r\ng) The fire engines did not come near enough to the fire due to the difficult terrain.\r\nh) The jet blast from the running engine was directed towards the fire engines, creating a headwind.\r\ni) Even though the fire and rescue service did all they could to contain the accident, the result was that the effort had little effect in the most critical period when the evacuation was in progress. "}