{"url": "https://www.baaa-acro.com/crash/crash-airbus-a300-622r-taipei-203-killed", "date": "Feb 16, 1998 at 2006 LT", "type": "Airbus A300-600", "operator": "China-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "City", "schedule": "Denpasar - Taipei", "msn": "578", "yom": 1990, "flight_number": "CI676", "city": "Taipei-Taoyuan (ex Chiang Kai-shek)", "zone": "Taipei City (臺北市)", "country": "Taiwan", "region": "Asia", "crew_on_board": 14, "crew_fatalities": 14, "pax_on_board": 182, "pax_fatalities": 182, "other_fatalities": 7, "total_fatalities": 203, "captain_hours": 7210, "captain_hours_type": null, "copilot_hours": 3530, "copilot_hours_type": null, "aircraft_hours": 20193, "circumstances": "Following an uneventful flight from Denpasar-Ngurah Rai Airport, the aircraft was approaching Taipei-Taoyuan Airport by night and marginal weather conditions with a limited visibility of 2,400 feet, an RVR of 3,900 feet and 300 feet broken ceiling, 3,000 feet overcast. On final approach to runway 05L in light rain and fog, at the altitude of 1,515 feet, the aircraft was 1,000 feet too high on the glide so the captain decided to initiate a go-around procedure. The automatic pilot system was disconnected but for unknown reasons, the crew failed to correct the pitch up attitude. The aircraft passed the runway threshold at an altitude of 1,475 feet, pitched up go around thrust was applied. The aircraft rapidly pitched up, reaching +35° and climbed through 1,723 feet at an airspeed of 134 knots. The gear had just been raised and the flaps set to 20°. The aircraft continued to climb to 2,751 feet when the speed dropped to 43 knots. At this point, the aircraft stalled, entered an uncontrolled descent (pitched down to 44,65°). The crew was apparently able to regain control when the aircraft rolled to the right at an angle of 20° 2-3 seconds prior to final impact. The aircraft struck the ground 200 feet to the right of the runway 05L centerline and 3,7 km from its threshold and eventually crashed on 12 houses. The aircraft disintegrated on impact and all 196 occupants were killed, among them five US citizens, one Indonesian and one French. On the ground, seven people were killed. ", "probable_cause": "The following factors were identified:\r\n- Wrong approach configuration as the aircraft was too high on the glide, \r\n- Poor crew coordination, \r\n- The crew failed to comply with published procedures, \r\n- Poor crew training, \r\n- The crew failed to correct the pitch up attitude during the go-around procedure, \r\n- Lack of visibility due to night, rain and fog. "}