{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-880-22m-21-near-pleiku-81-killed", "date": "Jun 15, 1972 at 1359 LT", "type": "Convair CV-880", "operator": "Cathay-Pacific-21", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Singapore – Bangkok – Hong Kong", "msn": "22-00-53", "yom": 1961, "flight_number": "CX700Z", "city": "Pleiku", "zone": "Gia Lai Province", "country": "Vietnam", "region": "Asia", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 71, "pax_fatalities": 71, "other_fatalities": 0, "total_fatalities": 81, "captain_hours": 14343, "captain_hours_type": 5261, "copilot_hours": 7649, "copilot_hours_type": 2687, "aircraft_hours": 29434, "circumstances": "Flight CX700Z was a scheduled international flight from Singapore to Hong Kong with an en-route stop at Bangkok. It made a 55 minute stop at Bangkok during which 68 passengers and baggage were off loaded, and 35 passengers and baggage, in addition to 35 000 lbs of JP-1 fuel, were loaded. The aircraft took off from Bangkok at 0455 hours GMT bound for Hong Kong via airway Green 67 at FL290. The flight proceeded normally with the aircraft maintaining routine radio contact first with Bangkok ACC and from 0542 hours with Saigon ACC. The last message from the aircraft was received at 0554 hours by Saigon ACC giving the aircraft's position at 0553 hours over reporting point \"PE5\" at FL290, with an estimated time over \"XVK\" reporting point of 0606 hours. At 0620 hours, when no further messages had been received from the aircraft, Saigon ACC called it several times but received no reply. A request for information concerning the aircraft, made by Saigon ACC at 0640 hours to Hong Kong and then Taipei ACCs, produced negative results. The Distress Phase was initiated at 0715 hours and DETRESFA signalled to Tan Son Nhut RCC for appropriate action. The RCC advised Saigon ACC at 0755 hours that a Convair type aircraft had crashed about 30 NM southeast of Pleiku TACAN beacon. The aircraft was identified as VR-HFZ by two helicopter pilots who reached the accident site soon after the occurrence and while the wreckage was still burning. They recovered two bodies from the burning wreckage and flew them to Pleiku. The aircraft was totally destroyed and none of the 81 occupants survived the crash.", "probable_cause": "The aircraft broke up in the air and caught fire following the detonation of a high explosive device within the passenger cabin."}