{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-steamboat-springs-2-killed", "date": "Dec 4, 1978 at 1945 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Rocky%20Mountains%20Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Steamboat Springs - Denver", "msn": "387", "yom": 1973, "flight_number": "JC217", "city": "Steamboat Springs-Bob Adams", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 20, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7340, "captain_hours_type": 3904, "copilot_hours": 3816, "copilot_hours_type": 320, "aircraft_hours": 15145, "circumstances": "The flight departed Steamboat Springs-Bob Adams Airport at 1855LT on a scheduled flight to Denver-Stapleton, carrying 20 passengers and a crew of two. After takeoff, while climbing, the crew encountered severe icing conditions and was cleared to return when the flight crashed into a mountain at the 10,530 feet level. Rescuers arrived on scene the following morning. A pilot and a passenger died while 20 other occupants were injured, most of them seriously. According to official observations, the weather at Steamboat Springs about 25 minutes before the accident consisted of an estimated 2,000 feet overcast ceiling and 6 miles visibility in freezing rain. According to surviving passengers, after the accident, snow was falling at the crash site and a strong wind was blowing and gusting from the west. ", "probable_cause": "The probable cause of the accident was severe icing and strong downdrafts associated with a mountain wave which combined to exceed the aircraft's capability to maintain flight. Contributing to the accident was the captain's decision to fly into probable icing conditions that exceeded the conditions authorised by company directive."}