{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54g-10-do-skymaster-near-oakland-35-killed", "date": "Mar 20, 1953 at 1838 LT", "type": "Douglas C-54 Skymaster", "operator": "Transocean%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Roswell – Oakland – Honolulu – Agana", "msn": "36076", "yom": 1945, "flight_number": "TL942", "city": "Oakland", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 30, "pax_fatalities": 30, "other_fatalities": 0, "total_fatalities": 35, "captain_hours": 8312, "captain_hours_type": 5570, "copilot_hours": 10656, "copilot_hours_type": 7379, "aircraft_hours": 5976, "circumstances": "Transocean Air Lines’ Flight 942 of March 20, 1953, departed Roswell, New Mexico, at 1211 for Oakland, California. On board were 30 military passengers and a crew consisting of Captain H. E. Hum, First Officer F. W. Patchett, Chief Pilot H. W. Rodgers and Stewardesses V. Sandridge and L. Chapman. The flight was for the purpose of transporting military personnel in accordance with the company’s contract with the United States Department of Defense. Prior to departure a DVFR (Defense Visual Flight Rules) flight plan was filed with ARTC (Air Route Traffic Control), indicating a flight to be flown at an altitude of at least 500 feet on top of clouds via Red Airway 88 to Albuquerque, New Mexico; Green Airway 4 to Palmdale, California; Blue Airway 14 and Amber Airway 1 to Bakersfield, California; Amber Airway 1 to Fresno, California; and Blue Airway 10 to Oakland, California. There was sufficient fuel on board for 10 hours and the flying time to Oakland was estimated to be six hours and 35 minutes. According to the company’s records the gross weight of the aircraft at the time of takeoff was 63,817 pounds, which was within the allowable gross weight of 73,000 pounds; the load was properly distributed. After departing Roswell the flight progressed in a routine manner and at 1451, when in the vicinity of Winslow, Arizona, the DVFR flight plan was changed to IFR (Instrument Flight Rules), still at least 500 feet on top of clouds. At 1732 the flight reported that it was over Fresno, California, at 1730, that it was cruising at 8,000 feet (at least 500 feet on top of clouds), estimating Los Banos, California, at 1740 and requested further clearance, At 1744 Flight 942 called the Fresno radio communications station and asked that the requested clearance be expedited, stating that it was now at 7,000 feet, at least 500 feet on top. At 1747, the following clearance was issued the flight: “ARTC clears Transocean 942 to the Newark radio beacon, maintain 8,000, contact Oakland Approach Control after passing Evergreen, no delay expected, report reaching 8,000.” Approaching Evergreen at 1809, the flight was advised to maintain 8,000 feet to Newark. One minute later, at 1810, Flight 942 reported over Evergreen at 8,000 and requested a lower altitude. This request was denied because of traffic at the 7,000-foot level. At 1819 the flight reported over the Newark, California, compass locator and fan marker (radio beacon) at 8,000 feet where it held for 11 minutes. At 1827, Oakland Approach Control cleared Flight 942 for a straight-in range approach, to descend in the holding pattern to cross the Newark compass locator at 3,500 feet and to report leaving each 1,000-foot level. Three minutes later, at 1830, the flight reported leaving 8,000 feet, and subsequently reported leaving each 1,000-foot level. At 1836, it reported being at 3,500 feet leaving the Newark compass locator inbound. This was the last known radio contact with the flight. At approximately 1838 the aircraft crashed in a barley field. Impact and fire destroyed the aircraft. There were no survivors. The Oakland weather reported at the time was: Measured ceiling 1300 feet broken, 1800 feet overcast, light rain, fog, visibility two and one-half miles, wind south-southwest 17 miles per hour, altimeter setting 30.09.", "probable_cause": "The Board determines that the probable cause of this accident was the loss of control of the aircraft for reasons unknown, during its descent from the Newark compass locator. The following findings were pointed out:\r\n- The aircraft was flying under instrument weather conditions with icing in the clouds above 5,000 feet; temperatures were above freezing below this altitude,\r\n- The descent from 8,000 feet to 3,500 feet was made at a rate of approximately 750 feet per minute,\r\n- After reporting at an altitude of 3,500 feet and leaving the Newark fan marker inbound, the aircraft became uncontrollable and its average rate of descent was approximately 1,750 feet per minute,\r\n- Witnesses observed the aircraft when it was immediately below the 1,300-foot cloud ceiling in a right wing low slipping attitude and watched it continue in this attitude until it struck the ground,\r\n- No emergency was declared by the flight,\r\n- All ground navigational facilities were operating normally,\r\n- The location of the accident was approximately three miles beyond the Newark fan marker toward Oakland, and one and one-half miles to the right of course,\r\n- The available evidence does not indicate that any malfunctioning of the aircraft or controls, fire in flight, or structural failure occurred prior to impact."}