{"url": "https://www.baaa-acro.com/crash/crash-siai-marchetti-sm102-parete-2-killed", "date": "Oct 22, 1961 at 0915 LT", "type": "SIAI-Marchetti SM.102", "operator": "Transavia-Italia", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Plain, Valley", "schedule": "Naples – Rome", "msn": "15", "yom": 1950, "flight_number": null, "city": "Parete", "zone": "Campania", "country": "Italy", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3306, "captain_hours_type": 82, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 695, "circumstances": "After unloading 500 kg of newspapers at Capodichino Airport, the empty aircraft with a pilot and a flight mechanic aboard took off at 0850LT for the return VFR flight to Ciampino Airport, Rome. The take-off and climb-out were normal. Twenty minutes later the pilot informed Capodichino tower that he was returning because the right engine had failed. At this time he was at 1 000 ft over Grazzanise. At 0914LT the aircraft was on a heading of 120°, at 700 ft and maintaining altitude fairly well. Thereafter the flight did not respond to any calls. It crashed at approximately 0915LT near Parete, 13 km to the west-northwest of the south end of the Capodichino runway. Both crew members were instantly killed and the aircraft was destroyed. There was no fire following impact. The airplane was operated by Transavia Airlines Italia. \nCrew:\nAngelo Arduini, pilot,\nCarlo Saporito, mechanic. ", "probable_cause": "Having considered various hypotheses as to the cause of the accident the Board concluded that it was caused by a cumulative effect of various factors. \n- The weather conditions conducive to carburetor icing were such as to escape the attention of the pilot and thus explain his failure to take preventive or corrective action.\n- Power reduction had occurred initially in the right engine as a result of carburetor icing.\n- Subsequent loss of power in the left engine was also due to carburetor icing, or overheating as a result of operation at increased power to compensate for the failure of the right engine or again because of the deliberate action by the pilot to counter incipient overheating.\n- The pilot failed to foresee the possibility of carburetor icing, to consider the desirability of feathering the right engine, to assess the significance of the increase in minimum speed caused by the trim of the aircraft and its asymmetric power and to appreciate the stall characteristics in such conditions. \n- The low altitude at which the aircraft was flying precluded prompt recovery from an involuntary and severe stall.\n- The pilot and mechanic had not strapped themselves into their seats with the result that they suffered fatal skull fractures. \n- There may have been psychological reactions, difficult to evaluate, which were due to the fact that the mechanic had only recently been hired and that he had been involved ill another accident on 6 September, which had nearly cost him his job. Therefore, he might have been more inclined to display ability to the point of recklessness rather than to be overcautious (failure to land at Grazzanise)."}