{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-49e-premier-21-killed", "date": "Jul 1, 1942 at 1200 LT", "type": "Douglas C-49 (DC-3)", "operator": "USAAF", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "Battle Creek – Cincinnati – Florence", "msn": "1976", "yom": 1937, "flight_number": null, "city": "Premier", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 19, "pax_fatalities": 19, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While approaching Cincinnati-Lunken Field Airport in poor weather conditions, the crew made three attempts to land without success. During the fourth attempt, the aircraft speed was too high and it hit hard the runway surface. The captain increased engine power and decided to continue to Florence, South Carolina. Few minutes later, while cruising in poor weather conditions (thunderstorm and turbulence), the aircraft banked left and right and eventually went out of control. From a height of 250 metres, it lost successively part of its wings and elevators, dove into the ground and crashed in an open field. The aircraft was totally destroyed by impact forces and post crash fire and all 21 occupants were killed.", "probable_cause": "According to the Board of investigations, it appears the aircraft lost parts of wings and elevators when it dove into the ground, most probably due to forces exceeding their design and certification. For undetermined reasons, the captain decided to continue the flight to Florence following a missed landing at Cincinnati Airport. Due to a heavy landing, the wings' and elevators' structure was slightly damaged and moderate to severe turbulence in the region also contributed to the wings' and elevator' structural weakness. Poor discipline and judgment is also reproached to both pilots as they should complete the landing procedure at Cincinnati and perform an inspection of the aircraft, which was not performed. Eventually, accumulation of ice on carburetors associated to a certain torsion during the hard landing was considered as a contributory factor as the carburetors did not work properly during the last segment of the flight."}