{"url": "https://www.baaa-acro.com/crash/crash-bae-nimrod-mr2p-toronto-7-killed", "date": "Sep 2, 1995", "type": "BAe Nimrod", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Demonstration", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Toronto - Toronto", "msn": "8014", "yom": 1969, "flight_number": null, "city": "Toronto", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Nimrod display aircraft and crew had deployed to Canada on 23 August 1995 for displays at Canadian Forces Base Shearwater and the Canadian International Air Show (CIAS) at Toronto. In excellent weather, with a light on-shore wind, the aircraft took off on time for its display. Upon completion of the safety checks, it ran in for the standard Nimrod display sequence which features two orbits and two dumb-bell turns. The latter manoeuvres each involved a turn away from the display line, a climb to not above 1,000 feet, followed by a turn in the opposite direction and descent, to fly back parallel with the display line. Having completed the two orbits, the first dumb-bell turn was completed uneventfully. After a slow flypast with undercarriage down, the aircraft entered its final manoeuvre, the second dumb-bell turn. It was seen to turn away approximately 75° to starboard under full power before the flaps were retracted to 20° and the undercarriage raised. The nose was then pitched up into a climbing attitude of 24°. As the aircraft passed 950 feet, engine power was reduced to almost flight idle, following which the speed reduced rapidly to 122 knots, below the 150 knots recommended and taught for that stage of the display. The aircraft was rolled to 70° of port bank, shortly afterwards reducing to 45°, and the nose lowered to 5° below the horizon. During this turn the airspeed increased slightly and the G-loading increased to 1 .6 G. However, the combination of the low airspeed and the G-loading led the aircraft to stall, whereupon the port wing dropped to 85° of bank and the nose dropped to 18° below the horizon. Full starboard aileron and full engine power were applied in an attempt to recover the aircraft but, by this stage, there was insufficient height to recover and the aircraft hit the water. All seven crew members were killed. ", "probable_cause": "The Inquiry determined that the captain made an error of judgement in modifying one of the display manoeuvres to the extent that he stalled the aircraft at a height and attitude from which recovery was impossible. The Inquiry considered that contributory factors could have included deficiencies in the flight deck crew's training and in the method of supervision which could have allowed the captain to develop an unsafe technique without full appreciation of the consequences."}