{"url": "https://www.baaa-acro.com/crash/crash-cessna-501-citation-isp-near-fairmount-4-killed", "date": "Feb 8, 2020 at 1011 LT", "type": "Cessna 501 Citation I", "operator": "Remonia Air", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Peachtree City - Nashville", "msn": "501-0260", "yom": 1982, "flight_number": null, "city": "Fairmount", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On February 8, 2020, at 1013 eastern standard time, a Cessna 501, N501RG, was substantially damaged after an inflight breakup near Fairmount, Georgia. The private pilot, commercial pilot, and two passengers were fatally injured. The airplane was owned and operated by Remonia Air, LLC. Instrument meteorological conditions prevailed, and an instrument flight rules flight plan was filed for the flight that originated at Falcon Field (FFC), Atlanta, Georgia around 0945. The personal flight was conducted under the provisions of Title 14 Code of Federal Regulations Part 91 and had an intended destination of John C. Tune Airport (JWN), Nashville, Tennessee. According to a fuel receipt, the airplane was \"topped off\" with 104 gallons of Jet A fuel that was premixed with Prist prior to departing on the accident flight. According to flight plan information that was filed with a commercial vendor, the accident flight was scheduled to depart at 0930 from FFC and arrive at JWN around 1022. Then, another flight plan was filed from JWN back to FFC departing at 1030 and arriving at JWN around 1119. In addition, the flight plan noted in the remarks section that the flight was a \"training flight.\" A preliminary review of air traffic control communications and radar data revealed that a controller issued local weather information and instructed the pilots to climb to 7,000 ft mean sea level (msl). The controller issued the pilots a pilot report (PIREP) for trace to light rime icing between 9,000 ft and 11,000 ft, and one of the pilots acknowledged. Then, the controller instructed the pilots to climb to 10,000 ft and to turn right to 020°. The controller observed the airplane on a northwest bound heading and asked the pilots to verify their heading. A pilot responded that they were returning to a 320° heading, to which the controller instructed him to maintain 10,000 ft. The controller asked the pilots if everything was alright, and a pilot responded that they had a problem with the autopilot. The controller instructed the pilots to again maintain 10,000 ft and to advise when they were able to accept a turn. The controller again asked if everything was alright or if they needed assistance; however, neither pilot responded. The controller again asked the pilots if everything was under control and if they required assistance, to which one of the pilots replied that they were \"OK now.\" The airplane climbed to 10,500 ft and the controller instructed the pilots to maintain 10,000 ft and again asked if everything was under control. A pilot responded in the affirmative and stated that they were \"playing with the autopilot\" because they were having trouble with it, and the controller suggested that they turn off the autopilot and hand-fly the airplane. The airplane descended to 9,000 ft and the controller instructed the pilots to maintain 10,000 ft and asked them if they could return to the departure airport to resolve the issues. One of the pilots requested a higher altitude to get into visual flight rules (VFR) conditions, and the controller instructed him to climb to 12,000 ft, advised that other aircraft reported still being in the clouds at 17,000 ft, and asked their intentions. The pilot requested to continue to their destination and the controller instructed him to climb to 13,000 ft. One of the pilots established communication with another controller at 11,500 ft and stated they were climbing to 13,000 ft on a 360° heading. The controller instructed the pilot to climb to 16,000 ft and inquired if their navigation issues were corrected. A pilot advised the controller that they had problems with the left side attitude indicator and that they were working off the right side. The controller cleared the airplane direct to the JWN and asked if they were above the clouds as they were climbing through 15,400 ft. The airplane then began a left turn and soon after radar contact was lost at 1013. The controller attempted numerous times to contact the airplane with no response.", "probable_cause": null}