{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-313a-washington-dc-6-killed", "date": "Dec 12, 1949 at 2041 LT", "type": "Douglas DC-3", "operator": "Capital-Airlines3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Memphis – Norfolk – Newport News – Washington DC", "msn": "2556", "yom": 1940, "flight_number": "CA500", "city": "Washington DC", "zone": "District of Columbia", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 20, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 6476, "captain_hours_type": 5296, "copilot_hours": 6590, "copilot_hours_type": 2559, "aircraft_hours": 27396, "circumstances": "Capital Airlines Flight 500 originated in Memphis, Tenn., December 12, 1949, and proceeded in a routine manner to Norfolk, Va. No difficulties of any kind were experienced. At Norfolk a new crew consisting of Captain William J. Davis, Copilot Lloyd L. Porter, and Flight Attendant Joseph W. Buell were assigned to the flight for the remainder of the trip to Newport News, Va., and Washington, D. C. Before takeoff from Norfolk, Captain Davis studied all weather data in the Capital Airlines office, and called the company’s dispatcher in Washington who advised him that weather conditions would remain above landing limits until after midnight. Flight 500 took off from Norfolk at 1816; arrived at Newport News, Va., at 1836; and seven minutes later, at 1843, was again in the air en route to Washington by way of Richmond, Va., at a cruising altitude of 4,000 feet. On board were 20 passengers, the crew of three, 792 pounds of cargo and 3,000 pounds of fuel. Total aircraft weight was 25,472 pounds, which was 126 pounds in excess of the certificated aircraft weight. The load was distributed so that the center of gravity of the aircraft was within the certificated limits. The trip continued without incident. It reported over Richmond at 1910, and was then cleared by Air Route Traffic Control to proceed at 8,000 feet to the Clifton Intersection, which is 32 miles southwest of the Washington National Airport. By the time that the flight arrived over Clifton, however, ceiling and visibility at Washington were below landing minimums, so instructions were given to the flight to “hold.” Approximately 410 gallons of fuel remained on board, and weather conditions at the al-ternate airports of Richmond and Norfolk were remaining well above landing minimums. At 2025, a weather observer stationed at the south end of runway 36 at the National Airport reported that the ceiling was 400 feet variable, and that the visibility was 3/4 of a mile. Since landing minimums were now indicated, the control tower cleared one aircraft to land and the Capital flight to descend to 3,500 feet in the holding pattern. The air-craft which had been cleared to land completed its landing at 2033 without incident using the instrument landing system (ILS). At 2033 another runway observation was made, reporting the ceiling to be 400 feet variable, and the visibility 1 1/2 miles restricted by light rain and fog. Immediately following the transmission of this observation, clearance was given to Capital’s Flight 500 to descend to 1,500 feet and to commence its landing approach. Flight 500 acknowledged. Five minutes later, at 2038, the flight reported leaving the outer marker, five miles south of the end of runway 36, at which time it was cleared by the tower to land. From the holding pattern to the outer marker the aircraft was observed in the ground control approach (GCA) radar scopes which are in the Washington National Tower. Nothing unusual was noted. As the flight passed over the outer marker at 1,500 feet, entering its ILS approach, the GCA operator advised that the approach would be monitored. This message, as is customary, was not acknowledged, so it is not known whether either the pilot or the copilot was listening to GCA. In the GCA radar scopes, the flight path and descent at first appeared to be normal. When the aircraft was 4 1/2 miles from its point of landing, it was 200 feet to the right of the intended track, an extended center line of the runway, and the glide was good. When it was three miles from intended point of touchdown, it was 50 feet to the right and the glide was still good. When two miles out, the aircraft was on the center line, and only 25 feet above the glide path. One and one-half miles out, it was on the center line, and on the glide path. Then, the flight began to deviate to the right from the center line. The GCA operator in his monitoring conversation advised the flight that it was drifting sharply to the right, and followed by saying that it had gone 1,500 feet off course. The flight then appeared to turn left, proceeding back to the center line, but when within 1,000 feet of the center line and only 1/2 mile from the end of the runway, it disappeared entirely from the scopes. The aircraft was neither seen nor heard by any of the control tower operators, nor by the weather observer stationed at the end of runway 36. A few minutes after the accident, the runway observer reported the ceiling to be 400 feet variable and visibility to be 3/4 of a mile. There was light rain and fog, and the wind was from the south-southwest at nine miles per hour. The aircraft struck the water, left wing and nose first, in a steep nose down, left turning attitude. Both pilots and four passengers were killed. The aircraft was lost.", "probable_cause": "The Board determines that the probable cause of this accident was the stalling of the aircraft at an altitude too low to permit a recovery.\r\nThe following findings were noted:\r\n- At the time of the accident the ceiling was 400 feet, variable and the visibility was 3/4 of a mile to the north of point of observation,\r\n- Immediately before the accident, and during the execution of an instrument approach, the aircraft was stalled at too low an altitude to effect recovery,\r\n- The aircraft struck the Potomac River in a steep, nose down, turning attitude, 1,875 feet southeast from the approach end of runway 36."}