{"url": "https://www.baaa-acro.com/crash/crash-learjet-24d-near-juneau-4-killed", "date": "Oct 22, 1985 at 2043 LT", "type": "Learjet 24", "operator": "ERA%20Aviation.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Mountains", "schedule": "Anchorage – Juneau", "msn": "24-265", "yom": 1973, "flight_number": null, "city": "Juneau", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 5578, "captain_hours_type": 547, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6303, "circumstances": "During arrival to pick up a medevac patient, the flight was cleared for an LDA-1 runway 08 approach via the Asort transition. Thus, the pilot should have continued southeast on J-541 toward the SSR vortac and intercepted the localizer (loc) at Asort; then track inbound on the loc (062°), using I-JDL frequency 109.9 MHz (frequency for loc and co-located DME). After Asort, minimum altitude was 6,500 feet to Dibol intersection, 5,100 feet to Lynns intersection and 3,400 feet to the faf at Barlo intersection. DME from I-JDL to the intersections was: 18.2, 13.5 and 8 miles. DME from SSR (south of loc track) to the intersections was 11.2, 12.7 and approximately 16 miles. Flight reported Asort inbound while descending thru approximately 9,500 feet. Last radio call was 30 seconds later while descending thru 8,200 feet, 14 miles west of Dibol. Approximately 4 miles west of Dibol, aircraft impacted mountain side at 3,500 feet msl. No preimpact mechanical malfunction was found. There was evidence that both nav's were tuned to 109.9 MHz, but DME control head was inadvertently left in 'hold' position (locking DME to SSR rather than I-JDLl) and crew began a premature descent. Juneau weather was in part: 600 feet scattered, 3,000 feet overcast, 7 miles visibility. Pilot-in-command was currently flying both Learjet and DHC-7. All four occupants, two pilots and two doctors, were killed. ", "probable_cause": "Occurrence #1: in flight collision with terrain/water\r\nPhase of operation: approach - iaf to faf/outer marker (ifr)\r\nFindings\r\n1. (f) comm/nav equipment,distance measuring eqpt(dme) - not switched\r\n2. (c) flight/navigation instrument(s) - improper use of\r\n3. (f) habit interference - pilot in command\r\n4. (c) became lost/disoriented - inadvertent - pilot in command\r\n5. (c) descent - premature\r\n6. (c) unsafe/hazardous condition - not identified - copilot/second pilot\r\n7. (f) light condition - dark night\r\n8. (f) weather condition - clouds\r\n9. (f) terrain condition - mountainous/hilly\r\n10. (c) proper altitude - not maintained - pilot in command\r\n11. (f) terrain condition - rising"}