{"url": "https://www.baaa-acro.com/crash/crash-consolidated-pb4y-2-privateer-nas-sand-point", "date": "Aug 26, 1956 at 0930 LT", "type": "Consolidated PB4Y-2 Privateer", "operator": "US%20Navy", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Sand Point - Sand Point", "msn": "59695", "yom": 1943, "flight_number": null, "city": "Sand Point NAS", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Lt. Thorson, pilot, and Lt. Shook, copilot, were scheduled for a local 2 ½ hour training flight in P4Y-2 registered 59695 at 0930LT. Due to marginal VFR conditions, they were briefed to conduct GCA runs and remain in the local pattern until the weather improved. The pilots completed the engine run-up and the take-off checklist (inadvertently missing the flaps). the tower informed the aircraft that the field was VFR and cleared the aircraft for take-off. The aircraft became airborne just prior to reaching the end of the runway in a near level attitude, no more than one to two feet in the air. As it passed the end of the runway and over the waters edge, a drop of about 10 feet, the loss of ground effect caused it to settle immediately. The aircraft settled to the water at full power about 300 feet from the end of the 5,000 foot runway. The aircraft planed on the main gear and belly and settled to a stop about 5,000 yards past the point of initial impact. An orderly ditching procedure followed. All personnel were out of the aircraft in approximately 45 seconds and in life rafts shortly thereafter. The aircraft sank in 175 feet of water in approximately 2 ½ minutes. The personnel were rescued by the NAS Seattle crash boat about 4 minutes later. Lt. Shook and one crewman received minor injuries while vacating the aircraft. During the run-out on the water, the bomb bay doors ripped open and one bomb bay tank was torn loose from the aircraft. All propeller blades were slightly bent from impact with the water. No other damage is believed to have occurred to the aircraft. Salvage operations commenced on August 28, 1956, and the aircraft was raised to the surface on August 31, 1956. However, a shackle pin to the hoisting sling broke while attempting to tow the aircraft ashore and the aircraft again sank to a depth of 210 feet. Lines had been secured to the two inboard engines and the engines broke off at the mounts when the sling shackle pin gave way. Further efforts to salvage the aircraft were abandoned as uneconomical.\nSource: \nhttp://www.memorieshop.com/Seattle/LakeWashington/PB4Y-2.html", "probable_cause": "It was concluded that the primary cause of the accident was pilot error in attempting a no-flap take-off. It was also concluded that the pilot and copilot did not take corrective action soon enough during take-off to successfully abort the take-off."}