{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-marathon", "date": "May 8, 2006 at 0800 LT", "type": "Cessna 421B Golden Eagle II", "operator": "BCL", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pompano Beach - Marathon", "msn": "421B-0535", "yom": 1973, "flight_number": null, "city": "Marathon", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1450, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5307, "circumstances": "The commercial certificated pilot was positioning the multi-engine, retractable landing gear airplane for a corporate passenger flight under Title 14, CFR Part 91, when the accident occurred. Upon landing at the destination, the pilot aborted the landing, and after climbing to about 100 feet agl descended, impacting in a canal. A witness who was not looking towards the runway, reported hearing the sound of a twin engine airplane approaching with the engines at reduced power, and then heard a scraping noise similar to the recent gear-up landing he had witnessed. Looking toward the runway, he said the airplane was midfield, left of the runway centerline, about 20 feet in the air with the landing gear retracted, and that he saw a cloud of dust, and heard what he thought was full engine power being applied. He said the airplane climbed to about 100 feet agl, and disappeared from view. Another witness with a portable VHF radio tuned to the unicom frequency, reported hearing the pilot say he was \"doing an emergency go-around.\" The airplane descended striking utility poles, and impacted in a saltwater canal. An examination of the airport runway revealed a set of parallel propeller strike marks. The left and right sets of marks were 109 and 113 feet long, and the mark's center-to-center measurement is consistent with the engine centerline-to-centerline measurement for the accident airplane. No landing gear marks were observed. The airplane's six propeller blades had extensive torsional twisting and bending, as-well-as extensive chord wise scratching and abrasion. Several of the blades had fractured or missing tips. An examination of the cockpit showed the landing gear retraction/extension handle was in the up/retracted position, and the landing gear extension warning horn circuit breaker was in the pulled/tripped position. The landing gear emergency extension handle was in the stowed position. The nose landing gear was damaged during final impact, and was not functional. During the postimpact examination, both the left and right main landing gear were stowed in the up and locked/retracted position. The landing gear were released/unlocked and operated appropriately using the emergency extension handle. An examination of the left and right main landing gear showed no damage to the wheel doors, leg doors, wheels, or tires. All linkages and locking devices were undamaged, and appeared to function normally.", "probable_cause": "The pilot's failure to extend the landing gear prior to landing, which resulted in the propellers striking the runway, an aborted landing, and an in-flight collision with terrain.\n"}