{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47-dl-near-saint-joachim-23-killed", "date": "Sep 9, 1949 at 1045 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "CP%20Air", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Montreal – Québec – Baie-Comeau", "msn": "4518", "yom": 1942, "flight_number": null, "city": "Saint Joachim", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 19, "pax_fatalities": 19, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft left Quebec-Ancienne Lorette Airport at 1020LT, five minutes behind the scheduled time. Twenty-five minutes later, while cruising above the St Laurent River along the coast of the 'non organized' territory of Sault-au-Cochon, the aircraft exploded, dove into the ground and crashed in a wooded area located northeast of Saint Joachim, about 65 km northeast of the city of Quebec. The aircraft was destroyed by impact forces and all 23 occupants were killed. It was quickly determined that the disintegration of the aircraft was caused by the explosion of a bomb placed in the front left cargo compartment. Prepared by Généreux Ruest, the bomb was composed by dynamite, was connected to a clockwork and was powered by a pocket lamp battery. Généreux Ruest and his sister Marguerite Pitre were partner in crime of Albert Guay who contracted a life insurance (10,000 Canadian dollars) for his wife who was on board the aircraft. In trouble with his wife, Albert Guay organized her assassination and put himself the bomb in his wife's luggage. She was killed in the crash with 22 other people. Albert Guay, Généreux Ruest and Marguerite Pitre were convicted of assassination and were executed by hanging respectively on January 21, 1951, July 25, 1952 and January 9, 1953.", "probable_cause": "Loss of control in flight due to the explosion of a bomb placed in the front left cargo compartment. "}