{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-231-phoenix", "date": "Aug 28, 2002 at 1843 LT", "type": "Airbus A320", "operator": "America%20West%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Houston - Phoenix", "msn": "092", "yom": 1990, "flight_number": "AWE794", "city": "Phoenix-Sky Harbor", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 154, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 19500, "captain_hours_type": 7000, "copilot_hours": 11000, "copilot_hours_type": 800, "aircraft_hours": 40084, "circumstances": "After an asymmetrical deployment of the thrust reversers during landing rollout deceleration, the captain failed to maintain directional control of the airplane and it veered off the runway, collapsing the nose gear and damaging the forward fuselage. Several days before the flight the #1 thrust reverser had been rendered inoperative and mechanically locked in the stowed position by maintenance personnel. In accordance with approved minimum equipment list (MEL) procedures, the airplane was allowed to continue in service with a conspicuous placard noting the inoperative status of the #1 reverser placed next to the engine's thrust lever. When this crew picked up the airplane at the departure airport, the inbound crew briefed the captain on the status of the #1 thrust reverser. The captain was the flying pilot for this leg of the flight and the airplane touched down on the centerline of the runway about 1,200 feet beyond its threshold. The captain moved both thrust levers into the reverse position and the airplane began yawing right. In an effort at maintaining directional control, the captain then moved the #1 thrust lever out of reverse and inadvertently moved it to the Take-Off/Go-Around (TOGA) position, while leaving the #2 thrust lever in the full reverse position. The thrust asymmetry created by the left engine at TOGA power with the right engine in full reverse greatly increased the right yaw forces, and they were not adequately compensated for by the crew's application of rudder and brake inputs. Upon veering off the side of the runway onto the dirt infield, the nose gear strut collapsed. The airplane slid to a stop in a nose down pitch attitude, about 7,650 feet from the threshold. There was no fire. Company procedures required the flying pilot (the captain) to give an approach and landing briefing to the non flying pilot (first officer). The captain did not brief the first officer regarding the thrust reverser's MEL'd status, nor was he specifically required to do so by the company operations manual. Also, the first officer did not remind the captain of its status, nor was there a specific requirement to do so. The operations manual did state that the approach briefing should include, among other things, \"the landing flap setting...target airspeed...autobrake level (if desired) consistent with runway length, desired stopping distance, and any special problems.\" The airline's crew resource management procedures tasked the non flying pilot to be supportive of the flying pilot and backup his performance if pertinent items were omitted from the approach briefing. The maintenance, repair history, and functionality of various components associated with the airplane's directional control systems were evaluated, including the brake system, the nose landing gear strut and wheels, the brakes, the antiskid system, the thrust levers and reversers, and the throttle control unit. No discrepancies were found regarding these components.", "probable_cause": "The captain's failure to maintain directional control and his inadvertent application of asymmetrical engine thrust while attempting to move the #1 thrust lever out of reverse. A factor in the accident was the crew's inadequate coordination and crew resource management."}