{"url": "https://www.baaa-acro.com/crash/crash-cessna-425-conquest-i-harbor-springs", "date": "Jan 12, 2007 at 1830 LT", "type": "Cessna 425 Conquest", "operator": "Lyden Air Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Toledo - Harbor Springs", "msn": "425-0196", "yom": 1984, "flight_number": null, "city": "Harbor Springs", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1991, "captain_hours_type": 60, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2345, "circumstances": "The pilot reported that during cruise descent the airplane accumulated about 1/2-to 3/4-inch of rime ice between 8,000 and 6,000 feet. During the approach, the pilot noted that a majority of the ice had dissipated off the leading edge of both wings, although there was still trace ice on the aft-portion of the wing deice boots. The pilot maintained an additional 20 knots during final approach due to gusting winds from the north-northwest. He anticipated there would be turbulence caused by the surrounding topography and the buildings on the north side of the airport. While on short final for runway 28, the pilot maintained approximately 121 knots indicated airspeed (KIAS) and selected flaps 30-degrees. He used differential engine power to assist staying on the extended centerline until the airplane crossed the runway threshold. After crossing the threshold, the pilot began a landing flare and the airspeed slowed toward red line (92 KIAS). Shortly before touchdown, the airplane \"abruptly pitched up and was pushed over to the left\" and flight control inputs were \"only marginally effective\" in keeping the wings level. The airplane drifted off the left side of the runway and began a \"violent shuddering.\" According to the pilot, flight control inputs \"produced no change in aircraft heading, or altitude.\" The pilot advanced the engine throttles for a go-around as the left wing impacted the terrain. The airplane cartwheeled and subsequently caught fire. No pre-impact anomalies were noted with the airplane's flight control systems and deice control valves during a postaccident examination. No ice shapes were located on the ground leading up to the main wreckage. The reported surface wind was approximately 4 knots from the north-northwest.", "probable_cause": "The pilot's failure to maintain aircraft control and adequate airspeed during landing flare. Contributing to the accident was the aerodynamic stall/mush encountered at a low altitude."}