{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-g650-roswell-4-killed", "date": "Apr 2, 2011 at 0934 LT", "type": "Gulfstream G650", "operator": "Gulfstream%20Aerospace", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Roswell - Roswell", "msn": "6002", "yom": 2010, "flight_number": null, "city": "Roswell", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 11237, "captain_hours_type": 263, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 434, "circumstances": "On April 2, 2011, about 0934 mountain daylight time, an experimental Gulfstream Aerospace Corporation GVI (G650), N652GD, crashed during takeoff from runway 21 at Roswell International Air Center, Roswell, New Mexico. The two pilots and the two flight test engineers were fatally injured, and the airplane was substantially damaged by impact forces and a post crash fire. The airplane was registered to and operated by Gulfstream as part of its G650 flight test program. The flight was conducted under the provisions of 14 Code of Federal Regulations Part 91. Visual meteorological conditions prevailed at the time of the accident. The accident occurred during a planned one-engine-inoperative (OEI) takeoff when a stall on the right outboard wing produced a rolling moment that the flight crew was not able to control, which led to the right wingtip contacting the runway and the airplane departing the runway from the right side. After departing the runway, the airplane impacted a concrete structure and an airport weather station, resulting in extensive structural damage and a post crash fire that completely consumed the fuselage and cabin interior.", "probable_cause": "An aerodynamic stall and subsequent uncommanded roll during a one engine-inoperative takeoff flight test, which were the result of (1) Gulfstream’s failure to properly develop and validate takeoff speeds for the flight tests and recognize and correct the takeoff safety speed (V2) error during previous G650 flight tests, (2) the G650 flight test team’s persistent and increasingly aggressive attempts to achieve V2 speeds that were erroneously low, and (3) Gulfstream’s inadequate investigation of previous G650 uncommanded roll events, which indicated that the company’s estimated stall angle of attack while the airplane was in ground effect was too high. Contributing to the accident was Gulfstream’s failure to effectively manage the G650 flight test program by pursuing an aggressive program schedule without ensuring that the roles and responsibilities of team members had been appropriately defined and implemented, engineering processes had received sufficient technical planning and oversight, potential hazards had been fully identified, and appropriate risk controls had been implemented and were functioning as intended.\n"}