{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-26-islander-tingwall-1-killed", "date": "May 19, 1996 at 2336 LT", "type": "Britten-Norman Islander", "operator": "Loganair", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Inverness - Tingwall", "msn": "544", "yom": 1977, "flight_number": null, "city": "Tingwall", "zone": "Shetland (Zetland)", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3879, "captain_hours_type": 305, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14700, "circumstances": "At 2300 hrs the two Tingwall fire attendants opened the airstripfor the returning flight. The airstrip lights were turned on and the fire appliance made ready. The firemen reported that,sometime later, the pilot radioed Tingwall asking for the wind speed and direction. This was passed as 090° to 120°/20 kt. One of the firemen also reported that at the time there was veryfine drizzle but the visibility was good. Analysis of recorded radar data from the radar head at Sumburgh confirmed that the aircraft routed over Lerwick and then flew north turning west inland over Kebister Ness. The doctor reported that, on approaching Lerwick he could see the lights of the town and the visibility was good enough for him to identify his house. The aircraft then turned southwards to join  downwind right hand for Runway 02. The doctor stated that there were not many lights on the ground to the north of the  airstrip but some to the south in the vicinity of Veensgarth. He also stated that the ride at this stage was moderately turbulent. At the end of the downwind leg the aircraft banked 'sharply' to the right to position on finals. It had, however, been blown through the centreline by the gusty easterly wind and was to the left of the required approach. The doctor confirmed that although the aircraft appeared to be at the correct height for its position he could see that when they were lined up the airfield lights were to the right of the windscreen. The pilot, unable to complete the approach, carried out a go-around to the left of the runway,climbed to 550 feet and turned right to enter the downwind leg again. The doctor reported that the engines sounded normal throughout this manoeuvre and the runway lights were clearly visible again as the aircraft became established on the downwind track. Several witnesses saw the aircraft fly downwind and turn onto the final approach. One witness, positioned on higher ground to the east of the runway threshold, stated that the aircraft flew downwind along the line of the houses at Veensgarth and 'asit turned it descended all the while'. Radar information shows that for this second attempt the pilot extended the downwind legby approximately 800 metres before turning towards the airfield. The rapid turn onto finals was described by the doctor as being very steep but without the increase in 'g' that he would have expected for such an steep angle of bank. The nurse described the sensation as 'the aircraft dropped, with my cheeks and whole body being forced upwards'. Throughout the turn the pilot was seen by the passengers to be generally looking to the right, presumably for the airfield. Seconds later the aircraft hit the ground. After the impact the nurse found herself still in her seat with the aircraft in an upright position. She was relatively uninjured and soon released her seatbelt, released her trapped right foot and struggled clear of the wreckage through the open right rear aircraft window. She ran around the tail section to the doctor and released debris from around his head. Unable to move him because of his injuries, she ran to a nearby house to summon the emergency services. The doctor, although seriously injured, remained conscious throughout and managed to clamber clear of the aircraft to lie on the round some ten feet from the wreckage. The pilot had received fatal injuries at impact.", "probable_cause": null}