{"url": "https://www.baaa-acro.com/crash/crash-cessna-551-citation-iisp-ainsworth", "date": "Jan 1, 2005 at 1120 LT", "type": "Cessna 551 Citation II", "operator": "Jet Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Reading - Ainsworth", "msn": "551-0029", "yom": 1980, "flight_number": null, "city": "Ainsworth", "zone": "Nebraska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2200, "captain_hours_type": 475, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5870, "circumstances": "The twin-engine corporate jet impacted terrain while maneuvering to land after a global positioning system (GPS) approach. The pilot reported that the airplane entered icing conditions during the approach and that the airplane descended out of instrument meteorological conditions between 300-400 feet above ground level (agl). The pilot reported that his windshield had become obscured by ice accumulation during the approach and that he \"had difficulty seeing the runway.\" The pilot elected to land the airplane instead of executing the published missed-approach procedure. The airplane impacted terrain 439 feet short of the runway threshold while in a right turn. After the accident, there was ice accumulation on all booted airframe surfaces measuring 2-4 inches wide and 1/4 to 3/8 inch thick. The upper portions of the windscreens were contaminated with ice measuring about 3/8 inch thick. The remaining airframe portions, including the heated surfaces, were free of ice accumulation. The windshield bleed air switch was selected on \"High\" with the pilot's side windshield heat control knob approximately mid-range. Windshield alcohol was selected \"On\", but the alcohol reservoir was still full upon inspection. At the time of the accident, there was an overcast ceiling of 500 feet agl, 1-3/4 statute mile visibility with mist, and an outside temperature of -08 degrees Celsius. The published minimum descent altitude (MDA) for the GPS runway 17 approach is 500 feet agl, for an airplane equipped with a lateral navigation only GPS receiver. The pilot held a private pilot certificate with multi-engine land, instrument airplane, and Cessna 500 type rating. The pilot reported having 2,200 hours total flight time and 475 hours in the same make/model as the accident airplane.", "probable_cause": "The pilot's decision to continue below the minimum descent altitude (MDA) and his failure to fly the published missed-approach procedure. A factor to the accident was the pilot's improper use of windshield heat which resulted in the windshield becoming obscured with ice during the instrument approach in icing conditions."}