{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-bundaberg-4-killed", "date": "Jun 21, 1987 at 0318 LT", "type": "Cessna 402", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bundaberg - Brisbane", "msn": "402C-0627", "yom": 1982, "flight_number": null, "city": "Bundaberg", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight had been arranged to transport a critically injured patient to hospital in Brisbane. The pilot evidently experienced some difficulty in starting one of the engines. However, witnesses reported that the engines sounded normal as the aircraft commenced moving from the parking area. At 0310 hours the pilot contacted Brisbane Flight Service Unit and reported that the aircraft was taxying. He advised that he was in a hurry, and indicated that he would provide details of the flight after takeoff. Two minutes later he advised that takeoff was being commenced from Runway 14. No further transmissions were received from the aircraft. The aircraft was seen to become airborne and shortly afterwards enter a fog bank. Other witnesses subsequently reported hearing the sounds of an impact. The flight had been arranged to transport a critically injured patient to hospital in Brisbane. The pilot evidently experienced some difficulty in starting one of the engines. However, witnesses reported that the engines sounded normal as the aircraft commenced moving from the parking area. At 0310 hours the pilot contacted Brisbane Flight Service Unit and reported that the aircraft was taxying. He advised that he was in a hurry, and indicated that he would provide details of the flight after takeoff. Two minutes later he advised that takeoff was being commenced from Runway 14. No further transmissions were received from the aircraft. The aircraft was seen to become airborne and shortly afterwards enter a fog bank. Other witnesses subsequently reported hearing the sounds of an impact. The flight had been arranged to transport a critically injured patient to hospital in Brisbane. The pilot evidently experienced some difficulty in starting one of the engines. However, witnesses reported that the engines sounded normal as the aircraft commenced moving from the parking area. At 0310 hours the pilot contacted Brisbane Flight Service Unit and reported that the aircraft was taxying. He advised that he was in a hurry, and indicated that he would provide details of the flight after takeoff. Two minutes later he advised that takeoff was being commenced from Runway 14. No further transmissions were received from the aircraft. The aircraft was seen to become airborne and shortly afterwards enter a fog bank. Other witnesses subsequently reported hearing the sounds of an impact.  The investigation revealed that the aircraft had collided with a tree 800 metres beyond the aerodrome boundary, while tracking about 10 degrees to the right of the extended centreline of the runway. It had then continued on the same heading until striking the ground 177 metres beyond the initial impact point. The wreckage was almost totally consumed by fire.", "probable_cause": "The extensive fire damage hampered the investigation of the accident. The surviving passenger believed that the aircraft was on fire before the collision with the tree. No other evidence of an in-flight fire could be obtained, and it was considered possible that the survivor's recall of the accident sequence had been affected by the impact and the fire. Such discrepancies in recall are not uncommon among accident survivors. The elevator trim control jack was found to be in the full nose-down position, but it was not possible to establish whether the trim was in this position prior to impact. Such a pre-impact position could indicate either a runaway electric trim situation or that, in his hurry to depart, the pilot had not correctly set the trim for takeoff. The aircraft was known to have had an intermittent fault in the engine fire warning system. The fault apparently caused the fire warning light to illuminate, and the fire bell to sound, usually just after the aircraft became airborne. The pilot was aware of this fault. It was considered possible that, if the fault occurred on this occasion as the aircraft entered the fog shortly after liftoff, the pilot's attention may have been focussed temporarily on the task of cancelling the warnings. During this time he would not have been monitoring the primary flight attitude indicator, and would have had no external visual references. It was also possible that, if for some reason the pilot was not monitoring his flight instruments as the aircraft entered the fog, he suffered a form of spatial disorientation known as the somatogravic illusion. This illusion has been identified as a major factor in many similar accidents following night takeoffs. As an aircraft accelerates, the combination of the forces of acceleration and gravity induce a sensation that the aircraft is pitching nose-up. The typical reaction of the pilot is to counter this apparent pitch by gently applying forward elevator control, which can result in the aircraft descending into the ground. In this particular case, the pilot would probably have been more susceptible to disorientating effects, because he was suffering from a bronchial or influenzal infection. Although all of the above were possible explanations for the accident, there was insufficient evidence available to form a firm conclusion. The precise cause of the accident remains undetermined.\r\nIt is considered that some of the following factors may have been relevant to the development of the accident\r\n1. The pilot was making a hurried DEPARTURE. It is possible that he did not correctly set the elevator trim and/or the engines may not have reached normal operating temperatures before the takeoff was commenced.\r\n2. Shortly after liftoff the aircraft entered a fog bank, which would have deprived the pilot of external visual references.\r\n3. The aircraft had a defective engine fire warning system. Had the system activated it may have distracted the pilot at a critical stage of flight.\r\n4. The aircraft might have suffered an electric elevator trim malfunction, or an internal fire, leading to loss of control of the aircraft.\r\n5. The pilot may have experienced the somatogravic illusion and inadvertently flown the aircraft into the ground. The chances of such an illusion occurring would have been increased because the pilot was evidently suffering from an infection. "}