{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-montgomery-2-killed", "date": "Jun 9, 1985 at 0230 LT", "type": "Beechcraft 200 Super King Air", "operator": "Jaradac International Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Baltimore – Teterboro – Montgomery", "msn": "BB-129", "yom": 1976, "flight_number": null, "city": "Montgomery-Orange County", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Pilot filed IFR for two flight legs; Baltimore, MD to Teterboro, NJ and Teterboro to Montgomery, NY (Orange County Airport). The pilot received a preflight weather briefing and was advised that the forecast for Stewart, NY, about 10 miles from Montgomery was sky partially obscured 4,000 feet, 500 feet scattered and 4 miles in fog. While enroute to Teterboro, at 0134 hrs, the pilot radioed Stewart airport and was advised of weather there as sky partially obscured with 4 miles in fog and haze. The aircraft landed at Teterboro at 0152 hours and departed VFR at 0200 hours. At 0211 hours the pilot radioed another aircraft and in part stated that he was at Orange County Airport and was attempting to land, however the weather was going down. At 0211 hours the pilot radioed Stewart and was advised that weather there was the same as reported at 0134 hours. The pilot acknowledged. There was no further transmission from the pilot. At 0215 hours a witness near the accident site heard a crash. He reported weather as 400 feet in fog. The aircraft crashed two miles south of runway 03. The landing gear and flaps were down. Examination of the aircraft did not disclose evidence of malfunction. Both occupants were killed. ", "probable_cause": "Occurrence #1: in flight encounter with weather\r\nPhase of operation: approach\r\nFindings\r\n1. (f) weather condition - fog\r\n2. (c) vfr flight into imc - performed - pilot in command\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: approach\r\nFindings\r\n3. (f) object - tree(s)\r\n4. (c) clearance - not maintained - pilot in command"}