{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-port-ellen-1-killed", "date": "Jun 12, 1986 at 1522 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Loganair", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Glasgow - Port Ellen", "msn": "635", "yom": 1979, "flight_number": "LC423", "city": "Port Ellen", "zone": "Argyll", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 14, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 12421, "captain_hours_type": 867, "copilot_hours": 2110, "copilot_hours_type": 27, "aircraft_hours": 9206, "circumstances": "Loganair Flight LC423 was a scheduled passenger flight from Glasgow Airport (GLA) to Islay/Port Ellen (ILY). The handling pilot, who occupied the first pilot's position, had recently converted to flying the DHC-6 Twin Otter aircraft, and was completing a series of supervised route flights required by the airline before the award of full command status. A company supervisory captain, the designated commander for this flight, occupied the co-pilot's position. The Twin Otter's engines were started at 14:38, and, at 14:44, Glasgow Airport ATC approved taxy clearance to the holding point of runway 28. The aircraft was operating on a stored Instrument Flight Rules (IFR) flight plan. The requested routeing was a Standard Instrument Departure (SID), to join Airway Blue 2 for the Skipness VOR beacon, and thereafter direct to the Islay/Port Ellen NDB. The direct track is the 272° Magnetic (M) radial from Skipness. At 14:46 Glasgow ATC advised LC423 of their flight clearance. The requirement to fly the SID was cancelled and the aircraft was cleared direct to Skipness, cruising level FL55. The aircraft took off from runway 28 at 14:48. The aircraft reported a position overhead the Skipness VOR at 15:08. At this point Scottish Airways Control informed LC423 that they should clear controlled airspace, contact Port Ellen, and that there was no known traffic to affect their descent. After passing overhead the Skipness VOR the aircraft did not depart that position on the 272° radial, but instead turned 15° left, and descended on the 257° radial towards the south of the island of Islay. At 15:10, having already started to descend, LC423 contacted Islay/Port Ellen, reported an arrival time of 15:23, and requested details of the latest weather. The Islay/Port Ellen radio operator replied that the weather details were a surface wind of 220°/05 knots, visibility 2000 metres in drizzle, cloud 3 oktas at 400 feet, 5 oktas at 700 feet, and 8 oktas at 1400 feet. The sea level barometric pressure was 1018 millibars. LC423 acknowledged the information and was asked to advise when overhead the aerodrome at 3600 feet, or when in visual contact. The aircraft then continued to descend, on a track of about 260° M towards the south of the island, until it disappeared from radar cover at a height of 1400 feet and at a position 12 nautical miles (nm) from Islay/Port Ellen aerodrome on the 106° M radial. From the position that the aircraft descended below radar cover it is estimated that a direct track was flown towards the southern coast of the Isle of Islay. The flight continued at very low level parallel to the south coast. At 15:21 the Islay/Port Ellen radio operator transmitted further weather information which recorded that cloud conditions were similar to the previous report but that there was then heavy drizzle. Changes in barometric pressure settings were also reported. LC423 acknowledged this information and reported \"over Port Ellen\". However, the aircraft was not, at that time, over Port Ellen, but was in fact turning inland at very low level over Laphroaig. From overhead Laphroaig the aircraft settled on to a northwesterly heading and very shortly afterwards crashed into rising ground, that was obscured in hill fog, approximately 1 nm from the coast at a height of 360 feet amsl.", "probable_cause": "The commander's decision to allow the handling pilot to carry out a visual approach in totally unsuitable meteorological conditions. An error in visual navigation was a contributory factor."}