{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-75-dl-clarksburg-3-killed", "date": "Jun 22, 1957 at 0750 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Capital-Airlines3", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Washington - Washington", "msn": "19448", "yom": 1944, "flight_number": "H-3", "city": "Clarksburg", "zone": "Maryland", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4342, "captain_hours_type": 961, "copilot_hours": 6248, "copilot_hours_type": 3138, "aircraft_hours": 14168, "circumstances": "Training flight H-3 was scheduled by Capital (Capital Airlines) flight training department for Captain Carl R. Burke, instructor, and two Copilots, Henry A. Podgurski and Robert K. Thomas. This was the second of a series of six flights being made for the purpose of giving Messrs. Podgurski and Thomas flight instruction to prepare them for upgrading from copilot to captain. The flight was dispatched in accordance with visual flight rules to operate in an area northwest, north, and northeast of Washington, D. C. This area was used by Capital as its local practice area for training flights. The aircraft was fully serviced with 820 gallons of fuel. Its gross takeoff weight was less than the max allowable and the center of gravity was within allowable limits. The weather was clear and was not a factor in thin accident. Takeoff was made at 0625. At 0631 the flight advised the company by radio of the trip number, time of takeoff, fuel aboard, and flight duration. There were no other radio contacts with the flight. At approximately 0745, N88835 was observed in the vicinity of Clarksburg, Maryland, by many people who saw it during several tea of flight and in its plunge to the ground.", "probable_cause": "The Board determines that the probable cause of this accident was loss of airspeed while executing maneuvers during a training flight, resulting in a stall followed immediately by a spin from an altitude too low to effect recovery. The following findings were reported:\r\n- No malfunctioning of the aircraft, engines, or control systems was evident from the examination of the wreckage,\r\n- The pilots were executing a \"canyon approach\" maneuver at an altitude approximately 2,500 feet above the terrain (3,000 feet msl),\r\n- During the abandon-approach phase of this maneuver the aircraft was inadvertently stalled from which it entered a spin and crashed,\r\n- Although rotation had stopped before impact occurred there was insufficient altitude to effect a recovery."}