{"url": "https://www.baaa-acro.com/crash/crash-quest-kodiak-100-moab-1-killed", "date": "Dec 12, 2016 at 0537 LT", "type": "Quest Kodiak 100", "operator": "Redtail-Air", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Moab – Salt Lake City", "msn": "100-0140", "yom": 2015, "flight_number": null, "city": "Moab", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4635, "captain_hours_type": 243, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 504, "circumstances": "The commercial pilot was departing on a routine positioning flight in dark night visual meteorological conditions. Footage from a security camera at the airport showed the airplane\r\ntake off normally and initiate a right turn, which was the established direction of traffic for the takeoff runway. The airplane continued the right turn, then entered an increasingly rapid descent and subsequently impacted terrain about 1 mile southwest from the airport. The wreckage distribution was consistent with a high-energy impact. Examination of the airframe and engine revealed no evidence of any preimpact mechanical malfunctions or anomalies that would have precluded normal operation. Autopsy and toxicology testing of the pilot did not reveal any evidence of impairment or incapacitation. Visual conditions prevailed in the area at the time of the accident; however, the setting Moon was obscured by cloud cover, and the airport was located in an area of remote, sparsely-populated high desert terrain. This would have resulted in few visual references to which the pilot could have oriented the airplane. Although the pilot had experience operating in this environment in night conditions and held an instrument rating, the circumstances of the accident are consistent with the known effects of spatial disorientation. The investigation could not determine the initiating event which led to the pilot's mismatch between the airplane's perceived and actual attitude; however, he likely experienced a sensory illusion as a result of spatial disorientation, which led to a loss of control. ", "probable_cause": "The pilot's loss of control shortly after takeoff due to spatial disorientation."}