{"url": "https://www.baaa-acro.com/crash/crash-bac-111-420el-near-san-carlos-de-bariloche-46-killed", "date": "Nov 21, 1977 at 0104 LT", "type": "BAc 111", "operator": "Austral-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Buenos Aires - San Carlos de Bariloche", "msn": "155", "yom": 1968, "flight_number": "AU009", "city": "San Carlos de Bariloche", "zone": "Río Negro", "country": "Argentina", "region": "South America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 74, "pax_fatalities": 41, "other_fatalities": 0, "total_fatalities": 46, "captain_hours": 11918, "captain_hours_type": 3587, "copilot_hours": 12347, "copilot_hours_type": 1691, "aircraft_hours": 21272, "circumstances": "The airplane was completing a charter flight and departed Buenos Aires-Aeroparque-Jorge Newbury Airport at 2253LT bound for San Carlos de Bariloche. While on a night ILS approach to runway 28, the crew encountered technical problems with the ILS reception and the captain decided to initiate a go-around procedure. Few minutes later, the crew started the descent prematurely with a rate of descent of 2,200 feet per minute instead of the required 750 feet per minute. This caused the aircraft to descend below the minimum descent altitude until it collided with ground about 21 km east of the airport. All five crew members and 41 passengers were killed while 33 other occupants were injured. The aircraft was destroyed. ", "probable_cause": "The accident was caused by the collision of the aircraft with the ground during the final approach to Bariloche runway after an improper and premature descent which was below safety limits. The accident can be attributed to a procedural error by the crew during the final approach in that they abandoned the ILS procedure, an action strongly and unduly influenced by the interruption of the VOR signal and also probably by the state of mind of the pilot-in-command."}