{"url": "https://www.baaa-acro.com/crash/crash-raytheon-390-premier-i-south-bend-2-killed", "date": "Mar 17, 2013 at 1623 LT", "type": "Raytheon 390 Premier I", "operator": "Digicut-Systems", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "City", "schedule": "Tulsa - South Bend", "msn": "RB-226", "yom": 2008, "flight_number": null, "city": "South Bend", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 613, "captain_hours_type": 171, "copilot_hours": 1877, "copilot_hours_type": 0, "aircraft_hours": 457, "circumstances": "According to the cockpit voice recorder (CVR), during cruise flight, the unqualified pilot-rated passenger was manipulating the aircraft controls, including the engine controls, under the supervision and direction of the private pilot. After receiving a descent clearance to 3,000 feet mean sea level (msl), the pilot told the pilot-rated passenger to reduce engine power to maintain a target airspeed. The cockpit area microphone subsequently recorded the sound of both engines spooling down. The pilot recognized that the pilot-rated passenger had shutdown both engines after he retarded the engine throttles past the flight idle stops into the fuel cutoff position. Specifically, the pilot stated \"you went back behind the stops and we lost power.\" According to air traffic control (ATC) radar track data, at the time of the dual engine shutdown, the airplane was located about 18 miles southwest of the destination airport and was descending through 6,700 feet msl. The pilot reported to the controller that the airplane had experienced a dual loss of engine power, declared an emergency, and requested radar vectors to the destination airport. As the flight approached the destination airport, the cockpit area microphone recorded a sound similar to an engine starter spooling up; however, engine power was not restored during the attempted restart. A review of the remaining CVR audio did not reveal any evidence of another attempt to restart an engine. The CVR stopped recording while the airplane was still airborne, with both engines still inoperative, while on an extended base leg to the runway. Subsequently, the controller told the pilot to go-around because the main landing gear was not extended. The accident airplane was then observed to climb and enter a right traffic pattern to make another landing approach. Witness accounts indicated that only the nose landing gear was extended during the second landing approach. The witnesses observed the airplane bounce several times on the runway before it ultimately entered a climbing right turn. The airplane was then observed to enter a nose low, rolling descent into a nearby residential community. The postaccident examinations and testing did not reveal any anomalies or failures that would have precluded normal operation of the airplane. Although the CVR did not record a successful engine restart, the pilot was able to initiate a go-around during the initial landing attempt, which implies that he was able to restart at least one engine during the initial approach. The investigation subsequently determined that only the left engine was operating at impact. Following an engine start, procedures require that the respective generator be reset to reestablish electrical power to the Essential Bus. If the Essential Bus had been restored, all aircraft systems would have operated normally. However, the battery toggle switch was observed in the Standby position at the accident site, which would have prevented the Essential Bus from receiving power regardless of whether the generator had been reset. As such, the airplane was likely operating on the Standby Bus, which would preclude the normal extension of the landing gear. However, the investigation determined that the landing gear alternate extension handle was partially extended. The observed position of the handle would have precluded the main landing gear from extending (only the nose landing gear would extend). The investigation determined that it is likely the pilot did not fully extend the handle to obtain a full landing gear deployment. Had he fully extended the landing gear, a successful single-engine landing could have been accomplished. In conclusion, the private pilot's decision to allow the unqualified pilot-rated passenger to manipulate the airplane controls directly resulted in the inadvertent dual engine shutdown during cruise descent. Additionally, the pilot's inadequate response to the emergency, including his failure to adhere to procedures, resulted in his inability to fully restore airplane systems and ultimately resulted in a loss of airplane control.", "probable_cause": "The private pilot's inadequate response to the dual engine shutdown during cruise descent, including his failure to adhere to procedures, which ultimately resulted in his failure to\r\nmaintain airplane control during a single-engine go-around. An additional cause was the pilot's decision to allow the unqualified pilot-rated passenger to manipulate the airplane controls, which directly resulted in the inadvertent dual engine shutdown. "}