{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61p-aerostar-ted-smith-601p-lake-woods-1-killed", "date": "Apr 27, 1997 at 1245 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "William Z. Williams", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Bellingham – Midland", "msn": "61-0379-124", "yom": 1977, "flight_number": null, "city": "Lake of the Woods", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6550, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4000, "circumstances": "About three hours and twenty minutes after departing Bellingham, Washington, for Midland, Texas, the pilot contacted Klamath Falls (Oregon) Tower and told the controller of his intention to land. About 10 minutes later, while about 30 miles north of Klamath Falls, the pilot reported he was low on fuel and was not able to find the city. The tower responded with instructions that would take the pilot south to the airport. But because the pilot seemed not to be following the instructions, but was instead continuing to the west, he was switched to Seattle Center. Center provided the pilot with a southeasterly heading direct to Klamath Falls, but less than a minute later radar and radio contact with the aircraft was lost. Other pilots overheard the pilot transmit that he had lost power in one engine, and later state that he had lost power in both. Soon thereafter the aircraft was seen to descend to about 200 to 300 feet above the surface of Lake of the Woods. The aircraft then began to slow and its nose began to rise. As it was slowing, one of the engines surged back to a high power setting, and the aircraft almost immediately rolled quickly to the side and dove nearly straight down into the lake. During the post-accident inspection of the airframe, the throttle for the right engine was found retarded to idle, but the throttle for the left engine was found in the full-forward (maximum power) position. A review of the Aerostar owner's manual revealed that the Engine Failure/Restart checklist called for the throttle for a failed engine (both engines in this case) to be retarded to the 'Cracked 1/2 inch open' position. Toxicological results indicate the presence in the pilot's blood of chlordiazepoxide and three of its active metabolites, norchlordiazepoxide, nordiazepam, and oxazepam. Chlordiazepoxide (Librium) is a tranquilizer often used to treat anxiety and tension. At sufficient levels it can have significant adverse effects on judgement, alertness, and performance. It is known to cause drowsiness, mental dullness, and euphoria. The results also indicate the presence of diphenhydramine in the pilot's blood. Diphenhydramine is a sedating antihistamine, and in sufficient quantities is known to produce drowsiness, impaired coordination, blurred vision, and reduced mental alertness.", "probable_cause": "The pilot's failure to set the throttle of his second failed engine to 'Cracked-1/2-Open' as called for in the Engine Failure/Restart checklist, followed by a high-power engine surge. Factors include the pilot's delay in landing for refueling, the pilot becoming lost/disoriented, drug impairment, and fuel exhaustion. "}