{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-guernsey-2-killed", "date": "Jan 21, 2019 at 2016 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Southern%20Aircraft%20Consultancy_0", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Nantes - Cardiff", "msn": "46-8408037", "yom": 1984, "flight_number": null, "city": "Guernsey", "zone": "Channel Islands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3500, "captain_hours_type": 30, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6636, "circumstances": "The pilot of N264DB flew the aircraft and the passenger from Cardiff Airport to Nantes Airport on 19 January 2019 with a return flight scheduled for 21 January 2019. The pilot arrived at the airport in Nantes at 1246 hrs on 21 January to refuel and prepare the aircraft for the flight. At 1836 hrs the passenger arrived at airport security, and the aircraft taxied out for departure at 1906 hrs with the passenger sitting in one of the rear, forward-facing passenger seats. Figure 1 shows the aircraft on the ground before departure. The pilot’s planned route would take the aircraft on an almost direct track from Nantes to Cardiff, flying overhead Guernsey en route (Figure 2). The Visual Flight Rules (VFR) flight plan indicated a planned cruise altitude of 6,000 ft amsl and distance of 265 nm. The aircraft took off from Runway 03 at Nantes Airport at 1915 hrs, and the pilot asked Air Traffic Control (ATC) for clearance to climb to 5,500 ft. The climb was approved by Nantes Approach Control and the flight plan was activated. The aircraft flew on its planned route towards Cardiff until it was approximately 13 nm south of Guernsey when the pilot requested and was given a descent clearance to remain in Visual Meteorological Conditions (VMC). Figure 3 shows the aircraft’s subsequent track. The last radio contact with the aircraft was with Jersey ATC at 2012 hrs, when the pilot asked for a further descent. The aircraft’s last recorded secondary radar point was at 2016:34 hrs, although two further primary returns were recorded after this. The pilot made no distress call that was recorded by ATC. On February 4, 2019, the wreckage (relatively intact) was found at a depth of 63 meters few km north of the island of Guernsey. On February 6, a dead body was found in the cabin and recovered. It was later confirmed this was the Argentine footballer Emiliano Sala. The pilot's body was not recovered.", "probable_cause": "Causal factors\r\n1. The pilot lost control of the aircraft during a manually-flown turn, which was probably initiated to remain in or regain VMC.\r\n2. The aircraft subsequently suffered an in-flight break-up while manoeuvring at an airspeed significantly in excess of its design manoeuvring speed.\r\n3. The pilot was probably affected by CO poisoning.\r\nContributory factors\r\n1. A loss of control was made more likely because the flight was not conducted in accordance with safety standards applicable to commercial operations. This manifested itself in the flight being operated under VFR at night in poor weather conditions despite the pilot having no training in night flying and a lack of recent practice in instrument flying. \r\n2. In-service inspections of exhaust systems do not eliminate the risk of CO poisoning.\r\n3. There was no CO detector with an active warning in the aircraft which might have alerted the pilot to the presence of CO in time for him to take mitigating action."}