{"url": "https://www.baaa-acro.com/crash/crash-rockwell-690b-turbo-commander-mcclellanville-2-killed", "date": "Jun 20, 2013 at 1648 LT", "type": "Rockwell Grand Commander 690", "operator": "Nighthawk Air", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Charleston - Charleston", "msn": "11399", "yom": 1977, "flight_number": null, "city": "McClellanville", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1540, "captain_hours_type": null, "copilot_hours": 22300, "copilot_hours_type": null, "aircraft_hours": 12193, "circumstances": "The purpose of the flight was for the pilot to accomplish a flight review with a flight instructor. According to air traffic control records, after takeoff, the pilot handling radio communications requested maneuvering airspace for airwork in an altitude block of 13,000 to 15,000 feet mean sea level (msl). About 8 minutes later, the air traffic controller asked the pilot to state his heading, but he did not respond. A review of recorded radar data revealed that, about 14,000 msl and 3 miles southeast of the accident site, the airplane made two constant-altitude 360-degree turns and then proceeded on a north-northeasterly heading for about 2.5 miles. The airplane then abruptly turned right and lost altitude, which is consistent with a loss of airplane control. The airplane continued to rapidly descend until it impacted trees and terrain on a southerly heading. No discernible distress calls were noted. The wreckage was found generally fragmented, and all of the airplane’s structural components and flight control surfaces were accounted for within the wreckage debris path. Subsequent examination of the engines revealed evidence of rotation and operation at impact and no mechanical malfunctions or failures that would have precluded normal operation. ", "probable_cause": "The pilot’s loss of airplane control during high-altitude maneuvering and his subsequent failure to recover airplane control. Contributing to the accident was the flight instructor’s\r\ninadequate supervision of the pilot and his failure to perform remedial action."}