{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90a-king-air-near-pagosa-springs-3-killed", "date": "Oct 4, 2007 at 2317 LT", "type": "Beechcraft 90 King Air", "operator": "Eagle%20Air%20Med", "flight_phase": "Flight", "flight_type": "Ambulance", "survivors": "No", "site": "Mountains", "schedule": "Chinle - Alamosa", "msn": "LJ-1594", "yom": 2000, "flight_number": null, "city": "Pagosa Springs-Stevens Field", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 12650, "captain_hours_type": 84, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3925, "circumstances": "The pilot contacted air traffic control, using the wrong call sign, requesting radar flight following. The airplane initially climbed to 13,500 feet, descended to 11,500 feet, climbed to 13,500 feet, and then began a descent until it impacted terrain at 11,900 feet. One minute prior to impact, the pilot asked the air traffic controller about various minimum altitudes for his route of flight. The controller responded with a minimum instrument altitude of 15,000 to 15,300 feet. A review of the handling of the accident flight showed that the controller was aware of the airplane's position, altitude, general route of flight, and its proximity to terrain. No safety alert was issued to the accident flight. Weather depiction charts, infrared satellite imagery, and local weather observations indicate instrument meteorological conditions prevailed along the route of flight, closest to the accident location. The moon had set at 1539 on the day of the accident. The pilot reported a planned flight altitude of 12,500 feet to his dispatcher. No record of a preflight weather briefing was located. An examination of the airplane, engines, and related systems revealed no anomalies.", "probable_cause": "The pilot's failure to maintain clearance from mountainous terrain. Contributing to the accident was the pilot's inadequate preflight planning, improper in-flight planning and decision making, the dark night, and the controller's failure to issue a safety alert to the pilot."}