{"url": "https://www.baaa-acro.com/crash/crash-antonov-12a-norilsk-10-killed", "date": "Jun 22, 1992 at 1245 LT", "type": "Antonov AN-12", "operator": "Kras%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Andijan – Omsk – Norilsk", "msn": "3 3 409 06", "yom": 1963, "flight_number": null, "city": "Norilsk-Alykel", "zone": "Krasnoyarsk Krai", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 6, "pax_on_board": 5, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15654, "circumstances": "The aircraft was completing a cargo flight from Andijan to Norilsk with an intermediate stop in Omsk, carrying five passengers, seven crew members and a load of 12 tons of fruits. En route from Omsk to Norilsk, the crew was forced to divert to Igarka Airport due to poor weather conditions at destination. Finally, the aircraft departed Igarka on the last leg of the day. Upon arrival at Norilsk, weather conditions were as follow: overcast with clouds down to 100 metres, visibility 2,410 metres, mist, heavy rain falls, OAT 0° and humidity 98%. On short final, after he established a visual contact with the ground, the captain realized that his position was wrong as the airplane was approaching the runway 220 metres from its threshold but 330 metres to the left of its extended centerline. The captain decided to initiate a go-around procedure when the aircraft pitched up to an angle of 16°. With such excessive angle of attack, the aircraft rolled to the left then struck the ground to the left of the runway. It rolled for about 60 metres then took off again. With a nose-up attitude of 14°, the aircraft climbed with a rate of 7 metres per second until the height of 55 metres then stalled again. It rolled to the right by angle of 45° and struck the ground at a speed of 200 km/h before crashing 1,332 metres past the runway end. The copilot and a passenger were seriously injured while 10 other occupants were killed. ", "probable_cause": "The accident was the consequence of a wrong approach configuration on part of the crew who allowed the aircraft to deviate from the approach glide above the permissible limit. The following contributing factors were reported:\r\n- Unsatisfactory crew interactions during the approach procedure, \r\n- Once the decision altitude was reached, the captain unreasonably left the controls to the copilot,\r\n- The crew decided to continue the descent beyond the minimum decision height without visual contact with the runway/approach lights,\r\n- The decision to initiate a go-around procedure was taken too late,\r\n- The performance level of the crew may have been reduced due to a long shift,\r\n- Poor weather conditions at destination airport. "}