{"url": "https://www.baaa-acro.com/crash/crash-hawker-siddeley-hs125-1-nice-2-killed", "date": "Jun 5, 1966 at 1712 LT", "type": "BAe 125", "operator": "Air Affaires", "flight_phase": "Landing (descent or approach)", "flight_type": "Demonstration", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Cannes - Nice", "msn": "25007", "yom": 1964, "flight_number": null, "city": "Nice", "zone": "Alpes-Maritimes", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 4601, "captain_hours_type": 324, "copilot_hours": 2080, "copilot_hours_type": 50, "aircraft_hours": 798, "circumstances": "The airplane departed Cannes at 1645LT bound for Nice and the crew was supposed to perform three low pass over the Airport of Nice-Côte d'Azur during a local Airshow. The first path was performed at low height over the runway. The crew then completed a turn to the right in an attempt to make a second low pass but on the opposite direction. Doing so, the airplane climbed to an altitude of 2,000 feet when control was lost. It went into a dive, caught fire in the air and crashed in flames into the sea some 1,5 km southwest of the airfield. The aircraft was destroyed and both pilots were killed. ", "probable_cause": "The stresses applied to the airframe of F-BKMF during the manoeuvre carried out in order to return to the Nice runway, exceeded the design limit loads of the wing unit. A rupture was then caused to the wing unit which resulted in the leakage of a large quantity of fuel from the upper surface near the wing root. The aircraft stalled under the high load factor and the pilot was unable to regain control because of the small height margin and the damage to the aircraft structure. In spite of the considerable stick forces which have to be applied in a normally trimmed aircraft in order to carry out such a manoeuvre, the latter may have been attempted by the pilot, who was experienced, skillful and cautious, in view of the following circumstances: \"tight\" manoeuvre at low altitude in poor visibility; air display atmosphere (type of flying pre-supposing special training different from the training normally required for a chief pilot of the Air Affaires company); possible anxiety to avoid crossing the flight paths of several aircraft in the vicinity during the display."}