{"url": "https://www.baaa-acro.com/crash/crash-lockheed-10b-electra-saint-louis-8-killed", "date": "Aug 5, 1936 at 2200 LT", "type": "Lockheed 10 Electra", "operator": "Chicago-Southern-Airlines2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "New Orleans – Saint Louis – Chicago", "msn": "1057", "yom": 1936, "flight_number": "SCA004", "city": "Saint Louis-Lambert", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine airplane departed Saint Louis-Lambert Airport at night and in poor weather conditions. While in initial climb, the crew made a turn to the left at an insufficient altitude, causing the left wing tip to struck the ground. Out of control, the aircraft crashed in an open field located 5 km north of Lambert Airport, bursting into flames. All eight occupants were killed. ", "probable_cause": "Several theories are suggested as to the cause of this accident. However, there is insufficient evidence to substantiate any of them. It is felt that the airplane was thoroughly controllable and that the turn back in the direction of the airport was a voluntary maneuver. Apparently, the pilot, after lifting the airplane into the air, became concerned either with some unexpected irregularity such as the functioning of some part of the airplane and made a turn toward the airport without realizing his nearness to the ground. However, it is not believed that any condition arose or a severity which would have prevented the pilot from acquiring more altitude before attempting to make a turn. It is the opinion of the Bureau of Air commerce that the probable cause of this accident was making a turn at an extremely low altitude, for reasons unknown, in which the wing of the airplane unintentionally contacted the ground."}