{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154m-moscow-2-killed", "date": "Dec 4, 2010 at 1436 LT", "type": "Tupolev TU-154", "operator": "Daghestan%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Makhatchkala", "msn": "92A-927", "yom": 1992, "flight_number": "DAG372", "city": "Moscow-Domodedovo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 0, "pax_on_board": 160, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 17384, "captain_hours_type": 10000, "copilot_hours": 3111, "copilot_hours_type": 1150, "aircraft_hours": 9285, "circumstances": "Daghestan Airlines (Avialinii Dagestana) flight DAG372 departed Moscow-Vnukovo Airport at 1408LT bound for Makhatchkala, Daghestan. Fourteen minutes after takeoff, while cruising at an altitude of 9,000 metres some 80 kilometers south of Moscow, the crew informed ATC about the failure of the engines n°1 and 3 and was cleared to return to Moscow-Domodedovo Airport. On final, the aircraft descended below the clouds at a height of 500 feet but was not properly aligned with the runway centerline. It landed hard to the right of runway 32R, went out of control, impacted an earth mound and bushed before coming to rest, broken in two. Two passengers were killed while 78 other occupants were injured.", "probable_cause": "Erroneous actions on part of the crew who, while landing in instrument meteorological conditions with one engine running, permitted the aircraft to touch down significantly to the right of the runway.\r\nThese actions were the result of following factors:\r\n- The flight engineer inadvertently turned off the fuel booster pumps of the service tank while working the procedures for manual fuel transfer during the climb, which led to fuel starvation, all engines spooling down with the outer engines (#1 and #3) shutting down as well as loss of electrical power for 2:23 minutes due to loss of all three generators\r\n- Failure by the crew to take use of all available possibilities to restore on-board systems after generator #2 was recovered and the APU spooled up and was successfully connected\r\n- Failure to comply with recommendations \"flying with two engines inoperative\" and \"approach and landing with two engines inoperative\"\r\n- Lack of leadership and lack of management and distribution of responsibilities by the captain leading to independent but not always accurate actions by the other crew members as result of insufficient training in crew resource management\r\n- A complex wind environment varying with heights which contributed to the deviation from the proper approach trajectory while the crew was flying on stand by instruments rather than regular instruments\r\n- Insufficient training of the crew as a whole as well as each individual to act in emergency and complex scenarios\r\n- The non-implementation of safety recommendations developed in earlier investigations to prevent the flight engineer inadvertently turn off the fuel booster pumps."}