{"url": "https://www.baaa-acro.com/crash/crash-canadian-vickers-pbv-1a-canso-aylmer-5-killed", "date": "Jul 23, 1945 at 1500 LT", "type": "Canadian Vickers PBV-1 Canso (OA-10 Canso)", "operator": "Royal-Canadian-Air-Force-31", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Ottawa - Ottawa", "msn": "CV-301", "yom": 1944, "flight_number": null, "city": "Aylmer", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 7, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "It was just after 3 o’clock on a hot, calm July 23 in the year 1945 and the waters of the Ottawa River were as smooth as glass. Having just returned from active duty in Iceland patrolling for German U-boats during the last months of WW2, the giant PBY Canso flying boat, serial number 11023, was now part of the Rockcliffe based No.162 Squadron which specialized in photo reconnaissance. Originally built in Montreal in 1943 at the Vickers Canada factory, the 100 foot wingspan radial twin-engined flying boat was conducting practice take-off and landings in Lake Deschenes, a body of water that stretches north upriver from Britannia Bay. The still, calm waters may have seemed pleasant for the many boaters and swimmers in the area, but proved deadly for the float plane since the surface can be like smooth cement at high speed. This is thought to have contributed to what happened next. The plane took off without incident near the shores of Aylmer and circled over Shirley’s Bay, dropping low to land heading towards Britannia Beach. Suddenly the still, glassy water caught the plane in a disastrous manner, tearing off part of the wing, flipping the aircraft over and tearing a gaping hole into the hull. Listing to one side with 5 of the 7 man crew still inside and 2 men thrown clear of the aircraft, the plane quickly filled with water. Shocked cottagers watching the incident from their lawn chairs quickly jumped into their boats and sped towards the crash to assist in retrieving survivors from the wreckage. Within a minute the hull had slipped sideways into the depths of the river, tipping the 100 foot wing on end, like a massive sail sticking straight up out of the water. Two men trapped inside desperately tried to free themselves from the sinking wreck, but within minutes the aircraft submerged, taking all those still aboard with it. Two of the crew were pulled from the water into waiting boats as an RCAF crew member in a nearby boat courageously jumped into the water trying to reach the submerging plane in a desperate attempt to free those trapped underwater. AC Nightingale would later be awarded a medal for his bravery trying to save the doomed crew members. The plane quickly dropped into the murky depths and sadly no one else could be saved. The wreckage of the Canso settled and sank into the muddy bottom of the river where it would remain for several days. Pieces of the plane, equipment, fuel, oil, log books and other remnants floated to the surface as well as a few of the dead crew members. Divers tried to recover the remains of the crew members still inside but were hampered by the muddy silt now enveloping the plane. A tug boat was hired to attach cables and chains to pull what was left of the Canso to shore in Aylmer where it was hauled out of the water. The salvaged remains of the once mighty flying boat were then transported to Trenton, ON No.6 Repair Depot where records show it was catalogued as “scrap” and never heard from again. Does Canso 11023 still exist in a scrapyard somewhere? Is this tragic piece of history sitting in a junkyard, its story slowly becoming lost in time? It is unclear if the remaining underwater wreckage of the ill-fated Canso were ever recovered from the depths of Britannia Bay. If the plane broke apart upon impact it is likely that pieces still remain on the bottom today, covered in almost 70 years of silt and mud.\r\nSource: \r\nhttp://ottawow.wordpress.com/2014/04/26/crash-of-the-canso/\r\nSpecial thanks to Anne Gafiuk, Calgary, Alberta, Canada.", "probable_cause": null}