{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-kathleen-3-killed", "date": "Aug 16, 1991 at 0051 LT", "type": "Cessna 402", "operator": "Philip J. Hmiel", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Live Oak – Hickory", "msn": "402B-0360", "yom": 1973, "flight_number": null, "city": "Kathleen", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 521, "captain_hours_type": 4, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4348, "circumstances": "The single engine rated pilot and 2 passengers were returning from Florida after picking up a newly acquired Cessna 402. The pilot called Macon FSS for fuel availability, and began a night, VFR descent. At about 5,300 feet msl, the airplane began rapid altitude excursions, while in a tight, right hand turn. During this time, it descended 2,600 feet in 37 seconds, then climbed 1,200 feet in 12 seconds. Subsequently, the airplane impacted gradually rising terrain at high speed. The engines were buried, and all prop blades showed evidence of power at impact. Weather in the area was reported to be: sky partially obscured with fog. An investigation revealed that the pilot was not multi-engine rated. A pilot for the seller flew with the accident pilot a few hours prior to the crash; he reported that the accident pilot had difficulty flying the airplane. He recommended that the accident pilot get additional training prior to leaving florida, but the accident pilot refused. All three occupants were killed. ", "probable_cause": "The pilot's failure to maintain aircraft control while descending at night. Factors related to the accident were: darkness, fog, the pilot's lack of qualification in multi-engine aircraft, his lack of experience in this type of aircraft, his overconfidence in his personal ability, and spatial disorientation of the pilot."}