{"url": "https://www.baaa-acro.com/crash/crash-bae-4121-jetstream-41-durban-1-killed", "date": "Sep 24, 2009 at 0757 LT", "type": "Bae Jetstream 41", "operator": "South%20African%20Airlink", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Durban - Pietermaritzburg", "msn": "41069", "yom": 1995, "flight_number": "LNK911", "city": "Durban", "zone": "KwaZulu-Natal", "country": "South Africa", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2956, "captain_hours_type": 751, "copilot_hours": 2002, "copilot_hours_type": 1027, "aircraft_hours": 27429, "circumstances": "During the take-off roll, the cockpit crew of another airliner observed smoke pouring from the right engine of ZS-NRM. They were shocked, yet reluctant to tell the crew of ZS-NRM to abort the take-off as they felt that they might be blamed had the abort gone wrong. Instead, the witnessing pilots enquired from the tower whether the aircraft was aware of the smoke. By the time the ATC responded, the aircraft was already in the air, but with its landing gear not yet retracted. Another aircraft lining up at the holding point informed ZS-NRM that their undercarriage was still extended, and the captain of ZS-NRM then transmitted (instead of using the intercom) an instruction to his co-pilot to raise the gear. During this transmission, the sound of what was possibly a warning sound could be heard in the background. The aircraft became airborne and climbed to approximately 500 ft above mean sea level before losing altitude and making a forced landing on a small field in the Merebank residential area, about 1,4 km from the end of the runway. During the forced landing, a member of the public was struck by the wing of the aircraft and the three crew members were seriously injured in the accident. The captain subsequently died from his injuries. \n", "probable_cause": "Engine failure after takeoff followed by inappropriate crew response, resulting in the loss of both lateral and directional control, the misidentification of the failed engine, and subsequent shutdown of the remaining serviceable engine.\r\nContributing factors:  \r\n- Separation of the second-stage turbine seal plate rim; \r\n- Failure of the captain and first officer to implement any crew resource management procedures as prescribed in the operator’s training manual; \r\n- The crew’s failure to follow the correct after take-off engine failure procedures as prescribed in the aircraft’s flight manual. \n"}