{"url": "https://www.baaa-acro.com/crash/crash-tupolev-ant-7-malmyzh-6-killed", "date": "Aug 4, 1936", "type": "Tupolev ANT-7 (PS-7)", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Aleksandrovsk-Sakhalinsky – Nizhnetambovskoye – Khabarovsk", "msn": null, "yom": null, "flight_number": null, "city": "Malmyzh", "zone": "Khabarovsk Krai", "country": "Russia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The float plane departed Nizhnetambovskoye at 1555LT on the final leg to Khabarovsk on a flight from Aleksandrovsk-Sakhalinsky. The crew did not obtain any weather bulletin for en route and destination prior to takeoff. Also, several instruments such as the variometer, the path finder and the artificial horizon were unserviceable. After passing over Komsomolsk, weather conditions deteriorated with low clouds and the captain decided to reduce his altitude and to continue at a height of 150 metres. Later, stormy weather forced the pilot to lower again his altitude and eventually, he attempted to land on the Amur River. On final, he saw an island and initiated a sharp turn to the left when the left float impacted the water surface. The aircraft cartwheeled and crashed in the river off Malmyzh. A passenger and all three crew members were rescued while six other occupants were killed. ", "probable_cause": "The accident was the consequence of the combination of the following factors: \r\n- The crew took the decision to take off without weather report being able to inform them about the conditions en route and at destination; \r\n- The crew took the decision to start the flight whereas instruments were out of order; \r\n- The crew decided to continue the flight after encountering poor weather conditions rather than returning to Nizhnetambovskoye; \r\n- A pilot error during the last turn."}