{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47-dl-near-tulua-15-killed", "date": "Mar 9, 1957 at 1000 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Avianca-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Condoto – Buenaventura – Cali", "msn": "4338", "yom": 1942, "flight_number": null, "city": "Tuluá", "zone": "Valle del Cauca", "country": "Colombia", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "HK-155 departed Cali for Condoto at 0827LT. It reported taking-off from Condoto on the return flight at 0950LT and advised that it would fly via Buenaventura. Shortly after take-off, HK-155 changed from Condoto Tower frequency to the Cali aeronautical telecommunications frequency and reported at 0958 that it had departed Condoto at 0950 with a load of 975 kg including 12 passengers and that it was proceeding to Cali via Buenaventura. No record could be found of a later call from the aircraft on any of the frequencies available. The flight from Condoto to Cali would normally take about 50 to 55 minutes. At 1037, Cali called HK-155 but received no reply. The Cali route frequencies log indicates at 1107 that Bogota: ATC had declared an alert with regard to HK-155. The wreckage was found on the slope of a wooded mountain located 32 km west of Tuluá. All 15 occupants were killed. ", "probable_cause": "It was determined that the probable cause of the accident was an instrument flight at inadequate altitude. The following factors were considered as contributing:\r\n- The Buenaventura route was not followed,\r\n- Instrument flight which precluded visual means of checking the aircraft's position,\r\n- The pilot did not consider it necessary to check his position by means of El Paso radio beacon,\r\n- Over-confidence on the part of the pilot regarding his knowledge of the route,\r\n- Flight outside the established route or airway\r\n- Unfavorable weather conditions.\r\nAs the aircraft crashed on the direct route Condoto - Cali and the said route had not been authorized by the Civil Aeronautics Department, it can be logically assumed that the pilot is solely responsible for this accident since he flew, on instruments, a route which had not been authorized, even for visual flights. "}