{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-sverdlovsk-6-killed", "date": "Nov 12, 1954 at 1640 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Leningrad – Moscow-Bykovo – Kazan – Sverdlovsk – Omsk – Novosibirsk", "msn": "184 290 02", "yom": 1948, "flight_number": null, "city": "Sverdlovsk-Koltsovo", "zone": "Sverdlovsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 2, "pax_on_board": 10, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7096, "circumstances": "One minute after takeoff from Sverdlovsk-Koltsovo Airport, while in initial climb, the airplane banked left and right and encountered difficulties to gain height when it stalled and crashed 250 meters past the runway end. The wreckage was spotted 150 meters to the left of the runway centerline. Both pilots and three passengers were killed while ten other occupants were injured. Two weeks after the accident, a passenger died from his injuries. ", "probable_cause": "It was determined that the flaps were deployed at 25° for takeoff, too much for this procedure. Thus, the aircraft's speed after rotation was too low, deteriorating its stability and its lateral control. Investigations were able to determine that the flying crew failed to identify and eliminate the abnormal behavior of the aircraft during initial climb, probably because his attention was diverted. This situation led the aircraft to stall and the distance between the aircraft and the ground was insufficient to expect a recovery. At the time of the accident, the crew was on duty since 13 hours and 40 minutes and the day before, it observed a ON duty period of 17 hours. Thus, it is believed that fatigue accumulated during these two consecutive days, which could be considered as a contributing factor. "}