{"url": "https://www.baaa-acro.com/crash/crash-casa-212-aviocar-100-near-tanjung-pinang-5-killed", "date": "Feb 12, 2011 at 1342 LT", "type": "Casa 212 Aviocar", "operator": "SMAC", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Batam - Tanjung Pinang", "msn": "120/18N", "yom": 1980, "flight_number": null, "city": "Tanjung Pinang", "zone": "Riau Islands", "country": "Indonesia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 13027, "captain_hours_type": 3311, "copilot_hours": 2577, "copilot_hours_type": 152, "aircraft_hours": 29990, "circumstances": "On 12 February 2011, a CASA C212-100 aircraft, registered PK-ZAI, operated by Sabang Merauke Raya Air Charter (SMAC), departed from Hang Nadim Airport, Batam (BTH/WIDD) at 1318 LT (0618 UTC)1 for a test flight following an engine replacement to the engine number one. The test flight was conducted over Tanjung Pinang Island area. There were five persons on board consisted of two pilots, and three company engineers. At 0628 UTC the aircraft appeared on Tanjung Pinang Approach radar display and was flying toward Tanjung Pinang area. Tanjung Pinang Approach controller informed that the aircraft was identified flying over Tanjung Pinang at 2000 feet. At 0633 UTC the aircraft received clearance to climb to 4000 feet. At 0644 UTC the aircraft disappeared from Tanjung Pinang radar display. The last position of the aircraft identified on the radar display was on 16 miles radial 010º from Tanjung Pinang airport. Tanjung Pinang Approach controller could not communicate with the PK-ZAI. At 0705 UTC, the controller requested relay by another aircraft to search PK-ZAI. The other aircrafts could not communicate with PK-ZAI. At 0706 UTC Tanjung Pinang Approach controller received information from Indonesian Air Force Base at Gunung Bintan that an aircraft had crashed at Gunung Kijang forest, Bintan Island. After receiving the information, Tanjung Pinang Airport staff coordinated with SAR Bureau, local police, and Indonesian Army for search and rescue operation. The aircraft was found at Gunung Kijang forest, Bintan Island at coordinate 1° 10’ 45” N; 104° 34’ 22” E, about 30 km north of Tanjung Pinang Airport. All occupants were fatally injured in this accident. The aircraft was substantially damaged.", "probable_cause": "Factors contributed to the accident are as follows: \r\n• The flight test was not properly well prepared; there was no flight test plan. \r\n• The current and applicable CMM is dissimilar the According to the CASA 212-100 and Garrett TPE331-5 Maintenance Manuals related to flight test requirement after the change of only one engine. \r\n• The left engine was shut down using normal/ ground shut down procedure. It used the fuel shut off switches off followed by pulling the Power Lever rearward to reverse, as indicated by the propeller pitch. \r\n• The right engine most likely shut down by wind milling prior the impact, it was indicated the propellers piston distance position to the cylinder was about normal flight range position and no indication of rotating impact on the blades. \r\n• The Casa Service Bulletin No. 212-76-07 Revision 1 issued dated 23 December 1991 (Anti Reverse) that applicable for Casa 212 -100/200, was not incorporated to this aircraft. \r\n• The PIC with pareses or paralysis vestibular organ or system could not response normally to the three dimensional motion or movement. This condition may the subject more sensitive to suffer Spatial Disorientation (SDO). The SDO is the pilot could not perceived rightly his position motion and attitude to the earth horizontal or to his aircraft or other aircraft and could as the dangerous precondition for unsafe action. \r\n• The Director (DGCA) decree No 30/II/200 issued on 20 February 2009 stated that for issuing medical certificate for pilot after 60th birthday require several additional medical examination items. Point 1.b of this decree states the Video Nystagmography examination.(differed the ICAO Doc 8984)."}