{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950-near-masterton-1-killed", "date": "Apr 19, 2002 at 1013 LT", "type": "Fletcher FU-24", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": null, "msn": "237", "yom": 1977, "flight_number": null, "city": "Masterton", "zone": "Greater Wellington Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10165, "captain_hours_type": 152, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": " On the morning of Friday 19 April 2002, the pilot was engaged in spreading superphosphate on a hill-country property to the south-east of Masterton. Operations had commenced at 0735 hours, after the pilot and loader driver had flown to the airstrip from Masterton. The topdressing proceeded normally for two hours, the pilot taking a refuel and “smoko” break from 0935 to 1000 hours. The left tank only was topped off, as the fuel system design permitted the fuel levels to equalise between the left and right tanks. As was his usual practice, the pilot carried out a full pre-flight inspection during the break. The loader driver noted the time of the first takeoff after the break as 1001 hours. This sortie was completed normally; but the aircraft became overdue on the second. Looking over towards the area being worked, the loader driver saw a column of black smoke; he immediately telephoned the company chief pilot, who was operating another aircraft on a property a short distance to the south-west. The chief pilot had already seen the smoke, and flew across to investigate. He saw the aircraft burning fiercely on the shoulder of a ridge and telephoned emergency services to report the accident. He briefly contemplated landing by the accident site, but decided against it and continued to the airstrip to pick up the loader driver. They flew back to the site, but could see no sign of the pilot, so returned to Masterton. They had seen that there was a person and a motorcycle on the ground by the wreckage: this was the farmer whose property was being topdressed, and who had been working on the eastern side of the valley being sown. While the aeroplane was on its last run, the farmer saw an object fall from it and “flutter” to the ground. He was unable to tell what the object was, but thought at first that it may have been a superphosphate bag by the way it fell. Two fencing contractors were working near the farmer’s position; they also saw an object fall from the aeroplane, and shortly afterwards one remarked to the other that the aeroplane “had no tail”. They watched the aeroplane climb and “veer to the left” before striking the ground near the top of the ridge at the southern end of the valley. It caught fire on impact. The farmer, although he did not see the impact because of intervening terrain, realised something was amiss and quickly moved to a position where he could see the accident site. He then drove his four-wheel motorcycle to the site; he estimated that this took about three minutes. On arrival, he found the centre section of the aircraft well ablaze; he could see no sign of the pilot at this stage, despite being able to get as close as the left wingtip. He reported that there were a number of explosions while the fire was burning, and that once the fire had subsided, he saw the pilot’s body in the wreckage. The impact (but not the falling object) was also witnessed by another farmer on the ridge to the western side of the valley. He estimated that some 10 seconds elapsed between impact and the first sign of fire, and had expected to see the pilot jump clear. The falling object was later found to be the tail fin (vertical stabiliser); it had landed in a clearing in a small patch of bush near where the fencers had been working, 870 m from the point where the aircraft struck the ground. The accident occurred in daylight, at 1013 hours NZST, 12 km south-south-east of Masterton, at an elevation of 1240 feet. Grid reference 260-T26-370116, latitude S 41° 04.36', longitude E 175° 42.05'. ", "probable_cause": "Conclusions:\r\n- The pilot was appropriately licensed, experienced and fit to carry out the series of flights.\r\n- The aeroplane had been operating normally up to the time of the accident.\r\n- An undetected fatigue crack, or series of cracks, had been propagating in the forward area of the tail fin for some time.\r\n- The cracks developed to a point where the remaining structure was unable to accommodate normal flight loads, and the fin separated from the aircraft.\r\n- The departure of the fin probably resulted in some uncommanded yawing and pitching effects, with accompanying control feedback and unusual sounds.\r\n- The rudder became lodged in the tailplane upper surface as the fin departed, with the potential to restrict elevator control.\r\n- The extent and duration of any elevator control restriction could not be determined.\r\n- The resultant impact with terrain may have been an attempt by the pilot to carry out an immediate forced landing, or may have been a result of limited control available to the pilot.\r\n- The impact and subsequent fire were not survivable.\r\n- The fatigue cracking in the fin originated from cuts in the skin, made when the leading-edge abrasion strip was being trimmed in situ.\r\n- It was not determined when and by whom the cuts were made, however, measures have been taken to prevent a recurrence. "}