{"url": "https://www.baaa-acro.com/crash/crash-boeing-ec-135n-walkersville-21-killed", "date": "May 6, 1981 at 1050 LT", "type": "Boeing KC-135 Stratotanker", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Wright-Patterson - Wright Patterson", "msn": "18235/C13", "yom": 1961, "flight_number": "AGAR23", "city": "Walkersville", "zone": "Maryland", "country": "United States of America", "region": "North America", "crew_on_board": 17, "crew_fatalities": 17, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13471, "circumstances": "On 6 May 1981, EC-135N, Serial Number 61-0328, call sign AGAR 23, departed Wright Patterson AFB, Ohio, at 1005 Eastern Daylight Savings Time (EDT) on a routine training mission. On board the aircraft were 17 crewmembers and four authorized passengers.  The flight proceeded uneventfully as planned for approximately 45 minutes. Then in a few brief moments, a sequence of very rapid events resulted in a crash with the loss of all onboard. At 1049:48 EDT, The Federal Aviation Administration (FAA) lost radar contact with AGAR 23. The aircraft was cruising at Flight Level 290, at .78 Mach while performing a navigational training leg.  The aircraft commander, Capt Emilio, occupied the right pilot seat and a passenger, Mrs. Emilio, occupied the left pilot seat. Also in the crew compartment were the 2 navigators, Lt Col Frederick and Capt Fonke, and 2 passengers, Mrs. Fonke and SSgt Brundige. For undetermined reasons, the aircraft pitch trim moved to the full nose-down position. The aircraft then a rapidly pitched over, most likely upon release of the autopilot, and induced sufficient negative \"G\" forces to cause the generators to trip off line, resulting in the loss of all AC electrical power. The pitch trim could not then be moved electrically. This condition, while unusual, can be controlled if prompt corrective action is taken; however, if corrective action is delayed approximately 8 seconds, the aircraft pitch angle will be greater than 30 degrees nose-down in the airspeed in excess of 350 knots indicated airspeed.  Under these conditions, the aircraft cannot be controlled until the pitch trim is moved toward neutral.  While it is evident that recovery was delayed, the reason for the delay is unknown. The aircraft became uncontrollable and entered a steep descent. During the rapid descent, an explosion occurred at approximately 1300 feet above ground level followed immediately by catastrophic failure, and complete break-up of the aircraft. The wreckage was found north of Walkersville and all 21 occupants were killed. ", "probable_cause": "At 1049:48 EDT, FAA lost radar contact with the aircraft. The aircraft was cruising at flight level 290 at .78 Mach and was performing a navigational training leg. Navigational legs are normally flown on autopilot, and FAA altitude readouts showed the aircraft was within 100 feet of assigned altitude, characteristic of autopilot flight. The aircraft commander, Capt Joseph Emilio, occupied the right pilot seat and a passenger, Mrs. Peggy Emilio, occupied the left pilot seat. Also in the crew compartment were the 2 navigators, Lt Col Benjamin B. Frederick and Capt Donald V. Fonke, and 2 passengers, Mrs. Linda Fonke and SSgt Joseph T. Brundige. This phase of flight, the navigational leg, was the least demanding on the pilot and was the logical time for the passengers to come forward to view the cockpit area. There is no evidence that the presence of the passengers in the crew compartment contributed to, or caused, the accident. For undetermined reasons, the aircraft pitch trim moved to the full nose-down position. The autopilot can overcome the trim until near full nose-down. The aircraft then rapidly pitched over, most likely upon release of the autopilot, and induced sufficient negative \"G\" forces to cause the generators to trip off line and loss of all AC electrical power. The pitch trim could not then be moved electrically. This condition, while unusual, can be easily controlled if prompt corrective action is taken; however if corrective action is delayed approximately 8 seconds, the aircraft pitch angle will be greater than 30° nose-down in the airspeed in excess of 350 KIAS. Under these conditions, the aircraft cannot be controlled until the pitch trim is moved toward neutral. While it is clear that recovery was delayed, the reason for the delay is unknown. The aircraft became uncontrollable and entered a steep descent. The aircraft emerged from the clouds at 2,000 feet above ground level (AGL) and was intact. Airspeed was in excess of 400 KTAS and die to angle was 20 to 30 degrees. Engine power was above 2.0 engine pressure ratio (EPR). At approximately 1,500 feet mean sea level (MSL) an explosion occurred inside the pressurized compartment of the fuselage and weakened the aircraft structure to the extent that catastrophic failure of the aircraft followed immediately. Cause of this explosion is undetermined; however, the aircraft was in an unrecoverable condition at the time of the explosion and a crash was already inevitable."}