{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-329c-lagos-7-killed", "date": "Jul 13, 1968 at 0400 LT", "type": "Boeing 707", "operator": "Sabena.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Brussels - Lagos", "msn": "19211", "yom": 1966, "flight_number": "SN712", "city": "Lagos-Murtala Muhammed", "zone": "Lagos", "country": "Nigeria", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Flight SN712 was a non-scheduled international cargo flight from Brussels direct to Lagos on behalf of the Federal Government of Nigeria with 34 994 kg of cargo on board. No passengers were being carried. A flight plan was filed for a flight of 6 hours 9 minutes and the total endurance of the aircraft was stated as 8 hours 20 minutes. The designated alternate was Kano. The aircraft took off from Brussels at 2152 hours GMT on 12 July 1968 and routine radio reports were received during the en route phase of the flight. At 0325 hours R/T contact was made with Lagos approach control. The R/T transmissions with the aircraft have been identified as being almost certainly the voice of the co-pilot indicating that he was doing the R/T rhile the pilot-in-command was flying the aircraft. The aircraft gave an ETA at Lagos of 0355 hours and reported that it was at flight Level (FL) 330. A request was then made for the latest Lagos weather and the reply included the following information: wind: 210°/3 kt; visibility: 16 km; cloud: 5/8 stratocumulus 270 m, 7/8 altostratus 2 400 m, temporary thunderstorms, 118 cumulonimbus 2 000 ft; QNH: 1012 mb; temperature 24°. At 0327 hours the aircraft reported an ETA overhead Ibadan NDB of 0344 hours in response to a request for this information from Lagos. One minute later it reported that the Ibadan NDB did not appear to be operating. At 0336 the aircraft requested descent clearance. It was cleared to Lagos at FL60 and commenced the descent from FL330 at that time. Three minutes later the aircraft reported passing Ibadan and descending through FL275 but since it had reported earlier that the Ibadan NDB seemed not to be radiating it is not known how the position was determined. In reply Lagos approach stated that there was no delay in the approach and that the runway in use was 19. At 0341 hours, when the aircraft was about 50 miles north of. Lagos, it was recleared to 2 200 ft on a QNH of 1012 mb - and told to report field in sight. The flight recorder readout shows that shortly after this interchange the descent was interrupted while the speed decreased to a figure corresponding to the recommended maximum for landing gear extension and this speed was not exceeded for the remainder of the flight. Close study of the flight recording shows subsequent irregularity indicating that the automatic pilot was most probably disengaged at this stage of the flight. Subsequent to the speed reduction the rate of descent was re-established to approximately 2 000 ft/min and at 0350 hours the aircraft passed one mile to the east of Lagos airport whilst on a southerly heading at an altitude of 15 000 ft. The aircraft was heard flying over the airport at this time. The flight recorder indicates that a procedure turn was made to the south of the airport in the vicinity of the city of Lagos and at its conclusion there was a second interruption in the descent following which the airspeed remained below the maximum for 25° of flap. At 0354 hours the aircraft passed over the airport northbound at an altitude of 9 000 ft maintaining the average rate of descent of 2 000 ft/min for a further 2 1/2 minutes. At 0356 hours a procedure turn was commenced at an altitude of about 5 000 ft during which the rate of descent was reduced to 1 500 ft/min. The track of the aircraft between its passage over the airport northbound and the commencement of the final procedure turn is almost coincident with the outbound track of the published VOR approach procedure. At 0357 hours Lagos approach control was informed by the aircraft that it was in the procedure turn and requested to give the wind conditions. In reply control stated that the wind was calm and this was acknowledged. Shortly afterwards approach control instructed the aircraft to report runway in sight and this was also acknowledged. On completion of the procedure turn at an altitude of 1 400 ft (a height above the airport of 1268 ft) the airspeed was reduced from 190 kt to a little less than 160 kt and the rate of descent was reduced to 900 ft/min. The heading was stabilized on 197° M and at 0359 hours the aircraft asked for the runway lights to be put on maximum brightness. Approach control replied that the runway lights were on low intensity non-variable. A transmitter switch was then heard but there was no subsequent message from the aircraft before it crashed about 8 1/2 miles north of the airport approximately on the extended centre line of the runway. All the occupants were killed and the aircraft caught fire immediately and was burnt out. All seven occupants were killed. ", "probable_cause": "The accident was caused by the aircraft descending below its minimum safe altitude for reasons that have not been determined. The following findings were reported:\r\n- The aircraft made an almost continuous descent from FL275 to the point of impact without an intermediate report being made of either its height or position between \"passing IB beacon\" and a point \"on procedure turn\" north of Lagos airport,\r\n- The approach to land was made at night without ILS glide slope or marker beacon guidance,\r\n- There was an absence of instructions regarding the monitoring of the altitude by the pilot not flying the aircraft and the cross checking of altimeters during an approach."}