{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900d-ghardaia-1-killed", "date": "Jan 28, 2004 at 2101 LT", "type": "Beechcraft 1900D", "operator": "Tassili%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hassi R’Mel – Ghardaïa", "msn": "UE-365", "yom": 1999, "flight_number": null, "city": "Ghardaïa", "zone": "Ghardaïa", "country": "Algeria", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1742, "circumstances": "The aircraft departed Hassi R'Mel-Tilrhempt Airport at 2030LT on a 15-minutes charter flight to Ghardaïa, carrying three crew members and two employees of the Sonatrach (Société Nationale pour le Transport et la Commercialisation d’Hydrocarbures). At 2044LT, the crew was cleared for a right hand circuit in preparation for an approach to runway 30. At that moment a Boeing 727 inbound from Djanet was on long finals. The copilot stated that he intended to carry out an NDB/ILS approach to runway 30. The captain however preferred a visual approach. The copilot carried out the captain's course and descent instructions with hesitation. At 2057LT, the EGPWS alarm sounded. Power was added and a climb was initiated from a lowest altitude of 240 feet above ground level. The captain then took over control and assumed the role of Pilot Flying. The airplane manoeuvred south of the airport until 2101LT when the copilot saw the runway. The captain rolled left to -57° and pitched down to -18.9° in order to steer the airplane towards the runway. Again the EGPWS sounded but the descent continued until the airplane impacted the ground and broke up. All five occupants were injured and the aircraft was destroyed. A day later, the copilot died from his injuries. ", "probable_cause": "The Commission believes that the accident can be explained by a series of several causes which, taken separately, would not lead to an accident.\r\nThe causes are related to:\r\n1 - the lack of rigor in the approach and landing phase evidenced by a failure to follow standard operating procedures, including the arrival checklist.\r\n2 - the failure to strictly comply with the holding, approach and landing procedures in force for the aerodrome of Ghardaïa.\r\n3 - the fact that the captain seemed occupied by the visual search maneuvers that put him temporarily out of the control loop. He was so focused on the visual search for the runway and abandoned the monitoring of parameters that are critical for the safety of the flight. This concentration completely disoriented him.\r\n4 - the fact that the crew did not respond appropriately to different alarms that occurred, indicating a lack of control in the operation of the aircraft in that kind of situation. Lack of control was apparently due to his lack of training on this aircraft type.\r\n5 - The activities in the southern part of Algeria may cause a certain routine that can promote the tendency to conduct visual approaches. It seems, indeed, that the crew is more experienced in visual flights.\r\n6 - A lack of coordination and communication between the crew members flying together for the first time."}