{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b60-duke-gaston-4-killed", "date": "Jun 20, 1989 at 1642 LT", "type": "Beechcraft 60 Duke", "operator": "Maurice J. Walsh III", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Gastonia – Fort Pierce", "msn": "P-445", "yom": 1977, "flight_number": null, "city": "Gaston", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1290, "captain_hours_type": 26, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1669, "circumstances": "After obtaining a weather briefing in which he was informed of thunderstorms and current sigmets for his intended route of flight, the pilot elected to depart his home airport on a personal flight. At the time of departure, witnesses indicated the presence of thunderstorms adjacent to the airport. After trying to obtain his IFR clearance from charlotte, the pilot was issued his IFR clearance when approaching Columbia, SC. The pilot had deviated around at least one thunderstorm while approaching Columbia. The pilot had been cleared to climb to his requested altitude of 17,000 feet and had reached 16,400 when the radar return was observed to indicate a descent and then was lost. Witnesses on the ground reported seeing the airplane exit the clouds in flames. The evidence indicated that the horizontal tail had separated followed by the wings and other components of the airplane. No evidence of separation due to structural weakening from heating was found. All four occupants were killed. ", "probable_cause": "The pilot exercised questionable judgement in initiating a flight into an area of known thunderstorms. Further, either deliberately or inadvertently entered a thunderstorm and overstressed the airframe structure resulting in an inflight separation of the aerodynamic surfaces."}