{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-134a-liepaja-4-killed", "date": "Mar 22, 1979 at 0057 LT", "type": "Tupolev TU-134", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Omsk - Gorki - Liepaja", "msn": "48530", "yom": 1976, "flight_number": null, "city": "Liepaja", "zone": "Courland (Kurzeme)", "country": "Latvia", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5838, "circumstances": "The airplane departed Omsk on a cargo flight to Liepaja with an intermediate stop in Gorki, carrying a crew of five and a load of eight tons of radio station's components. The aircraft, not configured for cargo with no cargo door and no cargo compartment, was loaded with light components in the rear part of the cabin and heavy parts in the front of the cabin. There were no passengers on board. The crew initiated the descent to Liepaja by night and poor weather conditions with a limited visibility to 900 meters (below airport minima) with mixed rain and snow falls. On approach, at an altitude of 310 meters and at a speed of 265 km/h, flaps were lowered and the aircraft became unstable on its roll and pitch axis. At an altitude of 180 meters, the autopilot was disconnected then the aircraft deviated to the right of the approach path. While trying to establish a visual contact with the runway, the pilot-in-command initiated a slight turn to the left  when the airplane adopted an excessive rate of descent of 8 meters per second until it struck tree tops located 1,690 meters short of runway threshold. The airplane stalled then struck the embankment of a railroad and eventually crashed in flames in a snow covered field located 155 meters to the right of the extended runway centerline. The aircraft was destroyed by impact forces and a post crash fire. A crew member was seriously injured while four other occupants were killed. ", "probable_cause": "It was determined that the crew decided to continue the approach in poor weather conditions with a visibility below airport minimums and an unstable aircraft. While trying to establish a visual contact with the ground, the crew let the airplane descending with an excessive rate of eight meters per second and failed to take appropriate actions to initiate a go-around maneuver. It was also determined that the flight was poorly planned and prepared by the crew and the operator. The airplane was not suitable for such cargo operation, the cargo has not been weighed prior to the flight and no weight and balance documentation was issued. The total weight of the aircraft was 752 kg above the maximum allowed weight and the CofG was too far forward, out of the enveloppe, which contributed to an unstable aircraft on final approach. "}