{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-440f-toledo-2-killed", "date": "Sep 11, 2019 at 0239 LT", "type": "Convair CV-440 Metropolitan", "operator": "Ferreteria e Implementos San Francisco", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Millington-Memphis - Toledo", "msn": "393", "yom": 1957, "flight_number": null, "city": "Toledo-Express", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8000, "captain_hours_type": null, "copilot_hours": 11287, "copilot_hours_type": null, "aircraft_hours": 47742, "circumstances": "The accident occurred during the second of a two-leg nonscheduled cargo flight. The initial leg of the flight departed the preceding evening. The pilots landed about 3.5 hours later for fuel and departed on the accident flight an hour after refueling. The flight entered a cruise descent about 39 miles from the destination airport in preparation for approach and landing. The pilots reported to air traffic control that they were executing a wide base and were subsequently cleared for a visual approach and landing. The landing clearance was acknowledged, and no further communications were received. No problems or anomalies were reported during the flight. The airplane was briefly established on final approach before radar contact was lost. The airplane impacted trees and terrain about 0.5 mile short of the runway and came to rest in a trucking company parking lot. A postimpact fire ensued. Damage to the landing gear indicated that it was extended at the time of impact. The position of the wing flaps could not be determined. Disparities in the propeller blade angles at impact were likely due to the airplane’s encounter with the wooded area and the impact sequence. No evidence of mechanical anomalies related to the airframe, engines, or propellers was observed. A review of air traffic control radar data revealed that the airplane airspeed decayed to about 70 to 75 kts on final approach which was at or below the documented aerodynamic stall speed of the airplane in the landing configuration. Although there was limited information about the flight crew’s schedules, their performance was likely impaired by fatigue resulting from both the total duration of the overnight flights and the approach being conducted in the window of the circadian low. This likely resulted in the flight crew’s failure to maintain airspeed and recognize the impending aerodynamic stall conditions.", "probable_cause": "The flight crew’s failure to maintain the proper airspeed on final approach, which resulted in an inadvertent aerodynamic stall and impact with trees, and terrain. Contributing to the accident was the flight crew’s fatigue due to the overnight flight schedule."}