{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-treasure-cay-2-killed", "date": "Jul 13, 2003 at 1530 LT", "type": "Cessna 402", "operator": "Air%20Sunshine", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Fort Lauderdale – Treasure Cay", "msn": "402C-0413", "yom": 1980, "flight_number": "RSI502", "city": "Treasure Cay", "zone": "Central Abaco", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7904, "captain_hours_type": 4964, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17589, "circumstances": "On July 13, 2003, about 1530 eastern daylight time, Air Sunshine, Inc. (doing business as Tropical Aviation Services, Inc.), flight 527, a Cessna 402C, N314AB, was ditched in the Atlantic Ocean about 7.35 nautical miles west-northwest of Treasure Cay Airport (MYAT), Treasure Cay, Great Abaco Island, Bahamas, following the in-flight failure of the right engine. Four of the nine passengers sustained no injuries, three passengers and the pilot sustained minor injuries, and one adult and one child passenger died after they evacuated the airplane. The airplane sustained substantial damage. The airplane was being operated under the provisions of 14 Code of Federal Regulations Part 135 as a scheduled international passenger commuter flight from Fort Lauderdale/Hollywood International Airport, Fort Lauderdale, Florida, to MYAT. Visual meteorological conditions prevailed for the flight, which operated on a visual flight rules flight plan.", "probable_cause": "The in-flight failure of the right engine and the pilotís failure to adequately manage the airplaneís performance after the engine failed. The right engine failure resulted from inadequate maintenance that was performed by Air Sunshine's maintenance personnel during undocumented maintenance. Contributing to the passenger fatalities was the pilotís failure to provide an emergency briefing after the right engine failed."}