{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-telequana-pass-5-killed", "date": "Sep 9, 1998 at 1045 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Rust%27s%20Flying%20Service-2", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Anchorage - Hoholitna River", "msn": "0595", "yom": 1953, "flight_number": null, "city": "Telequana Pass", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 1720, "captain_hours_type": 150, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12948, "circumstances": "The float equipped airplane was attempting to cross a mountain pass, following two other company airplanes. The first two pilots, and passengers, described five to seven miles visibility, 700 feet ceilings, clouds hanging on the mountainsides, and misty rain. The route of flight required several turns in the pass. The pilot had not flown through the pass in marginal Visual Flight Rules (VFR) weather before this flight. After the first two airplanes went through the pass, they lost radio contact with the accident pilot, and did not see or hear from him again. The wreckage was later located at the head of an intersecting canyon, two miles before the correct pass. The airplane had been modified with a Short Take Off and Landing (STOL) kit. Canadian certification flight tests had determined that this modification eliminated aerodynamic warning of impending stalls, and therefore required an audible stall warning. Company pilots indicated it was common for the stall warning system to activate at an airspeed 10-15 miles per hour above the actual stall. At the time of the accident, the airplane did not have the ventral fin installed, and a takeoff flaps setting was selected. The audible stall warning circuit breaker was found in the pulled (disabled) position. ", "probable_cause": "The pilot's failure to maintain adequate airspeed which resulted in an inadvertent stall. Factors associated with this accident were the pilot's unfamiliarity with the geographic area, the low clouds, his becoming disoriented, and the blind canyon into which he flew. An additional factor was the intentionally disabled stall warning system. "}