{"url": "https://www.baaa-acro.com/crash/crash-vickers-837-viscount-moscow-31-killed", "date": "Sep 26, 1960 at 2140 LT", "type": "Vickers Viscount", "operator": "Austrian%20Airlines-4", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Vienna – Warsaw – Moscow", "msn": "437", "yom": 1960, "flight_number": "OS901", "city": "Moscow-Sheremetyevo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 5, "pax_on_board": 31, "pax_fatalities": 26, "other_fatalities": 0, "total_fatalities": 31, "captain_hours": 2395, "captain_hours_type": 1752, "copilot_hours": 2088, "copilot_hours_type": 458, "aircraft_hours": 1272, "circumstances": "The approach to Moscow-Sheremetyevo Airport was completed by night and in poor weather conditions. After its four turn on approach, the crew continued the descent below the glide when the airplane struck trees and crashed in a wooded area located 11 km short of runway 07. The aircraft was destroyed, five crew members and 26 passengers were killed while six other occupants were seriously injured. At the time of the accident, the visibility was limited due to the night, foggy conditions and rain falls. ", "probable_cause": "The investigations revealed that there were no technical deficiencies in the aircraft itself or a meteorological phenomenon involved in the accident. The Austrian observers participating in the investigation of the accident were of the opinion that the accident was related to altitude measurement, inasmuch as it was apparent from radio communications as well as from the examination of the wreckage that that the crew believed that they were flying at the normal approach altitude. The erroneous altitude measurement may be attributed to: \r\n- A technical deficiency of either of the two altimeters,\r\n- The divergent settings of the altimeters or,\r\n- Omission of altimeter reading or erroneous reading of altimeters. \r\nThe internal mechanism of both altimeters was so heavily damaged that it could no longer be ascertained whether, at the time of the accident, the altimeters were functioning accurately. Both altimeters were set to the correct atmospheric pressure but their settings differed, namely the left altimeter was set at QFE 990 millibars and the right altimeter at 1013 millibars, which in view of the prevailing atmospheric pressure conditions, could have corresponded both to QNH and to the standard pressure setting. Such divergent settings are at variance with the usual procedure of Austrian Airlines. The reasons prompting the flight captain to depart from the usual practice could not be ascertained. It was not possible to reach a categorical conclusion as to which of the three causes were responsible for an approach below the minimum flying altitude."}