{"url": "https://www.baaa-acro.com/crash/crash-cessna-441-conquest-ii-cape-town-5-killed", "date": "Aug 16, 2015 at 0629 LT", "type": "Cessna 441 Conquest", "operator": "E-Med-Rescue.png", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Mountains", "schedule": "Oranjemund - Cape Town", "msn": "441-0288", "yom": 1983, "flight_number": null, "city": "Cape Town", "zone": "Western Cape", "country": "South Africa", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 6353, "captain_hours_type": 1357, "copilot_hours": 1394, "copilot_hours_type": 1, "aircraft_hours": 7605, "circumstances": "On 15 August 2015 at 2351Z a Cessna 441 aeroplane, with two crew and a paramedic on board took off from Eros Airport (FYWE) on a medical evacuation flight with their intended final destination Cape Town International Airport (FACT). The aircraft landed at Oranjemund (FYOG) to pick up a male patient and his daughter. At 0206Z the aircraft departed from FYOG on a mercy flight to FACT. At 0343Z the aircraft made the first contact with FACT area and the aircraft was put under radar control. At 0355Z, area control advised the crew that there was a complete radar failure. The aircraft was on a descent to 6500 ft when approach advised them to prepare for a VOR approach for runway 19. At 0429Z, while on approach for landing at FACT, all contact was lost with the aircraft. At approximately 0556Z the aircraft’s wreckage was located approximately 8 nm to the north of FACT. All five occupants on board were fatally injured and the aircraft was destroyed by impact and post impact fire. The investigation revealed the aircraft collided with terrain during instrument meteorological condition (IMC) conditions while on the VOR approach for Runway 19 at FACT. At the time the ILS was working, however the approach controller offered a VOR approach for separation with an outbound aircraft as the radar was unserviceable. ", "probable_cause": "The aircraft collided with terrain during instrument meteorological flight conditions while on the VOR approach Runway 19."}