{"url": "https://www.baaa-acro.com/crash/crash-antonov-26b-antalya", "date": "Nov 9, 2002 at 1900 LT", "type": "Antonov AN-26", "operator": "TyumenAviaTrans", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "City", "schedule": "Asmara – Port Sudan – Hurghada – Antalya", "msn": "100 07", "yom": 1980, "flight_number": "TMN9012", "city": "Antalya", "zone": "Mediterranean Region (Akdeniz Bölgesi)", "country": "Turkey", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 19, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was completing a charter flight from Asmara to Antalya with intermediate stops in Port Sudan and Hurghada, carrying helicopter crews back in Russia. On approach to Antalya by night, the crew was informed about the poor weather conditions at destination with thunderstorm activity, visibility limited to two km, wind from 220 gusting at 35 knots. ATC advised the crew to maintain heading and to initiate a go-around in case they would not establish a visual contact with the runway. On short final, the left engine struck a 10 metres high electric pole. The aircraft lost height and crashed on a road located 1,325 metres short of runway and 550 metres to the left of its extended centerline. All 27 occupants were rescued, among them eight were injured. The aircraft was destroyed. ", "probable_cause": "The following findings were identified:\r\n- The crew mistook the road lights for the airport lights and descended to low, \r\n- The crew continued the approach after passing the MDA, \r\n- The crew failed to initiate a go-around procedure, \r\n- Limited visibility due to poor weather conditions, \r\n- Some ATC instructions lead to confusion, \r\n- Informations related to weather condition were inaccurate. "}