{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-11f-newark", "date": "Jul 31, 1997 at 0131 LT", "type": "McDonnell Douglas MD-11", "operator": "FedEx", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Singapore – Penang – Taipei – Anchorage – Newark", "msn": "48604", "yom": 1993, "flight_number": "FDX014", "city": "Newark", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11000, "captain_hours_type": 1253, "copilot_hours": 3703, "copilot_hours_type": 95, "aircraft_hours": 13034, "circumstances": "The aircraft crashed while landing on runway 22R at Newark International Airport (EWR), Newark, New Jersey. The regularly scheduled cargo flight originated in Singapore on July 30 with intermediate stops in Penang, Malaysia; Taipei, Taiwan; and Anchorage, Alaska. The flight from Anchorage International Airport (ANC), Anchorage, Alaska, to EWR was conducted on an instrument flight rules flight plan and operated under provisions of 14 Code of Federal Regulations (CFR) Part 121. On board were the captain and first officer, who had taken over the flight in Anchorage for the final leg to EWR, one jumpseat passenger, and two cabin passengers. All five occupants received minor injuries in the crash and during subsequent egress through a cockpit window. The airplane was destroyed by impact and a post crash fire. According to flight plan and release documents, the airplane was dispatched to ANC with the No. 1 (left engine) thrust reverser inoperative. The flight plan time from ANC to EWR was 5 hours and 51 minutes—47 minutes shorter than the scheduled time of 6 hours and 38 minutes because of 45-knot tailwinds en route. The flight crew stated that at flight level (FL) 330 (about 33,000 feet mean sea level [msl]), the flight from ANC to EWR was routine and uneventful. At 0102:11, a Federal Aviation Administration (FAA) Boston Air Route Traffic Control Center air traffic controller instructed flight 14 to descend and maintain FL180, according to the airplane’s cockpit voice recorder (CVR).  About 0103, the captain and first officer discussed the approach and landing to runway 22R and the airplane’s landing performance. Using the airport performance laptop computer (APLC), the first officer determined that the airplane’s runway stopping distance would be approximately 6,080 feet using medium (MED) autobrakes. According to the CVR, at 0103:33, the flight crew then compared the APLC approximate landing distance for MED braking (6,080 feet) to the after-glideslope touchdown distance (6,860 feet) provided on the instrument approach plate. Based on the flight crew's calculation (6,860 – 6,080), MED braking provided a 780-foot margin after stopping. The flight crew then compared the APLC approximate landing distance for maximum (MAX) braking (5,030 feet) to the same 6,860-foot after-glideslope touchdown distance provided on the instrument approach plate. Based on the flight crew's calculation (6,860 – 5,030), MAX braking provided a 1,830-foot margin after stopping. On the basis of these calculations, the first officer suggested using MAX autobrakes. The captain agreed, stating “we got a lot of stuff going against us here so we’ll…start with max.” The first officer added, “I mean…I mean if we don’t have the reverser.” At 0114:22, the captain asked the first officer to advise the passengers that “we’re gonna have a pretty abrupt stop because of those brakes and the thrust reversers and all that stuff.” Twice during the approach, the captain asked the first officer to remind him to only use the No. 2 and No. 3 thrust reversers. At 0116:16, the captain noted that the left landing light was inoperative, adding “… just the right’s working.” The EWR tower controller cleared flight 14 to land at 0129:45 and advised the flight crew “winds two five zero at five.” At 0130:02, the first officer stated “max brakes” during the before-landing checklist. The captain replied “max brakes will be fine,” and the first officer responded “if they work.” At 0130:34, the captain stated “[landing gear] down in four green” and called for “flaps fifty.” At 0130:45, the captain disengaged the autopilot at an altitude of 1,200 feet during the approach and “hand flew” the airplane to touchdown. The autothrottles were engaged, as recommended by McDonnell Douglas and FedEx procedures. According to information from the airplane’s flight data recorder (FDR), the approach was flown on the glideslope and localizer until touchdown, and the airplane’s approach airspeed was about 158 knots until the flare. According to the CVR, the pilots had selected an approach reference speed of 157 knots, or Vref plus 5 knots. Altitude callouts were made by the on board central aural warning system (CAWS) at 1,000 feet and 500 feet, and the first officer called out minimums (211 feet) at 0132:03. At 0132:09, the first officer stated “brakes on max,” and CAWS callouts followed for 100, 50, 40, 30, 20, and 10 feet until the sound of initial touchdown at 0132:18.75. One-half second later, the CVR recorded an expletive by the captain. At 0132:20.26, the CVR recorded increasing high-frequency tones consistent with engine spool-up (accelerating engine rpms), and at 0132:21.06, the CVR recorded a decrease in high-frequency tones consistent with engine spool-down. The sound of a “loud thump” consistent with another touchdown was recorded at 0132:21.62. A series of expletives by the captain and first officer followed until sounds of “metallic breakup” were recorded at 0132:27. FDR data indicated that after the airplane’s initial touchdown, it became airborne and rolled to the right as it touched down again (see section 1.1.1 for a detailed description of the airplane’s performance during the landing sequence). The airplane continued to roll as it slid down the runway, coming to rest inverted about 5,126 feet beyond the runway threshold and about 580 feet to the right of the runway centerline. The accident occurred during the hours of darkness. Visual meteorological conditions prevailed at the time of the accident.", "probable_cause": "The captain’s overcontrol of the airplane during the landing and his failure to execute a go-around from a destabilized flare. Contributing to the accident was the captain’s concern with touching down early to ensure adequate stopping distance."}