{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-63f-toledo-4-killed", "date": "Feb 15, 1992 at 0326 LT", "type": "Douglas DC-8", "operator": "ATI", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Seattle - Toledo", "msn": "45923", "yom": 1968, "flight_number": "ATI805", "city": "Toledo-Express", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 16382, "captain_hours_type": 2382, "copilot_hours": 5082, "copilot_hours_type": 1143, "aircraft_hours": 70425, "circumstances": "ATI Flight 805 departed from Seattle at 23:20 for a flight to Toledo. The 1st officer was flying the ILS approach to runway 07. For undetermined reasons, he failed to properly capture the ILS localizer and/or glide slope during the approach. At 03:13 the captain decided to carry out a go-around. The aircraft was vectored onto a base leg and given a heading of 100° to intercept the final approach course again. With a 35 knots crosswind (at 180°) on the approach the 1st officer had trouble capturing the localizer/glide slope. At 03:24, as the 1st officer was attempting to stabilize the approach, 3 GPWS glideslope warnings and sink rate warnings sounded. The captain took over control at 03:24:17 and performed another missed approach manoeuvre. He became spatially disoriented and inadvertently allowed an unusual attitude to develop with bank angles up to 80° and pitch angles up to 25°. When in a nose-low and left bank angle attitude, control of the airplane was transferred back to the 1st officer who began levelling the wings and raising the nose of the airplane. Impact with the ground occurred before the unusual attitude recovery was completed. All four occupants were killed. ", "probable_cause": "The failure of the flight crew to properly recognize or recover in a timely manner from the unusual aircraft attitude that resulted from the captain's apparent spatial disorientation, resulting from physiological factors and/or a failed attitude director."}