{"url": "https://www.baaa-acro.com/crash/crash-antonov-24b-zalingei-2-killed", "date": "Nov 11, 2010 at 1618 LT", "type": "Antonov AN-24", "operator": "Tarco%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Khartoum - Nyala - Zalingei", "msn": "0 73 059 10", "yom": 1970, "flight_number": null, "city": "Zalingei", "zone": "Central Darfur", "country": "Sudan", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 38, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4400, "captain_hours_type": 300, "copilot_hours": 900, "copilot_hours_type": 700, "aircraft_hours": null, "circumstances": "The crew started the approach to Zaligei Airport runway 03 in good weather conditions. The aircraft landed hard 200 metres past the runway threshold, causing both propeller blades to struck the ground on a distance of 33 metres. The aircraft bounced and landed a second time 263 metres further then a third time after 15 metres. Upon impact, both engines were torn off and the aircraft rolled for about 400 metres before coming to rest, bursting into flames. Two passengers were killed while five others were injured. All 37 other occupants escaped unhurt. The aircraft was totally destroyed by a post crash fire. ", "probable_cause": "Sudan's Central Directorate of Air Accident Investigation concluded the probable causes as follow:\r\nThe accident cause is a complex set of reasons. The aircraft impacted the ground on three wheels at high forward speed shearing off both engines and propellers and damaging the left main landing gear which put the aircraft in an uncontrollable condition. \r\nContributory factors were:\r\n- Absence of crew coordination,\r\n- Absence of cabin procedure and check-lists for different phases of flight,\r\n- Unsatisfactory Periodic and Annual job check being reflected on the inoperative Cockpit Voice and Flight Data Recorders,\r\n- Bad planning of the flight and long period taken to clear the recorded defects before departure is considered to be a contributory factor to this accident.\n"}