{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-paris-1-killed", "date": "Feb 8, 2006 at 1210 LT", "type": "Swearingen SA226 Metro II", "operator": "TriCoastal Air", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Dayton - Harlingen", "msn": "TC-396", "yom": 1980, "flight_number": null, "city": "Paris", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5237, "captain_hours_type": 164, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15883, "circumstances": "While in cruise flight at 16,000 feet, the pilot requested from ATC and was cleared to make a 360-degree turn to the left. Shortly after this, the pilot requested a 360-degree turn to the right. The pilot then requested radar vectors to the closest airport and was given this. ATC asked the pilot if he had an emergency and the pilot reported he had an asymmetric fuel condition. The pilot then asked for a lower altitude and was cleared by ATC to 4,000 feet. About a minute later the pilot transmitted \"Mayday\" six times and shortly after this radar and radio contact with the flight was lost. Recorded radar data showed that at 1803:13 the accident airplane was proceeding on a southerly heading at 16,100 feet mean sea level (MSL). At 1803:53 the airplane turned left to a southeasterly heading. At 1804:13 the airplane turned right returning to its original southerly heading. At 1805:14 the accident airplane turned to the right on a southwesterly heading, and maintained that heading until 1809:04 at which time the airplane turned due west and was at an altitude of 15,400 feet. The last radar contact was at 1810:06 at an altitude of 13,800 feet. The airplane wreckage was located due north from this last recorded radar contact. Witnesses observed the airplane descend in a near vertical attitude, collide with the ground, and then explode. Components from all areas of the aircraft structure and flight control surfaces were located at the crash site along with components from both engines and propellers. Impact and post crash fire damage precluded the examination of the airplanes fuel system and components.", "probable_cause": "The pilot's inflight loss of control following a reported fuel asymmetry condition for undetermined reasons."}