{"url": "https://www.baaa-acro.com/crash/crash-atr42-320-puerto-ordaz-17-killed", "date": "Sep 13, 2010 at 1023 LT", "type": "ATR42-300", "operator": "Conviasa", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Porlamar - Puerto Ordaz", "msn": "371", "yom": 1994, "flight_number": "VCV2350", "city": "Puerto Ordaz", "zone": "Bolívar", "country": "Venezuela", "region": "South America", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 47, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 17, "captain_hours": null, "captain_hours_type": 1574, "copilot_hours": 1083, "copilot_hours_type": 483, "aircraft_hours": 27085, "circumstances": "Following two uneventful flights to Santiago Mariño and Maturín, the aircraft departed Porlamar on a flight to Puerto Ordaz with 47 passengers and a crew of four on board. While descending to Puerto Ordaz, at an altitude of 13,500 feet and at a distance of 79 km from the destination, the crew reported control difficulties. After being prioritized, the crew was instructed for an approach and landing on runway 07. At 1021LT, the crew reported his position at 3,000 feet and 28 km from the destination Airport. Two minutes later, the message 'mayday mayday mayday' was heard on the frequency. The aircraft went out of control and crashed in an industrial area located about 9 km short of runway, bursting into flames. Three crew members and 14 passengers were killed while 34 other occupants were injured, 10 seriously. ", "probable_cause": "The most probable cause for the occurrence of the accident was the malfunction of the centralized crew warning system (CCAS/CAC) with erroneous activation of the flight loss of lift warning system.\r\nThe following contributing factors were identified:\r\n- Poor crew resources management, \r\n- Loss of situational awareness,\r\n- Inadequate coordination during the decision-making process to deal with abnormal situations in flight,\r\n- Ignorance of the loss of lift warning system.\r\n- Inadequate handling of flight controls."}