{"url": "https://www.baaa-acro.com/crash/crash-fokker-f7-ver-sur-mer", "date": "Jul 1, 1927 at 0232 LT", "type": "Fokker F7", "operator": "America Transoceanic Company", "flight_phase": "Flight", "flight_type": "Postal (mail)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Roosevelt Field - Paris", "msn": "703", "yom": 1927, "flight_number": null, "city": "Ver-sur-Mer", "zone": "Calvados", "country": "France", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Orteig prize was won by Charles Lindbergh last 22nd of May so the crew was preparing the aircraft for the first postal and nonstop transatlantic flight between the United States and Paris. The aircraft named 'America' departed Roosevelt Field on 29JUN1927 with a crew of four on board. The flight was hard with many difficulties en route. Arriving over Paris from the north, the crew contacted ground services at Le Bourget Airport at 0110LT to obtain assistance as he was unable to localize the airport due to foggy conditions. After few minutes, the crew decided to return to the north and saw some lights on the ground and the sea as well. At this time, the crew realized he was not over Paris but Normandy. Due to poor visibility (night and fog) and fuel shortage, the crew understood it was not possible to continue to Paris anymore so he attempted to make an emergency landing. Aircraft eventually came to rest in the sea some 300 metres offshore, near Ver-sur-Mer. When it contacted water, the aircraft lost its undercarriage and nosed down before coming to rest. All four occupants evacuated the cabin themselves and swam to the beach. While all four occupants were slightly injured, the aircraft was recovered few hours later but was destroyed. The mail was later recovered as well. \r\nCrew:\r\nCdt Richard E. Byrd, pilot, \r\nBert Acosta, pilot, \r\nBernt Balchen, pilot, \r\nGeorge O. Noville, radio officer. ", "probable_cause": "Emergency landing due to fuel exhaustion."}