{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-hotnarko-lake-3-killed", "date": "Jun 19, 2000 at 1630 LT", "type": "De Havilland DHC-2 Beaver", "operator": "AvNorth Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Hotnarko Lake - Nimpo Lake", "msn": "841", "yom": 1955, "flight_number": null, "city": "Hotnarko Lake", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": 150, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The de Havilland DHC-2 (Beaver) floatplane, serial number 841, departed Hotnarko Lake, British Columbia, at about 1630 Pacific daylight time. The pilot and six passengers were on board, with fishing gear and fish. Soon after take-off, the pilot entered a left turn. Before the turn was completed, the aircraft rolled, without command, further left to about 40 degrees of bank and the nose dropped. The aircraft did not respond to initial pilot inputs and continued in a left, diving turn toward the trees at the edge of the lake. The pilot tried to get the aircraft back onto the lake. The aircraft started to recover from the bank and the nose started to come up; however, the aircraft struck the lake surface before a level attitude could be regained. It broke apart on contact with the water and sank soon after. The pilot and four of the passengers managed to free themselves from the wreckage, but only three passengers and the pilot managed to swim to shore. One passenger slipped below the water surface before reaching the shore and drowned. Two passengers remained in the aircraft below the water surface, one secured by his seat belt, and drowned.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. When the pilot entered a turn, the combined effects of the increased g-forces, power reduction, the aircraft=s heavy weight, the aft CofG, retraction of the flaps, and the wind conditions resulted in\r\nthe aircraft stalling. The aircraft struck the lake surface before the pilot was able to re-establish a level-flight attitude.\r\n2. The aircraft was operating in excess of 385 pounds above the maximum gross takeoff weight, and the CofG was about 2.7 inches aft of the aft limit. This loading configuration aggravated the stall characteristics of the aircraft.\r\n3. The pilot reduced power and raised the flaps before the climb was complete, contrary to the Pilot Operating Handbook, thereby increasing the aircraft's stall speed.\r\nOther Findings:\r\n1. The shoulder harnesses worn by the pilot and the front passenger likely prevented serious head injuries.\r\n2. The centre seat broke from its footings. This may have incapacitated the two passengers inside the aircraft or impeded their escape."}