{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900c-homer-18-killed", "date": "Nov 23, 1987 at 1825 LT", "type": "Beechcraft 1900C", "operator": "Ryan%20Air_0.png", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kodiak - Homer - Kenai - Anchorage", "msn": "UB-058", "yom": 1986, "flight_number": "XY103", "city": "Homer", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 19, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": 7087, "captain_hours_type": 4420, "copilot_hours": 10532, "copilot_hours_type": 300, "aircraft_hours": null, "circumstances": "During arrival, the aircraft (Ryan flight 103) crashed short of runway 03. The fuselage stayed intact during impact, but the belly structure was compressed and vertical deceleration forces exceeded the design capability of the seats. Rescue personnel had difficulty shutting off the aircraft's electrical power which delayed removal of the 1st officer (f/o) from the aircraft. An investigation revealed the aircraft was loaded with approximately 600 lbs more cargo than the f/o had requested. The center-of-gravity (cg) was 8 to 11 inches behind the allowable aft limit and the flight crew did not comply with company and FAA procedures in computing the cg. During flight, up to 3/8 inches of ice accumulated on the aircraft's leading edges. There was evidence the crew lost control of the aircraft as the flaps were lowered. The right flap actuator was found in the 7 to 12° position and the stabilizer trim was found at the full nose down position. Flight tests showed there would be no significant difficulty in controlling the aircraft with up to 1.5 inch of ice on the leading edges and that static stability would deteriorate during flap extension with the aft cg configuration. Three passengers survived while 18 other occupants were killed. ", "probable_cause": "The failure of the flight crew to properly supervise the loading of the airplane which resulted in the centre of gravity being displaced to such an aft location that the airplane control was lost when the flaps were lowered for landing."}