{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-32-warsaw", "date": "Dec 17, 1991 at 1749 LT", "type": "Douglas DC-9", "operator": "Alitalia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rome - Warsaw", "msn": "47339", "yom": 1969, "flight_number": "AZ552", "city": "Warsaw-Okęcie-Frederic Chopin", "zone": "Masovian Voivodeship (Mazowieckie)", "country": "Poland", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 90, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While descending to Warsaw-Okecie Airport, the crew encountered poor weather conditions with thunderstorm activity. On final approach, the copilot suggested the captain to abandon the landing procedure and to initiate a go-around maneuver. The captain dismissed the copilot's suggestion, disengaged the autopilot system and continued the approach when visual contact with the ground was established at an altitude of 400 feet. In a nose-down attitude and at an excessive speed of 155 knots (about 25-30 knots above the recommended speed), the aircraft struck the runway 33 surface nose gear first. The aircraft bounced then veered off runway to the left, rolled on soft ground for about 860 metres and lost its nose gear before coming to rest. All 96 occupants were evacuated, among them three passengers were slightly injured. The aircraft was damaged beyond repair. ", "probable_cause": "Wrong approach configuration on part of the flying crew who decided to continue the descent while the aircraft was unstable and misaligned with the runway. The following contributing factors were reported: \r\n- Failure of the crew to initiate a go-around procedure, \r\n- Unstabilized approach, \r\n- Excessive approach speed, \r\n- Touchdown completed in a nose-down attitude, \r\n- Poor crew coordination,\r\n- Poor weather conditions with thunderstorm activity. "}