{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-20d-matthew-town-2-killed", "date": "Dec 17, 2009 at 1930 LT", "type": "Dassault Falcon 20", "operator": "FL-Aviation-Group", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Oranjestad – La Isabela – Fort Lauderdale", "msn": "206", "yom": 1969, "flight_number": null, "city": "Matthew Town", "zone": "Inagua", "country": "Bahamas", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 26525, "captain_hours_type": null, "copilot_hours": 4800, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On December 17, 2009 at approximately 7:30 pm local (2330UTC), N28RK a Dassault Sud, Falcon Fan Jet, Mystere 20, Series D aircraft which departed Joaquin Balaguer Int’l Airport (MDJB) in the Dominican Republic, for Ft Lauderdale Executive Airport, (FXE) Ft Lauderdale, Florida, USA, crashed in a remote area of Matthew Town, Great Inagua, Bahamas. The accident occurred approximately 11.5 miles due east of Great Inagua International Airport at coordinates N 20˚ 58’ 30” latitude and W 073˚ 40’ 00.7” longitude. The aircraft made contact with the terrain on a heading of approximately 105 degrees magnetic. The accident occurred in area that was not accessible by land and the investigation team had to be airlifted by helicopter to the site. Witnesses on the island of Great Inagua reported hearing a loud bang that rattled doors and windows of their homes, but they did not report seeing the aircraft fall from the sky. The aircraft was under the command of Captain Harold Roy Mangels and First Office Freddy Castro. The aircraft reportedly departed Aruba, in the Netherland Antilles and made a fuel stop at Dr. Joaquin Balaguer Int’l Airport, Santo Domingo in the Dominican Republic. The final destination filed by the crew was Ft. Lauderdale Executive Airport, Ft Lauderdale Florida. The accident occurred approximately 6 mile off the filed flight path. ATC records and instructions were for the aircraft N28RK to maintain 28,000 ft (FL280). The aircraft transponder was reported as inoperative. It begun a rapid descent, with no report of an emergency declared or mayday call out. Investigation of the crash site indicates the airplane made contact with the terrain at a high rate of speed and approximately a 45 degree angle. The aircraft was destroyed on impact. The crew of a United States Coast Guard helicopter was on a training mission in the Great Inagua area at the time of the accident. They reported hearing a loud bang and noticed a huge explosion and fireball emanating from the ground in an area close to their location. The crew of the US Coast Guard helicopter reported that they did not see any in-flight fire prior to the fireball that they saw. The post impact fire engulfed approximately five (5) acres of trees and brush in the National Wildlife Refuge at Great Inagua. The coast guard helicopter crew stated that they discontinued their training mission and went to the site to investigate. Upon arrival at the site the crew reported that they lowered rescue personnel to the ground to investigate and search for survivors, but, due to the heat and extent of the fire on the ground, they had to discontinue the search. They reported the accident to authorities at Great Inagua. This information was further passed along to the National Transportation Safety Board who alerted the accident investigation unit of the Bahamas Civil Aviation Department. Night time conditions prevailed at the time of the accident. The crew of the aircraft received fatal injuries. A search of the area discovered no distinguishable human remains. Approximately less than 1% of what is believed to be possible human flesh / internal body parts were recovered. In addition clothing (piece of a pant with belt buckle fastened) was recovered, which possibly may have been worn by a member of the crew at the time of the accident. All recovered remains and clothing retrieved were gathered by officers of the Royal Bahamas Police Force that accompanied the investigation team and sent to the Forensic Science Laboratory at the Royal Bahamas Police Force, Nassau Bahamas for DNA analysis and possible identification. The aircraft broke into many pieces after contact with the terrain. Debris was spread over a large area of rough terrain. What remained of the aircraft post impact was either not found or possibly further destroyed by the post impact fire. The “four corners” of the airplane were confirmed in the area downstream of where the initial ground impact occurred. However, engine cowling parts were found prior to the point of initial ground impact. This may suggest an aircraft over-speed condition prior to ground impact. Less than 10% of the aircraft was recovered. An explosion occurred when N28RK made contact with the terrain. A post impact fire ensued. Approximately 5 acres of the national park was destroyed by the fire. Parts of the aircraft including personal effect, aircraft parts and furnishing, seat and seat cushions were also destroyed in the post impact fire.", "probable_cause": "The probable cause of this accident has been determined as loss of control. Insufficient wreckage of the aircraft were recovered to make a conclusive determination as to the cause of the accident."}