{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-kamako", "date": "Sep 13, 2013 at 1150 LT", "type": "PZL-Mielec AN-2", "operator": "Air%20Kasai", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tshikapa - Kamako", "msn": "1G223-14", "yom": 1987, "flight_number": null, "city": "Kamako", "zone": "Kasai-Occidental", "country": "Democratic Republic of Congo", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16798, "captain_hours_type": 16000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6981, "circumstances": "Following an uneventful flight from Tshikapa, the pilot initiated the approach to Kamako Airfield in relative good conditions. On final, the wind component suddenly changed. The aircraft lost height and impacted ground 16 metres short of runway 12. Upon impact, the undercarriage were partially torn off and the aircraft slid before coming to rest 37 metres past the runway threshold. All six occupants, one pilot and five passengers, escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "It was determined that the loss of control that occurred on short final was the result of the combination of a human error and weather component. The pilot was surprised by the abrupt change in weather conditions on short final to Kamako runway 12. He elected to initiate a go-around procedure and increased engine power but unfortunately, low level windshear caused the aircraft to lose height and to struck the ground as its speed was insufficient. In consequence, the increase power was too low to allow the pilot to maintain the approach profile. The torsion of the blades confirmed that the engine was at full power for a go-around procedure at impact. The absence of a windsock at Kamako Airfield was considered as a contributing factor as this would help the pilot to recognize the wind component and to decide to land or to go-around in due time. "}