{"url": "https://www.baaa-acro.com/crash/crash-lockheed-5c-vega-tenakee-1-killed", "date": "Jan 15, 1958 at 1600 LT", "type": "Lockheed 5 Vega", "operator": "Alaska%20Coastal%20Airlines2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Juneau – Angoon – Hood Bay – Baranof – Rodgers Point – Tenakee – Juneau", "msn": "99", "yom": 1929, "flight_number": "ACA040", "city": "Tenakee", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1263, "captain_hours_type": 209, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13496, "circumstances": "Alaska Coastal Airlines, a scheduled air carrier, is authorized to conduct operations throughout southeastern Alaska. On January 15, 1958, Captain Fred B. Sheldon departed from Juneau to fly Trip 40. Scheduled stops were planned at Angoon, Hood Bay, Baranof, Rodgers Point, Tenakee, and the flight was to terminate at the point of origin, Juneau. Weather reports for the area indicated conditions to be generally good, enabling the flight to be conducted according to visual flight rules. Ceilings were forecast to be 2,000 to 3,000 feet and winds near the surface were anticipated to be moderate and generally southwesterly. At least one mountain pass over the route was reported closed because of clouds. The gross takeoff weight of the aircraft at Juneau was calculated to be 5,237 pounds, approximately 4 pounds less than the maximum allowable. The load was correctly distributed within the center of gravity limitations. Flight 40 departed Juneau at 1301 and was routine to Angoon. After refueling, the flight continued uneventfully to Hood Bay, Baranof, Rodgers Point; arriving at Rodgers Point about 1520. About 1530, after the takeoff from Rodgers Point, a radio operator there advised the station agent at Tenakee (the next intended en route stop) that flight 40 was off the water and would need 20 gallons of fuel when it arrived. At approximately 1557 the agent at Tenakee heard a distress call from flight 40 over the radio. The pilot called “Mayday” and stated he was trying to make it to the flats in Kadashan Bay. The agent then called Flight 40 by radio asking its position. Sheldon’s final message was “ . . . the flats across from Tenakee.” Immediately thereafter the aircraft crashed. Both passengers were injured while the pilot was killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the poor flight planning by the pilot and his poor judgment in allowing the aircraft to run out of fuel. A contributing factor was the lack of adequate organization and management of the air carrier’s operations to ensure that all flights were planned and conducted with safety. The following findings were reported:\r\n- With one fuel tank out of use, the aircraft did not comply with the requirements of Bulletin 7A under which it was certificated for passenger-carrying service,\r\n- No evidence of mechanical or structural failure was found,\r\n- The pilot did not plan his flight to provide for an adequate fuel reserve at all times,\r\n- The company did not provide adequate supervision or control over flight planning or clearance of flights,\r\n- A longer alternate route had to be followed by the flight because of unfavorable weather,\r\n- The aircraft exhausted its fuel supply and crashed,\r\n- The air carrier’s operations manual was incomplete and was not maintained current as required by regulations,\r\n- The CAA safety inspection program was ineffective in terms of ensuring that the carrier was conducting operations at a level of safety appropriate for the carrier’s operating certificate and associated operating specifications."}