{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-228-biarritz", "date": "Mar 4, 1999 at 2010 LT", "type": "Boeing 737-200", "operator": "Air-France-31", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris - Biarritz", "msn": "23000", "yom": 1982, "flight_number": "AF7638", "city": "Biarritz", "zone": "Pyrénées-Atlantiques", "country": "France", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 91, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Air France Flight 7638, a Boeing 737-228, operated on a domestic flight from Paris-Charles de Gaulle Airport to Biarritz. The co-pilot on the flight was Pilot Flying (PF). While en route, about an hour before arrival, the flight crew listened out the ATIS frequency. The latest report mentioned a visibility of 10 km, a headwind of 15 to 30 kt and rain. When descending towards Biarritz the crew obtained an avoidance heading to bypass a thunderstorm cell. The flight was subsequently cleared for an ILS DME Cat I for runway 27. In the four minutes before landing, the visibility was 1500 metres in a squall, wind 6 kt with gusts to 3 kt, its direction changing from 250° to 290°, with variations up to 330°. The Vref is 129 kt and the Vapp 149 kt. The controller cleared the flight for landing and indicated a wind of 250° at 16 kt, gusts to 30 kt and heavy rain. The first officer disconnected the autopilot and autothrottle at an altitude of approximately 1200 ft, while established on the ILS. As the aircraft descended through 1100 feet, the captain was able to see the runway ahead. On short final, the controller reported a wind of 280° at 15 to 30 kt. The aircraft gradually deviated to the left of the centre line. The captain said: \"a little to the left\". The aircraft then gradually returned to align with the runway centreline. The PF banked the aircraft to the left as it slightly overshot the runway centreline. The aircraft passed the threshold approximately 4 m to the right of the centreline, parallel to it, with its wings horizontal. The PF started the flare with a slight bank to the left. The thrust reduction occurred a few seconds later. The left main gear touched the runway first at an indicated airspeed of 148 kt, while the aircraft was 12 m to the left of the runway centreline. The aircraft moved 7 m to the left, rolling on the only left main gear for about two seconds. The PF used the control column and the rudder pedals to steer the airplane to the right. The right main gear touched the runway while the left wheels were about 3 m from the edge of the runway. The PF corrected the trajectory using the rudders, without using the full amplitude. The aircraft exited the runway on the left at a speed of 133 kt. The nose gear struck the concrete support of a light and broke. The right gear was damaged and the aircraft rolled approximately 400 m off the runway and came to rest near the runway, 1150 m from the threshold.", "probable_cause": "The pilot flying experienced wind rotation below decision altitude without being aware of the crosswind corrections to be made during the flare. He did not have the necessary availability to analyse the reasons for the destabilisation in the short final. Without communication within the crew, the PF acted alone, with few external markers and found himself overloaded during touchdown. The slope of the runway also limited the forward visibility of the pilots."}