{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61p-aerostar-ted-smith-601p-philadelphia", "date": "Jan 16, 2012 at 1242 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "M & H Ventures", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Philadelphia – Meridian", "msn": "61-0427-157", "yom": 1977, "flight_number": null, "city": "Philadelphia", "zone": "Mississippi", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6200, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2857, "circumstances": "On the day of the accident, a mechanic taxied the airplane onto the runway and performed a full power check of both engines, exercised both propellers, and checked each magneto drop with no discrepancies reported. Following the engine run, the mechanic taxied the airplane to the fuel ramp where the fuselage fuel tank was filled; after fueling, the fuselage tank had 41.5 gallons of usable fuel. The mechanic then taxied the airplane to the ramp where the engines were secured and the fuel selector switches were placed to the off position. The mechanic reported that, at that time, the left fuel tank had 4 to 5 gallons of fuel, while the right fuel tank had about 2 to 3 gallons of fuel; the unusable fuel amount for each wing tank is 3 gallons. The pilot taxied the airplane to the approach end of runway 18 and was heard to apply takeoff power. A pilot-rated witness noted that, at the point of rotation, the airplane pitched up fairly quickly to about 20 degrees and rolled left to about 10 to 15 degrees of bank. The airplane continued rolling left to an inverted position and impacted the ground in a 40 degree nose-low attitude. A postcrash fire consumed most of the cockpit, cabin, both wings, and aft fuselage, including the vertical stabilizer, rudder, and fuselage fuel tank. Postaccident inspection of the flight controls, which were extensively damaged by impact and fire, revealed no evidence of preimpact failure or malfunction. Although the flap actuators were noted to be asymmetrically extended and no witness marks were noted to confirm the flap position, a restrictor is located at each cylinder’s downline port by design to prevent a rapid asymmetric condition. Therefore, it is likely that the flap actuators changed positions following impact and loss of hydraulic system pressure and did not contribute to the left roll that preceded the accident. Examination of the engines and propellers revealed no evidence of preimpact failure or malfunction that would have precluded normal operation. Postaccident examination of the fuselage fuel sump revealed the left fuel selector was in the crossfeed position, while the right fuel selector was likely positioned to the on position. (The as-found positions of the fuel selector knobs were unreliable due to postaccident damage.) The starting engines checklist indicates that the pilot is to move both fuel selectors from the on position to the crossfeed position, and back to the on position while listening for valve actuation/movement. The before takeoff checklist indicates that the pilot is to verify that the selectors are in the on position. Although the left engine servo fuel injector did not meet flow tests during the postaccident investigation, this was attributed to postaccident heat damage. Calculations to determine engine rpm based on ground scars revealed that the left engine was operating just above idle, and the right engine was operating about 1,315 rpm, which is consistent with a left engine loss of power and the pilot reducing power on the right engine during the in-flight loss of control. Examination of both propellers determined that neither was feathered at impact. Although the as-found position of the left fuel selector knob could be considered unreliable because of impact damage during the accident sequence, given that right wing fuel tank had no usable fuel, it is unlikely that the experienced pilot would have moved the left fuel selector to the crossfeed position in response to the engine power loss. It is more likely that the pilot failed to return the left fuel selector to the on position during the starting engines checklist and also failed to verify its position during the before takeoff checklist; thus, the left engine was being fed only from the right fuel tank, which had very little fuel. There was likely enough fuel in the right tank and lines for the pilot to taxi and takeoff before the left engine failed, causing the airplane to turn to the left, from which the pilot did not recover. ", "probable_cause": "The pilot’s failure to maintain directional control during takeoff following loss of power to the left engine due to fuel starvation. Contributing to the loss of control was the pilot’s failure to feather the left propeller following the loss of left engine power."}