{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-rockford-1-killed", "date": "Aug 20, 2020 at 1542 LT", "type": "Beechcraft 200 Super King Air", "operator": "Bomac air", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Rockford - DuPage", "msn": "BB-1198", "yom": 1984, "flight_number": null, "city": "Rockford-Greater Rockford", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3650, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8018, "circumstances": "On August 20, 2020, about 1542 central daylight time, a Beech B200 airplane (marketed as a King Air 200), N198DM, was destroyed when it was involved in an accident near Rockford, Illinois. The private pilot was fatally injured. The airplane was operated as a Title 14 Code of Federal Regulations (CFR) Part 91 positioning flight. The purpose of the flight was to relocate the airplane to the pilot's home base at the DuPage Airport (DPA), West Chicago, Illinois. The airplane had been at Chronos Aviation, LLC (a 14 CFR Part 145 repair station), at the Rockford International Airport (RFD), Rockford, Illinois, for maintenance work. Multiple airport-based cameras recorded the accident sequence. The videos showed the airplane taking off from runway 19. Shortly after liftoff, the airplane started turning left, and the airplane developed a large left bank angle as it was turning. The airplane departed the runway to the left and impacted the ground. During the impact sequence, an explosion occurred, and there was a postimpact fire. A video study estimated the airplane’s maximum groundspeed during the takeoff as 105.5 knots (kts). Data recovered from an Appareo Stratus device onboard the airplane showed that about 1538, the airplane began taxing to runway 19. At 1540:34, the airplane crossed the hold short line for runway 19. At 1541:19, the airplane began a takeoff roll on runway 19. At 1541:42, the airplane began to depart the runway centerline to the left of the runway. Subsequent tracklog points showed the airplane gaining some altitude, and the tracklog terminated adjacent to a taxiway in a grassy area. The Appareo Stratus data showed the airplane began to increase groundspeed on a true heading of roughly 185° about 1541. Airplane pitch began to increase at 1541:41 as the groundspeed reached about 104 kts. The groundspeed increased to 107 kts within the next 2 seconds, and the pitch angle reached around 4° nose-up at this time. In the next few seconds, pitch lowered to around 0° as the groundspeed decayed to around 98 kts. The pitch then became 15° nose-up as the groundspeed continued to decay to about 95 kts. A right roll occurred of about 13° and changed to a rapidly increasing left roll over the next 5 seconds. The left roll reached a maximum of about 86° left as the pitch angle increasingly became negative (the airplane nosed down). The pitch angle reached a maximum nose down condition of -73°. The data became invalid after 1541:53.4. An airplane performance study based on the Appareo Stratus data showed that during the takeoff from runway 19, the airplane accelerated to a groundspeed of 98 kts and an airspeed of 105 kts before rotating and lifting off. The airplane pitched up, climbed, and gained height above the ground. Then, 4 seconds after rotation, the airplane began descending and slowing, consistent with a loss of power. A nose-left sideslip, a left side force, and a left roll were recorded, consistent with the loss or reduction in thrust of the left engine. The sideslip was reduced, likely due to opposite rudder input, and the airplane briefly rolled right. The airplane pitched up and was able to begin climbing again; however, it continued to lose speed. The sideslip then reversed, and the airplane rolled left again and impacted the ground. One witness reported that he observed the accident sequence. He did not hear any abnormal engine noises, nor did he see any smoke or flames emit from the airplane before impact. The airplane came to rest on a flat grass field to the east of runway 19 on airport property. The airplane sustained fire damage and was fragmented from impacting terrain.", "probable_cause": "The pilot’s failure to maintain airplane control following a reduction of thrust in the left engine during takeoff. The reason for the reduction in thrust could not be determined based on the available evidence."}