{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-near-dabady", "date": "Jun 9, 2019 at 1624 LT", "type": "PZL-Mielec AN-2", "operator": "Feniks", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "Yes", "site": "Mountains", "schedule": "Kyren - Kyren", "msn": "1G208-19", "yom": 1984, "flight_number": null, "city": "Dabady", "zone": "Irkutsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6921, "captain_hours_type": 6912, "copilot_hours": 3561, "copilot_hours_type": null, "aircraft_hours": 3720, "circumstances": "The crew departed Kyren Airport on a crop spraying mission to treat forests. About 40 minutes into the flight, while flying at a speed of 140 km/h, the crew encountered downdrafts and the airplane lost height. Due to mountainous terrain, the crew made a turn to the right but the airplane continued to descend. The captain attempted an emergency landing when, at a speed of 85 km/h, the aircraft struck trees and crashed in a wooded area located 16 km southeast of Dabady. Both pilots were injured and evacuated to Irkutsk a day later. The aircraft was damaged beyond repair. ", "probable_cause": "Most likely, the reason for the accident with the An-2 RA-81519 aircraft was the execution by the flight crew along the route in the mountainous terrain to the area of ​​the AHR at an altitude not ensuring its safety, which did not allow crossing the mountain pass, led to the need to perform an emergency landing and damage to the aircraft.\r\nThe contributing factors were most likely:\r\n- Non-consideration by the crew of a significant increase of the outside air temperature during the day,\r\n- The crew did not set the altimeter properly,\r\n- Lack of instrument control over the flight altitude,\r\n- Downdraft air currents on the leeward side of the mountain slope;\r\n- Operating fatigue, leading to a weakening of attention and a decrease in level of situational awareness."}