{"url": "https://www.baaa-acro.com/crash/crash-mbb-hfb-320-hansa-jet-chesterfield-2-killed", "date": "Nov 30, 2004 at 1956 LT", "type": "MBB HFB-320 Hansa Jet", "operator": "Grand%20Aire_0", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chesterfield – Toledo", "msn": "1037", "yom": 1969, "flight_number": "GAE604", "city": "Chesterfield-Spirit of St Louis", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 11500, "captain_hours_type": 2500, "copilot_hours": 10377, "copilot_hours_type": null, "aircraft_hours": 6875, "circumstances": "The Hansa 320, a corporate turbojet airplane departed runway 26L at night on a maintenance ferry flight at 1954 central standard time, and was destroyed when it impacted a river two miles west of the departure airport. Radar track data indicated that the airplane climbed to about 900 feet msl at about 180 knots before it began losing altitude and impacted the river. The current weather was: winds 270 degrees at 13 knots gusting to 19 knots, visibility 7 miles, light rain, 1,000 feet scattered ceiling, 1,800 feet broken, 2,400 feet overcast, temperature 2 degrees Celsius (C), dew point 2 degrees C, altimeter 29.90. The FAA had issued the pilot a Special Flight Permit for the flight. The limitations listed in the flight permit included the following limitations: Limitation number 6 stipulated, \"IFR in VMC conditions approved, provided all equipment required for IFR flight is operational and certified iaw 14 CFR Part 91.413. If this equipment is NOT certified and operational, then VFR in VMC conditions ONLY.\" The ferry permit listed, \"Additional Limitations: Engine power assurance runs, compass swing, and functional check of avionics equipment must be performed, and appropriate maintenance entries in the aircraft log prior to departure.\" The pilot was informed that none of the additional limitations had been performed prior to takeoff. The pilot had aborted a previous takeoff at about 1830 due to no airspeed indications. At the request of the pilot, maintenance personnel disconnected the lines to the pitot tubes and blew out the tubes, but no leak check, as required by FAR 91.411, was performed prior to the accident flight. The pilot performed a high-speed taxi to test the airspeed indicators prior to takeoff. The copilot did not have any ground school or flight time in a Hansa 320. The second-in-command requirements stated in FAR 61.55 9 (f) (1), required that the flight be conducted under day VFR or day IFR. The Toxicology report for the pilot indicated that 0.106 (ug/ml, ug/g) Diphenhydramine was detected in the blood. Diphenhydramine is an antihistamine commonly used in over-the-counter cold/allergy preparations. In therapeutic doses, the medication commonly results in drowsiness, and has measurable effects on performance of complex cognitive and motor tasks (e.g. flying an aircraft). The pilot's currency in the Hansa 320 expired on November 30, 2004, the day of the accident. He would be required to have an FAA checkride in a Hansa 320 to be a pilot-in-command (PIC) after November 30th. Engine teardown inspections revealed that both engines were developing power at the time of impact. The inspection of the elevator trim  system revealed that the elevator trim cables were improperly installed when they were replaced to comply with an Airworthiness Directive (AD) 224-01-11. The maintenance manager who inspected the installation of the elevator trim cables did not perform an operational check of the elevator trim tabs. The maintenance manager signed the aircraft log stating the \"Aircraft is approved for one time ferry flight from SUS to TOL,\" although all stipulations of the ferry permit had not been met, and that a leak check of the pitot-static system had not been performed after the pitot tubes had been blown out.", "probable_cause": "The maintenance facility failed to properly install and inspect the elevator trim system resulting in the reversed elevator trim condition and the pilot's failure to maintain clearance with the terrain. Contributing factors included the dark night and low ceiling."}