{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-500-ronne", "date": "Dec 27, 1969 at 1555 LT", "type": "Fokker F27 Friendship", "operator": "Maersk%20Air.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rønne - Rønne", "msn": "10426", "yom": 1969, "flight_number": null, "city": "Rønne (Bornholm Island)", "zone": "Hovedstaden", "country": "Denmark", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 47, "circumstances": "As part of the transition training of the company pilots, Maersk Air had scheduled training flights on the Fokker F27. An instructor captain of Fokker Aircraft was on board, along with three trainee pilots. The aircraft took off from Copenhagen Airport at 15:00 hours and climbed to FL70, heading for Rønne Airport on the island of Bornholm. Two normal touch and go landings on runway 29 using the ILS were made after arrival at Rønne. The third approach and landing was to take place with a simulated engine failure on the right engine. After the second touch and go the aircraft was cleared to 2000 ft. The instructor briefed the trainee on the single engine approach that was about to be carried out while the aircraft was inbound, including the fact that after landing it was intended to take-off again immediately using both engines, but that an engine failure would be simulated again when the speed had built up to between V1 and V2. At a time when the aircraft was just about to pass over, or had just passed over the NDB, the instructor reduced the power of the right engine to a torque pressure of about 50 psi - equal to zero thrust. The trainee flew an approach and the aircraft made a normal landing. After touch down the instructor selected l6,5° flaps, re-trimmed the aircraft and asked for take-off to be made at 85 kt. The trainee applied power to both engines, released the throttles at V1 , pulled the aircraft into the air and ordered \"gear up\". The gear came up as the instructor cut the left engine. The trainee established a climb of 9° on the flight director but as the speed reached 97 kt., and he wished to hold V2 until 400 ft was reached, he pulled backwards slightly on the control column. The speed began to drop and at one point the instructor called out \"watch your speed\". However, according to the pilots, the speed dropped to 88-89 kt. and the aircraft began to roll to the left. At this time the height was about 100 ft. The trainee counteracted the left roll with the ailerons but the aircraft continued past the horizontal into a roll to the right. According to the trainee's statement this happened a couple of times during which he counteracted the rolls with large movements of the ailerons. He thinks that the speed was about 90 kt. and he stated that he was unable to control the aircraft. Neither of the pilots noticed the vertical speed indicator but at a time which the pupil estimated was when the aircraft began to lose height as he was able to see the trees or the ground at the end of the runway, the instructor took over the piloting of the aircraft by taking hold of the control column and applied full power to the left engine. However, the aircraft continued to sink in spite of the fact that the speed was still 90 kt. A shock was felt in the aircraft when it hit some bushes and the ground about 270 metres west of the end of the runway on the slope down to the sea. The instructor realized that it would not be possible to regain control of the aircraft even before the left engine had managed to develop full power. He therefore pulled both throttles back and the aircraft then crashed onto the stony beach at the edge of the water at the bottom of the slope. The aircraft broke into several sections before coming to rest in about 1,5 - 2 metres of water about 90 metres from the first point of contact.", "probable_cause": "During take-off followed by a simulated engine failure the aircraft was brought into a situation which permitted only a limited climb ability, if any. In order to reduce the speed, the pupil attempted such a rate of climb that the airspeed fell below that desired, causing the aircraft to stall or at least to be in a condition approaching the stall. The reason why the stall developed into an accident was that the instructor did not identify the situation as dangerous quickly enough and initiate the action necessary."}