{"url": "https://www.baaa-acro.com/crash/crash-cessna-207a-stationair-7-near-jabiru", "date": "Jan 7, 1991 at 1523 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Jabiru - Jabiru", "msn": "207-0439", "yom": 1978, "flight_number": null, "city": "Jabiru", "zone": "Northern Territory", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was nearing the completion of a scenic flight, maintaining about 800 feet above ground level, when the engine power reduced to 20 inches hg manifold pressure. The engine continued to run smoothly but failed to respond when the pilot advanced the throttle. All other means attempted by the pilot to restore the lost power were unsuccessful. The aircraft, which had a full compliment of persons on board, was too heavy to maintain height under these conditions. As it was flying over forest the pilot turned the aircraft towards the south-west where a more favourable open area, with a road and an airstrip, was available. This entailed having to cross an escarpment, but due to the aircraft's rate of descent insufficient height remained, committing the pilot to a forced landing in an unsuitable area. The pilot transmitted a distress call, gave the passengers a thorough briefing and prepared the aircraft for the forced landing. The aircraft was slowed down and allowed to sink slowly into the forest, contacting the first tree about seven metres above ground level. It then continued through the trees for 40 metres before coming to rest inverted on the forest floor. All passengers evacuated from the aircraft and were rescued by a helicopter which had responded to the distress call.", "probable_cause": " Inspection of the engine determined that it was capable of developing full power at the time of the accident. The throttle cable was found to have separated from the cast bronze throttle control lever at the fuel/air metering unit on the intake manifold. The serrated steel bush in the throttle control lever at the cable attachment had become loose, causing the hole to wear elongated which reduced the edge distance from the hole to the end of the control lever sufficiently for it to fail when the throttle was opened. This probably occurred during the last takeoff. During flight, the bush, which was still attached to the cable ball end by the bolt, was probably in such a position as to operate the lever when the throttle control was moved to reduce power for climb and cruise. As the flight progressed and the cable separated from the lever, in-flight movement and vibration would have moved the throttle towards the closed position, with the subsequent reduction in power. Further inspection found that the assembly of the cable to the lever was incorrect, with the washer from under the bolt head being omitted. This reduced the bearing area at the bolt head to the control lever, with the possibility that the bolt may have only been clamped to the bush assisting any movement of the bush in the lever. Once the steel bush started moving in the softer bronze material the rate of wear would have been rapid. The aircraft had flown 85 hours since the last periodic inspection, at which time it may have been possible to detect the first signs of wear between the bush and the control lever if information advising of this type of fault had been available. \r\nThe following factors were considered relevant to the development of the accident:\r\n- Incorrect assembly of the washers on the control cable attachment bolt may have allowed the bush to start moving in the lever.\r\n- The bush became loose in the control lever, with the subsequent wear elongating the hole allowing the control lever end to fail.\r\n- The throttle control cable separated from the throttle control lever.\r\n- The throttle closed sufficiently during flight to reduce engine power.\r\n- The aircraft was too heavy to maintain flight.\r\n- The aircraft was operating over an area unsuitable for a forced landing.\r\n- Wear between the bush and the lever may have been detectable during the previous periodic inspection if advisory information had been available. "}