{"url": "https://www.baaa-acro.com/crash/crash-martin-202-almelund-6-killed", "date": "Oct 13, 1950 at 1049 LT", "type": "Martin 202", "operator": "Northwest%20Airlines2", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Minneapolis - Minneapolis", "msn": "9158", "yom": 1947, "flight_number": null, "city": "Almelund", "zone": "Minnesota", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 9800, "captain_hours_type": 769, "copilot_hours": 8228, "copilot_hours_type": 368, "aircraft_hours": 5289, "circumstances": "Northwest Airlines' NC93037 departed from the Minneapolis- St Paul International Airport at 0946LT on a local flight. The purpose of the flight was a six-month instrument competency check of Captain John R. Galt under the supervision of Captain Ray Render, a company cheek pilot. Also on board and listed as official observers were William H Solomon, CAA air carrier agent, who was sitting on the jump seat between and immediately behind the pilots' seats, and CAA personnel from the Minneapolis Control Tower, E. Bergstrom, R. Olsen and B. Erickson, who were sitting in the main cabin. At the time of takeoff there were 800 gallons of fuel on board which resulted in a total aircraft weight of 32,943 pounds. This weight was within the allowable limit of 38,000 pounds and the aircraft was properly loaded. The weather was clear and visibility was unlimited. Following takeoff, two simulated US (Instrument landing system) approaches were made to the airport and at 1025LT the crew radioed the control tower that this phase of the check flight was completed. This was the last known contact with the flight. After departing the Minneapolis area, the aircraft was first seen near Center City, Minnesota, 43 miles northwest of Minneapolis. At this time it was making a steep left turn at an altitude estimated to he between 4,000 and 5,000 feet, and landing gear was down. At the completion of this turn a shallow climb was started. Throughout these maneuvers the engines sounded as if they were operating in a normal manner. The attention of the ground witness was then diverted for a few moments, and when he again saw the aircraft it was in a partially inverted position and starting a steep dive. After losing approximately 2,500 feet in the dive, an apparently normal recovery was made to a level flight attitude and the aircraft proceeded in a northeasterly direction. Shortly thereafter it was seen to make two or three pitching oscillations about its lateral axis. These maneuvers may he described as a series of steps made by the aircraft as it was being lowered abruptly, followed by a recovery to level flight. During each oscillation approximately 400 feet in altitude was lost and a noise was heard such as is usually associated with a surge of engine power. The aircraft continued on a northeast heading. Two miles south of Almelund, Minnesota, which is 14 miles northeast of Center City, the aircraft was seen to make a shallow right turn of approximately 270 degrees and once more to return to a level attitude heading in a northwesterly direction. Throughout the above-mentioned maneuvers, the aircraft was gradually losing altitude, and the right propeller was observed to be turning slowly during the latter part of the flight. Nearing Almelund and at an altitude of approximately 500 or 600 feet above the ground, a steep right turn was begun. Altitude was lost rapidly and after turning approximately 90 degrees, the aircraft's right wing struck the ground. All but one of the six occupants were killed at impact, the injured person died several days later without regaining consciousness. The aircraft was demolished.", "probable_cause": "The Board determines that the probable cause of this accident was the unwanted reversal of the right propeller during flight, as a result of which the crew was unable to maintain control of the aircraft. The following findings were reported: \r\n- The fuel feed valve of the right engine malfunctioned when tested,\r\n- The right propeller was found in 7 degrees to 10 degrees of reverse thrust,\r\n- A review of the evidence of a similar occurrence indicated that with a propeller in the reverse thrust position the aircraft would assume dangerous flight characteristics,\r\n- The fact that the aircraft's wing flaps were retracted may have contributed to the uncontrollability of the aircraft at speeds below 140 miles per hour."}