{"url": "https://www.baaa-acro.com/crash/crash-cessna-401a-fulton", "date": "Nov 17, 2014 at 1720 LT", "type": "Cessna 401", "operator": "Heartland Air", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fulton – Little Rock", "msn": "401A-0085", "yom": 1969, "flight_number": null, "city": "Fulton", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2949, "captain_hours_type": 304, "copilot_hours": 8675, "copilot_hours_type": 1850, "aircraft_hours": 6434, "circumstances": "The private pilot reported that, immediately after takeoff in the multi-engine airplane, the right engine experienced a total loss of power. The pilot aborted the takeoff; the airplane exited the end of the runway surface, impacted rough terrain, and came to rest upright. Examination of the right engine showed that the magneto distributor drive gears were not turning. Both damaged magnetos were removed and replaced with a slave set of magnetos. The right engine was installed in an engine test cell, and subsequently started and performed normally throughout the test cell procedure. The damaged magnetos from the right engine were disassembled. Both nylon magneto distributor gears exhibited missing gear teeth and brown discoloration. A review of maintenance records showed that the right engine had been operated for about 8 years and an estimated 697 hours since the most recent magneto overhauls had been completed. According to maintenance instructions from the engine manufacturer, the magnetos should be inspected every 500 hours and should be overhauled or replaced at the expiration of five years since the last overhaul. Guidance also indicated that discoloration of the drive gear is an indication that the gear had been exposed to extreme heat and should be replaced.", "probable_cause": "A failure of the right engine magneto distributor drive gears, which resulted in a total loss of engine power during takeoff. Contributing to the accident was the operator's failure to inspect and maintain the magnetos in accordance with the engine manufacturer's specifications. "}