{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-310-maadhiggaru-falhu-lagoon", "date": "Jul 11, 2011 at 0910 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Trans%20Maldivian%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Male - Male", "msn": "530", "yom": 1977, "flight_number": "TMW201A", "city": "Maadhiggaru Falhu", "zone": "North Central Province", "country": "Maldivian Islands", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5732, "captain_hours_type": 3387, "copilot_hours": 2650, "copilot_hours_type": 2650, "aircraft_hours": 34746, "circumstances": "The 8Q-TMD aircraft took-off from water runway of Male’ International Airport North Bound Left (NL) at 0820 hrs local time on 11 July 2011 for a routine training flight bound to Maadhiggaru Falhu (a lagoon located approximately 15 nautical miles south west of the Male’ International Airport). The sky was clear with good visibility and wind 8-10 knots from west and south west. During the training 5 landings and take-offs were made simulating different conditions of flight. Crew confirmed that all these landings and take-offs were made inside the lagoon except the last landing where the crew decided to land on open water outside the lagoon. Crew were simulating single engine landing with a tail wind. As per the crew, the aircraft initial touch down was smooth. However, they stroke a wave which made the aircraft bounce up for about 20 feet. With the low power the aircraft hit the water again, resulting in multiple float attachments to break. Both front and main spreader bars broke and floats rose up twisted, hitting the engine bottom cowlings. Propeller cut was found on top front of both floats.", "probable_cause": "Impact with a high swell during landing followed by a high bounce and hard landing resulting in both float attachments being damaged and detached with a major structural damages. Major contributing factor was higher than normal touch down speed due to abnormal landing configuration.\r\nContributing factors: \r\n- Selection of inappropriate landing site (channel) and landing direction (tail wind) based on surface conditions present at that time, \r\n- Simulation of multiple emergencies,\r\n- Abnormal landing configuration (flaps at zero) for single engine landing, \r\n- Time pressure to complete the training and return to commercial operations."}