{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900d-kathmandu-19-killed", "date": "Sep 25, 2011 at 0731 LT", "type": "Beechcraft 1900D", "operator": "Buddha%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kathmandu - Kathmandu", "msn": "UE-295", "yom": 1997, "flight_number": "BHA103", "city": "Kathmandu-Tribhuvan", "zone": "Bagmati", "country": "Nepal", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 16, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 19, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": 18, "aircraft_hours": null, "circumstances": "The aircraft was performing a special flight with tourists above the Himalayan mountains and especially a tour of the Everest in the early morning. While returning to Kathmandu-Tribhuvan Airport, the copilot (PIC) was cleared to descend to 6,000 feet for a landing on runway 02. In marginal weather conditions, he passed below 6,000 feet until the aircraft contacted trees and crashed in hilly and wooded terrain located near the village of Bishanku Narayan, some 6,7 km southeast of the airport. The aircraft was destroyed by impact forces and a post crash fire. A passenger was seriously injured while 18 other occupants were killed. Few hours later, the only survivor died from his injuries. The 16 tourists were respectively 10 Indians, 2 Americans, 1 Japanese and 3 Nepalese. ", "probable_cause": "The Accident Investigation Commission assigned by Nepal's Ministry of Tourism and Civil Aviation have submitted their report to the Ministry. The investigators said in a media briefing, that human factors, mainly fatigue by the captain of the flight, led to the crash. The aircraft was flown by the first officer and was on approach to Kathmandu at 5,000 feet MSL instead of 6,000 feet MSL as required, when it entered a cloud. While inside the cloud in low visibility the aircraft descended, hit tree tops and broke up. The captain had flown another aircraft the previous day and had been assigned to the accident flight on short notice in the morning of the accident day, but did not have sufficient rest. The commission analyzed that due to the resulting fatigue the captain assigned pilot flying duties to the first officer although she wasn't yet ready to cope with the task in demanding conditions. The newly assigned first officer had only 18 hours experience on the aircraft type. The mountain view round trip had to turn back about midway due to weather conditions. While on a visual approach to Kathmandu at 5,000 instead of 6,000 feet MSL the aircraft entered a cloud and started to descend until impact with tree tops. The crew did not follow standard operating procedures, that amongst other details required the aircraft to fly at or above 6,000 feet MSL in the accident area, the interaction between the crew members did not follow standard operating procedures, for example the captain distracted the first officer with frequent advice instead of explaining the/adhering to procedures. The commission said as result of the investigation they released a safety recommendation requiring all operators to install Terrain Awareness and Warning Systems (TAWS) in addition to eight other safety recommendations regarding pilot training, installation of visual aids, safety audit and fleet policies."}