{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hp70-halifax-viii-near-saint-asaph-4-killed", "date": "Dec 5, 1947 at 1636 LT", "type": "Handley Page H.P.70 Halifax VIII", "operator": "Lancashire%20Aircraft%20Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Lille – Liverpool", "msn": "1306", "yom": 1946, "flight_number": null, "city": "Saint Asaph", "zone": "Denbighshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While at Lille 6,380 kg (96 bales) of fabric was loaded onto the aircraft, this was described in contemporary newspaper reports as being woolen piece goods. Once this was complete their flight plan was submitted to the Lille controller, it was a direct flight back to Speke, and they received a weather briefing for the planned route. This indicated that there would be dense cloud layers from 1000 feet upwards on the entire route with some rain. The wind as far as the London area was forecast to be from the Southwest at 35 to 40 knots and from the Northwest beyond there at a similar speed. The estimated flight time was 1 hour 30 minutes. The aircraft departed Lille at 14:38 GMT and made contact with the regional control at Uxbridge at 15:06, they reported that they had flown over the French coast in the Dunkerque area at 14:46. At around 15:15 they were over the east coast of England between Ipswich and Colchester, they were already someway off course due to the strong wind and this was confirmed with a position fix at 15:35 which put the aircraft over the fens in the Ely area. Had they not had the strong cross wind their intended track at this point would have taken them over Bedford. Upon confirming how far off course they were the pilot adopted a more westerly course and asked Uxbridge if he should contact the Manchester area control at Ringway, they replied yes. By around 16:00 to 16:05 was more or less back on the right course in the Stafford area. The crew never made contact with Ringway, their call-sign was heard at 15:59 but another aircraft was communicating with Ringway at the time. Once this transmission was completed the Ringway controller attempted to contact G-AIHU twice but failed to get a response, the crew had in fact made contact directly with the approach controller at Speke around the time of the second attempt by Ringway. This was to request a QTE (true bearing) from Speke, this was passed as 1340. At 16:10 the Speke controller asked the crew what their ETA was and they replied 16:20, three minutes later he gave the crew permission to enter the controlled airspace around Speke and circle the airfield. They were instructed to report when they had descended to 2,000 ft and reply by R/T (Radio Telephony) to the Aerodrome Controller, up to this point they had been communicating by morse (Wireless Telegraphy). No communication was received from them by R/T and after dealing with other aircraft the approach controller managed to re-establish contact at 16:28 by W/T. The crew reported in plain language \"unable to raise 6440 - landing instructions?\", they also requested a QDM (magnetic course to steer) at 16:32, this and the landing instructions were transmitted, the QDM was 0900 which put the aircraft to the west of Speke. The landing instructions were \"QHG QHE2 QGP1 QFM 1000 ft\" which translated as \"you are cleared to enter the traffic circuit, inform me when you are on the down wind leg, your turn for landing is No.1, maintain (or fly at) an altitude of 1000 ft\". The approach controller contacted the aircraft again at 16:35 to ask for their position and ETA, the receipt of this was acknowledged but no reply was ever received. Shortly after this the aircraft struck the trees on the top of Cwm Mountain at a recorded height of 998 feet above sea level and broke up. The wreckage was spread along a magnetic bearing of 0850 for some 400 yards. The aircraft had been flying with the flaps and undercarriage in the up position. All four crew members were killed. The AIB investigation revealed that the aircraft had over flown the airfield at Hooton Park near Ellesmere Port in a North Westerly direction at an estimated altitude of 400 to 450 feet at 16:15 and was next witnessed crossing the Welsh coast heading South West near Prestatyn at 16:30. At around the time the crew received the QDM of 090o the aircraft was heard by an Army officer in low cloud to the west of St Asaph heading East.\r\nCrew:\r\nJohn Hale Parsonage, pilot,\r\nJohn Driver, copilot, \r\nAllan Brook, navigator, \r\nJohn E. Evans, radio operator.\r\nSource: \r\nhttp://www.peakdistrictaircrashes.co.uk/pages/wales/walesg-aihu.htm", "probable_cause": null}