{"url": "https://www.baaa-acro.com/crash/crash-canadair-c-4-argonaut-manchester-72-killed", "date": "Jun 4, 1967 at 0909 LT", "type": "Canadair C-4 North Star", "operator": "British%20Midland%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "City", "schedule": "Palma de Majorca - Manchester", "msn": "153", "yom": 1949, "flight_number": null, "city": "Manchester-Ringway", "zone": "Great Manchester", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 3, "pax_on_board": 79, "pax_fatalities": 69, "other_fatalities": 0, "total_fatalities": 72, "captain_hours": 10197, "captain_hours_type": 2009, "copilot_hours": 1001, "copilot_hours_type": 136, "aircraft_hours": null, "circumstances": "The aircraft was on a non-scheduled international flight from Manchester to Palma and return. It landed at Palma at 0220 hours GMT, was refuelled and took off for Manchester at 0406 hours GMT. The co-pilot was flying the aircraft from the right-hand seat and the flight was uneventful - between 0856 hours and 0900 hours the aircraft was descending for approach and landing and was being vectored towards the ILS localizer. At 0901:30 hours the flight was informed that it was 9 miles from touchdown and well left of the centre line and it was asked if it was receiving the ILS. The pilot-in-command replied that he was and would turn right a little. Shortly thereafter one engine, most probably No. 4, ceased to deliver power, followed some 15 seconds later by the other engine on the same side. The pilot-in-command took over the controls and just after 0903 hours the Controller told the flight that it was 6 miles from touchdown and asked if it was established on the ILS localizer. This message was not acknowledged by the flight and 7 seconds later the Controller asked if it was still receiving. The pilot-in-command then replied \"Hotel Golf is overshooting, we've got a little bit of trouble with rpm\". The aircraft's indicated air speed was then only 116 kt and its height 1 838 ft AMSL. The Controller then ordered the pilot-in-command to turn left on to 160'~ and climb to 2 500 ft QNH. He then asked the reason for overshooting and was told \"We've a little bit of trouble with rpm, will advise you\". At 0903:51 hours the pilot-in-command asked what the left turn was on to. The Controller noted that the aircraft had already turned through 25' to the right instead of to the left, so he ordered the pilot to continue turning right on to 020' and climb to 2 500 ft on QNH. This was acknowledged by the co-pilot. At 0904:41 hours the Controller asked the flight to advise when ready to recommence the approach. By this time the aircraft's IAS had dropped to 111 kt, its height to 1 287 ft ONH, and it had broken cloud and was seen by an eyewitness. Thereafter it flew below cloud in conditions of reasonable visibility. At 0905:26 hours the Controller told the flight that it was 7 miles from the airfield on a bearing of 040' and requested its height. The flight reported at 1 000 ft. This was the first indication to the Controller that the aircraft was faced with an emergency and after checking that the height given was correct he put full emergency procedure into operation at the airfield and ordered the aircraft to turn right on to 180 M, so that it would close the ILS localizer. At 0905:47 hoursthe Controller asked the flight if it could maintain height. The pilot-in-command now at 981 ft AMSL and only some 800 ft above the ground replied \"just about\". He was told he was 8 miles from touchdown and should continue his right turn on to 200% and maintain as much height as possible. At this point 341 ft of height were lost in 10 seconds after the IAS had fallen to 100 kt and the pilot-in-command said he was not able to maintain height at the moment. The Controller told him that he was 8 miles from touchdown and closing the ILS localizer from the right. At 0907:09 hours, the Controller informed the flight that radar contact had been lost due to the aircraft's low height and asked the pilot to adjust his heading on the ILS and report when established. The co-pilot replied that they had \"the lights to our right'' and were at 800 ft, just maintaining height, and the pilot-in- command asked for the emergency to be laid on. At 0907:35 hours the pilot-in-command requested his position and was told 7; miles to run to touchdown. Half a minute later the Controller repeated that he had no radar contact, and cleared the flight for landing, the surface wind being 270°/12 kt. At this stage the PAR Controller, who had overheard that the Approach Controller had lost radar contact, saw a contact at the bottom of his elevation display, and told the flight that it was 6 miles from touchdown. The co-pilot then gave their altitude as being 500 ft. The terrain clearance was only 300 ft and the IAS was below 105 kt and falling. The aircraft was approximately on the line of the ILS localizer and heading for the very centre of the built up area of Stockport. A few seconds after 0909 hours the aircraft struck the ground more or less level in pitch, slightly right wing down, and slightly yawed to the right. From the evidence of two eyewitnesses who saw the aircraft just before the crash it was clear the pilot-in-command deliberately cut the power very shortly before impact and deliberately put the aircraft down on what was the only pocket handkerchief of relatively open space available, immediately before tall blocks of flats, the town hall, the police station, and Stockport Infirmary. Three crew members and 69 passengers were killed while 12 other occupants were injured. ", "probable_cause": "The immediate cause of the accident was loss of power of both engines on the starboard side resulting in control problems which prevented the pilot from maintaining height on the available power with one propeller windmilling. The loss of power of the first engine was due to fuel starvation due to inadvertent fuel transfer in flight. The loss of power of the second engine was due either to fuel starvation resulting from inadvertent fuel transfer in flight or to misidentification by the crew of which engine had failed followed by failure to restore power in time to the engine misidentified as having failed. Contributory causes of the accident were: \r\n- The design of the fuel valves and location in the cockpit of their actuating levers, so that a failure by the pilot correctly to position the lever by an amount so small as to be easy to do and difficult to recognize would result in inadvertent fuel transfer on a scale sufficient to involve the risk after a long flight of a tank expected to contain sufficient fuel being in fact empty,\r\n- Failure of those responsible for the design of the fuel system or the fuel valves to warn users that failure by a small amount to place the actuating levers in the proper position would result in inadvertent fuel transfer on a scale involving this risk after a long flight,\r\n- Failure of British Midland's air crew or engineers to recognize the possibility of inadvertent fuel transfer in the air from the evidence available in previous incidents in flight and contained in the fuel logs,\r\n- Failure of other operators of Argonauts who had learned by experience of the possibility of inadvertent fuel transfer in flight to inform the Air Registration Board, the Directorate of Flight Safety of the Board of Trade or its predecessors, or the United Kingdom Flight Safety Committee of the facts which they had learned so that these might be communicated to other operators of Argonauts and other aircraft equipped with similar systems and fuel cocks."}