{"url": "https://www.baaa-acro.com/crash/crash-bleriot-155-romney-marsh-3-killed", "date": "Aug 18, 1926 at 1430 LT", "type": "Blériot 155", "operator": "Air-Union-France-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Paris - Croydon", "msn": "02", "yom": 1926, "flight_number": null, "city": "Ashford", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 13, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 47, "circumstances": "The aircraft departed Paris-Le Bourget Airport at 1240LT bound for Croydon with a crew of two and 13 passengers on board. The crew made a radio control arriving over the Channel and its overflight was uneventful. While reaching the British coast, the crew encountered poor weather conditions with heavy rain falls. Due to poor visibility, the pilot decided to make a precautionary landing in Romney Marsh but his altitude was too low.  The noise of all four engines suddenly ceased and the machine descended in a gliding turn to port as if the pilot was manoeuvring to land. When passing over some farm buildings on the borders of a large field, the four engines aircraft hit the roof of a barn and crashed into some hayricks. The pilot and two passengers were killed while 12 other occupants were injured, 10 seriously. \r\nCrew:\r\nPierre Delisle, pilot, †\r\nGabriel Ducos, mechanic.\r\nPassengers:\r\nR. Blaney, †\r\nH. Rizzi, †\r\nMr. R. McAdam, \r\nMr. S. Hazzard, \r\nMiss S. Hazzard, \r\nMiss H. Awes,\r\nMiss E. Fearn, \r\nMiss M. Varden,\r\nMiss V. Varden, \r\nMr. L. Stroh, \r\nMiss E. Bennett,\r\nLord Norreys, \r\nMrs. Grant.\n\r\nSource: Kent & Sussex History Forum", "probable_cause": "The wreckage of the aircraft showed evidence of both port wingtips being shattered by the collision with the tiled roof of the barn - it had carried away the top half of the hayrick and swung through 180° before coming to rest with the starboard wings crushed against another hayrick. The front of the fuselage was shattered and most of the starboard side of the passengers' cabin was broken outwards. No defects were found in the fuel system, mechanics or airframe, and the accident was put down to an error of judgement on the part of the pilot when manoeuvring to land owing to bad weather conditions."}