{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-428bcf-bagram-afb-7-killed", "date": "Apr 29, 2013 at 1527 LT", "type": "Boeing 747-400", "operator": "National%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Camp Bastion - Bagram AFB - Dubaï", "msn": "25630/960", "yom": 1993, "flight_number": "NCR102", "city": "Bagram AFB", "zone": "Parwan", "country": "Afghanistan", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 6000, "captain_hours_type": 440, "copilot_hours": 1100, "copilot_hours_type": 209, "aircraft_hours": null, "circumstances": "The aircraft crashed shortly after takeoff from Bagram Air Base, Bagram, Afghanistan. All seven crewmembers—the captain, first officer, loadmaster, augmented captain and first officer, and two mechanics—died, and the airplane was destroyed from impact forces and postcrash fire. The 14 Code of Federal Regulations Part 121 supplemental cargo flight, which was operated under a multimodal contract with the US Transportation Command, was destined for Dubai World Central - Al Maktoum International Airport, Dubai, United Arab Emirates. The airplane’s cargo included five mine-resistant ambush-protected (MRAP) vehicles secured onto pallets and shoring. Two vehicles were 12-ton MRAP all-terrain vehicles (M-ATVs) and three were 18-ton Cougars. The cargo represented the first time that National Airlines had attempted to transport five MRAP vehicles. These vehicles were considered a special cargo load because they could not be placed in unit load devices (ULDs) and restrained in the airplane using the locking capabilities of the airplane’s main deck cargo handling system. Instead, the vehicles were secured to centerline-loaded floating pallets and restrained to the airplane’s main deck using tie-down straps. During takeoff, the airplane immediately climbed steeply then descended in a manner consistent with an aerodynamic stall. The National Transportation Safety Board’s (NTSB) investigation found strong evidence that at least one of the MRAP vehicles (the rear M-ATV) moved aft into the tail section of the airplane, damaging hydraulic systems and horizontal stabilizer components such that it was impossible for the flight crew to regain pitch control of the airplane. The likely reason for the aft movement of the cargo was that it was not properly restrained. National Airlines’ procedures in its cargo operations manual not only omitted required, safety-critical restraint information from the airplane manufacturer (Boeing) and the manufacturer of the main deck cargo handling system (Telair, which held a supplemental type certificate [STC] for the system) but also contained incorrect and unsafe methods for restraining cargo that cannot be contained in ULDs. The procedures did not correctly specify which components in the cargo system (such as available seat tracks) were available for use as tie-down attach points, did not define individual tie-down allowable loads, and did not describe the effect of measured strap angle on the capability of the attach fittings.", "probable_cause": "The NTSB determines that the probable cause of this accident was National Airlines’ inadequate procedures for restraining special cargo loads, which resulted in the loadmaster’s\r\nimproper restraint of the cargo, which moved aft and damaged hydraulic systems No . 1 and 2 and horizontal stabilizer drive mechanism components, rendering the airplane uncontrollable. Contributing to the accident was the FAA’s inadequate oversight of National Airlines’ handling of special cargo loads."}