{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-melbourne-1-killed", "date": "Mar 30, 1978 at 0144 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Australian Air Charters", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Melbourne - Canberra", "msn": "31-7405196", "yom": 1974, "flight_number": null, "city": "Melbourne-Tullamarine", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 13017, "captain_hours_type": 1531, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was based at Moorabbin Airport and, late in foe afternoon of 29.3.78, it was refuelled and a pre-flight inspection was carried out. The pilot ferried it to Melbourne Airport just after midnight. While he was preparing and submitting a flight plan for the flight to Canberra and return, the aircraft was loaded with newspapers and a small quantity of other freight. On returning to the aircraft, the pilot checked the loading documents and the freight and made a walk around inspection of the exterior of the aircraft. The pilot started the aircraft engines and established radio communication with air traffic control at 0139 hours. He was given a taxi clearance and an airways clearance for departure from runway 34. Upon request, he was granted approval to commence take-off from the taxiway \"J\" intersection, some 800 metres from the southern end of the runway. He reported \"ready\" at 0143 hours and was immediately given a clearance for take-off. The aircraft commenced to take-off, became airborne and, when it was at a height of 100 to 200 feet above the intersection of the two runways, the pilot advised \"got a fire - fire in the ah starboard engine and ah doing a low circuit request two seven\". Air traffic control immediately replied \"make visual approach runway two seven clear to land\". Acknowledgement of this clearance was the last communication received from the aircraft. As the aircraft passed over the northern end of runway 34 it commenced a turn to the right and gradually descended. It struck the ground in a right wing down attitude on a track of 070° magnetic and an intense fire broke out. The accident site was 1.8 kilometres to the north-east, and 88 feet above the elevation, of the northern end of runway 34. At the time of the accident the surface wind was 330°/9 knots, the visibility was 25 km in passing showers, there was 3 oktas stratus cloud base 1800 feet and 6 oktas cumulus cloud base 3500 feet. It is probable that below 1000 feet there was some wind shear, downdrafts from passing showers and intermittent moderate turbulence. It has been calculated that the gross weight of the aircraft was some 65 kilograms in excess of the maximum take-off weight and the centre of gravity was within limits. A detailed examination of the wreckage of the aircraft revealed that the landing gear and flaps were fully retracted, the cowl flaps of both engines were midway between the open and closed positions a considerable degree of nose left rudder trim was selected, the right engine was closed down and the propeller feathered. It was established that, as a result of excessively lean mixture operation, there was a hole burned through the piston rings and into the side of the No. 2 piston of the right engine. There was no evidence of fire within the engine but it was apparent that the hole in the piston had resulted in pressurisation of the crankcase cavity, ejection of the oil dipstick and the consequent venting of oil from the dipstick orifice and the engine breather pipe on to the exterior of the exhaust pipes. The engine had the capacity to continue to produce a substantial amount of power for a limited period. The turbo-charger density controller of the left engine was found to be incorrectly adjusted to the extent that the engine could develop only about 330 BHP instead of 350 BHP of which it was normally capable.", "probable_cause": "The probable cause of the accident was that, believing there was an internal fire in the right engine, the pilot closed the engine down in circumstances where the single-engine performance capability of the aircraft proved to be insufficient to sustain continued flight."}