{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-12-novosibirsk-23-killed", "date": "Nov 17, 1951 at 1623 LT", "type": "Ilyushin II-12", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Novosibirsk – Moscow", "msn": "9 301 31 12", "yom": 21, "flight_number": null, "city": "Novosibirsk", "zone": "Novosibirsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 19, "pax_fatalities": 19, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2007, "circumstances": "Due to the arrival of additional passengers coming from Yakutsk, a second flight was organized from Novosibirsk to Moscow. Snow falls all day and about 15 mm of ice accumulated on all aircraft. During taxiing, an additional layer of 8 to 10 mm of snow accumulated on the airplane. The takeoff run was considered as normal and after rotation, the airplane climbed to a height of about 100 meters and then stalled and crashed in a huge explosion about 900 meters past the runway end. The aircraft was destroyed by impact forces and a post crash fire and all 23 occupants were killed. ", "probable_cause": "It was determined that the aircraft was covered by ice and snow and that the following areas were polluted and contaminated by ice and snow: leading edges, trailing edges, ailerons, wings, fuselage, tail and stabs. In such conditions, the aircraft was unable to climb in a safely manner. The following findings were pointed out:\n- The crew neglected some procedures referring to the flight preparation, \n- The crew failed to check the aircraft prior to departure and failed to provide an appropriate deicing procedure, \n- Poor flight preparation and organisation, \n- Poor weather conditions, \n- Lack of appropriate measures taken to clean the aircraft before takeoff. "}