{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-c-7b-caribou-camp-evans-afb-13-killed", "date": "Oct 3, 1968 at 1610 LT", "type": "De Havilland DHC-4 Caribou", "operator": "United%20States%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "213", "yom": 1964, "flight_number": null, "city": "Camp Evans AFB (Huế)", "zone": "Thừa Thiên–Huế Province", "country": "Vietnam", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff from Camp Evans AFB, while climbing to an altitude of 335 meters, the Caribou collided with a USAF Boeing-Vertol CH-47A Chinook registered 66-19041 that was approaching the same airbase with 6 passengers and five crew members on board. The rear rotor of the Chinook struck the cockpit of the Caribou. Following the collision, the Chinook and the Caribou dove into the ground and crashed few hundred yards from the runway end. All 26 occupants were killed in the accident and up to date, this was considered as the worst aerial collision involving USAF in Vietnam. At the time of the accident, the Caribou speed was about 190 km/h while the Chinook was approaching Camp Evans at a speed of 185 km/h. \r\nCaribou crew:\r\nCpt Wayne Philip Bundy,\r\n1st Lt Ralph Schiavone, \r\nS/Sgt Donald Gene Cleaver,\r\nS/Sgt James Kenneth Connor.", "probable_cause": "It was determined that the collision was the consequence of several violations on part of the Chinook crew who was attempting to land on an helipad located 300 meters to the left of the main runway. The following findings were reported: \r\n- The crew failed to contact ground control at Camp Evans AFB prior to its arrival, \r\n- The crew was not authorized to approach Camp Evans AFB at that time, \r\n- The crew failed to respect the maximum altitude of 180 meters fixed for helicopters in that area and was approaching at a too high altitude of 335 meters, \r\n- The crew was approaching Camp Evans from a non assigned approach path for helicopters. "}