{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-62m-mashhad-16-killed", "date": "Jul 25, 2009 at 1805 LT", "type": "Ilyushin II-62", "operator": "Aria%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tehran - Mashhad", "msn": "19 51 5 2 5", "yom": 1989, "flight_number": "IRX1525", "city": "Mashhad", "zone": "Razavi Khorasan", "country": "Iran", "region": "Asia", "crew_on_board": 17, "crew_fatalities": 11, "pax_on_board": 156, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": 14200, "captain_hours_type": 1500, "copilot_hours": 8294, "copilot_hours_type": 1319, "aircraft_hours": 13573, "circumstances": "At July 24, 2009, Ilyushin aircraft, model IL-62M of DETA Airline with registration, UP-I6208 and flight IRX1525 of Aria Airline flight with 169 passengers from Mehrabad International Airport/ Tehran, and it has landed at 18:05 local time on RWY 13 L in Mashhad International Airport; then it has run off from end of the runway, without considerable reduction in aircraft speed and it collided with wall of the airport and it was stopped after approximately 185 m. The mentioned aircraft has been leased by Aria Airline as ACMI, according to contract No. 002/IL-62M/ACMI. Subsequently, the ground safety unit of the airport has attended in place of occurring accident, by breaking protective fences and barbed wires of the airport, and then they evacuated passengers and extinguished fire outside of aircraft by carrying out necessary actions. 16 people were killed, 11 crew members and five passengers. All other occupants were rescued, among them 30 were injured. Accident site inspection revealed that the aircraft position had coordinates N 36,218º E 59,666º, at a road in the vicinity of the aerodrome, 1km away from the RWY-31R threshold (130º MH or 133, 5º TH) of the Mashhad airport with the azimuth of 125º (true).  Power line along the road was destroyed by the right aircraft wing. Wing fuel tanks of the right wing were damaged evidenced by fuel leaking. Main and emergency exits were open. An inflatable slide was dropped down from the port side. No evidences of fire on board and at the accident site were found. First tracks of intensive braking (black tire tracks) were found at the concrete at a distance of 550 m from the departure threshold of RWY31R. The track of the main gear wheels was going along the RWY in its left part, and diverging further to the right beyond the departure threshold. At about 100m away from the threshold at the end portion of the braking way, a net barrier was found (textile aerodrome emergency braking unit).The aircraft ran over the RWY when moving along the right side of the stop way, 300m long. Beyond the end of the RWY landing gear wheels track could be clearly seen passing over a rough partly grassed surface, and crossing a dirt road. At a distance of 100m from the RWY end, where the right gear crossed the road, a destroyed tire tube was found, which presumably belonged to the right gear front wheel. At a distance of 160m from the RWY end smashed approach lights were found, and after that point the gear wheel track started to diverge to the left from the RWY centerline. The front gear wheel track further merged with the left gear wheel track and extended joining the forward airframe track. At a distance of 320 m from the RWY end another line of broken approach lights were found. Airframe structures were found before the approach lights (along the aircraft way). From that point small aircraft structure pieces were found along the whole aircraft path. 40m past the destroyed approach lights line a ditch of 0,5…1m in depth was found (with an underground pipeline) which was crossing this area from the south to the north.  The south-eastern part of the aerodrome was fenced with a brick wall of 2,5m high and 0,4m thick with a concrete strip foundation. It went along the RWY there. The aircraft collided with the fence at a distance of 820m from the departure threshold (520m past the stop way end) with a heading of 105 degrees. The fence was destroyed throughout 70m.  Debris of the nose part of the airframe, cockpit, passenger seats, aircraft cabin parts were found behind the fence. Earlier aerodrome employees, police and medical services found at the site and evacuated crew bodies, as well as killed and injured passengers. After the collision with the fence the aircraft kept moving for 160 m with a heading of 105 degrees and came to a stop at the road.", "probable_cause": "The following findings were identified:\r\n- The crew was not trained &acquainted with flight conditions in the Iran territory with an Iranian instructor pilot and the operation unit of Aria Airline has acted so weak regarding those mentioned subjects.\r\n-  The approach speed of aircraft was higher than recommended available airport charts & aircraft weight, however it was controllable if the crew could proceed to land correctively.\r\n- The crew had not done correct procedure according to the aircraft Standard Operation Procedure (SOP) to use related check lists. (Descend-Approach-Landing)\r\n- There was lack of precise coordination between flight crew on their self responsibility during the approach and landing.\r\n- The flight crew did not pay attention to EGPWS warning, and did not take corrective action.\r\n- The crew did not use engine reverser and spoiler systems correctly to reduce aircraft speed during the landing and consequently it caused to loose long Runway distance.\r\n- The flight crew had not good English language proficiency. And they were poor in England language conversation.\r\n- The Capitan of the aircraft as the pilot in command had not sufficient force and efficient management in the cockpit. (lack of Cockpit Resource Management).\r\n- There were unauthorized actions of flight engineer for shifting engine reversers as well as lack of mutual oversight by crew members in checklist accomplishment during approach and landing.\r\n- The crew has had disagreement about “Go around” due to unsuitable landing situations.\r\n- Presence of General Director of airline in the cockpit had adverse psychological effect on crew efficiency behaviors. \r\n- The DETA airline did not use correct procedure to extend engines No; 1-2-4 life time from Ukrainian company (Aerotechservice co.) and the technical manager of ARIA airline did not control and\r\nsupervise the matter accordingly.\n\r\nMain Cause :\r\nConsidering those items in factual information and analysis, the main cause of this accident is “weak Cockpit management between the crew” to use correct landing techniques same as releasing Engine trust reversers – Engine shut down in unsuitable time - ….\n\r\nContributive Factors :\r\nSome of contributive factors for this accident occurrence are noted as:\r\n- The copilot and the flight engineer had self activity& decision without the (PIC) coordination.\r\n- The cockpit crew was careless and not paying proper attention toward EGPWS warning.\r\n- Psychological adverse effect on cockpit crew because of presence of General Director of Aria airline\n\r\nViolation & other deficiencies:\r\nThe accident investigation team encountered some violations and deficiencies with ICAO Standards and Iran Local Authority regulation (CAO) which are descript as:\r\n- Poor and in-sufficient supervision controlled of operation &technical manger of Aria Airline.\r\n- The DETA airline has not used proper procedure to receive life time extension of engine and has not passed necessary information to Iranian and Kazakhstan Authorities.\r\n- It has not been designed a headset for flight engineer to make more coordination between the crew, by the aircraft design bureau.\r\n- The crew was not familiar with Iranian AIP completely.\r\n- The total on board persons was not according to written load sheet."}