{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3t-turbo-otter-soldotna-10-killed", "date": "Jul 7, 2013 at 1120 LT", "type": "De Havilland DHC-3 Otter", "operator": "Rediske%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Soldotna - Bear Mountain Lodge", "msn": "280", "yom": 1958, "flight_number": null, "city": "Soldotna", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 7765, "captain_hours_type": 155, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 22831, "circumstances": "Before picking up the nine passengers, the pilot loaded the accident airplane at the operator's base in Nikiski with cargo (food and supplies for the lodge). The operator of the lodge where the passengers were headed estimated the cargo weighed about 300 pounds (lbs) and that the passengers' baggage weighed about 80 lbs. Estimates of the passengers' weights were provided to the lodge operator in preparation for the trip, which totaled 1,350 lbs. The load manifest listed each of these weight estimates for a total weight of 1,730 lbs and did not contain any balance data. The cargo was not weighed, and the pilot did not document any weight and balance calculations nor was he required to do so. The airplane operator did not keep fueling records for each flight. A witness who was present during the fueling operations at the operator's base reported that he saw the pilot top off the front tank then begin fueling the center tank. The first leg of the trip from the operator's base to pick up the passengers was completed uneventfully. According to witnesses at Soldotna Airport, after loading the passengers and their baggage, the pilot taxied for departure. There were no witnesses to the accident. The airplane impacted the ground about 2,320 feet from the threshold of the departure runway and about 154 feet right of the runway centerline. An extensive postcrash fire consumed most of the  airplane's cockpit and cabin area, including an unknown quantity of the baggage and cargo. Impact signatures were consistent with a nose- and right-wing-low attitude at impact. The entire airplane was accounted for at the wreckage site. Disassembly and examination of the engine and propeller revealed that both were operating during impact. Examination of the structure and flight control systems found no preimpact malfunctions or failures that would have precluded normal operation. The pilot was properly certificated and qualified in accordance with applicable federal regulations. Toxicological testing of specimens from the pilot was negative for any carbon monoxide, alcohol, or drugs. The airplane was not equipped, and was not required to be equipped, with any type of crashresistant recorder. A video recovered from a passenger's smartphone showed the accident sequence looking out of the row 4 left seat window; the left wing and flaps are in view for most of the sequence and the flap position does not change. The investigation found that the flaps were set to the full-down (or landing) position during takeoff, contrary to recommended procedures in the airplane flight manual (AFM). The recovered video was used to estimate the airplane speed, altitude, and orientation for the portion of the flight where ground references were visible, about 22.5 seconds after the start of the takeoff roll. For the first 12 seconds, the airplane accelerated linearly from the beginning of the takeoff roll through liftoff. The pitch angle decreased slightly in the first 8 seconds as the tail lifted, remained essentially constant for about 4 seconds, and began to slightly increase as the airplane lifted off. Beginning about 14 seconds after the start of the takeoff roll, the speed began decreasing and the pitch angle began increasing. The pitch angle increased at a constant rate (about 2.8 degrees/second), reaching a maximum value of about 30 degrees, and the ground speed decreased from its maximum of about 68 mph to about 44 mph at the end of the analyzed time. The ground references disappeared from the video frame as the airplane experienced a sharp right roll before impacting the ground several seconds later. The low speed, rapid right roll, and pitch down of the airplane is consistent with an aerodynamic stall. The constant pitch rate before the stall is consistent with an aft center of gravity (CG) condition of sufficient magnitude that the elevator pitch down authority was insufficient to overcome the pitching moment generated by the aft CG. Additionally, the flaps setting at the full-down (or landing) position, contrary to procedures contained in the AFM, would have exacerbated the nose-up pitching moment due to the increased downwash on the tail and aft shift of the center of pressure; the additional aerodynamic drag from the fully extended flaps would have altered the airplane's acceleration. Using the data available, the airplane was within weight and balance limitations for the first leg of the trip. However, the cargo loaded was about 2.4 times the weight indicated on the load manifest. Further, the total weight of cargo and baggage in the cargo area, as estimated during the investigation, exceeded the installed cargo net's load limit of 750 lbs by more than 50 lbs. Although the loaded cargo actual weight was higher than indicated on the load manifest, the flight from Nikiski to Soldotna was completed without any concerns noted by the pilot, indicating that even with the higher cargo load, the airplane was within the normal CG range for that leg of the flight. Thus, based on the investigation's best estimate and a calculation of the airplane's weight and balance using the recovered passenger weights, weights and location of the luggage recovered on scene, weight of the cargo recovered on scene, and weights accounting for the liquid cargo destroyed in the postimpact fire, once the passengers were loaded, the airplane weight would have exceeded the maximum gross weight of 8,000 lbs by about 21 lbs and the CG would have been at least 5.5 inches aft of the 152.2-inch limit (a more definitive calculation could not be performed because the exact location of the cargo was not known). Additionally, the kinematics study of the accident airplane's weight and motion during initial climb and up to the point of stall found that with the pilot applying full pitch-down control input, the CG required to produce the motion observed in the video was likely just past 161 inches. Thus, the only way for the airplane motion to match the motion observed in the video was for the CG to be considerably aft of the 152.2-inch limit, which provides additional support to the results from the weight and balance study. Based on the video study, the weight and balance study constructed from available weight and balance information, and the kinematics study, the airplane exceeded the aft CG limit at takeoff, which resulted in an uncontrollable nose-up pitch leading to an aerodynamic stall. The CG was so far aft of the limit that the airplane likely would have stalled even with the flaps in the correct position. Neither 14 CFR Part 135 nor the operator's operations specifications (OpSpec) require that the aircraft weight and balance be physically documented for any flights. However, according to Section A096 of the OpSpec, when determining aircraft weight and balance, the operator should use either the actual measured weights for all passengers, baggage, and cargo or the solicited weights for passengers plus 10 lbs and actual measured weights for baggage and cargo. The operator did not comply with federal regulations that require adherence to the weighing requirements or the takeoff weight limitations in the AFM. Additionally, although the inaccurate estimate of 300 lbs for the cargo resulted in a calculated CG that was within limits for both legs of the flight, the actual weight of the cargo was significantly higher. Once loaded in Soldotna, the combination of the passengers, their baggage, and the actual cargo weight and its location resulted in the CG for the accident flight being significantly aft of the limit. With the CG so far aft, even with full nose-down input from the pilot, the nose continued to pitch up until the airplane stalled. For each flight in multiengine operations, 14 CFR 135.63(c) requires the preparation of a load manifest that includes, among other items the number of passengers, total weight of the loaded aircraft, the maximum allowable takeoff weight, and the CG location of the loaded aircraft; one copy of the load manifest should be carried in the airplane and the operator is required to keep the records for at least 30 days. Single-engine operations are excluded from this requirement. The NTSB attempted to address this exclusion with the issuance of Safety Recommendations A-89-135 and A-99-61, which asked the Federal Aviation Administration (FAA) to amend the record-keeping requirements of 14 [CFR] 135.63(c) to apply to single-engine as well as multiengine aircraft. The FAA did not take the recommended action in either instance, and the NTSB classified Safety Recommendations A-89-135 and A-99-61 \"Closed—Unacceptable Action\" in 1990 and 2014, respectively.", "probable_cause": "The operator's failure to determine the actual cargo weight, leading to the loading and operation of the airplane outside of the weight and center of gravity limits contained in the airplane flight manual, which resulted in an aerodynamic stall. Contributing to the accident was the Federal Aviation Administration's failure to require weight and balance documentation for each flight in 14 Code of Federal Regulations Part 135 single-engine operations."}