{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-211-halifax", "date": "Mar 29, 2015 at 0030 LT", "type": "Airbus A320", "operator": "Air%20Canada.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Toronto – Halifax", "msn": "233", "yom": 1991, "flight_number": "AC624", "city": "Halifax-Stanfield", "zone": "Nova Scotia", "country": "Canada", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 133, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11765, "captain_hours_type": 5755, "copilot_hours": 11300, "copilot_hours_type": 6392, "aircraft_hours": 75103, "circumstances": "On 29 March 2015, an Air Canada Airbus Industrie A320-211 (registration C-FTJP, serial number 233), operating as Air Canada flight 624, was on a scheduled flight from Toronto/Lester B. Pearson International Airport, Ontario, to Halifax/Stanfield International Airport, Nova Scotia, with 133 passengers and 5 crew members on board. At approximately 0030 Atlantic Daylight Time, while conducting a non-precision approach to Runway 05, the aircraft severed power lines, then struck the snow-covered ground about 740 feet before the runway threshold. The aircraft continued airborne through the localizer antenna array, then struck the ground twice more before sliding along the runway. It came to rest on the left side of the runway, about 1900 feet beyond the threshold. The aircraft was evacuated; 25 people sustained injuries and were taken to local hospitals. The aircraft was destroyed. There was no post-impact fire. The emergency locator transmitter was not activated. The accident occurred during the hours of darkness.", "probable_cause": "Findings as to causes and contributing factors:\n\r\n1. Air Canada’s standard operating procedure (SOP) and practice when flying in flight path angle guidance mode was that, once the aircraft was past the final approach fix, the flight crews were not required to monitor the aircraft’s altitude and distance from the threshold or to make any adjustments to the flight path angle. This practice was not in accordance with the flight crew operating manuals of Air Canada or Airbus.\r\n2. As per Air Canada’s practice, once the flight path angle was selected and the aircraft began to descend, the flight crew did not monitor the altitude and distance from the threshold, nor did they make any adjustments to the flight path angle.\r\n3. The flight crew did not notice that the aircraft had drifted below and diverged from the planned vertical descent angle flight profile, nor were they aware that the aircraft had crossed the minimum descent altitude further back from the threshold.\r\n4. Considering the challenging conditions to acquire and maintain the visual cues, it is likely the flight crew delayed disconnecting the autopilot until beyond the minimum descent altitude because of their reliance on the autopilot system.\r\n5. The approach and runway lights were not changed from setting 4 to setting 5; therefore, these lights were not at their maximum brightness setting during the approach.\r\n6. The system to control the airfield lighting’s preset selections for brightness setting 4 was not in accordance with the NAV CANADA Air Traffic Control Manual of Operations requirement for the omnidirectional approach lighting system to be at its brightest settings.\r\n7. The limited number of visual cues and the short time that they were available to the flight crew, combined with potential visual illusions and the reduced brightness of the approach and runway lights, diminished the flight crew’s ability to detect that the aircraft’s approach path was taking it short of the runway. \r\n8. The flight crew’s recognition that the aircraft was too low during the approach would have been delayed because of plan continuation bias.\r\n9. The aircraft struck terrain approximately 740 feet short of the runway threshold, bounced twice, and then slid along the runway before coming to a rest approximately 1900 feet beyond the runway threshold.\r\n10. At some time during the impact sequence, the captain’s head struck the glare shield because there were insufficient acceleration forces to lock the shoulder harness and prevent movement of his upper body.\r\n11. The first officer sustained a head injury and serious injury to the right eye as a result of striking the glare shield because the automatic locking feature of the right-side shoulder-harness inertia reel was unserviceable.\r\n12. A flight attendant was injured by a coffee brewer that came free of its mounting base because its locking system was not correctly engaged.\r\n13. Because no emergency was expected, the passengers and cabin crew were not in a brace position at the time of the initial impact.\r\n14. Most of the injuries sustained by the passengers were consistent with not adopting a brace position.\n\r\nFindings as to risk:\n\r\n1. If aircraft cockpit voice recorder installations do not have an independent power supply, additional, potentially valuable information will not be available for an investigation.\r\n2. If Transport Canada does not consistently follow its protocol for the assessment of aeromedical risk and ongoing surveillance in applicants who suffer from obstructive sleep apnea, some of the safety benefit of medical examinations will be lost, increasing the risk that pilots will fly with a medical condition that poses a risk to safety.\r\n3. If new regulations on the use of child-restraint systems are not implemented, lap-held infants and young children are exposed to undue risk and are not provided with a level of safety equivalent to that for adult passengers.\r\n4. If passengers do not dress appropriately for safe travel, they risk being unprepared for adverse weather conditions during an emergency evacuation.\r\n5. If the type of approach lighting system on a runway is not factored into the minimum visibility required to carry out an approach, in conditions of reduced visibility, the lighting available risks being less than adequate for flight crews to assess the aircraft’s position and decide whether or not to continue the approach to a safe landing.\r\n6. If they do not incorporate a means of absorbing forces along their longitudinal axis, vertically mounted, non-structural beams (channels, tubes, etc.) in cargo compartments could penetrate the cabin floor when the fuselage strikes the water or ground, increasing the risk of aircraft occupants being injured or emergency egress being impaired.\r\n7. If an aircraft manufacturer’s maintenance instructions do not include the component manufacturer’s safety-critical test criteria, the component risks not being maintained in an airworthy condition.\r\n8. If there is a complete loss of electrical and battery power and the passenger address system does not have an independent emergency power supply, the passenger address system will be inoperable, and the initial command to evacuate or to convey other emergency instructions may be delayed, putting the safety of passengers and crew at risk.\r\n9. If passengers retrieve or attempt to retrieve their carry-on baggage during an evacuation, they are putting themselves and other passengers at a greater risk of injury or death.\r\n10. If passengers do not pay attention to the pre-departure safety briefings or review the safety-features cards, they may be unprepared to react appropriately in an accident, increasing their risk of injury or death.\r\n11. If an organization’s emergency response plan does not identify all available transportation resources, there is an increased risk that evacuated passengers and crew will not be moved from an accident site in a timely manner.\r\n12. If organizations do not practise transporting persons from an on-airport accident site, they may be insufficiently prepared to react appropriately to an actual accident, which may increase the time required to evacuate the passengers and crew.\n\r\nOther findings:\n\r\n1. The service director assessed the evacuation flow as good and determined that there was therefore no need to open the R1 door.\r\n2. The flight attendants stationed in the rear of the aircraft noted no life-threatening hazards. Because no evacuation order had been given, and deplaned passengers and firefighters were observed walking near the rear of the aircraft in an area where the deployment of the rear slides may have created additional hazards or risks, the flight attendants determined that there was no requirement to open the L2 and R2 doors.\r\n3. Although Transport Canada required the dual-exit drill to be implemented in training, it did not require all cabin crew to receive the training before an organization implemented the 1:50 ratio.\r\n4. At the time of the accident, neither the service director nor the flight attendants had received the dual-exit training, nor were they aware of the requirement for such training in order for Air Canada to operate with the exemption allowing 1 flight attendant for each unit of 50 passengers.\r\n5. Although Transport Canada had reviewed and approved Air Canada’s aircraft operating manual and the standard operating procedures (SOPs), it had not identified the discrepancy between the Air Canada SOPs and the Airbus flight crew operating manual regarding the requirement to monitor the aircraft’s vertical flight path beyond the final approach fix when the flight path angle guidance mode is engaged.\r\n6. A discrepancy in the Halifax International Airport Authority’s standby generators’ control circuitry caused the 2 standby generators to stop producing power. \r\n7. Air Canada’s emergency response plan for Halifax/Stanfield International Airport indicated that the airline was responsible for the transportation of passengers from an accident site.\r\n8. Air Canada’s emergency response plan did not identify the airport’s Park’N Fly minibuses as transportation resources. 9. The Halifax International Airport Authority’s emergency response plan did not identify that the airport Park’N Fly mini-buses could be used to transport the uninjured passengers, nor did it provide instructions on when and how to request and dispatch any transportation resources available at the airport.\r\n10. The Air Canada Flight Operations Manual did not identify that the required visual reference should enable the pilot to assess aircraft position and rate of change of position in order to continue the approach to a landing.\r\n11. In Canada, the minimum visibility that is authorized by the operations specification for non-precision approaches does not take into account the type of approach lighting system installed on the runway.\r\n12. It is likely that, during the emergency, a passenger activated the L1 door gust lock release pushbutton while trying to expedite his or her exit, which allowed the door to move freely.\r\n13. The passenger seatbacks were dislodged because the shear pins had sheared, likely as a result of contact with passengers during the impact sequence or emergency egress.\r\n14. Recovery of the uninjured passengers from the accident site was delayed owing to a number of factors, including the severe weather conditions; the failure of the airport’s 2 standby generators to provide backup power after the loss of utility power; the loss of the airport operations radio network; and the lack of arrangements for the dispatch of transportation vehicles until after emergency response services had advised that all passengers were evacuated and the site was all clear.\r\n15. Given that the captain rarely used continuous positive airway pressure therapy, he would have been at risk of experiencing fatigue related to chronic sleep disruption caused by obstructive sleep apnea. However, there was no indication that fatigue played a causal or contributory role in this occurrence."}