{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-580-near-lytton-2-killed", "date": "Jul 31, 2010 at 2024 LT", "type": "Convair CV-580", "operator": "Conair", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Mountains", "schedule": "Kamloops - Kamloops", "msn": "129", "yom": 1953, "flight_number": "Tanker448", "city": "Lytton", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 17000, "captain_hours_type": 900, "copilot_hours": 5200, "copilot_hours_type": 34, "aircraft_hours": null, "circumstances": "Crew was fighting a forest fire near Siwash Road, about 15 km south of Lytton. The bombing run required crossing the edge of a ravine in the side of the Fraser River canyon before descending on the fire located in the ravine. About 22 minutes after departure, Tanker 448 approached the ravine and struck trees. An unanticipated retardant drop occurred coincident with the tree strikes. Seconds later, Tanker 448 entered a left-hand spin and collided with terrain. A post-impact explosion and fire consumed much of the wreckage. A signal was not received from the on-board emergency locator transmitter; nor was it recovered. Both crew members were fatally injured.", "probable_cause": "Findings as to Causes and Contributing Factors: \r\n1. It could not be determined to what extent the initial collision with trees caused damage to the aircraft which may have affected its controllability.  \r\n2. Visual illusion may have precluded recognition, or an accurate assessment, of the flight path profile in sufficient time to avoid the trees on rising terrain. \r\n3. Visual illusion may have contributed to the development of a low energy condition which impaired the aircraft performance when overshoot action was initiated. \r\n4. The aircraft entered an aerodynamic stall and spin from which recovery was not possible at such a low altitude. \r\nFindings as to Risk:\r\n1. Visual illusions give false impressions or misconceptions of actual conditions. Unrecognized and uncorrected spatial disorientation, caused by illusions, carries a high risk of incident or accident. \r\n2. Flight operations outside the approved weight and balance envelope increase the risk of unanticipated aircraft behaviour. \r\n3. The recommended maintenance check of the emergency drop (E-drop) system may not be performed and there is no requirement for flight crews to test the E-drop system, thereby increasing the risk that an unserviceable system will go undetected. \r\n4. The location of the E-drop selector requires crews to divert significant time and attention to identify and confirm the correct switch before operating it. This increases the risk of collision with terrain while attention is distracted. \r\n5. The location of the angle-of-attack indicator on the instrument panel makes it difficult to see from the right seat, reducing its effectiveness. \r\n6. When cockpit recordings are not available to an investigation, this may preclude the identification and communication of safety deficiencies to advance transportation safety. "}