{"url": "https://www.baaa-acro.com/crash/crash-cessna-501-citation-isp-near-carey-3-killed", "date": "Mar 15, 2003 at 1425 LT", "type": "Cessna 501 Citation I", "operator": "Dancing Wind Aviation", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Salt Lake City – Sun Valley", "msn": "501-0073", "yom": 1978, "flight_number": null, "city": "Carey", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 14000, "captain_hours_type": 1382, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7120, "circumstances": "At 1407:11 the flight was cleared from Flight Level (FL) 240 to descend and maintain FL190. At 1409:08 the controller cleared the flight to descend and maintain 15,000 feet, and at 1409:17 the pilot read back the clearance in its entirety. At 1410:20 the controller instructed the pilot to expedite his descent through 16,000 feet for traffic; however, there was no response. From 1410:33 to 1417:21 the controller made ten attempts to contact the pilot; again, there was no response. At 1417:26 the controller requested the pilot to ident if he could still hear him. At 1417:38 the controller received an ident from the aircraft and instructed the pilot to descend and maintain 15,000 feet. At 1418:36 the controller cleared the aircraft for the GPS approach and to acknowledge with an ident. There was no response. The aircraft had impacted a rocky drainage trench near the base of rock outcropping on a magnetic heading of 200 degrees in a wings level, approximately 40-degree nose down attitude, 15 nautical miles east-southeast of the destination airport at an elevation of 5,630 feet mean sea level. An examination of the aircraft's flight control, pressurization, and electrical systems revealed no anomalies with these systems which would have precluded normal operations. A further examination of the thermal damage to the aircraft, determined that there was no evidence of an inflight fire. Both engines underwent a complete teardown examination revealing no evidence of catastrophic or pre accident failure, and that both engines were functioning at the time of impact. Radar data revealed the aircraft was in level flight at FL 190 for more than 4 minutes, when it had previously been cleared to 15,000 feet. It subsequently began a climb reaching an altitude of 20,300 feet before beginning a right descending turn followed by a left descending turn. The last radar return before radar contact was lost indicated the aircraft was at 15,900 feet and descending. No evidence was available that suggests icing greater than light rime icing was present in the area and that weather was unlikely to have been a factor in the accident. The pilot was on two medications for high blood pressure and one for high cholesterol. The pilot had recently been found to have an elevated blood sugar, suggesting early diabetes or some other systemic disease or injury. The pilot had a family history of heart disease and high blood pressure, and had at least one episode of chest tightness in the past. It is possible that he had some unrecognized heart disease. The circumstances of the accident suggest substantial impairment or incapacitation of the pilot. It is possible that the pilot experienced an event such as a stroke or heart attack related to his previous medical conditions or as a new occurrence. It  is also possible that he became hypoxic as a result of a decompression event without using supplemental oxygen. There is insufficient information to conclude any specific cause for the pilot's impairment or incapacitation", "probable_cause": "Pilot incapacitation for unknown reasons."}