{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-17g-95-ve-flying-fortress-hamilton-afb-3-killed", "date": "May 16, 1946 at 0200 LT", "type": "Boeing B-17 Flying Fortress", "operator": "USAAF", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Mountains", "schedule": "Clovis - Mines Field - Hamilton", "msn": "8417", "yom": null, "flight_number": null, "city": "Hamilton AFB (Novato)", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 9, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Aircraft took off from Clovis Army Air Field in New Mexico, bound for Hamilton AAF in Marin County.  The plane stopped at Mines Field in Los Angeles, refueled, retook to the skies at 2317LT and was due to arrive at Hamilton at 0117LT in the morning, but the pilot, according to the Army investigation, lost his way while trying to locate Hamilton Field. At around 0200LT in the morning, and five minutes from its destination, the pilot radioed Hamilton Field for radar assistance in landing. But, shortly after 0200LT, the engines of the bomber, starved of fuel, quit, and the bomber smashed into a 1300-foot peak of White's Hill, some nine miles short of the airfield. Striking the hill only six feet below its top, the plane bounced over the top, thudded across the rough terrain, and slid to a grinding halt that churned up earth and rock for more than 100 yards, and scattering wreckage for 300 yards. Dazed, confounded, and startled by the crash, the pilot and co-pilot extricated themselves out of the wreckage of his once-proud aircraft. Still trapped in the wreckage were five of their crew.  Stumbling and clawing their way through the morning darkness towards the city lights they saw in the distant, they reached a retirement home, from which they alerted the airfield. Killed instantly in the First Lieutenant Milton M. Souza, 25, of Santa Clara. CA. and Master Sergeant E. B. Nichols, of Clovis, NM. Rescuers chopped a hole through the wreckage with an axe to extricate a Lieutenant Colonel from the fuselage.  He was then strapped on a litter with his parachute shrouds and brought down the hillside. It took a total of six hours to free the five trapped men from the plane, two of whom were seriously injured.\r\nSource: \r\nhttp://www.check-six.com/Crash_Sites/Marin_B-17_crash.htm\n", "probable_cause": "The accident investigation concluded that: \"The pilot, due to lack of judgment, common sense and apparent disregard and/or unfamiliarity with facilities available to him, failed to properly follow instructions in preparing for let down. It is believed that the accident was 100% pilot error.\""}