{"url": "https://www.baaa-acro.com/crash/crash-cessna-525-citationjet-cj1-cedar-fort-2-killed", "date": "Jan 18, 2016 at 1000 LT", "type": "Cessna 525 CitationJet CJ1", "operator": "Donald L. Baker", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Salt Lake City - Tucson", "msn": "525-0299", "yom": 1999, "flight_number": null, "city": "Cedar Fort", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3334, "captain_hours_type": 1588, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2304, "circumstances": "The airline transport pilot and passenger departed on a cross-country flight in instrument meteorological conditions in the light business jet. About 1 minute after departure, air traffic control instructed the pilot to climb and maintain an altitude of 14,000 ft mean sea level (msl). About 3 minutes later, the pilot stated that the airplane's flight management system (FMS) had failed. Shortly thereafter, he requested a climb and stated that he was \"trying to get to clear skies.\" Over the next several minutes, the controller provided the pilot with headings and altitudes to vector the airplane into visual meteorological conditions. During this time, and over the course of several transmissions, the pilot stated that he was \"losing instruments,\" was hand-flying the airplane (likely indicating the autopilot was inoperative), and that he wanted to \"get clear of the weather.\" Radar data indicated that, during the 10-minute flight, the airplane conducted a series of climbs and descents with large variations in airspeed. About 2 minutes before the loss of radar contact, the airplane entered a climbing right turn, reaching its highest altitude of about 21,000 ft, before it began a rapidly descending and tightening turn. Performance data revealed that, during this turn, the airplane entered a partially-inverted attitude, exceeded its design maneuvering speed, and reached a peak descent rate of about 36,000 ft per minute. Radar contact was lost at an altitude of about 16,000 ft msl, and the airplane subsequently experienced an inflight breakup. The wreckage was distributed over a debris path that measured about 3/4-mile long and about 1/3-mile wide. Postaccident examination and testing of various flight instruments did not indicate what may have precipitated the inflight anomalies that the pilot reported prior to the loss of control. Additionally, all airframe structural fractures were consistent with ductile overload, and no evidence of any preexisting condition was noted with the airframe or either engine. The airplane was equipped with three different sources of attitude information, all three of which were powered by separate sources. It is unlikely that all three sources would fail simultaneously. In the event the pilot experienced a dual failure of attitude instrumentation on both the pilot and copilot sides, airplane control could have been maintained by reference to the standby attitude indicator. Further, the pilot would have been afforded heading information from the airplane's standby compass. Although the pilot did not specifically state to the controller the nature of the difficulties he was experiencing nor, could the investigation identify what, if any, anomalies the pilot may have observed of the airplane's flight instruments, the pilot clearly perceived the situation as one requiring an urgent ascent to visual conditions. As a single pilot operating without the assistance of an additional crewmember in a high-workload, high-stress environment, the pilot would have been particularly susceptible to distraction and, ultimately, a loss of airplane control due to spatial disorientation.", "probable_cause": "The pilot's loss of control due to spatial disorientation while operating in instrument meteorological conditions, which resulted in an exceedance of the airplane's design stress limitations, and a subsequent in-flight breakup. Contributing to the accident was the pilot's reported inflight instrumentation anomaly, the origin of which could not be determined during the investigation. "}