{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-i-fort-lauderdale-4-killed", "date": "Apr 12, 2015 at 1625 LT", "type": "Piper PA-31 Cheyenne", "operator": "Aircraft%20Guaranty%20Corp%20Trustee", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Orlando - Fort Lauderdale", "msn": "31T-7904002", "yom": 1979, "flight_number": null, "city": "Fort Lauderdale-Executive", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1221, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3267, "circumstances": "Following an uneventful personal flight, the pilot contacted the air traffic control tower controller and was immediately cleared to land. About 36 seconds later, the pilot reported \"smoke in the cockpit.\" When asked to repeat, the pilot repeated \"smoke in the cockpit.\" The tower controller cleared the pilot to land on any runway. About 47 seconds after the initial call of smoke, the pilot reported \"mayday mayday mayday mayday mayday (unintelligible).\" The airplane then crashed about ¼ mile short of the airport in a wooded area and burned. Security video showed the airplane pitch nose-down suddenly just before impact. The video revealed no visible smoke or fire trailing the airplane before ground impact. The pilot reported about 1,221 hours of total flight time on his Federal Aviation Administration first class medical certificate, issued about two months prior to the accident. He completed an initial training course for the airplane make and model 1 week before the accident. The airplane had recently undergone an annual inspection and extensive upgrades to its avionics. Both the left and right engines displayed contact signatures to their internal components characteristic of engines developing significant power at the time of impact, likely in the mid-to-high power range. The engines displayed no indications of any pre-impact anomalies or distress that would have precluded normal engine operation. Both propeller assemblies broke free from the engine during the crash sequence and the blades on both engines revealed signatures consistent with the development of power at impact. The center fuselage and cockpit areas were completely consumed in the postcrash fire. An examination of all remaining wires, wire bundles, switches, terminals, circuit breakers, electrical components, instruments, and avionics did not reveal evidence of precrash thermal distress. However, a small fire just before impact likely would not have had time to create thermal damage that would be discernable after an extensive postcrash fire.", "probable_cause": "A rapid onset of smoke and/or fire inflight for reasons that could not be determined due to the postimpact fire and the condition of the wreckage."}