{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-near-arkhangelsk", "date": "Nov 8, 2018 at 1054 LT", "type": "PZL-Mielec AN-2", "operator": "2nd%20United%20Arkhangelsk", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Arkhangelsk – Soyana – Dolgoshchel’e – Mezen", "msn": "1G191-52", "yom": 1981, "flight_number": "9135", "city": "Arkhangelsk", "zone": "Arkhangelsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 12, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4742, "captain_hours_type": 4336, "copilot_hours": 969, "copilot_hours_type": 761, "aircraft_hours": 13509, "circumstances": "The single engine airplane departed Arkhangelsk-Vaskovo Airport on a flight to Mezen with intermediate stops in Soyana and Dolgoshchel’e, carrying 12 passengers (11 adults and one child) and two pilots. En route, weather conditions deteriorated with drizzle. The crew reduced his altitude from 400 to 300 metres when frost formed on the windshield. The captain decided to return to Arkhangelsk but the aircraft' speed dropped from 170 to 120 km/h. Unable to maintain the speed and altitude, the crew attempted an emergency landing when the aircraft collided with trees and crashed in a wooded area located about 50 km northeast of Arkhangelsk-Talaghy Airport. All 14 occupants were rescued, among them two passengers were injured. The aircraft was destroyed. ", "probable_cause": "The accident with the An-2 RA-84674 aircraft occurred during a forced landing in the forest, the need for which was due to the impossibility of continuing the flight due to the effect of icing on the aerodynamic and traction characteristics of the aircraft (the inability to maintain altitude and speed even with the takeoff engine operating mode). The contributing factor, most likely, was the decision of the crew to climb over 150 m from the ground level, where the presence of stratus clouds and icing was predicted."}