{"url": "https://www.baaa-acro.com/crash/crash-avro-685-york-i-raf-lyneham-0", "date": "Nov 27, 1952 at 0915 LT", "type": "Avro 685 York", "operator": "Surrey-Flying-Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stansted – Lyneham – Singapore", "msn": "1355", "yom": 1946, "flight_number": null, "city": "Lyneham AFB", "zone": "Wiltshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The accident occurred towards the end of a positioning flight from Stansted to Lyneham prior to an intended flight with freight from Lyneham to Singapore. Before departing from Stansted the captain telephoned the Meteorological Office at Lyneham and obtained the local weather situation. The en route flight to Lyneham was without incident and on arrival overhead a Ground Controlled Approach to Runway 07 was begun. The aircraft intercepted the glide path at 2,000 feet and a normal talk-down approach was made until the 114 mile from touch-down position was reached. During the approach a normal descent was maintained with variations of up to 50 ft. above the glide path. At the 1/4 mile from touch-down position the aircraft's echo disappeared from the Tracker's Radar screen in a downward direction indicating a high rate of descent. At this time the captain, who was concentrating on the flight instruments, was warned suddenly by the co-pilot that there were trees ahead. The captain immediately pulled back the control column but was unable to prevent the aircraft striking the upper branches of trees and the ridge of steeply sloping ground approximately 140 yards short of the touch-down point. The aircraft was severely damaged and three of the crew were slightly injured. There was no fire. ", "probable_cause": "The accident occurred as a result of the captain's allowing the aircraft to descend below critical height during a Ground controlled Approach without having visual reference to the ground. \r\nThe contributory causes were: \r\n- The captain was not warned by the talk-down controller that the aircraft was approaching break-off altitude,\r\n- The visibility at the threshold of Runway 07 was less than the airfield visibility which had been reported to the captain-\r\n- The aircraft was affected by a downdraught which caused it to sink below the glide path. The glide path at Lyneham allows for less obstacle clearance than is normal with a civil installation. "}