{"url": "https://www.baaa-acro.com/crash/crash-lockheed-p-3b-80-lo-orion-hierro-island-13-killed", "date": "Dec 11, 1977 at 1120 LT", "type": "Lockheed P-3 Orion", "operator": "US%20Navy", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Mountains", "schedule": "Lajes - Lajes", "msn": "185-5225", "yom": 1967, "flight_number": null, "city": "Hierro Island", "zone": "Canary Islands", "country": "Spain", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine airplane departed Lajes Airport, Azores Islands, at 0836LT on a maritime patrol flight. About two hours later, the crew reported his position and that all went well on board. This was the last radio transmission. At 1120LT, while cruising at an altitude of 2,300 feet in a limited visibility due to foggy conditions, the airplane struck the slope of a mountain (5,200 feet high) at a speed pof 220 knots and crashed. The wreckage was found in a wooded area located near la Frontera, in the center of the island. At the time of the accident, three engines were operating while the engine n°1 was shutdown for loiter.", "probable_cause": "The accident was the consequence of a controlled flight into terrain. The following contributing factors were reported:\r\n- The crew consumed alcohol until 2 o'clock in the morning, \r\n- The crew started the mission without sufficient rest time, \r\n- Failure of the authority to implement an effective aircrew surveillance program, \r\n- Crew complacency for non adhering to sound navigation procedures, \r\n- The crew was not properly briefed prior to takeoff and was probably not aware of the presence of Hierro Island, \r\n- Poor visibility due to foggy conditions and rain falls."}