{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46a-commando-near-kingston-2-killed", "date": "Nov 26, 1962 at 0350 LT", "type": "Curtiss C-46 Commando", "operator": "Urraca-Colombia1", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Mountains", "schedule": "Fairbanks – Miami – Kingston – Bogotá", "msn": null, "yom": null, "flight_number": null, "city": "Kingston", "zone": "Kingston City District", "country": "Jamaica", "region": "Central America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Curtiss C-46 operated on a ferry flight from Fairbanks to Bogotá via Miami and Kingston, carrying four spare engines and spare parts. The plane arrived at Kingston on November 25, 17:01 GMT. Following refueling of the aircraft, fuel was observed venting from the right front tank. This caused a delay in departure. At 08:47 GMT the next day, the C-46 lifted off from runway 29 after a long takeoff run and was cleared to climb ahead to 1500 feet. The plane started to turn left on crossing the coastline. Three minutes after takeoff, while still in a shallow climbing left-hand turn, the aircraft flew onto the southern face of Port Henderson Hills at a height of 700 feet. After scraping along rough ground over the brow of the hill, the aircraft fell down a steep precipice and caught fire.", "probable_cause": "The aircraft was turned during the climb after takeoff at a height insufficient to clear rising ground. The ability of the pilot to avoid the hill may have been affected by some mechanical or other failure, although the occurrence of such a failure was not established. A contributing factor was that the carriage of one pilot was inadequate for the safe operation of an aircraft of this type."}