{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-near-condobolin-4-killed", "date": "Dec 2, 2005 at 1350 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Peter Menegazzo", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Brisbane – Swan Hill", "msn": "31-8252075", "yom": 1982, "flight_number": null, "city": "Condobolin", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 4600, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2900, "circumstances": "On 2 December 2005, at 1122 Eastern Daylight-saving Time, a Piper Aircraft Corporation PA-31-350 Chieftain aircraft, registered VH-PYN (PYN), departed Archerfield, Qld, on a private flight to Griffith, NSW. The flight was planned under the instrument flight rules (IFR). On board the aircraft were the pilot, two passengers and an observer-pilot who was on the flight to gain knowledge of the aircraft operation. The aircraft tracked direct to Moree and then Coonamble at 10,000 ft, in accordance with the flight plan. At 1303, the pilot amended the destination to Swan Hill, Vic, tracking via Hillston, NSW. At 1314, the pilot advised air traffic control that the aircraft had passed overhead Coonamble at 1312 maintaining 10,000 ft, and was estimating Hillston at 1418. At 1316, the pilot reported that he was tracking 5 NM (9 km) left of track due to weather. At 1337, the pilot advised that he was diverting up to 20 NM (37 km) left of track due to weather. At 1348, the pilot reported that he was diverting 29 NM (54 km) left of track, again due to weather. No further radio transmission from the pilot was heard. At about 1400, police received a report that an aircraft had crashed on a property approximately 28 km north of Condobolin, NSW. The extensively burned wreckage was subsequently confirmed as PYN. Other wreckage, spread along a trail up to 4 km from the main wreckage, was located the following day. Examination of air traffic control recorded radar data indicated that the aircraft entered radar coverage about 50 km north of Condobolin at 1346:34. The last valid radar data from the secondary surveillance radar located on Mount Bobbara was at 1349:53. During that 3 minute 19 second period, the recorded aircraft track was approximately 56 km left of the Coonamble to Hillston track and showed a change in direction from southerly to south-westerly. The aircraft’s groundspeed was in the range between 200 and 220 kts. The aircraft’s altitude remained steady at 10,000 ft. The last recorded radar position of the aircraft was approaching the limit of predicted radar coverage and was within 10 km of the location of the main aircraft wreckage. Earlier that day, the aircraft had departed Bendigo, Vic, at 0602 and arrived at Archerfield at 1034. The pilot and the observer-pilot were on board. The aircraft was refuelled to full tanks with 314 litres of aviation gasoline at Archerfield. The refuelling agent reported that the main and auxiliary tanks were full at the completion of refuelling. He also reported that the pilots had commented that the forecast for their return flight indicated that weather conditions would be ‘patchy’. \n", "probable_cause": "Contributing factors:\r\n• A line of thunderstorms crossed the aircraft’s intended track.\r\n• The aircraft was operating in the vicinity of thunderstorm cells.\r\n• In circumstances that could not be determined, the aircraft’s load limits were exceeded, causing structural failure of the airframe.\r\nOther safety factors:\r\n• Air traffic control procedures, did not require the SIGMET information to be passed to the aircraft.\r\n• There were shortcomings in the Airservices Australia Hazard Alert procedures and guidelines for assessing SIGMET information.\r\n• Air traffic control procedures for the dissemination of SIGMET information contained in the Aeronautical Information Publication were inconsistent with procedures contained in International Civil Aviation Organization (ICAO) Doc. 4444 and ICAO Doc. 7030.\r\nOther key findings:\r\n• The aircraft was not equipped with weather radar or lightning strike detection systems.\r\n• The pilot did not make any request for additional information regarding the weather to air traffic services.\r\n• The pilot in command was occupying the right cockpit seat and the observer- pilot the left cockpit seat at the time of the breakup, but that arrangement was not considered to have influenced the development of the accident."}