{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-30-marquise-melbourne-1-killed", "date": "Dec 21, 1994 at 0324 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Newcastle Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sydney – Melbourne", "msn": "517", "yom": 1970, "flight_number": null, "city": "Melbourne-Tullamarine", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5000, "captain_hours_type": 150, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Sydney for Melbourne International airport at 0130 on 21 December 1994. En-route cruise was conducted at flight level 140. Melbourne Automatic Terminal Information Service (ATIS) indicated a cloud base of 200 feet for the aircraft's arrival and runway 27 with ILS approaches, was in use. Air Traffic Control advised the pilot of VH-UZB, another company MU2 that was also en-route from Sydney to Melbourne, and the pilot of VH-IAM while approaching the Melbourne area, that the cloud base was at the ILS minimum and that the previous two aircraft landed off their approaches. VH-UZB was slightly ahead of VH-IAM and made a 27 ILS approach and landed. In response to an inquiry from the Tower controller the pilot of VH-UZB then advised that the visibility below the cloud base was 'not too bad'. This information was relayed by the Tower controller to the pilot of VH-IAM, who was also making a 27 ILS approach about five minutes after VH-UZB. The pilot acknowledged receipt of the information and was given a landing clearance at 0322. At 0324 the Approach controller contacted the Tower controller, who had been communicating with the aircraft on a different frequency, and advised that the aircraft had faded from his radar screen. Transmissions to VH-IAM remained unanswered and search-and-rescue procedures commenced. Nothing could be seen of the aircraft from the tower. A ground search was commenced but was hampered by the darkness and reduced visibility. The terrain to the east of runway 27 threshold, in Gellibrand Hill Park, was rough, undulating and timbered. At 0407 the wreckage was found by a police officer. Due to the darkness and poor visibility the policeman could not accurately establish his position. It took approximately another 15-20 minutes before a fire vehicle could reach the scene of the burning aircraft. The fire was then extinguished.", "probable_cause": "The following factors were reported: \r\n1. The company's training system did not detect deficiencies in the pilot's instrument flying skills.\r\n2. The cloud base was low at the time of the accident and dark night conditions prevailed.\r\n3. The pilot persisted with an unstabilised approach.\r\n4. The pilot descended, probably inadvertently, below the approach minimum altitude.\r\n5. The pilot may have been suffering from fatigue."}