{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-melbourne-3-killed", "date": "Mar 23, 2006 at 1057 LT", "type": "Cessna 340", "operator": "RAC Ltd", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Jacksonville – Melbourne", "msn": "340A-0124", "yom": 1976, "flight_number": null, "city": "Melbourne", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 801, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3068, "circumstances": "A commercial pilot with two passengers on a business flight was arriving at the destination airport in a light twin-engine airplane. The air traffic tower controller advised the pilot to follow a slower airplane that was on base leg. The controller subsequently asked the accident pilot if he could reduce his speed,\"a little bit.\" The accident pilot responded that he was slowing down. Less than a minute later, the controller told the accident pilot that he was cleared to land. The accident pilot's last radio transmission was his acknowledgement of the landing clearance. The controller stated that he did not see the accident airplane other than on the radar scope, but did see a plume of smoke on the final approach course for the active runway. Ground witnesses described the airplane as flying slowly with its wings wobbling, turn right, and dive into the ground. The majority of the airplane was consumed by a post crash fire. Inspection of the flight controls and engines disclosed no evidence of any preimpact mechanical problems. Low speed flight reduces the margin between a safe operating speed and an aerodynamic stall. Wing \"wobble\" at low speeds is often an indicator of an incipient aerodynamic stall. Toxicological samples from the pilot’s blood detected diphenhydramine (a sedating antihistamine commonly known by the trade name Benadryl) at a level consistent with recent use of at least the maximum over-the-counter dose. Diphenhydramine is used over-the-counter for allergies and as a sleep aid, and has been shown to impair the performance of complex cognitive and motor tasks at typical doses. The FAA does not specifically prohibit the use of diphenhydramine by pilots, though Federal Air Regulation 91.17, states, in part: \"No crewmember may act, or attempt to act as a crewmember of a civil aircraft...while using any drug that affects the person's faculties in any way contrary to safety...\"", "probable_cause": "The pilot's failure to maintain adequate airspeed to avoid a stall during the final approach to land. Contributing to the accident was the pilot's impairment due to the use of a sedating antihistamine."}