{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-330c-sharjah-6-killed", "date": "Oct 21, 2009 at 1531 LT", "type": "Boeing 707", "operator": "Azza%20Air%20Transport", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sharjah - Khartoum", "msn": "20123/788", "yom": 1969, "flight_number": "AZZ2241", "city": "Sharjah", "zone": "Sharjah (الشارقةّ)", "country": "United Arab Emirates", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 19943, "captain_hours_type": null, "copilot_hours": 6649, "copilot_hours_type": 900, "aircraft_hours": 77484, "circumstances": "The Aircraft was operating a flight from Sharjah International Airport, UAE to Khartoum International Airport, Sudan, with a total of six persons on board: three flight crew members (captain, co-pilot, and flight engineer), a ground engineer, and two load masters. All of the crew members sustained fatal injuries due to the high impact forces. Sometime after of liftoff, the core cowls of No. 4 engine separated and collapsed onto the departure runway, consequently No. 4 Engine Pressure Ratio (“EPR”) manifold flex line ruptured leading to erroneous reading on the EPR indicator. The crew interpreted the EPR reading as a failure of No. 4 engine; accordingly they declared engine loss and requested the tower to return to the Airport. The Aircraft went into a right turn, banked and continuously rolled to the right at a high rate, sunk, and impacted the ground with an approximately 90° right wing down attitude. ", "probable_cause": "The Investigation identified the following Causes: \r\n(a) the departure of the No. 4 engine core cowls; \r\n(b) the consequent disconnection of No. 4 engine EPR Pt7 flex line; \r\n(c) the probable inappropriate crew response to the perceived No. 4 engine power loss; \r\n(d) the Aircraft entering into a stall after the published maximum bank angle was exceeded; and \r\n(e) the Aircraft Loss of Control (“LOC”) that was not recoverable. \n\r\nContributing Factors to the Accident were: \r\n(a) the Aircraft was not properly maintained in accordance with the Structure Repair \r\nManual where the cowls had gone through multiple skin repairs that were not up to \r\naviation standards; \r\n(b) the Operator’s maintenance system failure to correctly address the issues relating to the No. 4 engine cowls failure to latch issues; \r\n(c) the failure of the inspection and maintenance systems of the maintenance organization, which performed the last C-Check, to address, and appropriately report, the damage of the No. 4 engine cowls latches prior to issuing a Certificate of Release to Service; \r\n(d) the Operator’s failure to provide a reporting system by which line maintenance personnel report maintenance deficiencies and receive timely and appropriate guidance and correction actions; \r\n(e) the Operator’s quality system failure to adequately inspect and then allow repairs that were of poor quality or were incorrectly performed to continue to remain on the Aircraft; and \r\n(f) the SCAA safety oversight system deficiency to adequately identify the Operator’s chronic maintenance, operations and quality management deficiencies."}