{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-32-everglades-national-park-110-killed", "date": "May 11, 1996 at 1413 LT", "type": "Douglas DC-9", "operator": "Valujet.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Miami - Atlanta", "msn": "47377", "yom": 1969, "flight_number": "VJA592", "city": "Everglades National Park", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 105, "pax_fatalities": 105, "other_fatalities": 0, "total_fatalities": 110, "captain_hours": 8928, "captain_hours_type": 2116, "copilot_hours": 6448, "copilot_hours_type": 2148, "aircraft_hours": 68395, "circumstances": "ValuJet Flight 592 was a scheduled flight from Miami (MIA) to Atlanta (ATL). The inbound flight had been delayed and arrived at Miami at 13:10. Flight 592 had been scheduled to depart at 13:00. The cruising altitude was to be flight level 350 with an estimated time en route of 1 hour 32 minutes. The DC-9 was loaded with 4,109 pounds of cargo (baggage, mail, and company-owned material (COMAT)). The COMAT consisted of two main tires and wheels, a nose tire and wheel, and five boxes that were described as \"Oxy Cannisters -‘Empty.’\" This cargo was loaded in the forward cargo compartment. Flight 592 was pushed back from the gate shortly before 13:40. The DC-9 then taxied to runway 09L. At 14:03:24, ATC cleared the flight for takeoff and the flightcrew acknowledged the clearance. At 14:04:24, the flightcrew was instructed by ATC to contact the north departure controller. At 1404:32, the first officer made initial radio contact with the departure controller, advising that the airplane was climbing to 5,000 feet. Four seconds later, the departure controller advised flight 592 to climb and maintain 7,000 feet. The first officer acknowledged the transmission. At 14:07:22, the departure controller instructed flight 592 to \"turn left heading three zero zero join the WINCO transition climb and maintain one six thousand,\" which was acknowledged. At 14:10:03, the flight crew heard a sound, after which the captain remarked, \"What was that?\" At that moment, the airplane was at 10,634 feet msl, 260 knots indicated airspeed (KIAS), and both engine pressure ratios (EPRs) were 1.84. At 14:10:15, the captain stated, \"We got some electrical problem,\" followed 5 seconds later with, \"We’re losing everything.\" At 14:10:21, the departure controller advised flight 592 to contact Miami on frequency 132.45 mHz. At 14:10:22, the captain stated, \"We need, we need to go back to Miami,\" followed 3 seconds later by shouts in the background of \"fire, fire, fire, fire.\" At 14:10:27, the CVR recorded a male voice saying, \"We’re on fire, we’re on fire.\" At 14:10:28, the controller again instructed flight 592 to contact Miami Center. At 14:10:31, the first officer radioed that the flight needed an immediate return to Miami. The controller replied, \"Critter five ninety two uh roger turn left heading two seven zero descend and maintain seven thousand.\" The first officer acknowledged the heading and altitude. The peak altitude reached was 10,879 feet msl at 14:10:31, and about 10 seconds a wings-level descent started. Shouting in the cabin subsided. The controller then queried flight 592 about the nature of the problem. The captain stated \"fire\" and the first officer replied, \"uh smoke in the cockp... smoke in the cabin.\" The controller responded, \"roger\" and instructed flight 592, when able, to turn left to a heading of two five zero and to descend and maintain 5,000 feet. At 14:11:12, a flight attendant was heard shouting, \"completely on fire.\" The DC-9 began to change heading to a southerly direction and at 14:11:26, the north departure controller advised the controller at Miami Center that flight 592 was returning to Miami with an emergency. At 14:11:37, the first officer transmitted that they needed the closest available airport. At 1411:41, the controller replied, \"Critter five ninety two they’re gonna be standing (unintelligible) standing by for you, you can plan runway one two when able direct to Dolphin [a navaid] now.\" At 14:11:46, the first officer responded that the flight needed radar vectors. At 14:11:49, the controller instructed flight 592 to turn left heading one four zero. The first officer acknowledged the transmission. At 14:12:45, the controller transmitted, \"Critter five ninety two keep the turn around heading uh one two zero.\" There was no response from the flightcrew. The last recorded FDR data showed the airplane at 7,200 feet msl, at a speed of 260 KIAS, and on a heading of 218 degrees. At 14:12:48, the FDR stopped recording data. The airplane’s radar transponder continued to function; thus, airplane position and altitude data were recorded by ATC after the FDR stopped. At 14:13:18, the departure controller instructed, \"Critter five ninety two you can uh turn left heading one zero zero and join the runway one two localizer at Miami.\" Again there was no response. At 14:13:27, the controller instructed flight 592 to descend and maintain 3,000 feet. At 1413:37, an unintelligible transmission was intermingled with a transmission from another airplane. No further radio transmissions were received from flight 592. At 14:13:43, the departure controller advised flight 592, \"Opa Locka airport’s about 12 o’clock at 15 miles.\" The accident occurred at 14:13:42. Ground scars and wreckage scatter indicated that the airplane crashed into the Everglades in a right wing down, nose down attitude.", "probable_cause": "The National Transportation Safety Board determines that the probable causes of the accident, resulting in a fire in the Class D cargo compartment from the actuation of one or more oxygen generators improperly carried as cargo, were: (1) the failure of SabreTech to properly prepare, package, identify, and track unexpended chemical oxygen generators before presenting them to ValuJet for carriage; (2) the failure of ValuJet to properly oversee its contract maintenance program to ensure compliance with maintenance, maintenance training, and hazardous materials requirements and practices; and (3) the failure of Federal Aviation Administration (FAA) to require smoke detection and fire suppression systems in Class D cargo compartments. Contributing to the accident was the failure of the FAA to adequately monitor ValuJet's heavy maintenance program and responsibilities, including ValuJet's oversight of its contractors, and Sabre Tech's repair station certificate; the failure of the FAA to adequately respond to prior chemical oxygen generator fires with programs to address the potential hazards; and the failure of ValuJet to ensure that both ValuJet and contract maintenance employees were aware of the carrier's no-carry hazardous materials policy and had received appropriate hazardous materials training.\" (NTSB/AAR-97/06)"}