{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-near-kwethluk-2-killed", "date": "Apr 8, 2014 at 1557 LT", "type": "Cessna 208B Grand Caravan", "operator": "ERA-Alaska2", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Bethel - Bethel", "msn": "208B-1004", "yom": 2002, "flight_number": null, "city": "Kwethluk", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 593, "captain_hours_type": 1, "copilot_hours": 14417, "copilot_hours_type": 5895, "aircraft_hours": 11206, "circumstances": "The check airman was conducting the first company training flight for the newly hired second-in-command (SIC). Automatic Dependent Surveillance-Broadcast (ADS-B) data showed that, after departure, the airplane began a series of training maneuvers, consistent with normal operations. About 21 minutes into the flight, when the airplane was about 3,400 ft mean sea level, it began a steep descent and subsequently impacted terrain. An airplane performance study showed that the airplane reached a nose-down pitch of about -40 degrees and that the descent rate reached about 16,000 ft per minute. Numerous previous training flights conducted by the check airman were reviewed using archived ADS-B data and interviews with other pilots. The review revealed that the initial upset occurred during a point in the training when the check airman typically simulated an in-flight emergency and descent. Postaccident examination for the airframe and control surfaces showed that the airplane was configured for cruise flight at the time of the initial upset. Examination of the primary and secondary flight control cables indicated that the cables were all intact at the time of impact. Trim actuator measurements showed an abnormal trailing-edge-up, nose-down configuration on both trim tabs. The two elevator trim actuator measurements were inconsistent with each other, indicating that one of the actuators was likely moved during the wreckage recovery. Based on the supporting data, it is likely that one of the actuators indicated the correct trim tab position at the time of impact. Simulated airplane performance calculations showed that, during a pitch trim excursion, the control forces required to counter an anomaly increases to unmanageable levels unless the appropriate remedial procedures are quickly applied. Given the simulated airplane performance calculations, the trim actuator measurements, and the check airman's known training routine, it is likely that the check airman simulated a pitch trim excursion and that the SIC, who lacked experience in the airplane type, did not appropriately respond to the excursion. The check airman did not take remedial action and initiate the recovery procedure in time to prevent the control forces from becoming unmanageable and to ensure that recovery from the associated dive was possible.", "probable_cause": "The check airman's delayed remedial action and initiation of a recovery procedure after a simulated pitch trim excursion, which resulted in a loss of airplane control.\n"}