{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-31-monrovia", "date": "Aug 18, 1994 at 1058 LT", "type": "Douglas DC-9", "operator": "ADC%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Banjul – Freetown – Monrovia – Accra – Lagos", "msn": "45872", "yom": 1968, "flight_number": "ADK018", "city": "Monrovia-James Spriggs Payne", "zone": "Montserrado", "country": "Liberia", "region": "Africa", "crew_on_board": 11, "crew_fatalities": 0, "pax_on_board": 74, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 62484, "circumstances": "The aircraft departed Banjul, Gambia, on an international scheduled service to Lagos with intermediate stops in Freetown, Monrovia and Accra. The approach to Monrovia-James Spriggs Payne Airport runway 23 was completed in poor weather conditions with heavy rain falls. On final, at a distance of 4 km from the runway threshold, the captain confirmed that visual contact with the runway was established and continued the approach. At an excessive speed, the airplane passed over the runway threshold at a height of 150 feet and landed too far down the runway, about 3,000 feet past its threshold. On a wet runway surface, despite full brakes and reverse thrusts were deployed, the aircraft could not be stopped within the remaining distance. It overran at a speed of 80 knots and came to rest 120 metres further, bursting into flames. All 85 occupants were rescued, among them few were slightly injured. The aircraft was destroyed by fire. ", "probable_cause": "Wrong approach configuration on part of the crew who completed the approach at an excessive speed and well above the glide, causing the aircraft to land too far down runway 23 which is 1,800 metres long. Poor braking action due to wet runway surface was considered as a contributing factor as well as the fact that the crew failed to initiate a go-around procedure as the landing maneuver was obviously missed. "}