{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-raleigh-12-killed", "date": "Feb 19, 1988 at 2127 LT", "type": "Swearingen SA227 Metro III", "operator": "AVAir", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Raleigh - Richmond", "msn": "AC-622", "yom": 1985, "flight_number": "CE3378", "city": "Raleigh-Durham", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 3426, "captain_hours_type": 1836, "copilot_hours": 2080, "copilot_hours_type": 450, "aircraft_hours": 4222, "circumstances": "The aircraft departed during low ceiling, low visibility, and night conditions. Shortly after takeoff the aircraft impacted a reservoir. Analysis of radar data indicated the aircraft was in a 45° descending turn. Examination of the aircraft trim system showed that the aircraft was trimmed for level flight. There was no voice or flight data recorder on board. A review of ATC communications indicated that the captain was communicating with ATC allowing the first officer to accomplish the flying duties. Examination of the wreckage revealed no indications of powerplant or system failures. However, there was evidence that the sas warning light was illuminated, the sas switch was in the off position, and no sas system malfunction could be found. Witnesses stated that before the flight the captain had complained of illness but he decided to report for duty. Company records showed instances of substandard performance by the first officer. The investigation found company oversight of training, operations, and inadequate faa supervision. All 12 occupants were killed. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was a failure of the flight crew to maintain a proper flightpath. Contributing to the accident were the ineffective management and supervision of flight crew training and flight operations, and ineffective FAA surveillance of AVAir."}