{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-200-wildwood-4-killed", "date": "Dec 12, 1976 at 2326 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Atlantic City Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Philadelphia - Atlantic City - Wildwood", "msn": "262", "yom": 1969, "flight_number": "AL977", "city": "Wildwood-Cape May County", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 7428, "captain_hours_type": 5200, "copilot_hours": 4306, "copilot_hours_type": 282, "aircraft_hours": null, "circumstances": "About 2326LT on December 12, 1976, an Atlantic City Airlines, Inc., De Havilland DHC-6 Twin Otter (N101AC) operating as Allegheny Commuter Flight 977, crashed about 4,000 feet short of the approach end of runway 19 at Cape May County Airport, New Jersey. The flight was making a VOR approach to runway 23 with a circle to land on runway 19. Of the 10 persons aboard, 4 died of injuries received in the crash. The aircraft was destroyed. About 10 minutes before the accident, according to official observation logs, at Cape May County Airport the sky was obscured with a 400 feet indefinite ceiling; the visibility was 1 mi in fog; and the wind was from 250° at 6 kns. Visibility was 1 mi to the south and west and 1 1/2\r\nmi to the east and north.", "probable_cause": "The flight crew's lack of altitude awareness during a circling approach permitting the aircraft's flight path to deviate below a safe approach profile. The aircraft's rate of descent and descent flight path angle increased as a result of windshear encountered during visual approach below minimum descent altitude. The flight crew did not recognize these flight path deviations because they were relying on visual references which were degraded by non-homogeneous fog and on kinesthetic cues which were adversely affected by the aircraft's forward centre of gravity resulting from the improperly loaded aircraft. Contributing to the accident was the lack of company procedures requiring altitude-callouts during the visual portion of an approach."}