{"url": "https://www.baaa-acro.com/crash/ground-accident-airbus-a340-642x-toulouse", "date": "Nov 15, 2007 at 1710 LT", "type": "Airbus A340-600", "operator": "Airbus%20Industries", "flight_phase": "Parking", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "856", "yom": 2007, "flight_number": null, "city": "Toulouse-Blagnac", "zone": "Haute-Garonne", "country": "France", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 0, "pax_on_board": null, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 24, "circumstances": "The aircraft registered F-WWCJ was tested at a fixed point at Toulouse-Blagnac Airport. The current mission consisted of various test' systems with airline technicians who had ordered the plane. It unfolded engines in operation without chocks wheel. At the end of these tests, after having stopped and inspected the engines, the technicians restarted them for a new fixed point at high power, to find the source of oil seeps. About three minutes after power-up, the aircraft began to moving forward. The technician in the left seat noticed the movement and informed the test technician in the right seat. The latter acted on the brakes located rudder pedals then released the parking brake. The DFDR then shows a  release of the brake command with the rudder bar. As the plane continues to advance, he tried to deviate from his course using the steering wheel. The nose gear quickly got in the way as the plane accelerated. The plane struck an inclined blast wall. Its front part broke and flipped over to the other side. Thirteen seconds elapsed between the start of the aircraft's movement and the shock with the wall. The aircraft was destroyed and all nine occupants were injured, four seriously. ", "probable_cause": "The accident was due to completion without chocks and on all four engines at the same time of a test during which the thrust was close to the capacity of the parking brake. The lack of a system for detecting and correcting drifts while carrying ground tests, in a context of industrial pressure and permanent sales force, encouraged a test to be carried out outside of the established procedures. The surprise led the ground test technician to focus on the brakes; therefore, he did not think of reducing the engines thrust."}