{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6a-whiteman-afb", "date": "May 10, 1965 at 0601 LT", "type": "Douglas DC-6", "operator": "Aaxico%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Oklahoma City – Whiteman ", "msn": "45480/980", "yom": 1958, "flight_number": "AAX1416B", "city": "Whiteman AFB", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15498, "captain_hours_type": 2389, "copilot_hours": 4481, "copilot_hours_type": 2113, "aircraft_hours": 20557, "circumstances": "AAXICO Airlines, Inc., Douglas DC-6A, N6579C, operating as AAXICO Flight No. 1416B, a regularly scheduled Civil Air Movement (CAN) cargo flight, crashed during an approach to a landing at Whiteman Air Force Base (AFB), Knob Noster, Missouri, at approximately 0601 c.s.t., on May 18, 1965. The crew of three, the only persons on board, escaped uninjured. The flight scheduled from Hill AFB, Ogden, Utah, to Offutt AFB, Omaha, Nebraska, with several scheduled stops at various Air Force Bases en route, departed Tinker AFB, Oklahoma City, Oklahoma, on an Instrument Flight Rules (IFR) flight plan at 0446 c.s.t., for Whiteman AFB. Shortly after departure the flight canceled IFR and continued in accordance with Visual Flight Rules (VFR). The flight approached Whiteman AFB from the south and was cleared for a straight-in visual approach to runway 36. At this time a line of thunderstorms was located to the west of the field, portions of which were moving across the approach end of the runway obstructing the crew's sighting of the base and runway. The flight continued the approach, encountering heavy rain which reduced visibility to the point that visual contact with the ground was lost. The aircraft struck the trees 4,204 feet short of the runway threshold and 740 feet to the right of the extended runway center-line while on a magnetic heading of 020 degrees. The aircraft continued to the ground, shearing the landing gear, the No. 4 engine and right outer wing panel, and slid approximately 1,200 feet on the bottom fuselage surface. Ground impact ruptured the right wing fuel tanks spilling fuel along the wreckage path which resulted in a ground fire of short duration. The left inboard tanks ruptured causing a fire which destroyed the fuselage interior.", "probable_cause": "The Board determines that the probable cause of this accident was an improperly executed landing approach into an area of adverse weather, during which the aircraft was allowed to descend to an altitude too low to avoid striking trees."}