{"url": "https://www.baaa-acro.com/crash/crash-antonov-24b-verona-49-killed", "date": "Dec 13, 1995 at 1955 LT", "type": "Antonov AN-24", "operator": "Banat Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Verona - Timișoara", "msn": "77303309", "yom": 1967, "flight_number": "BZ166", "city": "Verona-Villafranca (Valerio Catullo)", "zone": "Veneto", "country": "Italy", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 41, "pax_fatalities": 41, "other_fatalities": 0, "total_fatalities": 49, "captain_hours": 3645, "captain_hours_type": 2345, "copilot_hours": 7100, "copilot_hours_type": 6500, "aircraft_hours": 8913, "circumstances": "Following an uneventful flight from Timișoara, the aircraft landed at Verona-Villafranca Airport and remained parked for one hour on the ground. Weather conditions were as follow: wind 290° at 2 knots, horizontal visibility 1,300 metre, RVR 2,000 metres, haze and snow falls, overcast 500 feet, OAT 0° C, dew point below zero, QNH 1010. Despite snow falls, the crew decided to takeoff without proceeding to a pre-departure deicing/anti-icing of the aircraft. After liftoff from runway 23, the crew initiated a slight turn to the right heading 239° when 25 seconds later, the aircraft's speed dropped to 179 km/h. The crew selected elevator down so the speed increased to 185 km/h but when elevators were selected up again, the speed dropped to 155 km/h. The aircraft rolled to the right to an angle of 67° then lost height and crashed in a field located 1,500 metres from the airport, bursting into flames. The aircraft disintegrated on impact and all 49 occupants were killed, among them 31 Italian businessmen, 4 Serbs and 14 Romanians including all crew membres. At the time of the accident, the aircraft was operated by Banat Air and leased from Romavia.  ", "probable_cause": "Loss of control during initial climb due to the loss of aerodynamic properties consequently to the decision of the crew to not proceed to any deicing or anti-icing procedure prior to departure. The following contributing factors were reported:\r\n- Poor weather conditions, \r\n- Excessive accumulation of snow and frost on wings, tail, elevators, stabs and fuselage,\r\n- The crew underestimated and exercised poor judgment about weather conditions,\r\n- The pilot-in-command probably suffered a spatial disorientation during initial climb because of the unusual attitude of the aircraft caused by the loss of aerodynamic properties, combined with snow falls, the lack of visibility due to the night and a possible optical illusion caused by the headlights on,\r\n- The total weight of the aircraft was 2 tons above the MTOW,\r\n- The weight & balance sheet could not be checked prior to takeoff because the crew failed to transmit such document that was not requested by ground personnel, \r\n- A slight loss of power occurred on the right engine shortly after liftoff. "}