{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-la-alianza-2-killed", "date": "Dec 2, 2013 at 2010 LT", "type": "Swearingen SA227 Metro III", "operator": "IBC-Airways-2", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "CSQ405", "msn": "AC-654B", "yom": 1986, "flight_number": "Santo Domingo - San Juan", "city": "La Alianza", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1740, "captain_hours_type": 686, "copilot_hours": 1954, "copilot_hours_type": 92, "aircraft_hours": 33888, "circumstances": "The captain and first officer were conducting an international cargo flight in the twin-engine turboprop airplane. After about 40 minutes of flight during night visual meteorological conditions, an air traffic controller cleared the airplane for a descent to 7,000 ft and then another controller further cleared the airplane for a descent to 3,000 ft and told the flight crew to expect an ILS (instrument landing system) approach. During the descent, about 7,300 ft and about 290 kts, the airplane entered a shallow left turn, followed by a 45-degree right turn and a rapid, uncontrolled descent, during which the airplane broke up about 1,500 ft over uneven terrain. The moderately loaded cargo airplane was not equipped with a flight data recorder or cockpit voice recorder (CVR) (although it previously had a CVR in its passenger configuration) nor was it required by Federal Aviation Administration (FAA) regulations. There were also no avionics on board with downloadable or nonvolatile memory. As a result, there was limited information available to determine what led to the uncontrolled descent or what occurred as the flight crew attempted to regain control of the airplane. Also, although the first officer was identified in FAA-recorded radio transmissions several minutes before the loss of control and it was company policy that the pilot not flying make those transmissions, it could not be determined who was at the controls when either the loss of control occurred or when the airplane broke up. There was no evidence of any in-flight mechanical failures that would have resulted in the loss of control, and the airplane was loaded within limits. Evidence of all flight control surfaces was confirmed, and, to the extent possible, flight control continuity was also confirmed. Evidence also indicated that both engines were operating at the time of the accident, and, although one of the four propeller blades from the right propeller was not located after separating from the fractured hub, there was no evidence of any preexisting propeller anomalies. The electrically controlled pitch trim actuator did not exhibit any evidence of runaway pitch, and measurements of the actuator rods indicated that the airplane was trimmed slightly nose low, consistent for the phase of flight. Due to the separation of the wings and tail, the in-flight positions of the manually operated aileron and rudder trim wheels could not be determined. Other similarly documented accidents and incidents generally involved unequal fuel burns, which resulted in wing drops or airplane rolls. In one case, the flight crew intentionally induced an excessive slide slip to balance fuel between the wings, which resulted in an uncontrolled roll. However, in the current investigation, the fuel cross feed valve was found in the closed position, indicating that a fuel imbalance was likely not a concern of the flight crew. In at least two other events, unequal fuel loads also involved autopilots that reached their maximum hold limits, snapped off, and rolled the airplane. Although the airplane in this accident did not have an autopilot, historical examples indicate that a sudden yawing or rolling motion, regardless of the source, could result in a roll, nose tuck, and loss of control. The roll may have been recoverable, and in one documented case, a pilot was able to recover the airplane, but after it lost almost 11,000 ft of altitude. During this accident flight, it was likely that, during the descent, the flight crew did regain control of the airplane to the extent that the flight control surfaces were effective. With darkness and the rapid descent at a relatively low altitude, one or both crewmembers likely pulled hard on the yoke to arrest the downward trajectory, and, in doing so, placed the wings broadside against the force of the relative wind, which resulted in both wings failing upward. As the wings failed, the propellers simultaneously chopped through the fuselage behind the cockpit. At the same time, the horizontal stabilizers were also positioned broadside against the relative wind, and they also failed upward. Evidence also revealed that, at some point, the flight crew lowered the landing gear. Although it could not be determined when they lowered the gear, it could have been in an attempt to slow or regain control of the airplane during the descent. Although reasons for the loss of control could not be definitively determined, the lack of any preexisting mechanical anomalies indicates a likelihood of flight crew involvement. Then, during the recovery attempt, the flight crew's actions, while operating under the difficult circumstances of darkness and rapidly decreasing altitude, resulted in the overstress of the airplane.\n", "probable_cause": "The flight crew's excessive elevator input during a rapid descent under night lighting conditions, which resulted in the overstress and breakup of the airplane. Contributing to the\r\naccident was an initial loss of airplane control for reasons that could not be determined because postaccident examination revealed no mechanical anomalies that would have\r\nprecluded normal operation."}