{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-dallas", "date": "Oct 9, 2001 at 1322 LT", "type": "Beechcraft 90 King Air", "operator": "J & D Aircraft Sales", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Taos - Dallas", "msn": "LJ-690", "yom": 1976, "flight_number": null, "city": "Dallas-Love Field", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7000, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2356, "circumstances": "The commercial pilot flew the airplane on a cross-country flight of at least 2 hours and 47 minutes before dropping of his passengers, and flew back for 2 hours and 7 minutes without refueling. The pilot reported that as the airplane turned onto final approach, the right engine began to surge. He reduced the power on the right engine and increased power on the left, but the airplane started to roll right so he elected to reduce the power on the left engine and land in an alley. Prior to impacting wires, the pilot retracted the landing gear and brought the condition levers to \"cut-off.\" A witness observed the airplane prior to impact and noted that the \"motor wasn't on.\" The airplane impacted power lines, a tree, a natural gas meter, two residences, and a fence. The fuel tanks were compromised during the impact sequence, and the fire department sprayed the area with fire retardant foam. A test of the water runoff revealed \"negative results for petroleum risk.\" Examination of both engines' fuel lines between their respective firewalls and fuel heaters, and fuel pumps and fuel control units revealed that they were void of fuel.", "probable_cause": "The pilot's failure to refuel the airplane, which resulted in fuel exhaustion and subsequent loss of dual engine power while on approach."}