{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-cullman-6-killed", "date": "Mar 5, 1984 at 1836 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Anderson%20Tile%20Carpet", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Montgomery - Cullman", "msn": "421B-0911", "yom": 1975, "flight_number": null, "city": "Cullman", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 3423, "captain_hours_type": 1599, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2478, "circumstances": "Pilot cleared for night NDB runway 19 approach to Folsom Field. Erratic radar track during procedure turn and inbound intercept. Witnesses described 200 feet ceiling and reduced visibility in fog at airport. Other witnesses observed aircraft on northbound course, followed by turn to west at rooftop height, well below MDA, at a point one mile northeast of airport. Engine operation sounded normal. Aircraft contacted trees at about airport elevation, one mile north of airport. Wreckage produced 632 feet path. Severed limbs, prop damage and engine examination revealed evidence of power at impact. 62 year old pilot had not flown with cfi in years, instrument currency unknown. Pilot found to have severe coronary atherosclerosis with near total occlusion of right coronary artery and evidence of past total occlusion of left circumflex coronary artery. Ceiling lower than forecast for area. Flight purpose to carry employees to meet truck, go job site. Limitation on pilot medical certificate, not for night flight. Sunset at 1745 cst, 51 minutes before accident. All six occupants were killed. ", "probable_cause": "Occurrence #1: in flight collision with object\r\nPhase of operation: approach - faf/outer marker to threshold (IFR)\r\nFindings\r\n1. (f) weather condition - low ceiling\r\n2. (f) weather condition - fog\r\n3. (f) light condition - dark night\r\n4. (f) object - tree(s)\r\n5. (c) IFR procedure - not followed - pilot in command\r\n6. (c) visual/aural perception - pilot in command\r\n7. (c) minimum descent altitude - not maintained - pilot in command\r\n8. (c) lack of recent instrument time - pilot in command\r\n9. (c) missed approach - not performed - pilot in command\r\n10. (c) physical impairment - pilot in command"}