{"url": "https://www.baaa-acro.com/crash/crash-antonov-10-chisinau-11-killed", "date": "May 15, 1970 at 1149 LT", "type": "Antonov AN-10", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chișinău  - Chișinău ", "msn": "9 4 008 02", "yom": 1959, "flight_number": null, "city": "Chișinău", "zone": "Chișinău City District", "country": "Moldova", "region": "Europe", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4641, "circumstances": "The crew (seven pilots under supervision) and four instructors, were completing several training flight at Chișinău Airport. Following several manoeuvres, the crew initiated a new approach with both engines n°3 & 4 out of service. On final, the airplane banked left, lost height and crashed in a huge explosion few km short of runway threshold. The aircraft was totally destroyed and all 11 crew members were killed. ", "probable_cause": "Poor flying techniques on part of the crew and wrong decisions taken during a missed approach under conditions that did not guarantee the continuation of the flight on two engines. The following factors were considered as contributing:\r\n- The approach speed and altitude were below the prescribed values for such manoeuvre,\r\n- The decision of the instructor to initiate a go-around was too late, \r\n- The action to increase power on both left engine was inadapted and insufficient according to the situation, \r\n- The aircraft deviated from the approach path by 1,850 meters, \r\n- The runway at Chișinău Airport was 2,000 meters long, which is insufficient for approach with two engines out, \r\n- The crew failed to inform ATC he was completing an approach with two engines inoperative. "}