{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-springdale-2-killed", "date": "Nov 1, 2013 at 1742 LT", "type": "Beechcraft 90 King Air", "operator": "J & G Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Pine Bluff - Bentonville", "msn": "LJ-949", "yom": 1981, "flight_number": null, "city": "Springdale", "zone": "Arkansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3367, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11396, "circumstances": "As the airplane was descending toward its destination airport, the pilot reported to an air traffic controller en route that he needed to change his destination to a closer airport because the airplane was low on fuel. The controller advised him to land at an airport that was 4 miles away. Shortly after, the pilot contacted the alternate airport’s air traffic control tower (ATCT) and reported that he was low on fuel. The tower controller cleared the airplane to land, and, about 30 seconds later, the pilot advised that he was not going to make it to the airport. The airplane subsequently impacted a field 3.25 miles southeast of the airport. One witness reported hearing the engine sputter, and another witness reported that the engine “did not sound right.” Forty-foot power lines crossed the field 311 feet from the point of impact. It is likely that the pilot was attempting to avoid the power lines during the forced landing and that the airplane then experienced an inadvertent stall and an uncontrolled collision with terrain. About 1 quart of fuel was observed in each fuel tank. No evidence of fuel spillage was found on the ground; no fuel stains were observed on the undersides of the wing panels, wing trailing edges, or engine nacelles; and no fuel smell was observed at the accident site. However, the fuel totalizer showed that 123 gallons of fuel was remaining. Magnification of the annunciator panel light bulbs revealed that the left and right low fuel pressure annunciator lights were illuminated at the time of impact. An examination of the airframe and engines revealed no anomalies that would have precluded normal operation. About 1 month before the accident, the pilot had instructed the fixed-base operator at Camden, Arkansas, to put 25 gallons of fuel in each wing tank; however, it is unknown how much fuel was already onboard the airplane. Although the fuel totalizer showed that the airplane had 123 gallons of fuel remaining at the time of the crash,  information in the fuel totalizer is based on pilot inputs, and it is likely the pilot did not update the fuel totalizer properly before the accident flight. The pilot was likely relying on the fuel totalizer instead of the fuel gauges for fuel information, and he likely reported his low fuel situation to the ATCT after the annunciator lights illuminated. ", "probable_cause": "A total loss of power to both engines due to fuel exhaustion. Also causal were the pilot’s reliance on the fuel totalizer rather than the fuel quantity gauges to determine the fuel on\r\nboard and his improper fuel planning."}