{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-12-buguruslan-4-killed", "date": "Sep 9, 1948 at 1103 LT", "type": "Ilyushin II-12", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Buguruslan - Buguruslan", "msn": "30258", "yom": 10, "flight_number": null, "city": "Buguruslan", "zone": "Orenburg oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 245, "circumstances": "The crew, consisting of one instructor and three pilots, was completing a local training flight in Buguruslan-Baymakovo Airport. A first training program was completed at an altitude of 1,000 meters and the instructor ordered the crew to return to the airport. On final approach, during the last segment, the instructor ordered the crew to go around and increased power on both engines. During the initial climb, while at a height of 150 meters, the instructor shut down the right engine and feathered its propeller. At the same time, the aircraft banked left up to 30°, stalled, dove into the ground and crashed in a huge explosion. The aircraft was destroyed by impact forces and a post crash fire and all four crew members were killed.", "probable_cause": "It was determined that the aircraft stalled during initial climb due to the combination of flaps deployed at an angle of 17° and the power reduction on the right engine. Unfortunately, the distance between the aircraft and the ground was insufficient to a expect any recovery. The instructor decided to make a single engine climb out in violation of the NPP-47 training program and instructions published for IL-12. Wrong interpretation of the situation on part of the rest of the crew also contributed to the loss of control. The following factors were considered as contributory: \r\n- Absence of appropriate measures concerning pilots management and training,\r\n- Lack of control and demands in relation to the flight crews."}