{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-65-a90-1-king-air-slidell-2-killed", "date": "Apr 19, 2016 at 2115 LT", "type": "Beechcraft 90 King Air", "operator": "St-Tammany1", "flight_phase": "Landing (descent or approach)", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Slidell - Slidell", "msn": "LM-106", "yom": 1968, "flight_number": null, "city": "Slidell", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 18163, "captain_hours_type": 614, "copilot_hours": 7769, "copilot_hours_type": 22, "aircraft_hours": 15208, "circumstances": "The airline transport pilot and commercial copilot were conducting a mosquito abatement application flight. Although flight controls were installed in both positions, the pilot typically operated the airplane. During a night, visual approach to landing at their home airfield, the airplane was on the left base leg and overshot the runway's extended centerline and collided with 80-ft-tall power transmission towers and then impacted terrain. Examination of the airplane did not reveal any preimpact anomalies that would have precluded normal operation. Both pilots were experienced with night operations, especially at their home airport. The pilot had conducted operations at the airport for 14 years and the copilot for 31 years, which might have led to crew complacency on the approach . Adequate visibility and moon disk illumination were available; however, the area preceding the runway is a marsh and lacks cultural lighting, which can result in black-hole conditions in which pilots may perceive the airplane to be higher than it actually is while conducting an approach visually. The circumstances of the accident are consistent with the pilot experiencing the black hole illusion which contributed to him flying an approach profile that was too low for the distance remaining to the runway. It is likely that the pilot did not maintain adequate crosscheck of his altimeter and radar altimeter during the approach and that the copilot did not monitor the airplane's progress; thus, the flight crew did not recognize that they were not maintaining a safe approach path. Further, it is likely that neither pilot used the visual glidepath indicator at the airport, which is intended to be a countermeasure against premature descent in visual conditions.", "probable_cause": "The unstable approach in black-hole conditions, resulting in the airplane overshooting the runway extended centerline and descending well below a safe glidepath for the runway. Contributing to the accident was the lack of monitoring by the copilot allowing the pilot to fly well below a normal glidepath."}