{"url": "https://www.baaa-acro.com/crash/ground-accident-douglas-dc-8-62f-singapore", "date": "Feb 28, 2002 at 0044 LT", "type": "Douglas DC-8", "operator": "Arrow%20Air", "flight_phase": "Taxiing", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "46105/494", "yom": 1969, "flight_number": "APWP6L", "city": "Singapore-Changi", "zone": "Singapore", "country": "Singapore", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5000, "captain_hours_type": null, "copilot_hours": 4300, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 28 February 2002, Arrow Air flight APWP6L touched down on Runway 02L at Singapore Changi Airport at 0029 hours. The weather and visibility conditions were good (visibility in excess of 10 km). Arrow Air flight APWP6L was assigned to park at Bay 117, a remote aircraft parking bay. After APWP6L had landed, the runway controller at Changi Tower instructed the aircraft to taxi towards Bay 117. The aircraft exited the runway via rapid exit Taxiway W4. The ground movement planner at Changi Tower selected the taxiway centre line lights to guide the aircraft from Taxiway W4 onto Taxiway NC1, Taxiway WA and to Bay C7 (Bay 117 is the second parking bay after Bay C7). Due to airside construction works, there was no taxiway centre line lighting guidance on the short segment of taxi route from Taxiway WA from abeam Bay C7 to the adjacent parking Bays 117 and 118. There was a NOTAM in force that stipulated that during hours of darkness, aircraft could only be towed in to Bays 117 and 118. On reaching Bay C7, the flight crew of APWP6L did not stop but continued taxiing past Bay C7 onto a diverted portion of Taxiway WA. The taxiway centre line lights for this diverted portion of Taxiway WA were not switched on by ATC as it was not the intended route for the aircraft. At about 0037 hours, flight APWP6L called Changi Tower to indicate its position near Bay 106. Realising that flight APWP6L had missed its allocated parking position, the ground movement planner at Changi Tower routed the aircraft back to Bay 117 via Taxiways WA, SC, WP, V8 and Taxiway WA. Flight APWP6L followed the return route until it was abeam Bay 117 on the straight section of the diverted portion of Taxiway WA, just before Taxiway VY. At that location, the pilot saw the ground marshaller at Bay 117 on the aircraft’s right side. Instead of continuing to follow the assigned taxi route, the aircraft turned right. In doing so, it left the WA taxiway centre line and went onto a grass area between Taxiway WA and the parking apron. The nose gear of the aircraft went across an open drain of about 1.4 m wide and 0.8 m deep within the grass area. The aircraft came to a halt when its main landing gears went into the drain at about 0044 hours. All three crew members escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "The following findings were identified:\r\n- The accident took place at night in clear weather.\r\n- The flight crew members were properly licensed, qualified, medically fit, and in compliance with flight and duty time regulations.\r\n- The flight crew had the latest revision of the Jeppesen charts showing the layout of Singapore Changi Airport, including the yellow supplementary chart showing the area near Bay 117 in greater detail.\r\n- The flight crew was not familiar with the Terminal 1 West Apron area where Bay 117 was located.\r\n- The flight crew was aware of the NOTAM tow-in requirement at Bay 117 during hours of darkness.\r\n- The Apron Control duty supervisor was aware of the requirement for aircraft to be towed into Bay 117. He did not coordinate with ATC and the ground handler on towing arrangements as there was no towing procedure established for aircraft assigned to Bay 117 or 118.\r\n- The runway controller was not aware of the requirement for aircraft to be towed into Bay 117. He instructed flight APWP6L to follow the green lights to Bay 117 in accordance with standard ATC procedures.\r\n- The flight crew did not stop at Bay C7 to ask for instructions or guidance to get to Bay 117.\r\n- After missing Bay 117 initially, the flight crew continued taxiing in search of the bay on their own.\r\n- On the subsequent return towards Terminal 1 West Apron, after sighting Bay 117 and the marshaller on the right of the aircraft, the flight crew deviated from the Taxiway WA centre line marking and green centre line lights and turned the aircraft to the right directly towards Bay 117.\r\n- The flight crew did not see a turn signal from the marshaller but believed they saw the marshaller waving a “move ahead” signal. \r\n- The flight crew did not notice on the Jeppesen charts that there was a turf island separating Taxiway WA from the parking apron where Bay 117 was located. \r\n- The flight crew turned right from the straight section of the diverted portion of Taxiway WA to head directly towards Bay 117 even though there was no turn signal from the marshaller, no instruction to turn from ATC and no aircraft parking bay guidance marking on the ground to indicate to the flight crew to turn right.\r\n- The landing lights of the aircraft were turned on.\r\n- As taxiway centre line lights were provided along Taxiway WA, according to ICAO Annex 14, there was no requirement for taxiway edge lights to be provided. However, where there is a large unmarked paved area adjacent to a taxiway, the provision of taxiway edge lights or reflective markers (in addition to taxiway centre line lights) would provide an additional cue to pilots to stay within the taxiway. This may help to prevent pilots inadvertently straying off the taxiway.\r\n- There were no edge lights or markers to show the grass area between Taxiway WA and the parking apron where Bay 117 was located. There is no requirement in ICAO Annex 14 for edge lights or markers to show the presence of grass areas adjacent to taxiways.\r\n- The drain located within the grass area between the diverted portion of Taxiway WA and the parking apron was outside the taxiway strip. According to ICAO Annex 14, drains located outside a taxiway strip are not required to be covered.\r\n- The airworthiness of the aircraft was not a factor in this accident."}