{"url": "https://www.baaa-acro.com/crash/crash-cessna-t207-turbo-skywagon-colorado-springs", "date": "Sep 4, 2013 at 0758 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Sanborn Map Company", "flight_phase": "Takeoff (climb)", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Colorado Springs – Lubbock", "msn": "207-0259", "yom": 1974, "flight_number": null, "city": "Colorado Springs", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5200, "captain_hours_type": 18, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13482, "circumstances": "The pilot reported that he performed the takeoff with the airplane at gross weight and with the flaps up and the engine set for maximum power, which he verified by reading the instruments. During the takeoff, the airplane accelerated and achieved liftoff about 65 to 70 mph and then climbed a couple hundred feet before the pilot began to lower the nose to accelerate to normal climb speed (90 to 100 mph). The airplane then stopped climbing and would not accelerate more than 80 mph. While the pilot attempted to maintain altitude, the airplane decelerated to 70 mph with the engine still at the full-power setting. With insufficient runway remaining to land, the pilot made a shallow right turn toward lower terrain and subsequently made a hard landing in a field. The pilot likely allowed the airplane to climb out of ground effect before establishing a proper pitch attitude and airspeed for the climb, which resulted in the airplane inadvertently entering a “region of reversed command” at a low altitude. In this state, the airplane may be incapable of climbing and would require either more engine power or further lowering of the airplane’s nose to increase airspeed. Because engine power was already at its maximum and the airplane was at a low altitude, the pilot was unable to take remedial action to fly out of the region of reversed command.", "probable_cause": "The pilot’s failure to establish the proper pitch attitude and airspeed during takeoff with the engine at maximum power, which resulted in the exceedance of the airplane’s climb performance capability. "}