{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46a-50-cu-commando-cucuta-4-killed", "date": "Oct 4, 1965 at 1105 LT", "type": "Curtiss C-46 Commando", "operator": "SEA Colombia - Servicios Especiales Aéreos Colombia", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cúcuta – Arauca", "msn": "30465", "yom": 1944, "flight_number": null, "city": "Cúcuta", "zone": "Norte de Santander", "country": "Colombia", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight was a non-scheduled domestic cargo flight. After boarding 162 crates of beer and one passenger at Cúcuta the crew requested clearance to takeoff for Arauca at 10:42. Clearance was given by the control tower for runway 20 with a south-southeast wind at 18 kt. The aircraft used more than 3/4 of the runway for takeoff and initiated a turn over the city, returning over the aerodrome to gain height. At 10:58 hours it reported departure to the southeast, climbing in visual meteorological conditions to 7500 ft and estimating Santo Domingo at 11:13. When the aircraft was at approximately 4500 to 5000 ft, flames were seen coming from the no. 2 engine. The aircraft attempted to return to Cúcuta. On its way back the starboard wing and engine were seen tearing off from the aircraft. The rest of the aircraft immediately started to roll slowly to the left and moments later struck the ground on Cerro del Espinazo. All four occupants were killed. ", "probable_cause": "The accident was attributed to a maintenance error consisting of inadequate service and inspection of part of, or systems of the starboard engine, giving rise to a fire in an undetermined part of the accessories section of that engine. A contributing factor was a maintenance error consisting of failure to comply with Technical Directive No. 62-10-2 (Aerocivil C-46-39)."}