{"url": "https://www.baaa-acro.com/crash/crash-antonov-12bp-madras", "date": "Jan 7, 1974", "type": "Antonov AN-12", "operator": "Indian-Air-Force", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "2 4 014 06", "yom": 1962, "flight_number": null, "city": "Chennai", "zone": "Tamil Nadu", "country": "India", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Report from the crew: was PIC of AN-12 , BL740 on that fateful day of 7 January 1974. My cojo was Baldy, Nav Ambre and Prasad Rao (AEB examiner) & among passengers were Wingco \"Doc Lu\" of AEB, one F/L Raghavan of Logs & some more passengers. We were taking off from Chennai-Meenambhakam Airport in the morning. After waiting for takeoff clearance which got delayed due some R/T problem, we finally started rolling. All parameters were normal. Ambre started calling speed. As he called out speed 160, I was changing over from nose steer to control column. At that very moment, the aircraft swung viciously to the right and left, the R/W at 45° angle. It took me 2 or 3 seconds to realize that its an engine failure.  I immediately chopped all 4 throttles back and saw a really big ditch right ahead runway 07 before I could take any other action, the aircraft had come to a halt. With the impact, it broke in two. Main entrance door had flung open, there was no fire or casualty. I took my time to come out after ensuring all switches off. After we all had come out, we saw Ambre trying to come out from copilots side window and fell on the ground and broke his arm. Our Gunner W/O Nagarajan was the other crew member who was injured but safe. Co I was headed by Wingco \"Chotu\" Desores and Chotu S/L Rajgopalan. During the proceedings, they estimated that even after chopping throttles, the aircraft wouldn't have taken more than 5 seconds before crashing. Some passengers had gone to nearby Army M I room along with crew to get first aid treatment. Ultimately, I was blamed for \"Not using sufficient brake and for carrying unauthorized passengers.\" This incident brought an end to my AN-12 flying. As I understood later that S/L (later Air Marshal) Victor Puri, then my Flt Cdr in 44 Sqn tried to simulate N°4 engine auto feather (which was the cause of accident) with an experienced crew and could not control the aircraft as it was going to leave the runway and had to open power to regain control. Due to anti clockwise rotation of propeller blades, the n°4 engine is the most critical engine in an Antonov AN-12.\r\nSource: http://www.bharat-rakshak.com/IAF/Database/Aircraft/BL-740", "probable_cause": null}