{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-fort-lauderdale-1-killed", "date": "Jun 13, 2001 at 2122 LT", "type": "Beechcraft 90 King Air", "operator": "Soltuca", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Charallave – Fort Lauderdale", "msn": "LJ-591", "yom": 1973, "flight_number": null, "city": "Fort Lauderdale-Hollywood", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3205, "captain_hours_type": 1800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8279, "circumstances": "The Venezuelan registered Beech King Air C90 departed Caracas, Venezuela's Óscar Machado Zuloaga International Airport at 1516 eastern daylight time with a pilot and two passengers aboard, and flew to Fort Lauderdale-Hollywood International Airport, Florida. The route of flight filed with air traffic control was: after departure, direct to Maiquetia, thence Amber Route-315 to Bimini, thence Bahama Route 57V to Fort Lauderdale. The {planned} flight level was 220, and the pilot stated that 7 hours 15 minutes of fuel was aboard. Immigration/customs general declaration papers found aboard the wreckage stated the flight's intended destination was Nassau, and the pilot's daughter stated he always stopped at Nassau for fuel on many previous trips. After 6 hours 6 minutes, the aircraft crashed into a highway abutment about 1,700 feet short of his intended landing runway at Fort Lauderdale with total accountable onboard fuel of 3 to 4 gallons. One passenger received fatal injuries, one passenger received serious injuries, and the pilot received serious injuries. Engine factory service center disassembly examination revealed that the engines and their components exhibited no evidence of any condition that would have precluded normal operation, precrash. No precrash abnormalities with the propellers, their respective components, or any other aircraft system component were noted. Type certification data sheets for the C90 state that the unusable fuel aboard is 24 lbs., (3.6 gallons of Jet-A fuel).", "probable_cause": "The pilot's failure to properly plan fuel consumption and to perform an en route refueling, resulting in a total loss of engine power due to fuel exhaustion while on downwind leg for landing at eventual destination, causing an emergency descent and collision with a highway embankment."}