{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-mesquite-8-killed", "date": "Sep 2, 1995 at 0838 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Adventure%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "North Las Vegas - Yellowstone", "msn": "421C-0265", "yom": 1977, "flight_number": null, "city": "Mesquite", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 18628, "captain_hours_type": 86, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5461, "circumstances": "After climbing to 18,400 feet msl, the pilot reported a turbocharger problem and reversed course. He said he 'may lose the left engine' and that he was unable to maintain altitude. He diverted to an alternate airport. During a right turn onto final approach, the airplane was observed to cross (overshoot) the extended centerline of the runway. It continued in a right turn back toward the centerline, and then entered a left turn to intercept the inbound course. The turn steepened, and then the airplane entered a spin and crashed 1/2 mile short of the runway. A warped flange and evidence of exhaust gas leakage were found on the Inconel exhaust system Wye collector, at the wastegate outlet of the left engine. Neither propeller was in a feather position. There was evidence that the left engine was providing low power during impact. A note on the pilot's clipboard indicated that the (left engine) fuel flow and cylinder head temperature went to zero, and the manifold pressure dropped to 10 inches. The note also indicated that the pilot switched the 'boost pump' to high, the fuel flow went to 260 psi, and manifold pressure increased to 18.5 inches. Calculations showed that the airplane's gross weight (GW) and center-of-gravity (CG) were 7,645 pounds and 158.32 inches. The maximum allowable GW and CG were 7,450 pounds and 158 inches. During impact, the flaps were fully extended. The 'Engine Inoperative Landing' procedure stated, 'Wing Flaps - DOWN when landing is assured.' Most of the pilot's flight time in the Cessna 421 was before 1985; no record was found of recurrent training in the airplane since 1984. Annual and turbocharger inspections were made at 78 and 120 flight hours, respectively, before the accident, but no logbook entries were made concerning maintenance or replacement parts for the exhaust system. All eight occupants were killed. ", "probable_cause": "Failure of the pilot to maintain adequate airspeed, while maneuvering on approach, which resulted in an inadvertent stall/spin and uncontrolled collision with terrain. Factors relating to the accident were: the pilot allowed the aircraft weight and balance limitations to be exceeded; the pilot's lack of recurrent training in the make and model of airplane; inadequate maintenance/inspection of the engine exhaust systems; a warped and leaking exhaust system flange on the left engine, which resulted in a loss of power in that engine; and the pilot's improper use of the flaps. "}