{"url": "https://www.baaa-acro.com/crash/ground-accident-boeing-747-436-johannesburg", "date": "Dec 22, 2013 at 2243 LT", "type": "Boeing 747-400", "operator": "British%20Airways-2", "flight_phase": "Taxiing", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Johannesburg – London", "msn": "24054/794", "yom": 1990, "flight_number": "BA034", "city": "Johannesburg-Oliver Reginald Tambo (Jan Smuts)", "zone": "Gauteng", "country": "South Africa", "region": "Africa", "crew_on_board": 17, "crew_fatalities": 0, "pax_on_board": 185, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 20050, "captain_hours_type": 12500, "copilot_hours": 5700, "copilot_hours_type": 1400, "aircraft_hours": 110578, "circumstances": "The British Airways aircraft B747-400, flight number BA034 with registration G-BNLL, was going to embark on a commercial international air transportation long haul flight from FAOR to EGLL. The ATC gave the crew instructions to push back, start and face south, then taxi using taxiway Bravo to the Category 2 holding point for Runway 03L. During the taxi, instead of turning to the left to follow Bravo, the crew continued straight ahead, crossing the intersection of taxiway Bravo and aircraft stand taxilane Mike. After crossing the intersection, still being on Mike, the aircraft collided with a building. An investigation was conducted and several causal factors were determined. Amongst others, it was determined that the crew erred in thinking they were still taxiing on Bravo while in fact they were taxiing on Mike. This mistake, coupled with other contributory factors such as the briefing information, taxi information, ground movement visual aids, confusion and loss of situational awareness led to the collision. All 202 occupants evacuated safely while four people in the building were injured. The aircraft was damaged beyond repair. ", "probable_cause": "The loss of situational awareness caused the crew to taxi straight ahead on the wrong path, crossing the intersection/junction of Bravo and Mike instead of following Bravo where it turns off to the right and leads to the Category 2 holding point. Following aircraft stand taxilane Mike; they collided with a building on the right-hand side of Mike.\r\nContributory Factors:\r\n- Failure of the crew to carry out a briefing after they had received instruction from ATC that the taxi route would be taxiway Bravo.\r\n- The lack of appropriate knowledge about the taxiway Bravo layout and relevant information (caution notes) on threats or risks to look out for while taxiing on taxiway Bravo en route to the Cat 2 holding point.\r\n- The aerodrome infrastructure problems (i.e. ground movement navigation aids anomalies), which created a sense of confusion during the taxi.\r\n- Loss of situation awareness inside the cockpit causing the crew not to detect critical cues of events as they were gradually unfolding in front of them.\r\n- Failure of the other crew members to respond adequately when the Co-pilot was commenting on the cues (i.e. narrowness and proximity to the building).\r\n- The intersection/junction of Bravo and Mike not being identified as a hotspot area on the charts. "}