{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-g200-yangzhou", "date": "May 20, 2018 at 1507 LT", "type": "Gulfstream G200", "operator": "Star%20Jet", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yangzhou - Yangzhou", "msn": "134", "yom": 2006, "flight_number": null, "city": "Yangzhou-Taizhou", "zone": "Jiangsu", "country": "China", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16075, "captain_hours_type": 1181, "copilot_hours": 538, "copilot_hours_type": 246, "aircraft_hours": 2235, "circumstances": "The aircraft departed Yanzhou-Taizhou Airport runway 35 at 1359LT on a local training flight, carrying two pilots under supervision and one instructor. The crew completed six landings without any incidents. and then changed seats, the instructor seating in the left front seat and the pilot under training in the right front seat. On final approach to runway 35, at a height of about 50 feet, the aircraft followed a steep descent and landed 500 metres past the runway threshold to the right of the runway centerline with a 4,5° deviation to the right. The copilot elected to correct this when the aircraft veered to the left, exited the runway then deviated to the right and came back on the runway. Then it veered off runway to the right, lost its both main gears and came to rest in a grassy area. All thre crew members evacuated safely and the aircraft was damaged beyond repair.", "probable_cause": "The accident was the consequence of a series of errors on part of the crew. The following findings were identified:\r\n- The rate of descent on short final was escessive (sink rate),\r\n- The aircraft landed to the right of the runway centerline with a 4,5° deviation to the right, \r\n- The copilot actions were excessives and the aircraft veered to the left, \r\n- The instructor did not intervene in due time to expect recovery."}