{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-osteen-3-killed", "date": "Jun 14, 2002 at 2035 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Calvin M. Miller", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Raleigh-Durham – Marco Island", "msn": "46-08134", "yom": 1988, "flight_number": null, "city": "Osteen", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2800, "captain_hours_type": 380, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2813, "circumstances": "The pilot of N9143B had asked the controller if he could deviate about 12 miles west, because he thought he saw \"a hole\" in the weather. The radar ground track plot showed the pilot had observed a 3 to 5 mile gap between two thunderstorm clusters and attempted to fly through an area of light radar echoes between the two large areas of heavier echoes. N9143B departed level flight, and radar showed that a cluster of thunderstorms, level three to four were present in the vicinity of N9143B's ground track position. Radar data showed that N9143B started an uncontrolled descent from FL260 (about 27,500 feet msl). Witnesses reported hearing the engine make a winding noise, then observed the airplane come out of the clouds about 300 feet above the ground, in a nose low spiral, and the right wing was missing. The right wing was not found at the crash site, but was located 1.62 miles from the main wreckage. The pilot of N9143B had requested and received a weather briefing. He was advised that the weather data indicated that an area forecast for his route of flight predicted thunderstorm activity and cumulonimbus clouds with tops as high as FL450 (flight level 45,000 feet), and a weather system impacting the Florida Gulf Coast, consisted of \"looming thunderstorms\" in that area. The pilot had contacted the Enroute Flight Advisory Service (EFAS, commonly known as \"Flight Watch\") for enroute weather advisories, and advised of \"cells\" east of St. Augustine, advised of convective SIGMET 05E in effect for southern Florida, and was advised that a routing toward the Tampa/St. Petersburg area and then southward, would avoid an area of thunderstorms.", "probable_cause": "The pilot's inadequate weather evaluation and his failure to maintain control of the airplane after entering an area of thunderstorms resulting in an in-flight separation of the right wing and right horizontal stabilizer and impact with the ground during an uncontrolled descent."}