{"url": "https://www.baaa-acro.com/crash/crash-savoia-marchetti-sm73-tatsfield-11-killed", "date": "Dec 10, 1935 at 1645 LT", "type": "Savoia-Marchetti SM.73", "operator": "Sabena.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Brussels – Croydon", "msn": "30004", "yom": 1935, "flight_number": null, "city": "Tatsfield", "zone": "Surrey", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew initiated the descent to Croydon at sunset. The visibility was poor due to a cloud ceiling down to 100 metres. Too low on approach, the three engine aircraft impacted tree tops, stalled and crashed in a wooded area located in Tatsfield, some 13 km southast of Croydon Airport, bursting into flames. The airplane was destroyed and all 11 occupants were killed.\r\nCrew:\r\nJean Schroonbroodt, pilot,\r\nJean Desmet, radio navigator,\r\nAlphonse Verbinnen, engineer, \r\nRaymond Strechfuss, steward.", "probable_cause": "It was concluded by the UK Accidents Investigation Branch that the pilot, who did not request bearings from the airport and tried to navigate on his own, had descended out of the clouds prematurely, apparently uncertain of his position. He then must have initiated a steep climbing turn to the left to avoid the surrounding hilltops or after realizing that the visible lights were in fact those of Biggin Hill Aerodrome, not Croydon. During the evasive manoeuvre, the SM.73 apparently lost flying speed and stalled, resulting in an uncontrolled descent. And after the stall, some of the passengers may have been thrown forward, causing a weight distribution imbalance that would have hindered the ability of the pilot to regain control. No evidence was found of any prior mechanical or structural failure in the aircraft."}