{"url": "https://www.baaa-acro.com/crash/crash-avro-696-shackleton-mr2-isle-mull-10-killed", "date": "Dec 11, 1953 at 1730 LT", "type": "Avro 696 Shackleton", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Ballykelly - Ballykelly", "msn": null, "yom": 1953, "flight_number": null, "city": "Isle of Mull", "zone": "Argyll", "country": "United Kingdom", "region": "Europe", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed RAF Ballykelly to conduct radar homings on a submarine in the Lough Foyle - Rathlin Island area; this exercise was to be followed by a navigation exercise. The crew completed the anti-submarine procedures and made its last radio call at 1715LT. At 1730LT several civilians on the Isle of Mull heard a low-flying aircraft and an explosion. Wreckage was found on the Isle of Mull and the nearby mainland, although it is not clear whether this wreckage was found on the coastline or further inland. All 10 crew died in the accident. The condition of some of the wreckage indicated an extremely violent impact, but the cause of the accident was never established. In March 1954, further wreckage was found in the Sound of Mull which led experts to conclude that the aircraft appeared to have struck the water whilst turning to starboard in a nose down attitude. A search of the high ground on the Isle of Mull did not reveal any evidence of a glancing impact. Contemporary press cuttings indicate that it crashed in the Sound of Mull with the wreckage being found by the frigate HMS Volage on 13th December 1953. A month later a further cutting reports two bodies being found.\r\nCrew:\r\nF/Lt Fielding Chevallier, pilot,\r\nF/Sgt Arthur Gordon McReavy, pilot,\r\nF/O Horace Alexander Brown, navigator,\r\nP/O Alfred Brinkman, navigator,\r\nSgt Maurice Wilfred Richard Griffin, flight engineer, \r\nSgt Patrick William Harrington, flight engineer, \r\nSgt Lewis Ralph Allen, air signaller,\r\nSgt Michael Barron Bern, air signaller,\r\nSgt John Dodd, air signaller,\r\nSgt Maurice James Griffin, air signaller.\r\nSource: https://www.findagrave.com ", "probable_cause": "The exact cause of the accident could not be determined. "}