{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-black-mountain-1-killed", "date": "Jul 21, 2001 at 1707 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "William C. Plate", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Asheville – Burnsville", "msn": "46-36024", "yom": 1996, "flight_number": null, "city": "Black Mountain", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2555, "captain_hours_type": 127, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 709, "circumstances": "The pilot had left the airplane at Asheville on the day before the accident due to low cloud ceilings and visibility at Mountain Air Airport, his destination, and completed the trip by rental car. On the day of the accident the pilot returned the rental car and at 1656 departed Asheville in N396PM, enroute to Mountain Air Airport, 27 miles north of Asheville. The last radio contact with the pilot was at 1701:44, when the pilot told controllers at Asheville that he was in visual flight rule conditions, at 4,000 feet. The last radar contact with the flight was by FAA Atlanta Center, at 1704:00, when the flight was about 5 miles south of the accident site at 3,800 feet. The flight did not arrive at the destination, an emergency locator transmitter signal was received by satellite, and search and rescue operations were begun. The pilot and the wreckage of the airplane was located the next day about 1400. The airplane had collided with 75-foot tall trees, at about the 4,800-foot msl level on the side of Bullhead Mountain, while in a wings level attitude, while on a 170 degree heading. After the initial impact the airplane continued for another 300 feet, causing general breakup of the airplane. The main wreckage came to rest on a northerly heading. All components of the airplane were located at the crash site and there was no evidence of precrash failure or malfunction of the airplane structure, flight controls, airplane systems, engine, or propeller. A witness reported that the weather near the time of the accident on the Blue Ridge Parkway, located about 3/4 mile to the west of the crash site, was very foggy. Satellite images show clouds were present at the crash site and the Asheville airport, located 20 miles south-southwest of the crash site, reported overcast clouds 2,600 feet agl or 4,765 feet msl, and visibility 4 miles in haze, at the time of the accident. An Airmet for mountain obscuration due to clouds, mist, and haze was in effect at the time the pilot departed and the at the time of the accident. No record to show that the pilot received a weather briefing from a FAA Flight Service Station was found.", "probable_cause": "The pilot's continued VFR flight into IMC conditions resulting in the airplane colliding with mountainous terrain."}