{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-near-hundred-mile-house-52-killed", "date": "Jul 8, 1965 at 1541 LT", "type": "Douglas DC-6", "operator": "CP%20Air", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Vancouver – Prince George – Fort Saint John – Fort Nelson – Watson Lake – Whitehorse", "msn": "43844", "yom": 1953, "flight_number": "CP021", "city": "Hundred Mile House", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 46, "pax_fatalities": 46, "other_fatalities": 0, "total_fatalities": 52, "captain_hours": 13218, "captain_hours_type": 2690, "copilot_hours": 2657, "copilot_hours_type": 982, "aircraft_hours": 29998, "circumstances": "Flight 21 was a scheduled domestic flight from Vancouver, British Columbia, to Whitehorse, Yukon Territory via Prince George, Fort St. John, Fort Nelson in British Columbia and Watson Lake, Yukon Territory. At 1442 hours PST, the aircraft took off on an instrument flight plan for Prince George, via Victor 300 and Blue 22 airways. In the vicinity of Hope, north-bound on Blue 22 airway, it was sighted by CPA Flight 22 and communication was established. Shortly afterwards at 1517 hours Flight 21 requested and received clearance to proceed from its position north of Hope direct to Williams Lake, which track would pass to the west of Ashcroft. At 1529 hours, it reported to the Vancouver Air Traffic Control Centre that it had passed Ashcroft at 1527 hours at 16 000 ft and was estimating William Lake at 1548 hours. This transmission was acknowledged by the Vancouver Centre. At 1538 hours, Vancouver Centre called Flight 21 and did not receive a reply. About two minutes later, three \"mayday\" calls were heard by Vancouver Centre. At approximately the same time a four-engined aircraft, subsequently identified as Flight 21, was observed by witnesses flying in the clear over the Gustafson Lake area about 20 miles west of 100 Mile House, B.C. The aircraft appeared to be in normal flight when an explosion was heard, following which smoke was observed and the tail separated from the fuselage. The main portion of the wreckage assumed a nose down attitude and spiraled to the left until it crashed into a wooded area about 4.5 miles north of Gustafson Lake. The accident occurred at 1541 hours. There were no survivors among the 52 occupants. ", "probable_cause": "Explosion of a device which resulted in aerial disintegration."}