{"url": "https://www.baaa-acro.com/crash/crash-cessna-t303-crusader-louisa-1-killed", "date": "Mar 4, 2010 at 1245 LT", "type": "Cessna 303 Crusader", "operator": "James A. Youngquist", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Manassas - Louisa - Danville", "msn": "303-00001", "yom": 1981, "flight_number": null, "city": "Louisa", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2255, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1374, "circumstances": "During takeoff, one witness noted that at least one engine seemed to be running rough and not making power. Several other witnesses, located about 1/2 mile northwest of the airport, observed the accident airplane pass overhead in a right turn. They reported that the engine noise did not sound normal. Two of the witnesses noted grayish black smoke emanating from the airplane. The airplane then rolled left and descended nose down into the front yard of a residence. Review of maintenance records revealed the airplane underwent an annual inspection and extensive maintenance about 3 months prior to the accident. One of the maintenance issues was to troubleshoot the right engine that was reportedly running rough at cruise. During the maintenance, the right engine fuel pump, metering valve, and fuel manifold were removed and replaced with overhauled units. Additionally, the right engine fuel flow was reset contrary to procedures contained in an engine manufacturer service information directive; however, the fuel pump could not be tested due to thermal damage and the investigation could not determine if the fuel flow setting procedure contributed to the loss of power on the right engine. On-scene examination of the wreckage and teardown examination of both engines did not reveal any preimpact mechanical malfunctions. Teardown examination of the right propeller revealed that the blades were not at or near the feather position, which was contrary to the emergency procedure published by the manufacturer, to secure the engine and feather the propeller in the event of an engine power loss. The right propeller exhibited signatures consistent with low or no power at impact, while the left propeller exhibited signatures consistent of being operated with power at impact.\n", "probable_cause": "The pilot's failure to maintain aircraft control and secure the right engine during a loss of engine power after takeoff. Contributing to the accident was the loss of engine power on the right engine for undetermined reasons.\n"}