{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-10-chicago-273-killed", "date": "May 25, 1979 at 1504 LT", "type": "Douglas DC-10", "operator": "American-Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago - Los Angeles", "msn": "46510/22", "yom": 1971, "flight_number": "AA191", "city": "Chicago-O'Hare", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 13, "crew_fatalities": 13, "pax_on_board": 258, "pax_fatalities": 258, "other_fatalities": 2, "total_fatalities": 273, "captain_hours": 22500, "captain_hours_type": 3000, "copilot_hours": 9275, "copilot_hours_type": 1200, "aircraft_hours": 19871, "circumstances": "American Airlines Flight 191, a McDonnell-Douglas DC-10-10, crashed on takeoff from Chicago-O'Hare International Airport, Illinois, USA. The aircraft was destroyed and all 271 occupants were killed. Additionally, two persons on the ground sustained fatal injuries. At 14:59 hours local time Flight 191 taxied from the gate at O'Hare Airport. The flight was bound for Los Angeles, California, with 258 passengers and 13 crew members on board. Maintenance personnel who monitored the flight's engine start, push-back, and start of taxi did not observe anything out of the ordinary. The weather at the time of departure was clear, and the reported surface wind was 020° at 22 kts. Flight 191 was cleared to taxi to runway 32R for takeoff. The company's Takeoff Data Card showed that the stabilizer trim setting was 5° aircraft nose up, the takeoff flap setting was 10°, and the takeoff gross weight was 379,000 lbs. The target low pressure compressor (N1) rpm setting was 99.4 percent, critical engine failure speed (V1) was 139 kts indicated airspeed (KIAS), rotation speed (VR) was 145 KIAS, and takeoff safety speed (V2) was 153 KIAS. Flight 191 was cleared to taxi into position on runway 32R and hold. At 15:02:38, the flight was cleared for takeoff, and at 15:02:46 the captain acknowledged, \"American one ninety-one under way.\" The takeoff roll was normal until just before rotation at which time sections of the No.1 (left) engine pylon structure came off the aircraft. Witnesses saw white smoke or vapor coming from the vicinity of the No. 1 engine pylon. During rotation the entire No. 1 engine and pylon separated from the aircraft, went over the top of the wing, and fell to the runway. Flight 191 lifted off about 6,000 ft down runway 32R, climbed out in a wings-level attitude. About nine seconds after liftoff, the airplane had accelerated to 172 knots and reached 140 feet of altitude. As the climb continued, the airplane began to decelerate at a rate of about one knot per second, and at 20 seconds after liftoff, and an altitude of 325 feet, airspeed had been reduced to 159 knots. At this point, the airplane began to roll to the left, countered by rudder and aileron inputs. The airplane continued to roll until impact, 31 seconds after liftoff, and in a 112-degree left roll, and 21-degree nose down pitch attitude. At 15:04 Flight 191 crashed in an open field and trailer park about 4,600 ft northwest of the departure end of runway 32R. The aircraft was demolished during the impact, explosion, and ground fire. The No.1 engine pylon failure during takeoff was determined to have been caused by unintended structural damage which occurred during engine/pylon reinstallation using a forklift. The engine/pylon removal and reinstallation were being conducted to implement two DC-10 Service Bulletins. Both required that the pylons be removed, and recommended that this be accomplished with the engines removed. The Service Bulletin instructions assumed that engines and pylons would be removed separately, and did not provide instructions to remove the engine and pylon as a unit. Additionally, removal of the engines and pylons as a unit was not an approved Maintenance Manual procedure. The lack of precision associated with the use of the forklift, essentially an inability to perform the fine manipulations necessary to accomplish reinstallation of the engine/strut assembly, in combination with the tight clearances between the pylon flange and the wing clevis resulted in damage to the same part that had just been inspected. Inspections of other DC-10 pylon mounts following the accident resulted in nine additional cracked mounts being identified.", "probable_cause": "The asymmetrical stall and the ensuing roll of the aircraft because of the uncommanded retraction of the left wing outboard leading edge slats and the loss of stall warning and slat disagreement indication systems resulting from maintenance-induced damage leading to the separation of the no.1 engine and pylon assembly procedures which led to failure of the pylon structure. Contributing to the cause of the accident were the vulnerability of the design of the pylon attach points to maintenance damage; the vulnerability of the design of the leading edge slat system to the damage which produced asymmetry; deficiencies in FAA surveillance and reporting systems which failed to detect and prevent the use of improper maintenance procedures; deficiencies in the practices and communications among the operators, the manufacturer, and the FAA which failed to determine and disseminate the particulars regarding previous maintenance damage incidents; and the intolerance of prescribed operational procedures to this unique emergency."}