{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-7-near-las-vegas-47-killed", "date": "Apr 21, 1958 at 0830 LT", "type": "Douglas DC-7", "operator": "United-Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Desert", "schedule": "Los Angeles – Denver – New York", "msn": "45142", "yom": 1956, "flight_number": "UA736", "city": "Las Vegas", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 42, "pax_fatalities": 42, "other_fatalities": 0, "total_fatalities": 47, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "United Airlines Flight 736 departed Los Angeles International Airport at 0737 hours Pacific standard time with 42 passengers and 5 crew aboard. It was a scheduled passenger flight to New York, which was proceeding normally in accordance with an IFR flight plan along Victor Airway 16 to Ontario, California, and Victor Airway 8 to Denver. The aircraft was cleared to a cruising altitude of 21 000 ft msl and advised to climb in VFR weather conditions. At 0735 the flight reported to Aeronautical Radio that it was over Ontario at 12 000 ft and was climbing in VFR conditions. Then at 081 1 it reported over Daggett at its cruising altitude of 21 000 ft and estimated that it would reach Las Vegas (omni range station) at 0831, This was the last position report made by the flight. At approximately 0745 hours that morning F-100F, 56-3755, took off from Nellis Air Force Base, Las Vegas, Nevada on an instrument training flight carrying an instructor and a trainee pilot. The flight was in accordance with a VFR local flight plan filed with Nellis Operations and the local traffic control tower. At approximately 0823, 755 called Nellis VFR Control and reported that it was \"inbound on KRAM\" ( a local commercial radio broadcast station). The flight requested an altitude assignment from which it would conduct a simulated ADF instrument jet penetration utilizing KRAM. The VFR controller assigned 755, 28 000 ft and advised it to report over the radio station. At approximately 0828, the flight reported that it was over KRAM requesting a penetration. The VFR controller cleared it for an immediate penetration and requested that it report the penetration turn. 755 then reported leaving 28 000 ft. There were no &her reports from the flight in connection with this procedure. At 0830 the offices of Aeronautical Radio at Los Angeles, Denver and Salt Lake City heard an emergency message from the United flight.. . . . \" United 736, Mayday, midair collision, over Las Vegas. \" At the same time, as nearly as can be determined, there was an unrecorded emergency transmission from the F-1 00F. This message was heard by the VFR controller and by the two pilots of another F-100F. All were agreed that the first portion of the emergency transmission was \"Mayday, Mayday, this is 755. \" The last part of the message was either, \"We've had a flameout\" or 'We're bailing out.\" The aircraft collided at 21 000 ft over a position later determined to be about 9 miles southwest of the Las Vegas VOR station, on Victor Airway 8, approximately 1-3/4 miles to the right (southeast) of the centerline. Both aircraft fell out of control and crashed killing the 47 persons on board the DC-7 and both pilots of the F-100F. ", "probable_cause": "The probable cause of this collision was a high rate of near head-on closure at high altitude; human and cockpit limitations; and the failure of Nellis Air Force Base and the Civil Aeronautics Administration to take every measure to reduce a known collision exposure."}