{"url": "https://www.baaa-acro.com/crash/crash-cessna-404-titan-ii-benton-harbor", "date": "Aug 3, 1996 at 0740 LT", "type": "Cessna 404 Titan", "operator": "Superior%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kalamazoo - Benton Harbor", "msn": "404-0098", "yom": 1977, "flight_number": null, "city": "Benton Harbor", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3250, "captain_hours_type": 53, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10624, "circumstances": "The pilot said that during the landing approach, the flight visibility was inadequate for landing, and he aborted the landing. Witnesses observed the airplane touchdown long and fast, then it\r\nentered fog that shrouded the runway. Subsequently, the airplane collided with trees, then impacted on marshland about 70 feet below the runway elevation. No mechanical anomalies were found with the airplane or engines that would prevent flight. On the day before the accident, the pilot's duty day began at 0500. He had a 9-hour rest period (during the day) that did not involve any sleep. The pilot said that after work on the day before the accident, he arrived home about 2300. His wife said he awoke about 0230 on the accident date, then he returned to bed and arose between 0430 and 0500, departing for work about 0530. During his regular duty day rest period, the pilot would drive a total of 4 hours to and from his home each day. The pilot said he would generally get to bed about 2300 to 2330, arising about 0430 each work day. Also, he said he needed between 6 and 8 hours of sleep at night. ", "probable_cause": "The pilot's delay in initiating a go-around after not attaining the proper touchdown point during the landing, and his failure to remain clear of obstructions (trees) during the go-around. Factors relating to the accident were the adverse weather condition (fog and low ceiling), pilot fatigue, and the proximity of trees to the runway. "}