{"url": "https://www.baaa-acro.com/crash/crash-cessna-401a-gladewater", "date": "Nov 12, 2011 at 1635 LT", "type": "Cessna 401", "operator": "Timothy W. Taylor", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Natchitoches - Gladewater", "msn": "401-0097", "yom": 1969, "flight_number": null, "city": "Gladewater", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1241, "captain_hours_type": 468, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was substantially damaged while landing at the Gladewater Municipal Airport (07F), Gladewater, Texas. The private pilot and three passengers received minor injuries, and the forth passenger was seriously injured. The airplane was registered to and operated by the pilot. Visual meteorological conditions prevailed and a visual flight rules (VFR) flight plan was filed for the 14 Code of Federal Regulations Part 91 personal flight. The cross-country flight originated from the Natchitoches Regional Airport (IER), Natchitoches, Louisiana, around 1550. While preparing to enter the traffic pattern at 1,800 feet above ground level, the pilot checked the wind on his Garmin 696 with NEXRAD and also heard a wind update on the radio for the nearest weather facility. The current wind was understood to be from 170 degrees between 20 and 25 knots. The pilot entered the pattern in a left downwind for runway 14 and began to slow the airplane down. The pilot stated he was on short final and at an airspeed of about 120 knots when a gusting crosswind pushed the airplane 30 feet right of the runway centerline and began to descend very quickly. The pilot decided to perform a go-around maneuver and added full engine power. As engine power was added, the twin-engine airplane began to roll to the right. The pilot then elected to reduce engine power and land. The airplane impacted and exited the runway before coming to rest in an upright position. Investigators from the National Transportation Safety Board, the Federal Aviation Administration, Cessna Aircraft Co., and Continental Motors, Inc. performed a post accident examination of the airplane and the engines. Examination of the airplane revealed substantial damage to the fuselage, empennage, wings, and landing gear. No preaccident mechanical malfunctions or failures were found that would have precluded normal operation. At 1553, the aviation routine weather report at East Texas Regional Airport in Longview, Texas, about 16 nautical miles southeast of the accident location was: wind 170 degrees and 16 knots gusting to 23 knots; visibility 10sm; few clouds at 4,900 feet above ground level; temperature 23 degrees Celsius and dew point 13 degrees Celsius; altimeter 29.92 inches of mercury. At 1530, the weather station reported a peak wind gust of 27 knots from 190 degrees. ", "probable_cause": "The pilot’s failure to maintain control of the airplane during the landing and attempted go-around in a gusty crosswind.\n"}