{"url": "https://www.baaa-acro.com/crash/crash-martin-202-tucumcari-1-killed", "date": "Nov 5, 1951 at 0929 LT", "type": "Martin 202", "operator": "Transocean%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Oakland – Albuquerque – Indiantown Gap", "msn": "9160", "yom": 1947, "flight_number": "TL5763", "city": "Tucumcari", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 26, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7963, "captain_hours_type": 261, "copilot_hours": 1300, "copilot_hours_type": 13, "aircraft_hours": 6790, "circumstances": "Flight 5763, a military contract flight, originated in Oakland, California, with Indiantown Gap, Pennsylvania, as its destination. It was scheduled to depart Oakland, California, at 0200, November 5, 1951, but due to a mechanical delay, departure was not made until 0352. The crew consisted of Captain Alec S. Hamilton, Copilot Henry N. Ingram, and Stewardess Frances B. Reilly. There were 26 passengers on board. The IFR (Instrument Flight Rules) flight plan filed with the CAA prior to departure indicated that the first intended landing would be Albuquerque, New Mexico, with Tucumcari, New Mexico, as the alternate. It showed a cruising altitude of 500 on top and an estimated time of Albuquerque of four hours and five minutes, with six hours and fifteen minutes of fuel on board. At the time of departure the aircraft weighed 38,939 pounds, which was within the allowable gross takeoff weight of 39,900 pounds; the load was properly distributed. The company maintains a dispatching office at Oakland to assist crews in planning flights, but it has no communications facilities for maintaining flight supervision. Company pilots are authorized to act as their own dispatchers, utilizing the CAA Communications facilities for the purpose of flight control. Captain Hamilton stated that prior to departure he was briefed by the U. S. Weather Bureau forecaster at the Oakland Airport on the an route weather and forecasts. Weather information available to the captain at this time indicated that there would be VFR (Visual Flight Rules) flying weather between Oakland and Albuquerque, at a cruising altitude of 11,000 feet, and that helping winds averaging 15 to 20 knots could be expected along the entire route. The forecast for Tucumcari, the alternate airport, indicated clear weather until 0500, followed by an overcast, with a ceiling of 800 feet and surface winds from the northeast at 15 miles per hour. The flight was routine and on reaching Acomita, New Mexico, at 0755, reported that it was 500 on top at 12,000 feet and was estimating Albuquerque at 0811. Following this report the flight asked to change its flight plan to Tucumcari with Amarillo, Texas, the alternate, and requested the latest Tucumcari weather which was: 0728, overcast, 1500 feet, visibility 20 miles, wind northeast 20 mph; Amarillo, 0728, broken clouds 1700 feet, overcast at 3500 feet, visibility 8 miles, wind north-northeast, 17 mph. The flight passed over Albuquerque under broken clouds in the clear at 12,000 feet NSL at 0813, whereupon the following clearance was given: “ARTC (Air Route Traffic Control) Clears CAM 5763 to the Tucumcari Airport via Green Airway No. 4, to maintain 500 on top while in the control area.” This clearance was acknowledged. At 0831, the flight reported being over Anton Chico, New Mexico, at 13,000 feet, estimating Tucumcari at 0852. At this time the 0828 Tucumcari weather was given the flight as; coiling estimated 1,000 feet, overcast, visibility 3 miles, snow and fog. At approximately 0845, Tucumcari radio gave 5763 the following clearance: “ARTC clears 5763 to descend to 8,000 feet on the south course of Tucumcari range, maintain 11,000 feet until 2 minutes south, descend outbound, maintain 8,000, report leaving 9,000.” The following clearance was transmitted to the flight by Tucumcari radio at 0851: “ARTC clears 5763 to approach Tucumcari Airport en reaching 8,000 feet.” The flight next reported being over the Tucumcari range station at 0852, at 11,000 feet, descending to 8,000 feet, and at 0901 reported that it was at 9,000 feet outbound on the south leg of the Tucumcari range. At this time the special 0852 Tucumcari weather report was given the flight: “Ceiling 800 feet, overcast, visibility one mile, light snow and fog, wind north 20 miles per hour with strong gusts.” The reported surface visibility in this official weather report was loss than the CAA and company minimums of 11/2 miles for the Tucumcari Airport. At 0907 5763 was given the following clearance: “ARTC clears 5763 to make standard instrument approach.” The Amarillo weather was then given as: coiling estimated 1,000 feet, broken clouds, overcast 2,000 feet; visibility 5 miles, light snow and fog. The flight was asked if it wished to proceed to Amarillo and it replied that it had to land at Tucumcari. The flight continued its descent and at 0909 was advised by Tucumcari radio that the Tucumcari weather was then ceiling 800 feet, overcast, visibility 1/2 miles, light snow and fog, wind north 20 miles per hour. Two minutes later, at 0911, the flight reported it was outbound on the west leg at 8,000 feet, descending to 6,000 feet. Tucumcari radio again gave the flight the weather which had been given it at 0908. One minute after this transmission Tucumcari radio gave the flight the wind direction which was then north-northwest, variable to north-northeast, at 16 miles per hour, and advised that Runway 30 was the runway in use. 5763 immediately requested the bearing of this runway and this was corrected to 03, which was acknowledged by the flight. At 0915 5763 reported that it was at 6,000 feet and inbound on the west leg of the Tucumcari range. Immediately following this report, at 0916, Tucumcari radio asked the flight if it wanted ARTC to recommend an alternate airport closer than Amarillo. The flight acknowledged this and advised it would have to land at Tucumcari but asked where the alternate would be. The pilot was advised to stand by and, according to the communicator on duty, the aircraft was then seen to cross the field in a northwesterly direction at very low altitude. The pilot was quickly advised to pull up and answered that he was doing so. At 0925, the flight advised it was landing downwind. This was the last report received from the flight. After several passes over the airport at altitudes varying from 500 feet to as low as 50 feet, the aircraft crashed near the northeast end of Runway 21 at approximately 0929. A flash fire which occurred immediately after impact quickly subsided. Ten passengers were injured and another one was killed. The aircraft was destroyed. ", "probable_cause": "The Board determines that the probable cause of this accident was the captain’s attempt to land during less than minimum visibility, rather than proceed to his alternate. The following findings were pointed out:\r\n- The flight was routine until it arrived in the vicinity of Acomita, New Mexico, where the captain elected to change the existing flight plan and land at Tucumcari, with Amarillo as the new alternate,\r\n- The weather at Albuquerque at that time was CAVU, whereas the weather at Tucumcari at the estimated time of the flight’s arrival there was forecast to be marginal,\r\n- Prior to the change in flight plan the captain did not ask for now terminal forecasts as required, nor were they volunteered by Flight Assistance Service,\r\n- During the approach to Tucumcari the surface visibility was transmitted to the flight as one mile and eight minutes later, one-half mile, the company’s prescribed visibility minimum is 11/2 miles,\r\n- The captain did not execute a missed-approach and proceed to the alternate, but continued his attempts to land,\r\n- Control of the aircraft was lost during a steep turn, and the left wing struck the ground."}