{"url": "https://www.baaa-acro.com/crash/crash-lockheed-wc-130h-hercules-savannah-9-killed", "date": "May 2, 2018 at 1127 LT", "type": "Lockheed C-130 Hercules", "operator": "United%20States%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Savannah – Davis-Monthan", "msn": "4110", "yom": 1965, "flight_number": null, "city": "Savannah", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": 2070, "copilot_hours": null, "copilot_hours_type": 9, "aircraft_hours": null, "circumstances": "On 2 May 2018, at approximately 1127 hours local time (L), the Mishap Aircraft (MA), a WC-130H, tail number 65-0968, assigned to the Puerto Rico Air National Guard, 156th Airlift Wing (156 AW), located at Muñiz Air National Guard Base, Puerto Rico, crashed approximately 1.5 miles northeast of Savannah/Hilton Head International Airport (KSAV), Georgia. All nine members aboard the MA—Mishap Pilot 1 (MP1), Mishap Pilot 2, Mishap Navigator, Mishap Flight Engineer, and Mishap Loadmaster (collectively the “Mishap Crew (MC)”), and four mission essential personnel, Mishap Airman 1, 2, 3, and 4—perished during the accident. The MC’s mission was to fly the MA to the 309th Aerospace Maintenance and Regeneration Group at Davis-Monthan Air Force Base, Arizona (commonly referred to as the “Boneyard”), for removal from service. The MA had been at KSAV for almost a month, since 9 April 2018, to undergo prescheduled fuel cell maintenance and unscheduled work on engine number one by 156 AW maintenance personnel using the facilities of the 165th Airlift Wing. During takeoff roll, engine one revolutions per minute (RPM) fluctuated and did not provide normal RPM when MP1 advanced the throttle lever into the flight range for takeoff. Approximately eight seconds prior to aircraft rotation, engine one RPM and torque significantly decayed, which substantially lowered thrust. The fluctuation on roll and significant performance decay went unrecognized by the MC until rotation, when MP1 commented on aircraft control challenges and the MA veered left and nearly departed the runway into the grass before it achieved flight. The MA departed KSAV at approximately 1125L. As the MC retracted the landing gear, they identified the engine one RPM and torque malfunction and MP1 called for engine shutdown. However, the MC failed to complete the Takeoff Continued After Engine Failure procedure, the Engine Shutdown procedure, and the After Takeoff checklist as directed by the Flight Manual, and the MA’s flaps remained at 50 percent. Additionally, MP1 banked left into the inoperative engine, continued to climb, and varied left and right rudder inputs. At an altitude of approximately 900 feet mean sea level and 131 knots indicated air speed, MP1 input over nine degrees of left rudder, the MA skidded left, the left wing stalled, and the MA departed controlled flight and impacted the terrain on Georgia State Highway 21. ", "probable_cause": "The board president found, by a preponderance of the evidence, the cause of the mishap was MP1’s improper application of left rudder, which resulted in a subsequent skid below three-engine minimum controllable airspeed, a left-wing stall, and the MA’s departure from controlled flight. Additionally, the board president found, by a preponderance of the evidence, the MC’s failure to adequately prepare for emergency actions, the MC’s failure to reject the takeoff, the MC’s failure to properly execute appropriate after takeoff and engine shutdown checklists and procedures, and the Mishap Maintainers’ failure to properly diagnose and repair engine number one substantially contributed to the mishap. "}