{"url": "https://www.baaa-acro.com/crash/crash-piaggio-p180-avanti-near-kangerlussuaq", "date": "Oct 16, 2009 at 1140 LT", "type": "Piaggio P.180 Avanti", "operator": "Golden-Falcon-Aviation-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kuwait – Antalya – Vienna – Stornoway – Keflavik – Narsarsuaq – Goose Bay – Bangor – Denton", "msn": "1086", "yom": 2004, "flight_number": null, "city": "Kangerlussuaq (Søndre Strømfjord)", "zone": "Qeqqata Kommunia", "country": "Greenland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": 105, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1035, "circumstances": "The accident flight was a part of a ferry flight from Kuwait to USA. The flight departed from Keflavik, Iceland with planned destination Narsarsuaq, Greenland. The commander did not get visual contact with the runway on the instrument approach to Narsarsuaq and the flight diverted towards Kangerlussuaq, Greenland. During the flight towards Kangerlussuaq, the amount of fuel became critical low and the aircraft landed on the Greenlandic icecap. The aircraft was destroyed during the landing attempt. The commander suffered minor injuries. The accident occurred in daylight and under visual meteorological conditions (VMC). \n", "probable_cause": "After the flight was airborne from BIKF, the flight was restricted by ATC to cruise at FL200 instead of FL280. The lower flight altitude and the power setting used resulted in a reduction of the final reserve to approximately zero minutes. At that time the commander was not concerned about the final reserve because the flight to BGBW was only a two hours flight and as the aircraft before take-off from BIKF had fuel for more than three hours and 40 minutes of flight. During the approach to BGBW the flight never came below the clouds and was in IMC during the entire final approach. The most likely cause was that the aircraft was not following the NDB   DME 07 approach procedure descent profile. Consequently the commander did not get visual contact during the approach and he had to make a missed approach. During the diversion to the alternate aerodrome, BGSF the flight was altitude restricted by ATC to FL190. One engine was intentionally stopped during the diversion to BGSF. The consequence was a reduction of the aircraft range. A shallow descent was initiated approximately 57 minutes before ETA over BGSF. The shallow descent profile did consume more fuel than a steeper descent profile. The commander decided to make a precautionary landing in the terrain. The aircraft was destroyed during the landing attempt on the rugged and bumpy surface of the icecap."}