{"url": "https://www.baaa-acro.com/crash/crash-bushmaster-2000-fullerton", "date": "Sep 25, 2004 at 1523 LT", "type": "Bushmaster 2000", "operator": "Richard Fuchs", "flight_phase": "Takeoff (climb)", "flight_type": "Demonstration", "survivors": "Yes", "site": "City", "schedule": "Fullerton - Fullerton", "msn": "2", "yom": 1985, "flight_number": null, "city": "Fullerton", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3700, "captain_hours_type": 54, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1420, "circumstances": "The airplane crashed onto a street adjacent to the airport shortly after takeoff. As the airplane started its takeoff roll, it began to veer to the left off of the runway. About midway down the runway the airplane lifted off the ground and flew over a crowd of people assembled at the airport for an airport appreciation day. The airplane climbed to about 50 feet, made a steep roll to the left, flying in-between the control tower and a light pole, and crossed over the boundary fence where the left wing struck a moving vehicle before coming to rest against several parked cars. Numerous photographs (including video footage) were taken by witnesses on the airport of the airplane on the takeoff ground roll and throughout the accident sequence. The photographs clearly show a nylon strap connecting the left elevator and rudder. It was surmised that the use of the nylon strap was as a flight control/gust lock for the airplane. During the investigation, a nylon strap was observed hanging from an S-hook that was attached to the vertical stabilizer/rudder hinge attach point. The loop at the other end of the strap had come apart, and when investigators looked under the left stabilizer/elevator hinge attach area they noted a similar S-hook attached to the hinge attach area.", "probable_cause": "The inadequate preflight inspection by the pilot-in-command, where the pilot failed to remove the makeshift gust lock attached to the rudder and left elevator of the airplane. As a result, the airplane veered off the runway surface during the takeoff roll, became airborne, and immediately began an uncontrolled descending left roll until impacting vehicles and the ground."}