{"url": "https://www.baaa-acro.com/crash/crash-antonov-24rv-blagoveshchensk", "date": "Aug 8, 2011 at 1412 LT", "type": "Antonov AN-24", "operator": "IrAero", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Irkutsk - Chita - Blagoveshchensk - Khabarovsk", "msn": "67310609", "yom": 1976, "flight_number": "RD103", "city": "Blagoveshchensk", "zone": "Amur oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 36, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11555, "captain_hours_type": 6722, "copilot_hours": 3268, "copilot_hours_type": 575, "aircraft_hours": 12346, "circumstances": "Following an uneventful flight from Chita, the crew initiated the approach to Blagoveshchensk in poor weather conditions with reduced visibility, heavy rain falls, thunderstorm activity and a cloud base at 150 metres. On final approach, despite he did establish any visual contact with the runway or its light system, the captain continued the approach and passed below the MDA. As the aircraft was not properly aligned with the runway centerline, it descended too low and impacted trees 210 meters to the right of the centerline and 50 meters short of runway 36. Upon impact, the left wing was torn off and the aircraft crashed in a wooded area. It slid over a distance of 450 metres before coming to rest. There was no fire. All 41 occupants were rescued, among them 9 were injured.", "probable_cause": "The probable causes of the accident were the failure of the crew to go around and the descent well below decision height without visual reference to landmarks when the aircraft approached the airfield in weather conditions below the captain's, aircraft's and airfield's minima and in dangerous/adverse weather phenomena like thunderstorm, heavy rain and severe turbulence as well as the lack of appropriate response and required actions following terrain awareness warning system alerts resulted in a controlled flight into terrain, collision with obstacles and the destruction of the aircraft.\r\nContributing factors:\r\n- the crew underestimated the weather conditions at the destination airport thus taking an erroneous decision to attempt an approach in thunderstorm and heavy rain showers,\r\n- unsatisfactory meteorological support of the flight, the dispatcher and later air traffic control provided information about visibility, cloud and wind data that did not correspond to actual conditions that were significantly worse than minimums required,\r\n- clearance for the approach by air traffic control despite the presence of dangerous weather phenomena (thunderstorm, heavy rain) at the aerodrome, which did not correspond to the standard operating procedures at Blagoveshchensk,\r\n- inadequate staffing with a first officer who was performing his first flight after a prolonged leave without proper preparation and training,\r\n- unsatisfactory crew interaction and the failure to adhere to standard operating procedures, especially the call outs of approaching decision height, the absence of a decision by the commander to continue the landing or go-around and the lack of action to recommend/initiate a go around by the first officer."}