{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-680f-near-calvinia-1-killed", "date": "Oct 16, 1974 at 1640 LT", "type": "Rockwell Aero Commander 680", "operator": "Map Studios Productions", "flight_phase": "Flight", "flight_type": "Aerial photography", "survivors": "Yes", "site": "Mountains", "schedule": "Fraserburg - Fraserburg", "msn": "680-1085-63", "yom": 1961, "flight_number": null, "city": "Calvinia", "zone": "Northern Cape", "country": "South Africa", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6265, "captain_hours_type": 1301, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5258, "circumstances": "We were up early. There was a pre-dawn promise of spring in the air, and it had its own mystical Karoo flavour, recognized and eagerly anticipated only by those who have been there. This was to be a day like no other. It would be a mountain day. Libby and I had arranged to meet at breakfast, a two star event in Beaufort West. Elizabeth 'Libby' Stark, a Private Pilot in her own right, had an energetic, bubbly personality, and was a navigator of note. Her apprenticeship well served, she had crisscrossed vast expanses of Southern Africa in a surveyors bid to capture and record – if only for now – vital information for which mining companies, municipalities and a host of private and government agencies paid very well. Klaus Buchholz on the other hand was an unknown quantity. Recently arrived in South Africa, he was making his way in his chosen field of electronics, seeing the vast expanse of his new home in double quick time from the platform of a 'go anywhere' survey aircraft. Libby would be working up front with me, whilst Klaus would be doing his own thing in the back, behind a rack of instruments the complexity to which I would not be privy. South Africa was at war – if only sporadic and low key, and ours was a civilian operation. 'We were not to know' as the expression goes. The nature of the survey however gave away its end purpose, we where in the course of a single day to cover a vast area at a height above ground of 300 feet, traversing the most singularly remote and spectacular mountains in South Africa – the Roggeveldberge. Specific to this survey was the line spacing. Each line was to be flown no less than 5 kilometers from the previous line. The height above ground would have to be at as constant a parameter as was humanly possible; calling for a day where the pilots attention would be directed endlessly at the radar altimeter as the aircraft followed the undulations of the mountainous terrain below. No roller coaster anywhere on earth could provided such a spectacularly panoramic view of this vast empty stately landscape. This would be a hit or miss operation – a very general survey. After all, self-sufficiency was what being South African was all about. On board was a Scintillometer, a device carrying a crystal that would be able to detect any radioactivity should it be encountered. Remote and semi- covert – we were on our own. Full of anticipation I was going to meet an old friend, all-be-it in a different guise. ZS-CWD was a famous and venerable bird of the skies. First imported to South Africa by the late John Schlesinger this aircraft was then the latest state-of-the-art wonder machine. Equipped with two IGSO 540 engines it required kid-gloves on the part of the pilot not to grind away the gearing on the propellers, not to over boost the supercharged engines that were capable of reaching 48 inches of manifold pressure at an instant, nor to over impress any bystander whose head would be turned towards that most distinctive roar on takeoff. As the Flagship of Map Studio Productions, Charlie Whisky Delta and I had spent no less than 1301 hours in the sky on every conceivable survey mission. Starting on 13 March 1968, we had kept our secrets. Not much takes place on mother earth without an aerial photograph first being obtained from an archive or if not available, then from a commission to go out and get the necessary pictures. We were therefore on the cutting edge of up and coming projects in South Africa, pre-knowledge of which would have had the potential of throwing the JSE into disarray and turning those in the know into instant millionaires. Winding along the dirt road leading to a typical unkempt small town airfield, CWD came into view. No longer recognizable in the distinctive black, gray and orange livery of Map Studio Productions, the inscription read 'Planning and Mapping'. No matter; CWD was instantly recognizable and if inanimate objects are capable of embrace, we did just that. Pursuant to their own expertise the crew set about readying their stations for the mission ahead. It would, of necessity, be a long day. No sooner airborne and Libby took control. On her lap were the mosaics, on which were drawn the predetermined lines we were going to have to locate and follow to the satisfaction of client and conscience. What was different this time was that ground proximity required a level of situational awareness, not to be found in a photographic environment. The geophysical survey operation as distinct from a photographic one – (where all that is required is a stable platform for the camera to do its work) – dictates constant power adjustments of mixture, pitch and throttle to accommodate the fluctuating terrain and hold that all important distance between ground and equipment. Flight path is under constant surveillance from a camera facing down under the fuselage, and ground separation is being monitored at all times. With crew performance being scrutinized in this way, there was no room for error. The Aero Commander Series of aircraft (all but relegated to posterity by the specialization to be found in aviation these days) were machines with high aspect ratio wings (i.e. highly tapered) which at speed, made for a wonderfully stable platform for photography. What we were not told, and had to find out for ourselves, was something that would have a decisive influence on the outcome of our activities that day. The tracer camera beneath the aircraft, set at its fastest, would only record an unbroken flight path if the aircraft could be flown at no more than 150 knots. Aero Commanders were most stable and therefore controllable at their cruising speed of 170 knots. This, more than anything else, became the single most important factor overriding that day's operation. With an unbroken flight path record, correlating data collected would proceed unimpeded. Back at base the rest of the team busied themselves with reams of film and graphic recordings from the previous days production and were the only people aware of our mountain project that day. We would be expected back around four thirty in the afternoon. Radio communication from our low level and remote situation was all but impossible - in any case we where far too busy with the hands-on nature of the job to take time out communicating an irrelevant position report. Our only other possible traffic that day would be soaring mountain raptors. Up and down the imaginary roller coaster we flew. Strapped to our stations, we followed those vertical and horizontal contours. If fatigue was setting in we were too involved to be able to detect its insidious inroads. A welcome break occurred when at around noon our fuel situation required a landing at Fraserburg. For most of the morning we had approached and tackled those mountain ramparts head- on. For the uninitiated this would be like approaching Table Mountain from the height of one of the taller downtown buildings. The trick lay in knowing at what point to start the climb that would allow the aircraft to clear the ridges at the top of the mountain with the required 300 feet in hand. Libby indicated with two fingers in the air that we were on our second last line for the day. It was now four o'clock in the afternoon and we were flying north. The last line would take us east towards Beaufort West and a well-deserved shower and cold beer. For the first time that day the mountain confronting us looked just too mighty to challenge, the same way we had tackled the rest. I indicated my intention to break line, at which point Klaus would suspend his recordings while we retraced our flight path, all the time climbing to a safer altitude from where we could tackle the apex in a securer position. The decision (while time still permitted) to break line, was lying on Libby's lap, as she would have to find a suitable feature on the ground up ahead for the tracer camera record, in order to identify the exact point at which Klaus had stopped his data. It was later determined that the farm road Libby had chosen on which to break line lay approximately 5 to 6 kilometers from the base of this particular mountain. At the moment the 'break line' call was given, a climb to the left was initiated and as we now found ourselves in a huge amphitheatre with a saddle dead ahead connecting an isolated koppie, known as Bobbejaan's Kop to the rest of the ramparts of this colossal obstacle, a decision had to be taken as to whether the rate of climb would permit for an assault on the saddle or if a climbing turn to the right would the safer option. The climb required for the saddle was lacking in momentum and a right hand turn was commenced that would take the now rapidly climbing Aero Commander on a course parallel to an immense rock face. At optimum climb speed, with balls to the wall, the rate of climb had increased to 2000 feet per minute, a sure indication we where in the grips of a mountain wave. Pointing the nose of CWD away from the mountain we drew level with the krans, The IGSO 540s were at max takeoff power and it was all action. Fate being the hunter, we were now in the hands of providence. Time-warped moments can be relived, and those last few seconds before impact are today as vivid as if they occurred only yesterday. Sudden death has to be the most expeditious way of leaving this planet. Before the mind can comprehend what in fact is taking place – life is painlessly over. Facing death should not be what a normal working day is all about – however, hazards abound in an aviation environment where pushing the envelope is hardly ever called into question and expertise is a presumption rather than a reality. If a moment can be frozen in time, it has to be those seconds before inevitable death that become etched on the brain as it miraculously comes to the realization that somehow the inevitable did not happen. Some people will pass it off, as a close call. What happened to Libby and myself in the Roggeveldberge on the 16 October 1974 defies explanation. Out of control and hurtling towards certain destruction – at full flying speed, the only thought was – 'this is it, I'm dying'. On reflection; if you remember hearing the destructive noises at the moment of impact, then guess what? – You have survived. Other senses were delivering the screams coming from Libby, as the same inevitability of our fate became evident to her, and then the sight of all those rocks along the edge of the krans. In a flash it was over. The all-pervading sensation now, was the utter silence of this place. There was a slight breeze and only silence. I was facing at some 70 meters distance, the wreck of CWD, and less than 5 meters from CWD was the vertical edge to the krans – a krans the height of our survey. On impact (it was determined later) the right wing struck the ground first where traces of the navigation light were found. The main body of the fuselage then struck a large rock at a speed and angle sufficient to cause the nose of the aircraft to break and tuck under the rest of the fuselage, depositing the pilot on the mountain in an upright position still strapped to his seat. Libby and Klaus were carried further in the aircraft as it careened forward through the rocks to total destruction. Undoing my seat belt I made my way over rocks towards the wreck at the same time noticing Libby moving away from the carnage that was once CWD. Klaus was nowhere to be seen. At the wreck my first concern was to make Libby comfortable. Fuel was dripping from the wings and a fire was a real threat. Tearing some carpeting from the exposed wreck I got her to lie down. It was glaringly obvious that she was in considerable distress, as a large bump had developed above her buttocks. There was total silence, other than the whimpering sounds coming from Libby, and I expected the worst for Klaus. The sun was sinking fast, and to all intents and purposes nobody knew of our plight. A chill, common to high mountain environments, was already noticeable and I knew instinctively that Libby would not survive the night if a rescue was not mounted …the problem now, was how to get off the mountain.\r\nTexts and photos: Nico Willoughby-Smith", "probable_cause": null}