{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-70-dl-denver-2-killed", "date": "Dec 21, 1967 at 1600 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Frontier%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Denver – Scottsbluff – Rapid City", "msn": "19202", "yom": 1943, "flight_number": "FL2610", "city": "Denver-Stapleton", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 13011, "captain_hours_type": 4860, "copilot_hours": 3141, "copilot_hours_type": 937, "aircraft_hours": 49282, "circumstances": "On December 21, 1967, Frontier Airlines had a backlog of more than 100,000 pounds of air freight which they were attempting to move during the busy pre-holiday period. Because of this, employees and equipment were pressed into service in a maximum effort to move the freight. Although Frontier did not use its DC-3 equipment in all-cargo operations, the passenger seats of N65276 were removed and the DC-3C was assigned to operate as all-cargo Flight 2610, from the Stapleton International Airport at Denver, Colorado to Rapid City, South Dakota, with an en route stop at Scottsbluff, Nebraska. About 1100 MST the aircraft was moved from the company hangar to the airport freight terminal for loading. About 1030, a Frontier radio communicator who knew how to prepare weight manifests was assigned to prepare the manifest for Flight 2610. He was given the operating and pit weight maximums for the aircraft. The dispatch office prepared a dispatch release for the flight. At 1100 and 1400 the employee called the freight office for specific loading information from which to execute the weight manifest. He was told both times that the information was not yet ready and would be furnished to him later. When this employee's shift ended at 1430 he still had not received the information. He then went off duty, neglecting to inform his relief of the status of the situation. In the meantime N65276 was being loaded. An air cargo service employee listed the cargo before it was loaded and tied down and later totalled its weight. No one engaged in the loading could recall that the cargo was placed in the aircraft according to any formal preloading schedule. The first officer came to the air cargo office about the time the cargo listing was being totalled. He was asked if a weight manifest were needed and he replied, \"No, we have our release, that's enough.\" When he reached the aircraft some of the loading remained to be done and he authorized the loaders to use some of the space left in the fuselage for an aisle to accommodate this cargo. The first officer bearded the aircraft, took the left pilot's seat and had started both engines by the time the captain arrived and got aboard. Just before the flight started to taxi out and while the captain was getting settled in his seat, a Frontier station agent began to remove the control battens and landing gear pins. When he started to remove a gear pin before the pilot signalled that hydraulic pressure on the gear was up, another station agent stopped him and took over. The latter agent subsequently stated that there was no batten on the left elevator and he did not check the right one because it was customary to install the device on the left elevator when only one batten was used. He said that after he finished, he gave the crew a departure salute and that at no time did he see any of the controls move or any indication from the first officer that any of the controls were not movable. Flight 2610, appropriately cleared, left the loading area at 1544 and about 1559 began takeoff using runway 35. Weather conditions were: scattered clouds at 5,000 feet, visibility 60 miles and the wind 270 degrees at 16 knots. According to eyewitnesses, the takeoff appeared normal until after the aircraft became airborne. At this time it entered an increasingly steep climb attitude to an estimated deck angle of 50 to 60 degrees. About 300 feet above the surface, the aircraft rolled to its left and entered a steep nose-down left turning descent and crashed off the left side of the runway. The aircraft burst into flames at impact.", "probable_cause": "The failure of the crew to perform a pre-takeoff control check resulting in takeoff with the elevators immobilized by a control batten."}