{"url": "https://www.baaa-acro.com/crash/crash-cessna-525-citationjet-cj1-point-lookout-6-killed", "date": "Dec 9, 1999 at 1512 LT", "type": "Cessna 525 CitationJet CJ1", "operator": "College%20of%20the%20Ozarks_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Saint Louis - Point Lookout", "msn": "525-0136", "yom": 1996, "flight_number": null, "city": "Point Lookout", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 10150, "captain_hours_type": 328, "copilot_hours": 1000, "copilot_hours_type": 70, "aircraft_hours": 783, "circumstances": "Prior to takeoff from Lambert Field/St. Louis International Airport, St. Louis, Missouri, the pilot contacted the operations manager at M. Graham Clark Airport, Point Lookout, Missouri, and asked about the current weather conditions there. The operations manager told the pilot that the weather was \"pretty poor.\" The airplane took off from St. Louis, at 1411 cst. At 1447:12 cst, the pilot checked in with Springfield Approach Control. The pilot was told to expect the ILS approach to runway 2 at the Springfield-Branson Regional Airport. At 1501:01 cst, the pilot requested to go to Point Lookout and shoot the GPS to runway 11. Springfield Approach instructed the pilot to descend to 3,000 feet msl and cleared him for the approach. At 1507:08 cst, Springfield radar showed the airplane crossing the initial waypoint at 3,000 feet msl, and turn to 116 degrees approach heading. At 1507:17 cst, the airplane descended to 2,500 feet msl. At 1508:51 cst, Springfield Approach cleared the pilot to change to advisory frequency. \"Call me back with your cancellation or your miss.\" The pilot responded, \"Okay we're, we're RAWBE inbound and we will call you on the miss or cancellation.\" The operations manager at M. Graham Clark Airport said that he heard the pilot on the airport's common frequency radio say, \"Citation 525KL is RAWBE inbound on the GPS 11 approach.\" At 1509:01 cst, Springfield radar showed the airplane begin a descent out of 2,500 feet msl. The last radar contact was at 1509:48 cst. The airplane was five nautical miles from the airport on a 296 degree radial, at 2,100 feet msl. At 1530 cst, the operations manager heard Springfield approach trying to contact the airplane. The operations manager initiated a search for the airplane. At 1430 cst, the weather observation at the M. Graham Clark Airport was 300 feet overcast, rain and mist, 3/4 miles visibility, temperature 53 degrees F, winds variable at 3 knots, altimeter 29.92 inches HG. Approach minimum weather for the GPS RWY11 straight in approach to Point Lookout are a minimum ceiling of 600 feet and visibility of 1 mile for a category B aircraft. An examination of the airplane wreckage revealed no anomalies. The results of FAA toxicology testing of specimens from the pilot revealed concentrations of Doxepin in kidney and liver. The Physicians' Desk Reference states that \"... drowsiness may occur with the use of this drug, patients should be warned of the possibility and cautioned against driving a car or operating dangerous machinery while taking the drug.\" The physician who prescribed the Doxepin to the pilot said that he was using it to treat the pilot's \"irritable bowel\" condition. According to his wife, the pilot had not slept well for several nights, up to the day of the accident, due to problems he was having with the FAA. A friend, who spoke with the pilot just before the accident flight, confirmed the pilot saying \"I haven't slept for three days.\" The friend stated further that the pilot \"wasn't himself that day.\"", "probable_cause": "The pilot descended below the minimum altitude for the segment of the GPS approach. Factors relating to the accident were low ceilings, rain, and pilot fatigue. "}