{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-portland", "date": "Dec 24, 2005 at 0743 LT", "type": "Cessna 208B Grand Caravan", "operator": "FedEx", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Portland - Medford", "msn": "208B-0248", "yom": 1991, "flight_number": null, "city": "Portland-Intl", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4625, "captain_hours_type": 2450, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7375, "circumstances": "The pilot stated that during takeoff, \"after becoming airborne, the airplane quit accelerating and a positive climb rate was not established.\" He pushed the power lever all the way forward, but did not feel a response from the airplane. Witnesses reported that the airplane became airborne, but failed to gain altitude and struck an antenna array and a fence off the departure end of the runway. The airplane continued across a slough, struck an embankment and came to rest about 900 feet from the departure end of the runway on a golf course located adjacent to the airport. Examination of the airplane revealed no pre-mishap airframe anomalies. Examination of the engine revealed that the compressor and power turbines displayed moderate circular rubbing damage to the blades suggesting engine operation at impact, likely in the low to mid power range. Examination of the airframe and engine revealed no anomalies that would have prevented the engine from producing power prior to impact. The reason for the partial loss of engine power was not determined.", "probable_cause": "A partial loss of engine power for an undetermined reason during the initial takeoff climb resulting in an in-flight collision with objects."}