{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e18s-washington-court-house-1-killed", "date": "Oct 10, 2000 at 0145 LT", "type": "Beechcraft E18", "operator": "Northern%20Airmotive_0", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Washington Court House – Wilmington", "msn": "BA-424", "yom": 1959, "flight_number": null, "city": "Washington Court House", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 22500, "captain_hours_type": 17000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane was observed to depart normally for a positioning flight conducted during night visual meteorological conditions. In addition, the landing gear was observed to retract after takeoff. A witness who lived near the accident site heard a \"loud\" engine noise and observed the airplane just above the trees. The airplane then pitched down, impacted the ground, and exploded. The airplane impacted in a soybean field about a 1/2 mile from the departure end of the runway. Two pairs of ground scars were observed at the beginning of the debris path. The initial pair of ground scars were about 2 to 3 feet in length and were located about 380 feet south of the main wreckage. A pair of 10 to 12 foot long ground scars were located about 10 feet forward of the initial ground scars and they contained portions of the left and right engines; respectively. There was no impact damage observed to the portion of the soy bean field located in-between the second ground scar and the main wreckage. Prior to the flight, maintenance personnel replaced a frayed elevator trim cable. The work was supervised and checked by the accident pilot. Examination of the airplane did not reveal any evidence of a preimpact failure; however, a significant portion of the airplane was consumed in a post crash fire. Examination of the propellers revealed damage consistent with engine operation at the time of impact. The pilot reported 22,500 hours of total flight experience, with over 17,00 flight hours in make and model.", "probable_cause": "An undetermined event, which resulted in an off airport landing. A factor in this accident was the night light condition."}