{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-near-longmont-44-killed", "date": "Nov 1, 1955 at 1903 LT", "type": "Douglas DC-6", "operator": "United-Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "LaGuardia – Chicago – Denver – Portland – Seattle", "msn": "43538", "yom": 1952, "flight_number": "UA629", "city": "Longmont", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 39, "pax_fatalities": 39, "other_fatalities": 0, "total_fatalities": 44, "captain_hours": 10086, "captain_hours_type": 703, "copilot_hours": 3578, "copilot_hours_type": 1062, "aircraft_hours": 11949, "circumstances": "After a routine radio ramp check, Flight 629 taxied to runway 08R (80 degrees, right) and at 1844 the flight was in runup position where it was given ATC clearance for the flight to Portland, the first intended landing. The clearance, in part, included compulsory radio reports from the flight upon passing the Denver Omni and when climbing through 18,000 feet to its assigned flight altitude, 21,000 feet. Following takeoff the flight reported its \"off time\" to the company as 1852 and thereafter reported passing the Denver Omni at 1856. The latter communication was the last from the flight. About 1903 the Denver tower controllers saw two white lights, one brighter than the other, appear in the sky north-northwest of the airport and fall to the ground. Both lights were observed 30-45 seconds and seemed to fall with approximately the same speed. There was then a momentary flash originating at or near the ground which illuminated the base of the clouds, approximately 10,000 feet above. When the controllers observed the lights they initiated action to determine if any aircraft were in distress. Radio calls were made to all aircraft in the Denver area of responsibility and all except flight 629 were accounted for. It was soon learned that the flight had crashed and all 44 occupants had been killed. It was later confirmed that the disintegration of the aircraft in the air was caused by a bomb. Two weeks later, on November 15, investigators confirmed that an explosive device has been placed on board by John Gilbert Graham aged 23 who signed a US$ 37,500 life-insurance for his mother who was on board. Convicted guilty for murder and terrorism, he was sentenced to death penalty and executed on January 11, 1956. ", "probable_cause": "The Board determines that the probable cause of this accident was the disintegrating force of a dynamite bomb explosion which occurred in the number 4 baggage compartment. The following findings were reported:\r\n- At 1903, eleven minutes after departure, an in-flight disintegrating explosion occurred aboard Flight 629,\r\n- The aircraft was climbing normally and was on course when the explosion occurred,\r\n- Physical evidence showed conclusively the explosion took place in the number 4 baggage compartment of the aircraft,\r\n- The violence of the explosion and the physical evidence proved the explosion was not caused by any system or component of the aircraft,\r\n- Physical evidence at the scene and laboratory tests confirmed that the explosive material was dynamite, in the form of a bomb,\r\n- There was no evidence found to indicate malfunction or failure of the aircraft or its components prior to the explosion."}