{"url": "https://www.baaa-acro.com/crash/crash-douglas-b-26b-union-city-4-killed", "date": "Oct 3, 1955 at 2117 LT", "type": "Douglas A-26 Invader", "operator": "Great-Lakes-Carbon-Corp", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Bridgeport – White Plains – LaGuardia – Tulsa", "msn": "29229", "yom": 1944, "flight_number": null, "city": "Union City", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Bridgeport, Connecticut, for California at 1245LT carrying two crew members. Two stops were then made at White Plains,N. Y. and at LaGuardia Field where 2 passengers boarded the aircraft. At 1346 the flight left La Guardia for Tulsa, Oklahoma, under Visual Flight Rules and no flight plan was filed. At Tulsa the aircraft was refueled with 906 gallons of gasoline which filled to capacity both main tanks, the nose tank and the rear fuselage tank. After the pilots were briefed by the Tulsa U.S. Weather Bureau Office, an Instrument Flight Rules flight plan was filed with the Air Route Traffic Centre. At 2114LT Oklahoma City Airway Communications Station received a call from the flight on 126.7 mcs requesting cancellation of the IFR flight plan and asking for a landing clearance at Oklahoma City. The flight was given the special 2100LT weather as 10,000 feet overcast, sky partially obscured, fog. visibility 1-1/2 miles, and was advised to contact RAPCON (Radar Approach Control) on 119.3 mcs for a clearance to land as IFR conditions prevailed. The crew advised that it desired clearance for Will Rogers Field. This was the last radio contact with the aircraft. It crashed at 2117LT 2 3/8 miles northwest of Union City, Oklahoma, and 23 miles west of Will Rogers Field, Oklahoma City. Two explosions were heard in the air prior to the crash and portions of the empennage and fuselage were found along the last 3 miles of the flight path. All four occupants were killed, among them George Skakel Sr., founder of Great Lakes Carbon Corporation and his wife Ann. ", "probable_cause": "The probable cause of this accident was the loss of the aircraft's empennage as a result of an in-flight fuel explosion in the aft section of the fuselage. Investigation recent A-26 accident indicates possible fire and explosion hazard in rear fuselage area. For all A-26-B and A-26-C aircraft having rear fuselage tank installed in same compartment with electrical components liable to sparking the following restriction is mandatory until further notice. Rear fuselage fuel tank shall be drained, purged, and marked to prohibit use. Placard cockpit fuel controls and filler cap for information pilot and servicing personnel."}