{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-huanuco", "date": "Nov 5, 2010 at 1423 LT", "type": "Swearingen SA227 Metro III", "operator": "LC%20Busre", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lima - Huánuco", "msn": "AC-715", "yom": 1988, "flight_number": "LCB1331", "city": "Huánuco", "zone": "Huánuco", "country": "Peru", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7590, "captain_hours_type": 553, "copilot_hours": 5348, "copilot_hours_type": 2050, "aircraft_hours": 24342, "circumstances": "Following an uneventful flight from Lima, the crew continued the approached while the aircraft was unstabilized. Upon touchdown on runway 07, the aircraft landed relatively hard then bounced three times when the crew retracted the landing gear. The aircraft slid on its belly for about 600 metres before coming to rest. All nine occupants escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "Erroneous retraction of the landing gear following three bounces on the runway due to an unstabilized final approach and poor crew resource management.\r\nContributing factors were:\r\n- Although the descent and landing checklists were followed, the crew did not review stabilized approach criteria or procedures for a possible controlled flight into terrain and did not take into consideration the possibility of any go around procedure\r\n- Several call-outs were non-standard while others were missing\r\n- Descent was continued under visual flight rules, approach was unstabilized and not detected by crew\r\n- Speed was too high on touch down while the power levers were not into idle position\r\n- Lack of corrective action on part of the crew when the aircraft was bouncing\r\n- Loss of situational awareness led to the retraction of the landing gear."}