{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-annette-island-18-killed", "date": "Oct 26, 1947 at 1345 LT", "type": "Douglas DC-4", "operator": "Pan%20Am.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Seattle – Annette Island – Juneau", "msn": "10317", "yom": 1944, "flight_number": "PA923", "city": "Annette Island", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 13, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": 13565, "captain_hours_type": 514, "copilot_hours": 12412, "copilot_hours_type": 359, "aircraft_hours": 4146, "circumstances": "Flight 923 departed at 1030 October 26, 1947, from Seattle, Washington, for Juneau, Alaska, with an intermediate stop scheduled at Annette Island Captain Alf N. Monsen flew as pilot and First Officer Laurence A Foster as copilot. The airplane carried 13 passengers including an infant, a crew of five, 2,500 gallons of fuel, and 822 pounds of cargo. This load was within the allowable airplane weight and was properly distributed in respect to the center of gravity. Company weather information given to Captain Monsen before departure was to the effect that there would be unlimited ceiling from Seattle to Comox, British Columbia. Then at the cruising altitude of 9,000 feet, instrument conditions, light icing, and light to moderate turbulence was expected over the route. Winds were forecasted to be from 200 to 230 degrees at 30 to 40 knots. It was also forecasted that at the time of the flight's arrival over Annette there would be an 800-foot overcast, lower broken clouds, visibility of 2 miles, light rain, and a surface wind from the south-southeast at 18 knots. A cold type occlusion or front which was moving toward Annette Island from a point about 375 miles west of there was expected to pass Annette Island before the flight arrived. Proceeding en route in accordance with an instrument clearance to fly at 9,000 feet, the flight arrived over Annette Island at 1338 after a routine trip. Earlier, at 1326, the company radio at Annette Island had transmitted a weather observation which reported an indefinite 1,400-foot ceiling, overcast, lower broken clouds, visibility of 3 miles, rain, wind southeast at 28 miles per hour, with gusts to 40 miles per hour. The flight acknowledged receipt of this information. Airway Traffic Control cleared the flight to pass over the radio range station located 1 5 mile northwest of the airport at 7,000 feet and then to proceed with a normal instrument letdown and approach to the field. The flight acknowledged this clearance, and reported its position over the radio range station at 7,000 feet at 1338. The normal instrument procedure for Annette Island was established with regard to the mountainous terrain east and northeast of the airport, which rises to an elevation of 3,596 feet on Tamgas Mountain. This procedure required the flight, after approaching from the south at 7,000 feet and reporting over the radio station, to remain west of the south course of the range while on instruments. Five minutes after the flight reported over the range station, at 1343 it advised Annette Radio that it was proceeding to Juneau, approximately 250 miles north-northwest of Annette Island, because of extreme turbulence. This was the first indication that the flight was encountering any difficulty in accomplishing a normal letdown and approach to the airport. In response, Annette Radio asked the flight to report its altitude, but there was no reply. After repeated calls to the flight Annette Radio issued an alert at 1401. It was estimated that the flight at the time of its last radio contact had aboard 9 hours and 16 minutes of fuel. At approximately 1430 the Civil Aeronautics Board was notified, and a search by air, land, and sea was immediately begun. However, adverse weather conditions retarded the search to such a degree that the wreckage was not located until 5 days after the accident October 31, 1947. It was found that the airplane had crashed on the north slope of Tamgas Mountain, approximately 8 miles east of Annette Island Airport and 8 miles east of the south course of the Annette radio range.", "probable_cause": "The Board finds that there is not sufficient evidence to determine the probable cause of this accident."}