{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-newnan-2-killed", "date": "Dec 4, 2003 at 1940 LT", "type": "Beechcraft 200 Super King Air", "operator": "Southeastern Air Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Douglas – Newnan", "msn": "BB-734", "yom": 1981, "flight_number": null, "city": "Newnan-Coweta County", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1248, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9864, "circumstances": "Upon arriving at the destination airport, the controller cleared the flight for localizer 32 approach and informed the pilot that radar service was terminated and a frequency change was approved, report canceling IFR this frequency. The pilot acknowledged the clearance. A review of radar data revealed that the airplane was on course and lined up with the runway when the airplane collided with trees and the ground one mile south of runway 32. A review of information on file with Southeastern Air Charter, Inc., the operator of the accident airplane, found that the pilot's most recent Airman Competency/Proficiency Check was conducted in a Cessna 210. There were no records to indicate the pilot had undergone a flight-check in the Beech 200, as outlined in the Corporations FAA Approved Operational Specifications. Examination of the airframe and engines found no pre-existing discrepancies that would have precluded the airplane from operating properly prior to impact. Surface Weather Observations reported near the time of the accident. was visibility 1 to 1¼ miles; ceiling 200 feet overcast. A review of the approach plate found the minimum descent altitude for the approach to be 325 AGL and visibility 1 mile. ", "probable_cause": "The pilot's inadequate in-flight planning/decision when he continued the flight below the decision height and collided with trees. A related factor was the low ceiling."}