{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-18v-paris-21-killed", "date": "Nov 23, 1962 at 1410 LT", "type": "Ilyushin II-18", "operator": "Malev", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Budapest – Frankfurt – Paris", "msn": "180 0020 02", "yom": 1960, "flight_number": "MA355", "city": "Paris-Le Bourget", "zone": "Seine-Saint-Denis", "country": "France", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 13, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": 10380, "captain_hours_type": 1313, "copilot_hours": 4135, "copilot_hours_type": 733, "aircraft_hours": 2363, "circumstances": "Malev Airlines Flight 355 was a scheduled international transportation service from Budapest to Frankfurt and Parts. The flight departed Budapest for Frankfurt at 0744 hours GMT. The crew reported to the Frankfurt meteorological office for briefing at 0950 hours when the pilot's attention was drawn to the frequent occurrences of log and stratus cloud, and the possibility of light icing in stratus cloud The crew remained in the meteorological office for two hours checking successive weather reports from Orly and Le Bourget Airports. There were 13 passengers and a crew aboard when the flight departed Frankfurt for Le Bourget with the pilot-in-command occupying the left-hand seat. The first radio contact with North Area Control Centre was made at 1332 hours when the flight reported it had passed over Luxembourg at 1331 hours at flight level 180 and estimated the next reporting point MY at 1335 hours. It was then Instructed to report over MY, CH and BE. From 1344:20 hours to 1355:20 hours the flight received progressive descent clearances down to 1800 feet. At 1348:50 when the aircraft reported over CH, it was instructed to proceed to BN. However, at 1354:40 when reporting approaching BN the controller stated that it was cleared to BE and not to BN. This was acknowledged by the aircraft without repeating the message. At 1356:10 hours the flight was cleared by Le Bourget Approach for final approach. At 1356:10 the controller asked the aircraft whether it was heading BE or UN. Ten seconds later the aircraft confirmed that it was heading for BN and was then requested again to proceed to BE. The aircraft was instructed to call when over BE and was advised that it was number 2 to land. Confirmation of the QNH (altimeter setting) was given to the aircraft, and it was cleared for final approach at 1359 hours. At 1401:40 Le Bourget Approach called the aircraft, and the aircraft reported on final and stated it would call \"over BE\". The controller gave the aircraft its position as 2 miles east of BE and asked the pilot if he was making an ILS approach. This was confirmed. At 1405:10 hours the aircraft contacted the tower and advised it would reach BE at 1800 feet and was making an ILS approach on runway 25. At 1405:30 hours the aircraft reported over BE. It should then have been in level flight with 15deg of flap, at about 500 m (1500 ft) and at a speed of 310-320 km/h. There was no further radio contact between the aircraft and the tower although the aircraft should have reported over the outer marker at approximately 300 m (900 ft). At 1421 hours the airport authorities were informed by the police that the aircraft had crashed about 8OO m beyond the outer marker and about 135 m to the right of the ILS centreline.", "probable_cause": "The accident was the result of a stall during approach in the configuration landing gear extended, flaps 30°. At the time of impact the four engines were nearly at full power. The Board has not been able to establish the cause of this stall whose pattern, according to the data supplied by the Soviet experts, can only be compatible with a G-load manoeuvre. The Board has not been able to discover what caused the manoeuvre."}