{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-21g-turbo-goose-al-ain-4-killed", "date": "Feb 27, 2011 at 2007 LT", "type": "Grumman G-21A Goose", "operator": "Triple%20S%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Al Ain - Riyadh", "msn": "1240", "yom": 1944, "flight_number": null, "city": "Al Ain", "zone": "Abu Dhabi (إمارة أبو ظبي‎)", "country": "United Arab Emirates", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1000, "captain_hours_type": 50, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9926, "circumstances": "On 27 February 2011, at approximately 12:12:20 UTC, a mechanic working on McKinnon G-21G, registration mark N221AG, called the operational telephone line of Al Ain International Airport tower and informed the Aerodrome Controller (ADC) that the Aircraft would depart that evening. The Aerodrome Controller requested the estimated time of departure (ETD) and the mechanic stated that the departure would not be before 1400 outbound to Riyadh, Saudi Arabia. The ADC asked if the flight crew were still planning to perform a test flight before departure to the planned destination. The mechanic answered that they have not flown the Aircraft for a while and they want to stay in the pattern to make sure everything is “okay” prior to departure on the cleared route. The ADC advised that they could expect a clearance to operate in the circuit until they were ready to depart. The mechanic advised that there would be no need land, they only wished to stay in the circuit and to go straight from there towards the cleared route. The ADC asked the mechanic about the Aircraft type, the mechanic answered that it is Grumman Goose equipped with turbine engines and it would be heading back to the United States for an autopilot installation and annual inspection and “everything”. The mechanic commented to the ADC that the Aircraft was unique in the world with the modifications that it had. At 13:53:15, the ADC contacted the mechanic and requested an ETD update. The mechanic advised that there would be a further one-hour delay due to waiting for fuel. A witness, who is an instructor at the flight academy where the Aircraft was parked, stated that he had formed the impression that the maintenance personnel “…looked stressed out and they were obviously behind schedule and were trying to depart as soon as possible for the test flight so everything would go as planned and they could depart to Riyadh the same evening”. At approximately 14:10, the Aircraft was pushed out of the hangar, and the two mechanics moved luggage from inside the hangar and loaded it onboard the Aircraft. The mechanics also loaded a bladder extra fuel tank onboard and placed it in the cabin next to the main passenger door. At 14:17, the Aircraft was fueled with 1,898 liters of Jet-A1 which was 563 liters less than the 650 USG (2,461 liters) requested by the crew. At approximately 15:00, and after performing exterior checks, the male, 28 year old pilot in command (PIC), and another male, 61 years old pilot boarded the Aircraft and occupied the cockpit left and right seats, respectively. The two mechanics occupied the two first row passenger seats. The PIC and the other pilot were seen by hangar personnel using torchlights while following checklists and completing some paperwork. At 15:44:48, the PIC contacted the Airport Ground Movement Controller (GMC) on the 129.15 MHz radio frequency in order to check the functionality of the two Aircraft radios. Both checks were satisfactory as advised by the GMC. Thereafter, and while the Aircraft was still on the hangar ramp, the PIC informed the GMC that he was ready to copy the IFR clearance to Riyadh. The GMC queried if the Aircraft was going to perform local circuits and then pick up the IFR flight plan to the destination. The PIC replied that he would like to make one circuit in the pattern, if available, then to [perform] low approach and from there he (the PIC) would be able to accept the clearance to destination. The GMC acknowledged the PIC’s request and advised him to expect a left closed circuit not above two thousand feet and to standby for a clearance. The PIC read back this information correctly. At 15:48:58, the GMC gave engine start clearance and, at 15:50:46, the PIC reported engine start and requested taxi clearance at 15:52:16. The GMC cleared the Aircraft to taxi to the holding point of Runway (RWY) 19. The GMC advised, again, to expect a left hand (LH) closed circuit not above two thousand feet VFR and to request IFR clearance from the tower once airborne. The GMC instructed the squawk as 3776, which was also read back correctly. At 15:55:13, the PIC requested a three-minute delay on the ramp. The GMC acknowledged and instructed the crew to contact the tower once the Aircraft was ready to taxi. At 15:56:03, the PIC called the GMC and requested taxi clearance; he was recleared to the holding point of RWY 19. At 15:57:53, the GMC advised that, after completion of the closed circuit, route to the destination via the ROVOS flight planned route on departure RWY 19 and to make a right turn and maintain 6,000 ft. The PIC read back the instructions correctly. At 16:02:38, and while the Aircraft was at the holding point of RWY 19, the PIC contacted the ADC on 119.85 MHz to report ready-for-departure for a closed circuit. The ADC instructed to hold position then he asked the PIC if he was going to perform only one closed circuit. The PIC replied that it was “only one circuit, then [perform] a low approach and from there capture the IFR to Riyadh.” At 16:03:56, the ADC instructed the PIC “to line up and wait” RWY 19 which, at that time, was occupied by a landing aircraft that vacated the runway at 16:05:23. At 16:05:37, the Aircraft was cleared for takeoff. The ADC advised the surface wind as 180°/07 kts and requested the crew to report left downwind which was acknowledged by the PIC correctly. The Aircraft completed the takeoff acceleration roll, lifted off and continued initial climb normally. When the Aircraft reached 300 to 400 ft AGL at approximately the midpoint of RWY 19, it turned to the left while the calibrated airspeed (CAS) was approximately 130 kts. The Aircraft continued turning left with increasing rate and losing height. At approximately 16:07:11, the Aircraft impacted the ground of Taxiway ‘F’, between Taxiway ‘K’ and ‘L’ with a slight nose down attitude and a slight left roll. After the impact, the Aircraft continued until it came to rest after approximately 32 m (105 ft) from the initial impact point. There was no attempt by the PIC to declare an emergency. The Aircraft was destroyed due to the impact forces and subsequent fire. All the occupants were fatally injured.", "probable_cause": "The Air Accident Investigation Sector determines that the cause of the Accident was the PIC lapse in judgment and failure to exercise due diligence when he decided to enter into a steep left turn at inadequate height and speed.\r\nContributing factors:\r\n- The PIC’s self-induced time pressure to rapidly complete the post maintenance flight.\r\n- The PIC’s desire to rapidly accomplish the requested circuit in the pattern.\r\n- The PIC’s lack of recent experience in the Aircraft type.\r\n- The flight was SPIFR requiring a high standard of airmanship."}