{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-near-manacapuru-12-killed", "date": "Jul 29, 1998 at 1300 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Selva Táxi Aéreo", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Manaus – Tefé", "msn": "110-343", "yom": 1982, "flight_number": null, "city": "Manacapuru", "zone": "Amazonas", "country": "Brazil", "region": "South America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 24, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 15000, "captain_hours_type": 8000, "copilot_hours": 2500, "copilot_hours_type": 2000, "aircraft_hours": null, "circumstances": "The EMB-110 Bandeirante operated on a domestic flight from Manaus to Tefé, Brazil. Although the airplane was certificated for a maximum of 19 passengers, there were 25 passengers on board. Also, for financial reasons the crew decided to take more fuel than necessary for this flight. This resulted in the airplane departing with an excess of weight of 852 kg. About 20 minutes into the flight the oil pressure of the no. 2 engine dropped. The crew reduced engine power to 72% and continued to Tefé. When the flight was 185 km from Manaus at FL85 the oil pressure dropped to 40psi and the TGT increased. The copilot shut down the engine and the captain turned the airplane around, back to Manaus. At 13:15 the crew contacted Manaus ACC reporting that they were returning on one engine. The overloaded airplane flying on one engine, began to lose height. During the descent the speed was kept around 105 kts which occasionally caused activated stick shaker. To lose weight, the left overwing exit was opened and luggage of the passengers was jettisoned. The airplane did not make it to Manaus and an emergency landing on the Manacapuru River was made. The Bandeirante landed hard on the water, causing an opening in the fuselage. It sank quickly.", "probable_cause": "The following factors were identified:\r\n- It was not possible to examine the debris of the aircraft to determine the contribution of this factor to the failure of the left engine.\r\n- It is possible that the failure to carry out a type B2 inspection and/or to carry out a type A1 inspection by an unqualified person may have contributed to the occurrence of a low oil pressure emergency, due to material deterioration or inadequate services. The impossibility of examining the aircraft could not determine this aspect.\r\n- The owner of the air taxi company participated due to lack of adequate supervision in the planning of operations, at the technical, operational and administrative levels. This deficiency can be characterized, among other things, by the owner of the company that allowed the aircraft to fly with the type B2 inspection expired; by the excessive amount of fuel, when refueling in Manaus; by the unreasonable number of people on board, causing the aircraft to fly with excess weight, and still, by the receipt of pilots' salary to be conditioned to the accomplishment of the fateful flight.\r\n- Errors were made by the aircraft crew due to the improper use of the resources available in the cabin, intended for the operation of the aircraft, due to non-compliance with operational rules.\r\n- There was a mistake made by the crew due to the inadequate preparation for the flight, assuming numerous failures, such as: the non conference, by the pilots, of the cargo and passengers manifest; the lack of the realization of a briefing and still, to accept an aircraft for a flight, being the same with its inspection not carried out.\r\n- An error was made by the crew due to inadequate evaluation of certain aspects of the flight. Such deficiency was evidenced when the first sign of failure of the lubrication system occurred, after twenty minutes of flight, and even so, they decided to proceed with the flight, when the most sensible and safe would be the return, immediately, to Manaus.\r\n- The airline's support staff participated in the planning of weight and balance of the aircraft and the number of passengers on board, providing incorrect information to the aircraft's crew members. In addition, the mechanic who performed the A1 type inspection was not qualified for the function.\r\n- There has been intentional non-compliance by the crew members with the operational rules established by the aircraft manufacturer.\r\n- The Commander did not foresee what was predictable, for lack of caution, thus intentionally increasing the risk margin of the mission."}