{"url": "https://www.baaa-acro.com/crash/crash-waco-uic-whangarei-1-killed", "date": "Sep 29, 1957 at 1515 LT", "type": "Waco UIC", "operator": "Northland-Districts-Aero-Club", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Whangarei - Whangarei", "msn": "3820", "yom": null, "flight_number": null, "city": "Whangarei", "zone": "Northland Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane was engaged in a local sightseeing flight over the region of Whangarei, carrying one pilot, two adults, a mother and her one year-old baby. After takeoff, while climbing to a height of 300 feet, the engine failed. The pilot made a turn to the left, reduced his altitude and decided to return to the airport. He elected several times to restart the engine but without success. Eventually, he was forced to ditch the aircraft that crashed into the Whangarei harbor. The pilot evacuated the cabin and was able to assist both adults and the baby but unfortunately, the woman was trapped and could not be saved. The aircraft was lost.   ", "probable_cause": "It was determined that the accident was caused by an engine failure due to the following factors:\n- The engine failure was caused by a fuel starvation,\n- The fuel starvation was caused by the petrol in the tank in use being forced to the outward end of the tank, thus vacating the tank outlets,\n- The movement of the petrol away from the tank outlets was caused by a state of unbalanced flight,\n- The state of unbalanced flight was caused either by corrective control to overcome the left wing low tendency, or by uncoordinated control during take-off,\n- Underlying the causation factors is the inherent risk created by the design of the petrol system when the aircraft was flown on one partially-filled tank."}