{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-134skh-nyagan", "date": "Jun 24, 2003", "type": "Tupolev TU-134", "operator": "VoronezhAvia", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nyagan – Salekhard", "msn": "66495", "yom": 1987, "flight_number": null, "city": "Nyagan", "zone": "Khantia-Mansia okrug", "country": "Russia", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was subject to major maintenance during the last two months, especially with the rudder actuators that were replaced. As there were still problems with the actuators during the last flight, decision was taken to make the appropriate adjustments followed by a flight to Salekhard. During the takeoff roll on runway 16/34, at a speed of 150 km/h, the aircraft deviated to the left and the captain decided to counter this deviation by using the nosewheel steering system. This caused the right front tyre to burst. At a speed of 250 km/h, the takeoff procedure was abandoned but this decision was taken too late. Unable to stop within the remaining distance (the runway 16/34 is 2,530 metres long), the aircraft overran, lost its nose gear and rolled for 577 metres before coming to rest. All 11 occupants escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "The following findings were identified:\r\n- Poor quality of work from the engineering personnel of Voronezh Avia during the replacement and adjustment of the hydraulic amplifier GU-108D,\r\n- Unsatisfactory flying and technical operation of the aircraft after the completion of the replacement of the hydraulic amplifier, during which the incorrectly installed rudder actuator was not discovered,\r\n- The decision taken by the crew to continue the takeoff procedure despite significant efforts needed for the deflection of the right rudder pedal already noted during the preflight checks,\r\n- The late rejection of the takeoff procedure."}