{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-sacramento", "date": "Jan 23, 2003 at 2030 LT", "type": "Cessna 402", "operator": "Redding%20Aero%20Entreprises", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ukiah – Sacramento", "msn": "402C-0645", "yom": 1982, "flight_number": null, "city": "Sacramento-Mather", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3400, "captain_hours_type": 350, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13817, "circumstances": "The airplane collided with obstructions following a loss of power in one engine during a missed approach. Following the collision sequence the airplane came to rest upright about 500 feet from the approach end of the runway and was destroyed in a post-impact ground fire. The pilot told a responding sheriff's deputy and a Federal Aviation Administration (FAA) inspector that he made the ILS approach to land and initiated a missed approach. When he added power, the left engine sputtered and the airplane veered to the left. He activated the fuel boost pump, but the airplane contacted obstructions and crashed. The responding sheriff's deputy also observed the accident. He heard an engine of an airplane making unusual sounds. The engine \"seemed to get quiet and then revved higher as if to climb.\" He looked in the direction of the sound and saw a series of blue flashes and then an orange fireball. The deputy reported that there was a dense fog in the area at the time. At the time of the accident, the airport's weather conditions were reported as 100 feet overcast and 1/4-mile visibility in fog. The landing minimums for the ILS approach are 200 feet and 1/2-mile. According to the operator's records, when the airplane departed from Ukiah, its gross takeoff weight was about 5,909 pounds. The pilot operating handbook (POH) for the airplane lists the following items in the single engine go around checklist: 1) Throttle full forward; 2) wing flaps up; 3) when positive climb rate achieved, gear up; 4) ensure the inoperative engine is feathered. For a gross weight of 5,900 pounds, and the existing atmospheric conditions, the single engine climb performance chart shows an expected positive rate of climb of 500 feet per minute if the airplane was configured correctly. The chart also lists the following subtractions from that performance for the listed condition: 1) -400 fpm for wind milling inoperative engine; 2) -350 feet for landing gear down; 3) -200 fpm for flaps extended to 15 degrees. Examination of the wreckage disclosed that neither engine's propeller was feathered, the landing gear was down and the flaps were extended to 10 degrees. Without the airplane configured correctly for the single engine missed approach, the net climb performance would be a negative 400 feet per minute. There were no discrepancies noted with the airframe examination. The engine examination revealed no mechanical anomalies with either engine that would have precluded normal operation. 14 CFR 135.224 states that a pilot cannot initiate an approach if the weather conditions are below landing minimums if the approach is started outside of the final approach fix. The pilot can continue the landing if they are already established on the approach and the airport goes below landing minimums. According to the operator's FAA approved operating specifications, the operator had not been approved for lower than standard landing minimums.", "probable_cause": "Loss of engine power in the left engine for undetermined reasons. Also causal was the pilot's failure to correctly configure the airplane for a single engine missed approach, which resulted in a negative climb performance. A factor was the pilot's decision to initiate the approach when the weather conditions were below the published approach minimums."}