{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e18s-kansas-city-1-killed-0", "date": "Dec 8, 1994 at 2038 LT", "type": "Beechcraft E18", "operator": "Cape Central Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Postal (mail)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sedalia - Kansas City", "msn": "BA-364", "yom": 1958, "flight_number": null, "city": "Kansas City", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2523, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During arrival at night in fog and drizzle, the pilot was cleared for an ILS runway 1l approach. While on the approach, she reported encountering moderate rime ice. Radar data showed that the airplane continued inbound on the localizer until it neared the middle marker, then it deviated about 20° left and collided with the ground, about 300 feet short and 300 feet left of the threshold. According to witnesses, the airplane stopped its descent and slowed down, shortly before entering a steep descent and a spin. An on-scene investigation revealed no preimpact airframe, control system, or powerplant anomalies. The wings had 1/4 inch of ice on the leading edge and a 1/2 inch high ridge of ice, parallel to the deicing boots, about 3 inches aft of the boots. The cockpit and windshield heating system were found in the 'off' position. The pilot's logbook was not available for inspection. Company records showed she had passed a 14 cfr part 135 checkride on may 20, 1994. The faa checkride form was administered and signed by the chief pilot. However, other records/information showed the chief pilot would not have been able to have given the checkride on that date.", "probable_cause": "Failure of the pilot to maintain adequate airspeed on final approach, which resulted in an inadvertent stall/spin. Factors related to the accident were: the adverse weather (icing) conditions, the accumulation of airframe/wing ice, the pilot's improper use of the anti-ice/deice equipment, inadequate training of the pilot concerning flight in icing conditions, and inadequate surveillance of the operation by the chief pilot (company/operator management)."}