{"url": "https://www.baaa-acro.com/crash/crash-airbus-a330-243-jeddah", "date": "May 21, 2018 at 2150 LT", "type": "Airbus A330", "operator": "Saudia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Madinah - Dhaka", "msn": "437", "yom": 2001, "flight_number": "SV3818", "city": "Jeddah-King Abdulaziz", "zone": "Makkah l-Mukarramah (مكة المكرمة)", "country": "Saudi Arabia", "region": "Asia", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 142, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Madinah-Mohammad Bin Abdulazziz Airport at 1724LT on a schedule service to Dhaka with 142 passengers and 10 crew members on board. At 1746LT, while cruising at FL370, the crew informed ATC about a malfunction of the green hydraulic system followed by a 'green hydraulic system reservoir low level' warning. The crew decided to return to Madinah but this was not possible due to deteriorating weather conditions, so it was decided to divert to Jeddah-King Abdulazziz Airport. Several attempts to lower the nose gear were unsuccessful and only both main landing gear seemed to be down. After a circuit to burn fuel, the crew was cleared to descent and expected to make a low pass over runway 16C but neither the control tower nor ground staff were able to confirm the nose gear extension. Eventually, the crew was cleared to land on runway 34R with the nose gear retracted. The aircraft landed 700 metres past the runway threshold and the nose landed 1,350 metres further, causing both engine nacelles to hit the runway surface. The airplane slid for few hundred metres and came to rest 700 metres from the runway end. All 152 occupants evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": null}