{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-elko-4-killed", "date": "Nov 18, 2016 at 1920 LT", "type": "Piper PA-31 Cheyenne", "operator": "American-Medflight", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Elko - Salt Lake City", "msn": "31-7920093", "yom": 1979, "flight_number": null, "city": "Elko", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 7050, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6600, "circumstances": "The airline transport pilot departed in the twin-engine, turbine-powered airplane on an air ambulance flight with two medical crew members and a patient on board in night visual meteorological conditions. According to a witness, during the initial climb, the airplane made a left turn of about 30° from the runway heading, then stopped climbing, made an abrupt left bank, and began to descend. The airplane impacted a parking lot and erupted into flames. In the 2 months before the accident, pilots had notified maintenance personnel three times that the left engine was not producing the same power as the right engine. In response, mechanics had replaced the left engine's bleed valve three times with the final replacement taking place three days before the accident. In addition, about 1 month before the accident, the left engine's fuel control unit was replaced during trouble shooting of an oil leak. Post accident examination revealed that the right engine and propeller displayed more pronounced rotational signatures than the left engine and propeller. This is consistent with the left engine not producing power or being at a low power setting at impact. Further, the abrupt left bank and descent observed by the witness are consistent with a loss of left engine power during initial climb. The extensive fire and impact damage to the airplane precluded determination of the reason for the loss of left engine power.", "probable_cause": "A loss of engine power to the left engine for reasons that could not be determined due to the extensive fire and impact damage to the airplane."}