{"url": "https://www.baaa-acro.com/crash/crash-bac-111-320az-port-harcourt", "date": "Sep 7, 1989 at 1905 LT", "type": "BAc 111", "operator": "Okada%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lagos - Port Harcourt", "msn": "133", "yom": 1968, "flight_number": "OKJ307", "city": "Port Harcourt", "zone": "Rivers", "country": "Nigeria", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 88, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 42575, "circumstances": "Okada Air Flight OKJ307 originated from Lagos (LOS), at about 17:10 hours UTC en-route to Port-Harcourt (PHC). By 17:40 hours, at FL250, the crew established contact with Port Harcourt Tower and was cleared to the \"PR\" Radio Beacon. The 1700 hours weather report was passed onto the crew with the assurance not to expect any delay for an ILS approach to runway 21. At 75 nm from Port Harcourt, the aircraft was cleared down to FL90 and the crew reviewed their approach briefings. The First Officer was still flying when the airplane was further cleared to 2000 feet with the instructions to report when established on the localizer. At 700 feet, the Commander had the field-in-sight but the flying pilot had not. Then the Commander took over control from the First Officer. The captain requested the tower to increase approach lights intensity because of drizzling rain. The BAC 111 passed an area of heavy downpour. It entered a high sink rate and made a hard landing. The airplane bounced and made the second touchdown on its nose-wheel. The right nose wheel shattered instantaneously while the second nose wheel fractured at the hub. It rolled for about 90 metres and crumbled under the weight of the aircraft. When both wheels of the nose gear had broken away, the wheel axle made contact with runway to cut grooves onto the runway surface for about 25 metres before the nose strut finally gave way. The aircraft now scooped forward on the nose fuselage section and continued off the runway on to the left shoulder. On the shoulder, the aircraft ran into the wide trench which was covered up with loose soil and the impact severed off the right main gear from the attachment point. The aircraft eventually came to a stop 735 meters after touchdown.", "probable_cause": "The probable cause of this accident is the poor handling of the controls at the critical movement of final approach and landing phases, probably due to the sudden loss of azimuth in the heavy downpour of rain. The contributory factor to the accident is the excavation and improper refilling of the outrageous trenches of wide dimensions along the length of runway 03/21."}