{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-8as-rome", "date": "Nov 10, 2008 at 0756 LT", "type": "Boeing 737-800", "operator": "Ryanair", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hahn - Rome", "msn": "33639/2557", "yom": 2008, "flight_number": "FR4102", "city": "Rome-Ciampino", "zone": "Lazio", "country": "Italy", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 164, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9883, "captain_hours_type": 6045, "copilot_hours": 600, "copilot_hours_type": 400, "aircraft_hours": 2419, "circumstances": "The airplane departed Hahn Airport at 0630LT on a flight to Rome-Ciampino Airport, carrying 14 passengers and a crew of 8. The first officer was the Pilot Flying on the leg whilst the captain was the Pilot Monitoring. The flight was uneventful until the approach phase at the destination airport. The aircraft established the first radio contact with Ciampino Tower, communicating that it was 9 NM from the runway and stabilised on the ILS for runway 15. The aircraft, authorized and configured for the approach, was proceeding for landing, when, at a height of 136 ft and a distance of about 300 m from the runway, the captain noticed birds on the flight trajectory. He stated \"Ahi\", repeated in rapid sequence. At a distance of about 100 m from the runway, the TO/GA pushbutton was activated. The first officer acknowledged: \"Go around, flaps 15\", setting the go around attitude. At the same time as the TO/GA was activated, the aircraft collided with a thick flock of some 90 starlings. A loud bang was heard and both engines stalled. The aircraft climbed to 173 feet and then continued to lose height, despite the nose-up command. There was a progressive speed reduction and an increase of the angle of attack until the activation of the stick shaker, which was recorded at 21 feet. The aircraft hit the ground in aerodynamic stall conditions, near taxiway AC, about half way along the total length of the runway at a vertical acceleration of 2.66g. First contact with the runway occurred with the main landing gear properly extended and with the lower part of the fuselage tail section. The left main landing gear detached from its attachment during the landing run and the lower part of the left engine nacelle came into contact with the runway. The aircraft stopped near the threshold of runway 33. The fire brigade sprayed extinguishing foam around the area where the engine nacelle had come into contact with the runway. The captain then arranged for the disembarkation of the passengers and crew using a ladder truck from the right front door, with the addition of the right rear slide, later activated and used.", "probable_cause": "The accident has been caused by an unexpected loss of both engines thrust as a consequence of a massive bird strike, during the go-around manoeuvre. The loss of thrust has prevented the aircrew from performing a successful go around and has led the aircraft to an unstabilized runway contact. The following factors have contributed to the event:\r\n- The inadequate effectiveness of bird control and dispersal measures put in place by the airport operator at the time of the accident,\r\n- The captain decision to perform a go around, when the aircraft was at approximately 7 seconds from touchdown. The above decision was significantly influenced by:\r\n- The lack of instructions to flight crew concerning the most suitable procedures to adopt in the case of single or multiple bird strikes in the landing phase,\r\n- The absence of specific training in the management, by the flight crew, of the \"surprise\" and \"startle\" effects in critical phases of the flight."}