{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-h18-great-bend-1-killed", "date": "Feb 9, 2007 at 0850 LT", "type": "Beechcraft H18", "operator": "Bygone Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Wichita - Great Bend", "msn": "BA-717", "yom": 1965, "flight_number": null, "city": "Great Bend", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3250, "captain_hours_type": 125, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7702, "circumstances": "Prior to the flight, the pilot obtained a weather briefing which included an AIRMET for IFR conditions and an AIRMET for icing that was \"just off to the north.\" According to air traffic control (ATC) information, the en route portion of the flight was uneventful. ATC cleared the pilot for an ILS approach to runway 35, and the pilot acknowledged the approach clearance. When the airplane reached the outer marker ATC approved the pilot for a frequency change to the common traffic advisory frequency. The pilot acknowledged the frequency change, and no further communications were received from the pilot by ATC. Witnesses observed the airplane approximately 200 feet above ground level (agl) on a northwesterly heading, west of runway 35. The airplane then entered a climbing left turn to the south and disappeared into the overcast cloud layer. Shortly thereafter, the witness observed the airplane in a \"20 degree nose down, wings level attitude\" on a southeasterly heading. The witness then lost sight of the airplane due to hangars obstructing his view. At the time of the accident, the witness stated that the ceiling was approximately 500 foot overcast with mist. The published missed approach procedure instructed the pilot to initiate a climbing left turn to a fix and hold. Examination of the accident site revealed the airplane impacted the terrain in a right wing, nose-low attitude. No ground impact marks were noted except in the immediate vicinity of the wing leading edges, engines, and propeller assemblies. The flaps and landing gear were in the extended position. The leading edge surfaces of the vertical and horizontal stabilizers revealed 1/4 to 1/2 inches of clear ice. The upper fuselage antenna displayed 1/4 to 1/2 inches of clear ice. Local authorities reported observing a \"layer of ice\" on the leading edges of both wings when they arrived to the accident site. Examination of the airframe and engines revealed no anomalies that would have precluded normal operations.", "probable_cause": "The pilot's failure to maintain aircraft control during the missed approach which resulted in an inadvertent stall and impact with terrain. A contributing factor was the icing conditions."}