{"url": "https://www.baaa-acro.com/crash/crash-consolidated-pby-5a-catalina-walterboro", "date": "Aug 14, 1961", "type": "Consolidated PBY Catalina", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Walterboro – Charleston", "msn": "1697", "yom": 1944, "flight_number": null, "city": "Walterboro", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was to be ferried from Walterboro to Charleston, South Carolina, after a period of non-use, except one flight, of about two years. Following takeoff and two circles in the vicinity of the airport, course was set for Charleston at an altitude of about 1,000 feet. Shortly thereafter the left engine followed by the right began to surge and lose power. In the attempt to reach an open field beyond trees the aircraft stalled and crashed. All three crew members were uninjured while the aircraft was damaged beyond repair. \nSource: \nhttps://aviation-safety.net/database/record.php?id=19610814-1", "probable_cause": "Examination of the wreckage revealed water contamination of the fuel system of the aircraft. Evidence of water was found in the left main fuel feed line and cylinders of the left engine. The right carburetor screen was excessively corroded and a fuel sample showed pronounced evidence of water. Cylinders of the right engine revealed water. The left and right fuel selector valve screen showed no evidence of having been pulled and cleaned and there was water present in both screens. The refueling facility from which the aircraft had been refueled was examined for water but none was found. From the above evidence it was obvious that water contamination caused the power failure and that preparation of the aircraft for the flight after a prolonged period of non-use was inadequate."}