{"url": "https://www.baaa-acro.com/crash/crash-bae-3101-jetstream-31-dallas", "date": "Mar 25, 1988 at 0830 LT", "type": "BAe Jetstream 31", "operator": "American-Eagle-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Wichita Falls - Dallas", "msn": "671", "yom": 1985, "flight_number": null, "city": "Dallas-Fort Worth", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4841, "captain_hours_type": 2100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4475, "circumstances": "The copilot was flying the aircraft as it was being ferried after minor maintenance. As they were in a descent and were approaching the destination airport, the captain noted a left engine torque fluctuation of 20% to 30% and elected to secure the engine, although no yawing was noticed. During shutdown, the left propeller did not feather and drag increased until the aircraft would not sustain level flight. An attempted restart of the left engine was unsuccessful, so the captain tried to feather it again. However, the left propeller still did not feather. Subsequently, the pilots were forced to land in an open field on uneven terrain and the aircraft was damaged. An extensive investigation was made, but no cause could be found for the torque fluctuation, nor could the condition be duplicated, however, the investigation did note that the air and ground procedures for engine shutdown were similar. A variation in the ground shutdown procedures allowed for engagement of the start latches. ", "probable_cause": "Airplane's encounter with rought terrain during an attempted forced landing. The forced landing was necessitated after the captain used improper procedures to shutdown the left engine in flight following an unexplained torque fluctuation."}