{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-20c-detroit", "date": "Aug 28, 2001 at 1805 LT", "type": "Dassault Falcon 20", "operator": "Grand%20Aire_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Detroit – Rockford", "msn": "88", "yom": 1967, "flight_number": "GAE617", "city": "Detroit-City (Coleman A. Young)", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 24000, "captain_hours_type": 900, "copilot_hours": 5700, "copilot_hours_type": 200, "aircraft_hours": 13282, "circumstances": "The airplane sustained substantial damage on impact with terrain and objects after traveling off the end of the runway during a main wheels up landing. The captain reported that prior to takeoff, he closed the cargo door and the copilot confirmed the door light was out. After takeoff at an altitude of about 600 feet, the cockpit door popped open and the crew noticed the cargo door was open. The captain elected to return to land. The captain reported he requested repeatedly for gear and flaps extension, but the copilot was late in doing so and it \"caused us to overshoot the runway centerline.\" The copilot then began calling for a go around/missed approach at which time he raised the gear and the retracted some of the flaps. The copilot reported the captain continued to descend toward the runway and overshot the runway centerline to the right. The copilot reported that at this time he lowered the gear. The nose gear extended prior to touchdown, however the main gear did not. The airplane touched down approximately 1/2 way down the runway and traveled off the end. A witness reported noticing that the exterior door latch was not down as the airplane taxied to the runway.", "probable_cause": "The wheels up landing performed by the flightcrew during the emergency landing and improper aircraft preflight by the pilot in command. Factors were the unsecured cargo door, the cemetery fence, and the lack of crew coordination during the flight."}