{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-boyne-city-2-killed", "date": "Nov 15, 2021 at 1245 LT", "type": "Beechcraft 90 King Air", "operator": "N290KA LLC", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Pontiac - Boyne City", "msn": "LW-59", "yom": 1973, "flight_number": null, "city": "Boyne City", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On November 15, 2021, about 1245 eastern standard time, a Beech E-90, N290KA, was destroyed when it was involved in an accident near Boyne City, Michigan. The airline transport pilot and passenger sustained fatal injuries. The airplane was operated as a Title 14 Code of Federal Regulations Part 91 business flight. A review of preliminary air traffic control (ATC) information revealed that the airplane departed Oakland County International Airport (PTK), Pontiac, Michigan, at 1150 on an instrument flight rules (IFR) flight plan and climbed to 16,000 ft mean sea level (msl). The airplane was enroute to Boyne City Municipal Airport (N98), Boyne City, Michigan. The airplane descended toward N98 and the pilot was cleared for the RNAV GPS Runway 27 approach. While on the final approach course, the airplane’s groundspeed gradually slowed from 129 to 88 knots over a period of one minute and the last recorded location showed the airplane was 3.3 nautical miles east of the Runway 27 threshold, about 1,500 ft msl (800 ft above ground level), and slightly left of the approach course. The airplane subsequently impacted the ground about 600 ft west of the last recorded location. Broken tree limbs indicated the airplane was in a steep descent of about 70° while on a west heading. Two witnesses located about ¼ mile southeast of the accident site heard the airplane fly overhead, followed by a loud thud. The witnesses observed very heavy sleet with low visibility conditions for about 10 minutes, before and after the accident time. The sleet had a high liquid content and would melt quickly after ground impact. An Airman’s Meteorological Information (AIRMET) for icing was valid for the accident location. Initial examination revealed the entire airplane was present at the accident site and no anomalies were noted with the airplane’s flight controls that would have precluded normal operation. The airplane was retained for further examination. ", "probable_cause": null}