{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-ocean-ridge", "date": "Jul 22, 2008 at 1350 LT", "type": "Cessna 402", "operator": "Jean P. Bayardelle", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "City", "schedule": "Lantana - Pompano Beach", "msn": "402B-0857", "yom": 1975, "flight_number": null, "city": "Ocean Ridge", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1565, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7222, "circumstances": "The commercial pilot, who was also the former owner of the twin-engine airplane, stated that the purpose of the flight was to reposition the airplane to an airport approximately 22 miles south of the departure airport. Just prior to the flight, he purchased 10 gallons of fuel for each of the two main tanks. The pilot reported that about 5 minutes after takeoff, at an altitude of approximately 1,000 feet, he experienced a \"loss of engine power.\" However, his three separate accounts of the event were inconsistent with respect to which engine had a problem, or the specific nature of the problem. The pilot reported that the airplane started to lose altitude \"rapidly,\" and that he attempted to \"wag the wings\" in order to \"get all the fuel to be useable.\" The airplane struck a building and terrain approximately 8 miles south of the departure airport. The pilot sustained serious injuries, but there was no fire. Damage to the left engine and propeller was consistent with the engine running at impact, and precluded an attempt to run the left engine in a test cell. Damage to the right engine and propeller was consistent with low or no power at impact. The right engine was subsequently successfully run in a test cell. No evidence of any pre-accident anomalies that could have contributed to the accident was noted with the airframe, engines, or propellers. The fuel selector valve placards did not accurately depict the fuel system configuration. The fuel quantity and its distribution in the tanks, either at the beginning of the flight or at the time of the accident, could not be determined.", "probable_cause": "A partial loss of engine power due to fuel starvation. Contributing to the accident was the pilot’s decision to add only a limited amount of fuel prior to the flight, and the fuel selector valve placards' inaccurate depiction of the airplane fuel tank configuration."}