{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-denver-2-killed", "date": "Jan 24, 2003 at 1721 LT", "type": "Piper PA-31 Cheyenne", "operator": "Lee Larson Aircraft Sales", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Broomfield – Denver", "msn": "31-7520036", "yom": 1975, "flight_number": null, "city": "Denver", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 9365, "captain_hours_type": null, "copilot_hours": 1944, "copilot_hours_type": null, "aircraft_hours": 6478, "circumstances": "A Piper PA-31T \"Cheyenne\" and a Cessna 172P \"Skyhawk\" collided in midair during cruise flight at dusk and in visual meteorological conditions. The Cheyenne departed under visual flight rules (VFR) from a local airport northwest of Denver, and was proceeding direct at 7,800 feet to another local airport south of Denver. Radar indicated its ground speed was 230 knots. Its altitude encoder was transmitting intermittently. The Skyhawk departed VFR from the south airport and was en route to Cheyenne, Wyoming, at 7,300 feet. The pilot requested and was cleared to climb to 8,500 feet and penetrate class B airspace. Radar indicated its ground speed was 110 knots. The Skyhawk was flying in the suggested \"VFR flyway\"; the Cheyenne was not. When the controller observed the two airplanes converging, he asked the pilot of the Cheyenne for his altitude. He replied he was at 7,600 feet. The controller immediately issued a traffic advisory, but the pilot did not acknowledge. Both airplanes departed controlled flight: the Skyhawk struck a house, and the Cheyenne fell inverted into the backyard of a residence. Wreckage was scattered over a 24 square block area in west Denver. At the time of the accident, the controller was handling low altitude en route, arrival and departure traffic for both airports. Wreckage examination disclosed four slashes, consistent with propeller strikes, on top of the Cheyenne's right engine nacelle, the cabin above the right wing trailing edge, the empennage at the root of the dorsal fin, and at the tail cone. The Cheyenne was on a similar flight three days before the collision when the pilot was informed by air traffic control that the transponder was operating intermittently. According to recorded radar and voice communications from that flight, the transponder/encoder operated intermittently and the pilot was so advised. Examination of the Cheyenne's altimeter/encoder revealed a cold solder connection on pin 8 of the 15-pin altimeter connector. When the wire was resoldered to the pin, the information from the altimeters, encoder, and altitude serializer was normal.", "probable_cause": "Both pilots' inadequate visual lookout. A contributing factor was the Cheyenne pilot operating the airplane with a known transponder deficiency."}