{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-049-constellation-sanoyie-40-killed", "date": "Jun 22, 1951 at 0325 LT", "type": "Lockheed L-049 Constellation", "operator": "Pan%20Am.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Johannesburg – Léopoldville – Accra – Monrovia – Lisbon – Horta – New York", "msn": "2046", "yom": 1946, "flight_number": "PA151", "city": "Sanoyie", "zone": "Bong", "country": "Liberia", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 34, "pax_fatalities": 34, "other_fatalities": 0, "total_fatalities": 40, "captain_hours": 7818, "captain_hours_type": 426, "copilot_hours": 5134, "copilot_hours_type": 2776, "aircraft_hours": 13343, "circumstances": "Pan American's Flight 151 departed Johannesburg at 0812, June 21, and after a routine flight and scheduled stop at Léopoldville, Belgian Congo, arrived at Accra, Gold Coast, at 2125. Following a mechanical delay which required the changing of several spark plugs and a set of magneto points, the flight was dispatched and cleared to Roberts Field, Monrovia, on an instrument flight plan at 16,500 feet with Dakar, French West Africa, and Accra as alternates Take-off from Accra was at 2352Z. The gross weight at departure was 89,255 pounds, including cargo, mail, 3,340 gallons of fuel, 31 passengers, and a crew of nine. The gross weight of the aircraft and distribution of the disposable load were within the allowable limits. The en route communication system of the flight sector between Accra and Roberts Field is high frequency radio-telephone utilizing ground stations at Accra and Roberts Field as primary guarding stations Normal communication with these two stations was maintained as Flight 151 progressed westward after departing Accra. The flight proceeded in a routine manner, climbing to 16,500 feet MSL in accordance with the flight plan. At 0057 a position report was given over Abidjan, 258 miles west of Accra, and arrival over Cape Palmas, Liberia, 265 miles farther to the west, was estimated as 0156. At 0156 Flight 151 reported over Cape Palmas at 16,500 feet MSL, on instruments, and estimated arrival at Roberts Field as 0246. (A plantation employee in the Cape Palmas area stated that he beard an airplane inland and very high at approximately 0220, that the moon was bright and the sky was clear at the time. Since no other aircraft was known to have been in the area, this is presumed to have been Flight 151). At 0220 Flight 151 requested clearance to descend. Roberts Field radio cleared the flight to descend to 3,000 feet and advised that at 0225 the Roberts Field tower would establish contact on VHF A clear two-way contact was made at 0225 on 118.1 mcs, at which time the tower gave the flight the local weather and altimeter set-ting, cleared it to descend IFR over Roberts Range Station, and indicated that Runway 05 was in use. At 0237 Flight 151 was again given local weather for Roberts Field cloud base estimated 1,000 feet, broken, light drizzle and haze, visibility 3 miles. At 0241 the local wind was given as W-WNW variable 7 miles per hour All of these messages were acknowledged. At 0255, nine minutes after its ETA at Roberts, Flight 151 was heard calling Roberts Field on VHF 118.1 mcs. The tower responded, repeating the call three times. There was no indication that the aircraft heard the tower, whereupon the tower switched to 3270 kcs and requested the flight to give its current position. There was no reply to this call. Immediately following failure of the aircraft to respond to Roberts tower on 3270 kcs, the Roberts Field high frequency radio-telephone facility established contact advising the flight that they were unable to read it on 118.1 mcs and that the flight should reply to the tower's call on 3270 kcs. This message was acknowledged at 0301. At 0305 the flight again contacted Roberts tower on 3270 kcs advising that the Dakar radio beacon was interfering with the Roberts Field radio beacon and that they would \"be back in 15 minutes\" Roberts tower advised Flight 151 that Dakar would be requested to turn off the beacon and this message was acknowledged (Because of incoming traffic to Dakar, the beacon there was not turned off until 0410) At 0315 Flight 151 again called Roberts tower on 3270 kcs and the latter transmitted the latest weather. The flight did not acknowledge this transmission on 3270 kcs but called Roberts tower on 118.1 mcs Roberts tower then replied on 118 1 mcs but received no acknowledgement. Thereafter, the tower repeatedly called Flight 151 on both 118.1 mcs and 3270 kcs, requesting the aircraft's position and broadcasting the weather However, the incomplete contact at 0315 was the last transmission received from the flight. The wreckage was found a day later near the village of Sanoyie, about 91 km northeast of Monrovia-Roberts Airport. The aircraft was destroyed by impact forces and a post crash fire and all 40 occupants have been killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the action of the captain in descending helm his en route minimum altitude without positive identification of the flight's position. The following finding was pointed out: the aircraft never overheaded the Roberts Field range station and a let-down was made without positive determination of the flight's position.\n"}