{"url": "https://www.baaa-acro.com/crash/crash-boeing-767-moroni-125-killed", "date": "Nov 23, 1996 at 1515 LT", "type": "Boeing 767-200", "operator": "Ethiopian%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Addis Ababa – Nairobi – Brazzaville – Lagos – Abidjan", "msn": "23916", "yom": 1987, "flight_number": "ET961", "city": "Moroni-Prince Saïd Ibrahim (ex Hahaya)", "zone": "All Comoros Islands", "country": "Comoros Islands", "region": "Africa", "crew_on_board": 12, "crew_fatalities": 6, "pax_on_board": 163, "pax_fatalities": 119, "other_fatalities": 0, "total_fatalities": 125, "captain_hours": 11525, "captain_hours_type": 4067, "copilot_hours": 6570, "copilot_hours_type": 3042, "aircraft_hours": 32353, "circumstances": "Ethiopian Airlines flight ET961 had taken off from Addis Ababa, Ethiopia, at 08:09 hours UTC for a scheduled flight to Abidjan, Ivory Coast via Nairobi, Kenya; Brazzaville, Congo; and Lagos, Nigeria. Twenty minutes after takeoff, at about 08:29 UTC, one passenger stood up from his seat and ran up the aisle to the cockpit, and two other passengers followed him heading for the cockpit. While rushing to the cockpit one of the men said \"Everybody should be seated, I have a bomb!\". Then they opened the cockpit door and stormed in. They declared to the pilots that there were eleven hijackers on board and beat the First Officer and forced him out of the cockpit. They then grabbed the fire axe and fire extinguisher bottle from their respective stowages and ordered the pilot-in-command to change direction and fly to Australia. The pilot-in-command explained to the hijackers that he had not enough fuel to reach Australia and demanded to make a refueling stop at Mombasa. The hijackers refused the refueling stop and continued arguing with the pilot-in-command. They insisted that they had learned from the inflight magazine that the B767 could fly 11 hours without refueling. After passing Dar es Salaam one of the hijackers ordered him to fly away from the coast, head to Australia and indicating to the altimeter not to descend below FL390. The pilot-in-command turned left towards the Comoros Island. The lead hijacker was sitting in the first officer's seat and was fiddling with the aircraft's controls, kicking the rudder, whilst also drinking whisky. The pilot-in-command kept on telling them that he was running short of fuel pointing to the fuel quantity indicators, but the hijackers did not listen. The leader continued fiddling with the controls, trying to turn the aileron and pulling the reverse thrust lever at random. As the flight came over the Comoros Islands the pilot-in-command saw the Moroni International Airport runway and circled 15-20 nm south of the field. Then the LOW FUEL CAUTION came on. The pilot-in-command pleaded to land because of low fuel. The hijackers were unconcerned and only insisted that the pilot not descend below FL390. At about 11:41 UTC the right engine ran down to wind milling speed. The pilot-in-command showed the red warning message for the right engine on the EICAS to the hijacker. At this moment, the hijacker left the right seat and went to the cabin door to discuss with the other two hijackers. This gave the captain the opportunity to pick up his microphone and address the passengers: \"....ladies and gentlemen this is your pilot, we have run out of fuel and we are losing one engine this time, and we are expecting crash landing and that is all I have to say. we have lost already one engine, and I ask all passengers to react ..... to the hijackers ....\". The hijacker then came back to the cockpit and hit the microphone out of the pilot's hand. After the right engine failed, the pilot started to descend the aircraft in order to increase speed, but the hijacker again interfered and violently played with the controls which resulted in improper control inputs. As a result the autopilot was disconnected and the flight became erratic with the airspeed varying between 216 and 336 kts. As the pilot regained control of the aircraft, the left engine went dead. The hijacker kept on instructing the pilot not to descend and again went to the cabin. Upon returning to the cockpit he saw that the altitude was decreasing, and angrily shouted at the pilot not to go any lower. The pilot said that the fuel was already finished and that the engines were without power. This time the hijacker instructed the captain not to touch the controls, and threatened to kill him. The captain said, \"I am already dead because I am flying an airplane without engine power.\" The first officer, who had earlier been forced out to the First Class cabin, got up and, via the right aisle, went to the rear of the aircraft where he saw that a lot of economy class passengers had their life jackets on and that some had already inflated them. The first officer, along with the cabin crew members, helped the passengers to deflate the life jackets and showed them how the jackets should be re-inflated and how to assume the brace position during impact. While returning to the front of the aircraft, they repeated the same instructions as many times as they could. About less than 2 minutes before the ditching, the co-pilot forced his way to the cockpit shouting \"let me help the pilot ...\". After adjusting his seat and seat belts the pilot asked him for help since the controls were heavy. The hijackers still kept on struggling with the controls. By now, the aircraft was descending into the Indian Ocean over the Comoros Islands. The aircraft now had only standby instruments and RAT (Ram Air Turbine). The altimeter was indicating 150 feet and the airspeed was 200 kts. By this time the flight crew had been left alone to assume control. They turned the aircraft to the left in order to parallel the waves. However, the aircraft brushed the water in a left-wing-low attitude. It was then held straight and level after which it broke into four sections and came to rest in the sheltered waters 500 metres off Le Galawa Beach. Of the 175 occupants, 6 crew members and 119 passengers were fatally injured in the accident. Six crew members and 38 passengers sustained serious injuries, 2 passengers sustained minor injuries and 4 passengers received no injury.", "probable_cause": "The Investigation Committee determines that the cause of this accident was unlawful interference by the hijackers which resulted in loss of engines thrust due to fuel exhaustion."}