{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-barbados-2-killed", "date": "May 18, 2003 at 2046 LT", "type": "Piper PA-31-310 Navajo", "operator": "Ian Gordon Fletcher", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Canouan – Bridgetown", "msn": "31-7812117", "yom": 1978, "flight_number": null, "city": "Barbados", "zone": "All Barbados", "country": "Barbados", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 390, "captain_hours_type": 70, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a flight from Canouan, a small island in the St Vincent group, to Barbados. Shortly after entering Barbados airspace, radar recordings show the aircraft deviated to the south of a direct easterly track to Barbados and descended from cruise flight level (FL) 55 to an altitude of 2,300 feet. The aircraft levelled at 2,300 feet and resumed an easterly track for about six minutes before once again deviating to the south and commencing a further descent. About 16 minutes after the aircraft's initial descent from FL55, the pilots of a commercial aircraft flying from Grenada to Barbados relayed a MAYDAY call from G-ILEA to Barbados Arrivals reporting that the pilot \"had lost one engine; it appeared he was losing fuel and he doubted that he would be able to make it to Barbados\". Some three and a half minutes after the initial MAYDAY call, the pilot of the commercial aircraft relayed a further message stating that the pilot intended to ditch. The final radar return for the aircraft showed it at an altitude of 600 feet about 55 miles on the 259° radial from Barbados Airport. Despite an extensive search and rescue operation, no trace of the aircraft or its two occupants was found. A reconciliation of fuel receipts and flight times shows that, at best, the aircraft would have been short of fuel for the flight, and at worst could have run out of fuel. ", "probable_cause": "No trace of the aircraft or its occupants has been discovered and the lack of any wreckage makes it difficult to come to firm conclusions on the cause of this accident. The reported pilot's statement from he relayed MAYDAY transmission that \"it appeared he was losing fuel\" points to some problem with the fuel system, but there was no indication on how the pilot came to this judgement. A rupture in a fuel tank or a leak from one or more of the aircraft's fuel drains would have been difficult or impossible to detect visually from the cockpit. Loss of a fuel filler cap may have resulted in loss of fuel. However, the relatively low fuel level in the tanks would probably have limited or precluded such a loss and since the caps on both sides are visible from the cockpit it might be expected that the pilot would have stated the problem in his emergency call. Alternatively, the pilot's assessment that he was losing fuel may have been based simply on a perceived rate of change of fuel contents on the  fuel gauges. Indeed the reported use by the pilot of the phrase \"appears to be losing fuel\" may point to some uncertainty on the matter or that there was no physical evidence of fuel loss. "}