{"url": "https://www.baaa-acro.com/crash/crash-canadair-cl-600-2b16-challenger-604-near-shahr-e-kord-11-killed", "date": "Mar 11, 2018 at 1840 LT", "type": "Canadair CL-604 Challenger", "operator": "Basaran", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Sharjah – Istanbul", "msn": "5494", "yom": 2001, "flight_number": null, "city": "Shahr-e-Kord", "zone": "Chahar Mahaal and Bakhtiari", "country": "Iran", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 4880, "captain_hours_type": 1600, "copilot_hours": 1132, "copilot_hours_type": 114, "aircraft_hours": 7935, "circumstances": "A Turkish Challenger 604 corporate jet impacted a mountain near Shahr-e Kurd in Iran, killing all 11 on board. The aircraft departed Sharjah, UAE at 13:11 UTC on a flight to Istanbul, Turkey. The aircraft entered Tehran FIR fifteen minutes later and the Tehran ACC controller cleared the flight to climb to FL360 according to its flight plan. About 14:32, the pilot requested FL380, which was approved. Before reaching that altitude, the left and right airspeeds began to diverge by more than 10 knots. The left (captain's) airspeed indicator showed an increase while the right hand (copilot's) airspeed indicator showed a decrease. A caution aural alert notified the flight crew of the difference. Remarks by the flight crew suggested that an 'EFIS COMP MON' caution message appeared on the EICAS. As the aircraft was climbing, the crew reduced thrust to idle. Approximately 63 seconds later, while approaching FL380, the overspeed aural warning (clacker) began to sound, indicating that the indicated Mach had exceeded M 0.85. Based on the Quick Reference Handbook (QRH) of the aircraft, the pilot flying should validate the IAS based on the aircraft flight manual and define the reliable Air Data Computer (ADC) and select the reliable Air Data source. The pilot did not follow this procedure and directly reduced engine power to decrease the IAS after hearing the clacker. The actual airspeed thus reached a stall condition. The copilot tried to begin reading of the 'EFIS COMP MON' abnormal procedure for three times but due to pilot interruption, she could not complete it. Due to decreasing speed, the stall aural warning began to sound, in addition to stick shaker and stick pusher activating repeatedly. The crew then should have referred to another emergency procedure to recover from the stall condition. While the stick pusher acted to pitch down the aircraft to prevent a stall condition, the captain was mistakenly assumed an overspeed situation due to the previous erroneous overspeed warning and pulled on the control column. The aircraft entered a series of pitch and roll oscillations. The autopilot was disengaged by the crew before stall warning, which ended the oscillations. Engine power began to decrease on both sides until both engines flamed out in a stall condition. From that point on FDR data was lost because the electric bus did not continue to receive power from the engine generators. The CVR recording continued for a further approximately 1 minute and 20 seconds on emergency battery power. Stall warnings, stick shaker and stick pusher activations continued until the end of the recording. The aircraft then impacted mountainous terrain. Unstable weather conditions were present along the flight route over Iran, which included moderate up to severe turbulence and icing conditions up to 45000ft. These conditions could have caused ice crystals to block the left-hand pitot tube. It was also reported that the aircraft was parked at Sharjah Airport for three days in dusty weather condition. Initially the pitot covers had not been applied. The formation of dust inside the pitot tube was considered another possibility.", "probable_cause": "The accident was caused by insufficient operational prerequisites for the management of erratic airspeed indication failure by the cockpit crew. The following contributing factors were identified:\r\n- The aircraft designer/manufacturer provided insufficient technical and operational guidance about airspeed malfunctions that previously occurred.\r\n- Lack of effective CRM."}