{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-30-marquise-chillicothe", "date": "Sep 28, 1996 at 0835 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Air Hi Ho", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chillicothe - Columbus", "msn": "533", "yom": 1971, "flight_number": null, "city": "Chillicothe-Ross County", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5400, "captain_hours_type": 2150, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6644, "circumstances": "The pilot said that after climbing about 500 feet after takeoff, at 120 knots with the gear retracted, the left engine lost power. He feathered the propeller, lowered the nose to the horizon, and began a shallow left turn back to the airport. He left the flaps at 20° and noted a descent of 200 feet to 300 feet per minute in the turn. After clearing trees, the pilot extended the landing gear, banked the aircraft to the right to align it with the runway and lowered flaps to 40°. After touchdown, he applied single engine reversing. The aircraft went off right side of runway and into a ditch, collapsing the right main and nose gear. Examination of the engine revealed the torque sensor housing had failed, resulting in loss of drive to the fuel pump. Metallurgical exam of the housing arm of the torque sensor revealed it had failed from fatigue. On 9/14/79, a service bulletin (SB) was issued for replacement of the torque sensor housing with an improved housing. The manufacturer overhauled the engine on 12/1979, but SB was not complied with. SB indicated a history of resonant vibration causing cracks in the housing arm of original torque sensor and gear assemblies, and that the housing should be replaced, no later than during next part exposure. Investigation revealed pilot did not comply with engine failure procedures and airspeeds. Flight manual cautioned not to use 40° of flaps during single engine landings. ", "probable_cause": "Failure of the pilot to follow the published emergency procedures after loss of power in the left engine. Factors relating to the accident were: fatigue failure of the left torque sensor and gear assembly, which resulted in the loss of engine power, failure of the manufacturer to comply with the respective service bulletin, and the pilot's improper use of the flaps and reverse (single-engine) thrust. "}