{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-saint-mathieu-de-beloeil", "date": "Jun 10, 2013 at 1725 LT", "type": "Beechcraft 100 King Air", "operator": "Aviation%20Flycie", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Montreal - Montreal", "msn": "B-88", "yom": 1971, "flight_number": null, "city": "Saint-Mathieu-de-Beloeil", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4301, "captain_hours_type": 1500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13616, "circumstances": "The aircraft took off from the Montréal/St-Hubert Airport, Quebec, on a local flight under visual flight rules with 1 pilot and 3 passengers on board. The purpose of the flight was to check the rudder trim indicator and to confirm a potential synchronization problem between the autopilot and the global positioning system (GPS). As the aircraft approached Runway 24R at the Montréal/St-Hubert Airport, both engines (Pratt & Whitney Canada, PT6A-28) stopped due to fuel exhaustion. The pilot diverted to the St-Mathieu-de-Beloeil Airport, Quebec, and then attempted a forced landing in a field 0.5 nautical mile west of the St-Mathieu-de-Beloeil Airport. The aircraft struck the ground 30 feet short of the selected field, at 1725 Eastern Daylight Time. The aircraft was extensively damaged, and the 4 occupants sustained minor injuries. The emergency locator transmitter activated during the occurrence. The flight took place during daylight hours, and there was no fire.", "probable_cause": "Findings as to causes and contributing factors:\r\n- The pilot relied exclusively on the gauge readings to determine the quantity of fuel on board, without cross-checking the fuel consumption since the last fueling to validate those gauge readings.\r\n- The pilot misread the fuel gauges and assumed that the aircraft had enough fuel on board to meet the minimum fuel requirements of the Canadian Aviation Regulations for this visual flight rules flight, rather than adding more fuel to meet the greater reserves required by the company operations manual.\r\n- The pilot did not monitor the fuel gauges while in flight and decided to extend the flight to carry out a practice instrument approach with insufficient fuel to complete the approach.\r\n- The right engine stopped due to fuel exhaustion.\r\n- The pilot did not carry out the approved engine failure procedure when the first engine stopped, and the propeller was not feathered, resulting in significant drag which reduced the aircraft's gliding range after the second engine stopped.\r\n- The pilot continued flying toward Montréal/St-Hubert Airport (CYHU), Quebec, despite having advised air traffic control of the intention to divert to the St-Mathieu-de-Beloeil Airport (CSB3), Quebec, and without communicating the emergency. The priority given to communications resulted in the aircraft moving farther away from the intended diversion airport.\r\n- The left engine stopped due to fuel exhaustion 36 seconds after the right engine stopped, when the aircraft was 7.4 nautical miles from Runway 24R at Montréal/St-Hubert Airport (CYHU), Quebec, and 2400 feet above sea level.\r\n- The pilot's decision to lower the landing gear while the aircraft was still at 1600 feet above sea level further increased the drag, reducing the aircraft's gliding range. As a result, the aircraft was not able to reach the runway at St-Mathieu-de-Beloeil Airport (CSB3), Quebec.\r\n- The operations manager was unable to perform the duties and responsibilities of the position related to monitoring and supervision of flight operations. As a result, the safety of more than half of the flights was compromised.\r\nFindings as to risk:\r\n- If the total fuel quantity required for a flight is not calculated and clearly displayed on the operational flight plan, there is an increased risk that aircraft will depart without the fuel reserves required by the Canadian Aviation Regulations.\r\n- If flights are planned and carried out without the fuel reserves required by the Canadian Aviation Regulations, there is an increased risk of fuel exhaustion resulting from unanticipated situations that extend the duration of the flight.\r\n- If pilots elect to extend flight without first determining whether sufficient fuel reserves are available to do so, there is an increased risk of fuel exhaustion.\r\n- If pilots do not regularly check the quantity of fuel on board, there is an increased risk of fuel exhaustion.\r\n- If pilots do not rule out a fuel leak before opening the crossfeed valve, they risk losing all of the remaining fuel on board.\r\n- If a pilot does not maintain control of an aircraft until landing, the force of an impact following an aerodynamic stall is likely to be far greater, increasing the risk of injury or death during a forced landing.\r\n- If a pilot does not declare an emergency to air traffic control in a timely manner, the pilot may be deprived of assistance and resources that could help deal with the emergency, increasing the risk of an accident.\r\n- If pilots do not receive training in dealing with complex emergencies that require prioritizing tasks, there is a risk that they will not react effectively to emergencies, increasing the risk of an accident.\r\n- If companies do not establish a process to monitor the performance of their pilots during training and testing, there is a risk that those companies will inadvertently assign pilots to carry out flights for which they are not proficient.\r\n- If a flight is planned and authorized solely by the pilot, with no cross-check for compliance with existing regulations, there is a risk that deviations will continue undetected, reducing the safety of the flight.\r\n- If pilots operate without regular supervision to ensure compliance with regulations and company procedures, coupled with effective training, there is a risk of procedural adaptations that result in reduced safety margins.\r\n- If companies assign inexperienced personnel to key flight operations management positions, there is a risk that deviations in performance or from regulations will not be detected, reducing the safety of flight operations.\r\n- If the pilot proficiency check requirements for a chief pilot are not more stringent than those for other pilots, there is a risk that the chief pilot will be unable to perform the duties required to ensure the safety of company training and operations.\r\n- If the approval process for appointment of operations management personnel by companies is reduced to a compliance checklist based on the minimum standards in the Commercial Air Service Standards and on pilot proficiency checks that may be repeated an unlimited number of times, there is a risk that candidates who are unfit to perform the duties and responsibilities of their positions will be appointed.\r\n- If Transport Canada does not take into consideration the combined knowledge and experience of a new operator's management team, there is a risk that the operator will lack the skills necessary to ensure the safety of flight operations.\r\n- If process inspections carried out by Transport Canada do not examine factors related to a recent occurrence, there is a risk that those hazardous conditions will go undetected and will persist.\r\nIf process inspections carried by TC on newly certificated operators do not closely examine the outcomes of company processes, there is a risk that hazardous conditions will not be identified and will persist.\r\n- If the inability of appointed individuals to perform their duties and responsibilities does not constitute grounds for suspending or revoking the ministerial approval of such appointments, there is a risk that operations management personnel who are not competent will remain in their positions, increasing the risk to flight safety.\r\nOther findings:\r\n- The chief pilot did not meet the requirements of the Canadian Aviation Regulations at the time of appointment.\r\n- There was no indication that the aircraft's fuel gauges were not functioning properly at the time of the occurrence flight, and it is unlikely that a deviation of the fuel gauge indicator was a factor in the pilot's decision to take off.\r\n- C-GJSU had approximately 260 pounds of fuel on board when it took off from Montréal/St-Hubert Airport (CYHU), Quebec, and did not experience a fuel leak during the occurrence flight."}