{"url": "https://www.baaa-acro.com/crash/crash-convair-rb-36h-25-cf-peacemaker-ellsworth-afb-26-killed", "date": "Aug 27, 1954 at 2211 LT", "type": "Convair B-36 Peacemaker", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ellsworth - Ellsworth", "msn": null, "yom": null, "flight_number": null, "city": "Ellsworth AFB", "zone": "South Dakota", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 23, "pax_fatalities": 23, "other_fatalities": 0, "total_fatalities": 26, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Aircraft Commander Lt Col Wray Cotterill, Pilot 1st Lt Roger Bumps, Co-pilot Captain Neal Williams and a crew of twenty-four took off in RB-36H, 51-13722 of the 77th Strategic Reconnaissance Squadron of the 28th Strategic Reconnaissance Wing from Ellsworth AFB at 4:15 in the morning on August 27, 1954. The crew had just returned from a thirty day leave. Captain Williams had finished a 20-hour mission just 32 hours earlier. Their flight took them to Kansas City, Missouri; Little Rock, Arkansas; Dallas, Texas; and back to Little Rock for radar bombing practice. They flew to Kansas City again and then returned to Ellsworth AFB after flying 3,594 air miles. At 9:00 in the evening the pilots began to practice Planned Position Indicator Ground Control Approaches (GCA PPI) using Air Surveillance Radar. They entered the pattern for Runway 12. GCA PPI was not as precise as GCA precision approach. The minimum altitude for GCA approach was 3,864 feet. The approaches were flown at 145 miles per hour. The landing gear remained retracted. The flaps were lowered to 20 degrees and the landing lights were extended. The night was clear and visibility exceeded 15 miles. During the first four approaches, Lt Bumps flew from the right seat and Captain Williams observed from the left seat. A pair of North American F-86D Sabre Dogs took off from Runway 30 at 9:30. Their pilots noticed that the red obstruction lights on a low range of hills 1-3/4 miles northwest of the runway were not working. The lead pilot notified the Ellsworth tower that the obstruction lights were out. It was not known at the time that they had been disabled by a lightning strike the night before. The civilian Senior Electrician of Air Installations was called shortly before 10:00 P.M. and notified that the obstruction lights needed to be repaired. He assembled a crew at the AIO electrical shop and prepared to drive out to the lights. On the fourth approach, ground control advised Lt Bumps that the obstruction lights northwest of the field were not working. After the fourth pass over the airfield, Col Cotterill moved into the left hand seat to fly the next approach. Col Cotterill flew the approach higher than the glide path specified by the GCA operator. Before the sixth approach, Captain Williams replaced Lt Bumps in the right hand seat. It is believed that Col Cotterill flew the next approach. The RB-36H was flying at 145 miles per hour on a heading of 147 degrees (true), descending at 750 feet per minute when the left wing struck one of the inoperative obstruction lights. Seventy feet beyond the obstruction light the lower fuselage struck the ground 8,777 feet short and 225 feet right of the centerline of Runway 12 at 10:11 P.M. Mountain Standard Time. The impact point was at an elevation of 3,394 feet, 148 feet higher than the runway. The tail section broke away from the fuselage and came to rest 275 feet from the first point of impact. E.C.M. Captain Philip Toups, 1st Lt Roger Bumps and E.C.M. A/1C John Harvey were rescued from the wreckage while 24 other occupants were killed. Cpt Toups died five days after the crash. A/1C Harvey succumbed to his injuries after six days. Eventually, only 1st Lt Roger Bumps survived the crash. \r\nCrew:\r\nLt Col Wray Cotterill, pilot,\r\nCpt Neal Williams, copilot,\r\n1st Lt Roger Bumps, copilot,\r\nMaj Martin Margolin, navigator.\r\nPassengers: \r\nMaj Harold Chambers, photo navigator,\r\nCpt James MacDaniel, radar navigator,\r\nCpt Roy Wegner, engineer,\r\nM/Sgt William Ratagick, engineer, \r\nA1c Glenn Kerri, ECM,\r\nT/Sgt Charles Briggs, ECM\r\nCpt Philip Toups, ECM,\r\nA1c John Harvey, ECM,\r\nM/Sgt Carl Boyd, radio operator,\r\nA1c James Swanson, radio operator, \r\nA1c Russell Wilson, photo,\r\nA2c Allen Jenkins, photo,\r\nM/Sgt Dean McKever, gunner, \r\nA1c John Baker, gunner, \r\nA1c George Gross, gunner, \r\nS/Sgt Dennis Murphy, gunner, \r\nA2c George Hertnecky, gunner,\r\nA2c William Lynch, radio operator, \r\n2nd Lt Richard Crittenden, navigator,\r\n2nd Lt Joseph Mullan, engineer, \r\nA2c Marcel Herbert, photo,\r\nA2c Billy Campbell, photo,\r\nA2c Donald Wolf, gunner.\r\nSource & photos: http://www.air-and-space.com", "probable_cause": "Several factors contributed to the crash. The altimeter error for the RB-36H was estimated at -160 feet to  270 feet. An additional local terrain effect introduced an additional error of -70 feet to  70 feet. The Rapid City GCA radar was miscalibrated. The range value shown on the radar at the point of impact was off by 1/2 mile. Since the GCA radar indicated that the airplane was 1/2 mile closer than it actually was, it placed the glide slope 150 feet low. In the months preceding and following the crash, at least six pilots reported that GCA instructions might have caused them to land short or that GCA had reported them over the end of the runway before they actually reached it."}