{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46f-1-cu-commando-near-fish-haven-40-killed", "date": "Jan 7, 1953 at 0412 LT", "type": "Curtiss C-46 Commando", "operator": "Associated Air Transport", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Seattle – Cheyenne – Fort Jackson", "msn": "22395", "yom": 1945, "flight_number": "AAT166A", "city": "Fish Haven", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 37, "pax_fatalities": 37, "other_fatalities": 0, "total_fatalities": 40, "captain_hours": 4960, "captain_hours_type": 1055, "copilot_hours": 3584, "copilot_hours_type": 46, "aircraft_hours": 1941, "circumstances": "The flight originated at Boeing Field, Seattle, Washington, with the first stop scheduled at Cheyenne, Wyoming. The crew consisted of Captain Lawrence B. Crawford, First Officer Maxwell F. Perkins and Stewardess Marie Davis. Prior to departure the aircraft was serviced with 738 gallons of fuel and 20 gallons of oil, bringing the total on board to 1,020 gallons of fuel and 60 gallons of oil. Pre-flight inspection was performed by the crew. The gross weight of the aircraft at departure was 45,401 pounds or 401 pounds over the maximum allowable gross weight of 45,000 pounds authorized for passenger operations; 3 the distribution of the load on board, however, was within the prescribed center of gravity limitations. Weather briefing of the crew by the United States Weather Bureau at Boeing Field indicated en route weather to be scattered to broken clouds to overcast with the tops estimated at 12,000 feet and a Cheyenne Terminal Forecast of scattered clouds at 15,000 feet, visibility of more than 15 miles. The weather briefing included a forecast of icing conditions in clouds and precipitation above 6,000 feet along the route, with cloud tops ranging from 10,000 to 14,000 feet MSL. An IFR (Instrument Flight Rules) flight plan, filed by Captain Crawford and approved by the Civil Aeronautics Administration Air Route Traffic Control, Seattle, requested a cruising altitude of 13,000 feet to Cheyenne via Airways Green 2, Blue 12, Blue 32, Red 1, and Green 3, with a proposed air speed of 200 mph, estimated elapsed time five hours, with six hours and forty minutes of fuel aboard, alternate airport, Denver, Colorado. The flight departed Boeing Field at 0050 and made the required position reports along the route, with no mention of any irregularities, reporting over Malad City at 13,000 feet, time 0358, and estimating Rock Springs at 0445. There were no further radio contacts with the aircraft. All attempts to contact the flight by CAA radio stations and by other aircraft along and bordering the proposed route were unsuccessful. A widespread search for the missing aircraft was subsequently conducted under the supervision of Air Search and Rescue units of the United States Air Force. The wreckage was found eight miles west of Fish Haven five days later by the pilot of reconnaissance aircraft and all 40 occupants have been killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the inadvertent descent into an area of turbulence and icing which resulted in the flight's inability to regain a safe altitude. The following findings were pointed out:\r\n- Light to moderate turbulence and light rime ice prevailed in cloud tops at cruising altitude, while at lower altitudes moderate to severe turbulence and moderate to heavy icing existed,\r\n- Ice found on the wing had formed in flight,\r\n- The crew had been adequately briefed by the U. S. Weather Bureau as to weather over the route prior to departure from Seattle,\r\n- All major components of the aircraft were identified and examination of the wreckage disclosed no evidence of malfunction, failure or fire prior to impact,\r\n- Both engines were developing power at impact,\r\n- All navigation aids along the route were reported normal,\r\n- The accident occurred within the airway and slightly to the left of course."}