{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-100-greenland-2-killed", "date": "Apr 20, 1985 at 1932 LT", "type": "Fokker F27 Friendship", "operator": "Aeronica", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Keflavik – Sondreströmfjord", "msn": "10118", "yom": 1959, "flight_number": null, "city": "Greenland", "zone": "All Greenland", "country": "Greenland", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 45111, "circumstances": "The Fokker F-27, registration YN-BZF, was engaged on a delivery flight from North Yemen to Nicaragua. For the purpose of extended range two 200 US gal auxiliary ferry fuel tanks had been installed in the cabin of the aircraft. YN-BZF departed on 11 April 1985 from North Yemen (Sanaa) via Saudi Arabia (Jeddah), Egypt (Cairo) to Greece (Athens). The flight proceeded from Greece on 19 April 1985 via Italy (Genoa) to Scotland (Prestwick). On 20 April 1985 the flight proceeded from Prestwick via Stornoway to Reykjavik (Iceland) where it arrived at 15:48 hours. Since the crew had been unable to retrieve fuel from the auxiliary ferry fuel system during the preceding part of the flight, they checked the system during the stay at Reykjavik, and they found it to be in working order. An additional check was done by experienced Icelandic F-27 engineers. In the opinion of the ground engineers the auxiliary fuel system \"was not very professionally looking\" and they \"got the feeling that the crew was not quite certain of how to operate it\". They advised the crew on how to operate the fuel system and do a ground run to see if it worked. After having received weather information and ATC clearance, the crew took off at 17:21 hours, heading for Kangerlussuaq-Søndre Strømfjord Airport. At 18:32 the Pilot-in-Command transmitted a message to Iceland radio, whom he asked to extend his thanks to the Icelandic engineers with the message that the auxiliary ferry fuel system was working correctly. This message was transmitted prior to passage of Kulusuk at 19:35 hours. During the flight from Reykjavík, Iceland to Greenland the crew informed the air traffic control that problems had arisen with retrieving fuel from the auxiliary ferry fuel system. At 19:50, approximately 50 NM west of Kulusuk, the crew radioed to the radar station BIG GUN about fuel problems, as it had been discovered that the auxiliary ferry fuel system did not function after all. Thus encountering a reduction of fuel reserves by approximately 400 US gal together with a ground speed of only 180 knots the crew decided to return for landing at Kulusuk Airport. However, due to deteriorating weather conditions the aerodrome could not be located. The flight diverted hereafter westbound for an emergency landing at a radar station, \"SOB STORY\", on the icecap. During descent the aircraft collided with the icecap.", "probable_cause": "The following findings were reported: \r\n- The crew was properly certified for the flight,\r\n- According to the crew the normal aircraft systems, except for the FDR and the cockpit right front window electrical deicing system, were functioning normally, which was also determined by the on site investigation,\r\n- The auxiliary ferry fuel system was not functioning properly. The cause of this has not been conclusively established,\r\n- The crew did not undertake a satisfactory functional airborne check of the auxiliary ferry fuel system to ensure that it worked prior to the essential appliance of the system for flight, (cause-factor),\r\n- It is the opinion of this department from the evidence available that a deficiency in the procedures applied for operating the auxiliary ferry fuel system may have been a major factor,\r\n- The assistance rendered to the flight of YN-BZF was active and generally professional. However, the AFIS operator erroneously stated the distance from the KK NDB of 3 NM to be 10 NM.,\r\n- Furthermore the bearing from the KK NDB was not stated by the AFIS operator at BGKK on request from the crew of YN-BZF,\r\n- In the opinion of this department the lack of this information does not seem to have had any important bearing on the possibility of locating the aerodrome,\r\n- Weather conditions were a major factor in this accident, at the time of the approach into BGKK, as well as at the accident site, (cause-factor),\r\n- The Search and Rescue operation was anticipated at an early stage and put into effect immediately after the aircraft was considered to have had an accident,\r\n- The conditions offered on the accident site: low visibility approaching darkness, and consequently the inability to evaluate surface conditions, precluded successful rescue in the first attempt."}