{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-214-bilbao", "date": "Feb 7, 2001 at 2309 LT", "type": "Airbus A320", "operator": "Iberia-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Barcelona – Bilbao", "msn": "1278", "yom": 2000, "flight_number": "IB1456", "city": "Bilbao", "zone": "Basque Country", "country": "Spain", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 136, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10805, "captain_hours_type": null, "copilot_hours": 423, "copilot_hours_type": null, "aircraft_hours": 1149, "circumstances": "The aircraft was on its final approach to runway 30 of Bilbao Airport. The aircraft, operated by Iberia, was employed on flight IB1456, a scheduled domestic flight from Barcelona to Bilbao, with 136 passengers and 7 crew members on board. The expected flight time was 53 minutes. The current conditions in Bilbao were night VMC, with a 10 knots and southwest (SW) wind and gusts of up to 25 knots. Visibility was more than 10 km and there were scattered clouds above 5,600 feet. The sun had set four hours earlier and all electronic and visual aids in the airport were fully operational. There was no rain and the flight was conducted unter IFR rules. Since the takeoff from Barcelona at 2201LT, the flight had been uneventful. The pilot flying was seated on the right hand side, and he was in line flying under supervision. The captain seated on the left hand side was supervising the flight. A third flight crew member, seated in the jumpseat, was the first officer who had given his seat to the pilot under supervision on the right hand seat. On course to Bilbao, the aircraft flew over Pamplona at FL150, where they were informed of possible light turbulence. A about 25 NM from their destination and at 7,500 feet altitude, they crossed a small cumulus with strong turbulence. Descending through 6,000 feet and established on the Bilbao localizer they found winds of 55 knots. The ATC tower (TWR) of Bilbao cleared them to land on runway 30, and informed the decision height, 247 feet, under VMC conditions and continued the approach to land. One minute prior to touchdown, the tower informed of wind conditions of 240° 8 knots. The aircraft conditions during the approach were: weight, 62,380 kilos; centre of gravity, 28,66% MAC, full flaps. The reference speed (Vref) was 132 knots and the approach speed (Vapp), 142 knots. Autopilot was disconnected by the crew at 400 feet to continue the approach manually. In the last few seconds prior to touchdown, the vertical descent speed was very high, around 1,200 feet per minute (6 metres per second) and the 'sink rate' warning of the GPWS sounded twice. The aircraft did not react to the pitch-up order input applied by both pilots on the side-sticks, due to the design software logic that operates at these specific moments, and did not flare. Announcements of 'dual-input' warning were heard at the time. Then the captain, in view of the 'sink rate' warnings, selected TOGA power setting to go around and abort the landing. The pilot's actions on the flight controls could not avoid a hard touchdown of the aircraft in a slight nose down attitude, and the captain decided to continue the landing and to stop the aircraft. The aircraft slowed-down along 1,100 metres of the runway within the paved surface. It finally came to a stop with its horizontal axis at an angle of 60° to the right of the runway centerline. During the landing roll the nose landing gear collapsed, the four tires of the main gear burst and the engine nacelles, on which the aircraft was leaning after the collapse, dragged along the pavement. Once the aircraft came to a halt, the captain ordered its evacuation, which was carried out using all the exit doors and their slides. During the evacuation a cabin crew member and 24 passengers were injured. All injuries were considered minor except for one, a female passenger whose injuries were considered serious. Seven injured people were taken to hospital. ", "probable_cause": "The cause of the accident was the activation of the angle of attack protection system which, under a particular combination of vertical gusts and windshear and the simultaneous actions of both crew members on the sidesticks, not considered in the design, prevented the aeroplane from pitching up and flaring during the landing."}