{"url": "https://www.baaa-acro.com/crash/crash-cessna-t207a-skywagon-near-henderson-1-killed", "date": "Dec 8, 2004 at 1031 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "King Airelines", "flight_phase": "Flight", "flight_type": "Meteorological / Weather", "survivors": "No", "site": "Mountains", "schedule": "Henderson - Henderson", "msn": "207-0383", "yom": 1977, "flight_number": null, "city": "Henderson", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1209, "captain_hours_type": 117, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12616, "circumstances": "The airplane impacted mountainous terrain in an extreme nose-down attitude following a departure from controlled flight. The purpose of the flight was to check the weather conditions for passenger tour flights that day. The pilot reported about 20 minutes prior to the accident that the ceiling was 6,500 feet mean sea level (msl). Radar data showed that following this weather report, the airplane's radar track continued eastbound and upon its return westbound, at an altitude of about 6,000 feet msl, the airplane entered a series of altitude fluctuations approximately 1 mile west of a ridge that was the location of the accident, descending at 4,000 feet per minute while turning northbound, and then climbing at 3,900 feet per minute while traveling eastbound, prior to disappearing from the radar. The airplane impacted on the eastern side of the ridge. There were no monitored distress calls from the aircraft and no known witnesses to the accident. Prior to the accident, there were reports of vibrations during flight on this aircraft, although many went unreported to maintenance personnel. The day (and flight) prior to the accident, a pilot experienced a vibration during flight with passengers and it was not reported to maintenance personnel because it was logged improperly in the operator's maintenance tracking system. No corrective actions were taken. During the post accident examinations, no portions of the right elevator and trim tab were identified in the wreckage, or at the accident site. The bracket attachment to the right elevator was found loose within the wreckage and was torsionally twisted counterclockwise (aft). Ground and aerial searches for the missing parts based on a trajectory study were unsuccessful. This aircraft was equipped with a foam cored elevator trim tab that was installed during aircraft manufacture. A service difficulty report (SDR) query showed that 47 reports had been issued on elevator trim tab corrosion and many included reports of vibrations during flight. On January 20, 2005, the Federal Aviation Administration (FAA) issued Special Airworthiness Information Bulletin (SAIB) CE-05-27, which addressed potential problems with foam-filled elevator trim tabs in the accident make/model airplane, and Cessna 206 and 210 series airplanes. The SAIB indicated that the foam-filled elevator trim tabs, manufactured until 1985, were reported to have corrosion between the tab and the foam. The SAIB further said, in part, \"When the skin of the trim tab becomes thin enough due to the corrosion, the actuator can pull the fasteners through the skin and disconnect. When this occurs, the tab can flutter.\" Some reports indicated prior instances of \"vibrations in the tail section and portions of the elevator tearing  away with the trim tab.\" Prior to the issuance of the SAIB, Cessna Aircraft Company issued a Service Bulletin (SB) SEB85-7 on April 5, 1985, that addressed elevator and trim tab inspection due to corrosion from moisture trapped in the foam cored trim tabs. Based on a review of the airplane's logbooks, the SB was not complied with, nor was the operator required to do so based on the FAA approved maintenance specifications.", "probable_cause": "A loss of control due to the in-flight separation of the right elevator and elevator trim tab control surfaces. The precipitating reason for the elevator separation could not be resolved as related to the tab foam core issue with the available evidence."}