{"url": "https://www.baaa-acro.com/crash/crash-fairchild-c-119g-flying-boxcar-castle-crags-state-park-3-killed", "date": "Sep 16, 1987 at 1730 LT", "type": "Fairchild C-119 Flying Boxcar", "operator": "Hawkins-Powers-Aviation-2", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Mountains", "schedule": "Montague - Redding", "msn": "11005", "yom": 1952, "flight_number": null, "city": "Castle Crags State Park", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Fairchild C-119G airtanker had been dispatched to a fire about six miles west of Castle Crags State Park, California at 17:05 and departed the Siskiyou County Airport, CA (SIY) shortly thereafter. N48076, another airtanker of the same kind, a leadplane, and an air attack arrived at the fire at the same time. Two more airtankers followed shortly thereafter. The leadplane identified the target, the approach and departure routes, indicated the target was at an elevation of 4,500 feet, that the ridge on final approach was to be crossed at 6,600 feet, advised there was no wind, there was good visibility, and that there was no turbulence except a \"1.5g bump\" going across the head of the fire. The leadplane directed one of the C-119 airtankers to drop first. That airtanker aborted their first run because of excess speed. On the second pass, it crossed the ridge at a different point, permitting a somewhat longer final approach. That drop was a successful one. The run was made through a saddle then down a creek to the fire some two miles down stream with a planned exit down stream into a larger canyon. The leadplane then directed the mishap C-119G airtanker to drop next. The mishap airtanker used the same approach as the first airtanker. The mishap airtanker reached the uphill side of the fire when the crew reported trouble maintaining proper speed and dropped their retardant on the fire. At about the time the pilot dropped the retardant, a structural failure occurred and the right wing separated from the airframe along with the tip of the left wing and the tail booms. The fuselage with both engines and most of the left wing attached encountered terrain impact and burned as a unit.\r\nSource: https://www.fs.usda.gov/managing-land/fire", "probable_cause": "In-flight loss of control following the structural failure of the right wing. "}