{"url": "https://www.baaa-acro.com/crash/crash-airbus-a300b4-203f-afgooye", "date": "Oct 12, 2015 at 1930 LT", "type": "Airbus A300", "operator": "Tristar-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Oostend – Cairo – Mogadishu", "msn": "129", "yom": 1980, "flight_number": "TSY810", "city": "Afgooye", "zone": "Shabeellaha Hoose (شبيلي السفلى)", "country": "Somalia", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was performing a cargo flight from Ostend to Mogadishu with an intermediate stop in Cairo with perishable goods on board on behalf of the AMISOM, the African Mission in Somalia. The final approach to Mogadishu-Aden Abdulle International Airport was performed by night. As the crew was unable to localize the runway, he abandoned the approach and initiated a go-around procedure. A second attempt was also interrupted and the crew initiated a new go-around then continued towards the north of the capital city. Eventually, the captain decided to attempt an emergency belly landing near Afgooye, about 25 km northwest of Mogadishu. Upon landing, the aircraft lost its both engines and came to rest in the bush. Two crew members were taken to hospital while four others were uninjured. The aircraft was damaged beyond repair. According to Somalian Authorities, the International Airport of Mogadishu is open to traffic from 0600LT till 1800LT. For undetermined reason, the crew started the descent while the airport was already closed to all traffic (sunset at 1747LT). Also, an emergency landing was unavoidable, probably due to a fuel exhaustion. It is unknown why the crew did not divert to the alternate airport.", "probable_cause": "When the controller received the estimated time of arrival for TSY810 from the Flight Information Center (FIC) Nairobi he advised FIC Nairobi (Kenya) that Mogadishu Airport was closed at the estimated time of arrival and advised the crew should divert to their alternate aerodrome but received no feedback. At 14:45Z the tower received first communication from the crew advising they would be overhead the aerodrome at 15:02Z, the controller advised again that the aerodrome would already be closed by then, the crew insisted however that they would land. Tower provided the necessary landing information like weather and active runway. At 15:02Z there was no sight of the aircraft, tower queried with the crew who reported still being 54nm out and revised their estimated time of arrival. At 15:27Z the aircraft turned final for runway 05, tower advised the crew to land at own discretion as tower's \"instructions were only advisory and not clearance\". The controller added that the approach was aborted and all subsequent approaches were unsuccessful too. \"At one point the pilot mistook street parallel to the runway lighted by flood lights with intention of landing but was alerted the runway was on his right and the approach was discontinued. The crew has been warned numerous times that Mogadishu Airport closed at 1800LT (1500Z) and there is no adequate runway lights as the airport is not prepared to receive flights during night time hours. Thus, the pilot has intentionally tried to land at the airport while the visibility was limited to few metres due to darkness. "}