{"url": "https://www.baaa-acro.com/crash/crash-lockheed-p-3a-55-lo-orion-whidbey-island-nas", "date": "Jan 18, 1981", "type": "Lockheed P-3 Orion", "operator": "US%20Navy", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Whidbey Island - Whidbey Island", "msn": "185-5131", "yom": 1965, "flight_number": null, "city": "Whidbey Island NAS (Ault Field)", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While conducting a Naval Air Training and Operating Procedures Standardization check the pilot at controls was allowed to perform his first attempt at shooting an obstacle approach at Whidbey Island NAS. This maneuver was inadequately briefed by the pilot in command during the mission brief. The pilot in command, having great confidence in the pilot at controls, allowed him to conduct this maneuver without prior demonstration. After pushing over for the approach an excessive sink rate developed. Upon determination that the approach was getting dangerous, power was applied and the nose pulled up. Due to the combination of slow approach speed, late and in inadequate power application, the excessive sink rate was not arrested, resulting in a hard landing followed by failure of the starboard wing.", "probable_cause": "The accident was the consequence of the following factors: \r\n- The pilot-in-command failed to recognize a dangerous situation and take appropriate corrective action,\r\n- The pilot at controls failed to properly compensate for excessive sink rate during landing transition,\r\n- The pilot at controls began transition to landing attitude too late to arrest a high rate of descent for the power applied,\r\n- Poor crew coordination."}