{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-40-solitaire-parry-sound-2-killed", "date": "May 24, 1999 at 2130 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Lucky Landings Charter", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Parry Sound – Toronto", "msn": "410", "yom": 1979, "flight_number": null, "city": "Parry Sound", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5500, "captain_hours_type": 400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "With one pilot and one passenger, the Mitsubishi MU-2B-40 Solitaire aircraft, serial number 410 S.A., departed on a night instrument flight rules flight from Parry Sound / Georgian Bay Airport, Ontario, destined for Toronto / Lester B. Pearson International Airport. Prior to departure, the pilot received his instrument flight rules clearance via telephone from the Sault Ste. Marie flight service station with a clearance valid time of 2118 eastern daylight time from Toronto Area Control Centre and a clearance cancel time of 2135. When the pilot did not establish communications with Toronto Area Control Centre within the clearance valid time, the Area Control Centre supervisor commenced a communication search. At 2151, he confirmed with Parry Sound / Georgian Bay Airport personnel that the aircraft had departed 10 to 15 minutes earlier. The aircraft was assumed missing and the Rescue Coordination Centre in Trenton, Ontario, was notified. Search and rescue was dispatched and three days later the aircraft wreckage was located one nautical mile west of the airport. Both of the aircraft occupants were fatally injured. The aircraft disintegrated as it cut a 306-foot swath through the poplar forest. The accident occurred at night in instrument meteorological conditions.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The accident flight was conducted at night in IMC, and the pilot, whose private pilot licence was not endorsed with an instrument rating, was not certified for the IFR flight.\r\n2. The pilot may have been subjected to somatogravic illusion and allowed the aircraft to descend into terrain after a night take-off in IMC.\r\n3. The pilot did not completely report his medical conditions to the civil aviation medical examiner. \r\nOther Findings\r\n1. The pilot was not certified to fly this model of aircraft as his private pilot licence was not endorsed with the appropriate high-performance aircraft rating.\r\n2. The pilot conducted a downwind take-off.\r\n3. While the aircraft was turning left for the on-course track, the aircraft flaps were retracting.\r\n4. The aircraft struck trees while in a shallow descent. The integrity of the aircraft was compromised as it rolled inverted and entered the impact zone at high speed.\r\n5. The aircraft engine teardown examination revealed no pre-impact failures of any component parts or accessories in either the left or right engine that would have precluded normal engine operation.\r\n6. The propeller teardown examination revealed that both propellers were in a normal operating range and were rotating with power at the time of impact.\r\n7. The ELT did not function due to the impact damage sustained by its various components."}