{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-8f2-odessa", "date": "Nov 21, 2019 at 2055 LT", "type": "Boeing 737-800", "operator": "Turkish-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Istanbul – Odessa", "msn": "35739/2654", "yom": 2008, "flight_number": "TK467", "city": "Odessa", "zone": "Odessa Oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 136, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6094, "captain_hours_type": 5608, "copilot_hours": 252, "copilot_hours_type": 175, "aircraft_hours": 38464, "circumstances": "On November 21, 2019, a regular THY2UT flight en-route Istanbul – Odesa at B737-800 aircraft, nationality and registration mark TC-JGZ of the Turkish Airlines, was performed by the aircraft crew consisting of the Pilot-in-Command (PIC), co-pilot and four flight attendants of the aircraft. In fact, the departure from Istanbul Airport was performed at 17:33. The actual aircraft landing took place at 18:55. According to the flight plan, the alternate aerodromes were Istanbul and Chișinău. There were 136 passengers and 2793 kg of luggage on board the aircraft. The PIC was a Pilot Flying, and the co-pilot was a Pilot Monitoring of the aircraft. The pre-flight briefing of the crew, according to its explanations, was carried out before departure from the Istanbul Airport, after which the PIC took the decision to perform the flight. The climb and level flight were performed in the normal mode. The landing approach was performed to the Runway16 with ILS system at a significant crosswind component of variable directions. At the final stage of approaching with ILS to Runway 16, the ATC controller of the aerodrome control tower (ATC Tower) gave the aircraft crew a clearance for landing. The aircraft crew confirmed the controller’s clearance and continued the landing approach. Subsequently, from a height of about 50 meters, the aircraft performed a go-around due to the aircraft non-stabilization before landing. Following the go-around, the aircraft headed to the holding area to wait for favorable values of wind force and direction. At 18:45, the PIC took the decision to carry out a repeated landing approach, reported of that to the ATC controller, who provided ATS in the Odesa Terminal Maneuvering Area (TMA.) At 18:51, the crew re-contacted the Tower controller and received the clearance to land. At 18:55, after touchdown, during the runway run, the aircraft began to deviate to the left and veered off of the runway to the left onto the cleared and graded area. After 550 m run on the soil, the aircraft returned to the runway with its right main landing gear and nose part (while moving on the soil, the nose landing gear collapsed) and came to rest at the distance of 1612 m from the runway entrance threshold. The crew performed an emergency evacuation of passengers from the aircraft. As a result of the accident, the aircraft suffered a significant damage to the nose part of the fuselage and left engine. None of the passengers or crew members was injured.", "probable_cause": "The cause of the accident, i.e. runway excursion, which caused significant damage to the structural elements of the aircraft B-737-800 TC-JGZ of Turkish Airlines, which took place on 21.11.2019 during landing at «Odesa» Aerodrome, was failure to maintain the direction of the aircraft movement during the landing run in the conditions of a strong crosswind of variable directions.\r\nContributing Factors:\r\n- Use by the crew of the landing approach method using the Touchdown in Crab technique, which is not recommended by FCTM B-737NG document for use on dry runways in the conditions of a strong crosswind;\r\n- Untimely and insufficient actions of the crew to maintain the landing run direction;\r\n- Presence of a significant cross component of the wind; \r\n- Effect of an omnidirectional wind – from cross-headwind to cross-tailwind directions – during the landing run."}