{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-321c-calcutta-6-killed", "date": "Jun 13, 1968 at 0058 LT", "type": "Boeing 707", "operator": "Pan%20Am.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Francisco – Honolulu – Hong Kong – Bangkok – Calcutta – New Delhi – Beirut – Istanbul – Frankfurt – London – New York", "msn": "18790", "yom": 1964, "flight_number": "PA001", "city": "Calcutta-Dum Dum", "zone": "West Bengal", "country": "India", "region": "Asia", "crew_on_board": 10, "crew_fatalities": 1, "pax_on_board": 53, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 5392, "captain_hours_type": 2475, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft christened 'Clipper Caribbean' was performing the westward Pan Am flight 001 from San Francisco to New York with intermediate stops in Honolulu, Hong Kong, Bangkok, Calcutta, New Delhi, Beirut, Istanbul, Frankfurt and London. Following an uneventful flight from Bangkok-Don Mueang Airport, the crew started the approach to Calcutta-Dum Dum Airport by night and marginal weather conditions due to low clouds at 400 feet and rain showers. The crew deployed the flaps at 50° and continued the approach when he misunderstood the atmospheric pressure value transmitted by ATC. Instead of setting the QNH value of 993 mb, the crew set the QFE at 29,93, which caused the aircraft to descent 360 feet below the glide. It continued below the decision height until it struck tree tops located 1,128 meters short of runway threshold then impacted the ground and came to rest in flames one km short of runway. A crew member and five passengers were killed while 20 others were injured. 37 people were unhurt. The aircraft was destroyed. ", "probable_cause": "Improper IFR operation on part of the flying crew who misused the flaps. Misinterpretation of the approach QNH/QFE values on part of the crew which caused the aircraft to complete the approach below the minimum prescribed altitude."}