{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54-do-skymaster-lookout-rock-50-killed", "date": "Jun 13, 1947 at 1816 LT", "type": "Douglas C-54 Skymaster", "operator": "Pennsylvania%20Central%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Chicago-Cleveland-Pittsburgh-Washington DC-Norfolk", "msn": "3112", "yom": 1942, "flight_number": "PCA410", "city": "Lookout Rock", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 47, "pax_fatalities": 47, "other_fatalities": 0, "total_fatalities": 50, "captain_hours": 18001, "captain_hours_type": 1309, "copilot_hours": 2513, "copilot_hours_type": 1833, "aircraft_hours": 8038, "circumstances": "The flight departed Pittsburgh at 1724 and at 1753, 29 minutes later, reported over the Flintstone Intersection, 88 miles southeast of Pittsburgh at 7,000 feet. At 1754 the flight received a message from Washington Airway Traffic Control clearing it to the Herndon Fan Marker to maintain 7,000 feet until further advised The flight was also instructed that there would be an indefinite delay at Herndon but that approach clearance could be expected no later than 1920, which was approximately one hour and 10 minutes later than its estimated time of arrival Immediately after receiving this message the flight was given the 1730 hourly weather sequence report for Washington After acknowledging receipt of the Washington weather report, Flight 410 instructed the company station at Washington to request from Airway Traffic Control a clearance to approach Washington in accordance with contact flight rules on the right side of the west leg of the Arcola radio range This request was approved by Airway Traffic Control and at 1803 the flight received a message clearing it to the Washington tower to cross the Arcola radio range station at or below 2,500 feet and in accordance with contact flight rules. The flight was advised that if this were not possible it was to hold at 2,500 feet and to inform Airway Traffic Control. Prior to establishing its descent the flight was instructed to report when leaving each 1,000-foot level In accordance with these instructions Flight 410 reported leaving the 7,000-foot level at 1805 and two minutes later another report was received from the flight indicating it was leaving 6,000 feet. The flight reported its position as \"south of Martinsburg\" at 1808 and immediately thereafter reported that it was leaving 5,000 feet at that time At 1810 another report was received from the flight, leaving 4,000 feet.\" Three minutes thereafter the flight again reported its progress and indicated it was leaving 3,000 feet. Approximately 6 minutes later the company station at Washington initiated several calls to the flight but, although these transmissions were continued for several hours, no contact was established.", "probable_cause": "The Board finds that the probable cause of this accident was the action of the pilot in descending below the minimum enroute altitude under conditions of weather which prevented adequate visual reference to the ground. A contributing cause was the faulty clearance given by Airway Traffic Control, tacitly approved by the company dispatcher, and accepted by Flight 410."}