{"url": "https://www.baaa-acro.com/crash/crash-embraer-erj-145xr-presque-isle", "date": "Mar 4, 2019 at 1129 LT", "type": "Embraer ERJ-145", "operator": "United-Express-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Newark - Presque Isle", "msn": "145-859", "yom": 2004, "flight_number": "UA4933", "city": "Presque Isle", "zone": "Maine", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 28, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5655, "captain_hours_type": 1044, "copilot_hours": 4909, "copilot_hours_type": 470, "aircraft_hours": null, "circumstances": "The first instrument landing system (ILS) approach to runway 1 appeared to be proceeding normally until the first officer (the pilot flying) transitioned from instrument references inside the flight deck to outside references. During a postaccident interview, the first officer stated that he expected to see the runway at that time but instead saw “white on white” and a structure with an antenna that was part of the runway environment but not the runway itself. The captain (the pilot monitoring) stated that she saw a tower and called for a go-around. (Both flight crewmembers were most likely seeing the automated weather observing system wind sensor pole, which was located about 325 ft to the right of the runway 1 centerline and about 870 ft beyond the runway threshold, and the damage to the lightning arrester at the top of the wind sensor pole was likely due to contact with the accident airplane as it flew over the pole.) According to the cockpit voice recorder (CVR), after the go-around, the first officer asked the captain if she saw the runway lights during the approach. The captain responded that she saw the lights but that “it’s really white down there that’s the problem.” Airport personnel stated that snow plowing operations on the runway had finished about 10 minutes before the first approach. The CVR recorded the flight crew’s discussion about turning on the pilot-controlled runway lights and sounds similar to microphone clicks before and after the discussion. However, the PQI maintenance foreman stated that, after the first approach, the runway lights were not on. Thus, the investigation could not determine, based on the available evidence, whether the flight crew had turned on the runway lights during the first approach. The captain thought that the airplane had drifted off course when the first officer transitioned from flight instruments to the outside, so she instructed the first officer to remain on the instruments during the second approach until the decision altitude (200 ft above ground level [agl]). The second approach proceeded normally with no problems capturing or maintaining the localizer and glideslope. During this approach, the captain asked airport maintenance personnel to ensure that the runway lighting was on, and the PQI maintenance foreman replied that the lights were on “bright”(the high-intensity setting). Thus, the flight crew had a means to identify the runway surface even with the reported snow cover at the time. As the airplane approached the decision altitude, the captain instructed the first officer to disconnect the autopilot, which he did. About nine seconds later, the airplane reached the decision altitude, and the captain called, “runway in sight twelve o’clock.” This callout was followed by the first officer’s statement, “I’m stayin’ on the flight director ‘cause I don’t see it yet.” A few seconds later, while the airplane was below 100 ft agl, the captain and the first officer expressed confusion, stating “what the [expletive]” and “I don’t know what I'm see in’,” respectively, but neither called for a go-around. The airplane subsequently impacted the snow-covered grassy area between runway 1 and a parallel taxiway. During a postaccident interview, the first officer stated that, when he transitioned from flight instruments to the outside during the second approach, he again saw “white on white” as well as blowing snow and that the airplane touched down before he could  determine what he was seeing. The maintenance foreman estimated that, at the time of the accident, the runway had about 1/8 inch of snow with about 20% to 25% of the runway visible. ", "probable_cause": "The flight crew’s decision, due to confirmation bias, to continue the descent below the decision altitude when the runway had not been positively identified. Contributing to the accident were:\r\n1) the first officer’s fatigue, which exacerbated his confirmation bias, and \r\n2) the failure of CommutAir pilots who had observed the localizer misalignment to report it to the company and air traffic before the accident. "}