{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-100-guwahati-34-killed", "date": "Oct 19, 1988 at 0856 LT", "type": "Fokker F27 Friendship", "operator": "Vayudoot", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Silchar - Guwahati", "msn": "10173", "yom": 1961, "flight_number": "PF703", "city": "Guwahati", "zone": "Assam", "country": "India", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 31, "pax_fatalities": 31, "other_fatalities": 0, "total_fatalities": 34, "captain_hours": 5673, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Vayudoot F27 aircraft VT-DMC was operating scheduled flight VDT703 Silchar - Guwahati on 19-10-1988. There were 34 persons on board including 3 crew members. The aircraft took off from Silchar at around 0810LT from runway 06. The weather report at that time was visibility 3 km with rain. After takeoff, the aircraft gave estimate time to Silchar tower of its passing the Point Hotel at 0820LT and the estimated time of arrival at Guwahati was at 0850LT. At 0823LT the flight reported over Point Hotel at FL105 and thereafter the aircraft was in contact with Guwahati control when the flight was cleared to change over to Guwahati control tower. At 0839LT the aircraft reported ATC that they are passing through FL55 for 40 and will call over VOR for ILS let down at out bound. At 0846LT the aircraft commenced procedure turn. At 0847LT the aircraft reported ATC that they are not getting glide path. At 0848:15LT the aircraft reported turning inbound after completing procedure turn. At 0848:45LT the aircraft reported outer marker inbond. The aircraft lost contact with ATC at 0853:30LT. The aircraft was destroyed due impact with a hill and post impact fire at a distance of more than 10 nautical miles from Guwahati Airport. All persons on board received fatal injuries. ", "probable_cause": "An error on the part of the pilot-in-command in obeying the localiser bar on the outbound leg when it is supposed to be disobeyed and which has resulted in disorientation of the pilot resultant effect of which is total non-adherence of the ILS let down procedure at Guwahati viz. failure to monitor the middle and outer locators, allowing the aircraft to descend below 2750 feet without intercepting the localiser and glide slope. The wrong clearance by ATC in asking the aircraft to report outer marker inbound when Captain-in-command reported non-availability of the Glide slope has misled the captain and as such has contributed to the accident. The possibility of sabotage or the aircraft outliving its age has been ruled out. The pilot failed to follow approved procedures, directives, instructions, etc. "}