{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-hawthorne-3-killed", "date": "May 28, 2000 at 1159 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Andrew J. Lowe", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Hawthorne – Las Vegas", "msn": "46-8408016", "yom": 1984, "flight_number": null, "city": "Hawthorne", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2550, "captain_hours_type": 1250, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft collided with the ground in a steep nose down descent angle while maneuvering to return to the runway during the takeoff initial climb from the airport. Pilot and mechanic witnesses on the airport described the engine sounds during the takeoff as abnormal. The takeoff ground roll was over 3,000 feet in length, and the airplane's climb out angle was much shallower than usual. Two other witnesses said the engine sounded \"like a radial engine,\" and both believed that the power output was lower than normal. One mechanic witness said the engine was surging and not developing full power; he believed the symptoms could be associated with a fuel feed problem, a turbocharger surge, or an excessively lean running condition. The ground witnesses located near the impact site said the airplane began a steep left turn between 1/4- and 1/2-mile from the runway's end at a lower than normal altitude. The bank angle was estimated by the witnesses as 45 degrees or greater. The turn continued until the nose suddenly dropped and the airplane entered a spiraling descent to ground impact. The majority of these witnesses stated that they heard \"sputtering\" or \"popping\" noises coming from the airplane. Engineering personnel from the manufacturer developed a performance profile for a normal takeoff and climb under the ambient conditions of the accident and at gross weight. The profile was compared to the actual aircraft performance derived from recorded radar data and the witness observations. The ground roll was 1,300 feet longer than it should have been, and the speed/acceleration and climb performance were consistently well below the profile's predictions. Based on the radar data and factoring in the winds, the airplane's estimated indicated airspeed during the final turn was 82 knots; the stall speed at 45 degrees of bank is 82 knots and it increases linearly to 96 knots at 60 degrees of bank. No evidence was found that the pilot flew the airplane from December until the date of the accident. The airplane sat outside during the rainy season with only 10 gallons of fuel in each tank. Comparison of the time the fueling began and the communications transcripts disclosed that the pilot had 17 minutes 41 seconds to refuel the airplane with 120 gallons, reboard the airplane, and start the engine for taxi; the maximum nozzle discharge flow rate of the pump he used is 24 gallons per minute. Review of the communications transcripts found that a time interval of 3 minutes 35 seconds elapsed from the time the pilot asked for a taxi clearance from the fuel facility until he reported ready for takeoff following a taxi distance of at least 2,000 feet. During the 8 seconds following the pilot's acknowledgment of his takeoff clearance, he  and the local controller carried on a non pertinent personal exchange. The aircraft was almost completely consumed in the post crash fire; however, extensive investigation of the remains failed to identify a preimpact mechanical malfunction or failure in the engine or airframe systems. The pistons, cylinder interiors, and spark plugs from all six cylinders were clean without combustion deposits. The cockpit fuel selector lever, the intermediate linkages, and the valve itself were found in the OFF position; however, an engineering analysis established that insufficient fuel was available in the lines forward of the selector to start, taxi, and perform a takeoff with the selector in the OFF position.", "probable_cause": "A partial loss of power due to water contamination in the fuel system and the pilot's inadequate preflight inspection, which failed to detect the water. The pilot's failure to perform an engine run-up before takeoff is also causal. Additional causes are the pilot's failure to maintain an adequate airspeed margin for the bank angle he initiated during the attempted return to runway maneuver and the resultant encounter with a stall/spin. Factors in the accident include the pilot's failure to detect the power deficiency early in the takeoff roll due to his diverted attention by a non pertinent personal conversation with the local controller, and, the lack of suitable forced landing sites in the takeoff flight path."}