{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-820c-navajo-varginha", "date": "Feb 22, 2001 at 1935 LT", "type": "Embraer EMB-820 Navajo/Carajá", "operator": "Sete%20Taxi%20Aereo", "flight_phase": "Takeoff (climb)", "flight_type": "Postal (mail)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Varginha – Belo Horizonte", "msn": "820-038", "yom": 1977, "flight_number": null, "city": "Varginha-Major-Brigadeiro Trompowsky", "zone": "Minas Gerais", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1959, "captain_hours_type": 213, "copilot_hours": 658, "copilot_hours_type": 276, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Varginha-Major-Brigadeiro Trompowsky Airport on a mail flight to Belo Horizonte-Pampulha Airport with two pilots on board. After takeoff, while in initial climb, the right engine lost power. The aircraft lost height and crash landed in an open field. It slid for about 100 metres before coming to rest, bursting into flames. Both pilots escaped with minor injuries and the aircraft was destroyed by fire. ", "probable_cause": "Loss of power on the right engine for undetermined reasons. The following findings were identified:\r\n- Poor flight preparation on part of the crew,\r\n- The crew did not know the exact weight of the mail/cargo,\r\n- The crew did not have sufficient training/instruction regarding a possible loss of engine power at takeoff,\r\n- Poor engine maintenance as the right engine had experienced power issues in the past that had not been resolved,\r\n- Poor crew coordination,\r\n- When the loss of power occurred on the right engine, the captain asked the copilot to raise the landing gear and preferred to resolve the emergency situation alone, \r\n- Poor evaluation of the aircraft performances on part of the crew in regard of the weight and balance values and CofG."}