{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-141a-lm-starlifter-near-peterborough-18-killed", "date": "Aug 28, 1976 at 1240 LT", "type": "Lockheed C-141 Starlifter", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "McGuire - Mildenhall - Torrejón", "msn": "300-6259", "yom": 1967, "flight_number": null, "city": "Peterborough", "zone": "Cambridgeshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 14, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14989, "circumstances": "The Starlifter registered 67-0006 had a recent history of weather radar problems. It had been written up by crew members eight times previously. On the day of the accident the maintenance crewman, unaware of the previous problems, checked the radar. It seemed to be working, so it was signed off as \"Ops Check Okay\". Shortly after takeoff from McGuire AFB, the crew noticed that the radar was inoperative. Since severe weather was not forecast, they elected to continue to RAF Mildenhall, UK. Two hours after takeoff, British forecasters issued a SIGMET for \"Moderate to occasional severe clear air turbulence from FL240 to FL400\", but the crew never got this report. Four hours after takeoff the crew updates the weather forecast. They receive a weather forecast of \"3/8 at 3000 feet, 4/8 at 4000 feet with an intermittent condition of wind 030/12 gusting 22, visibility five miles in thunderstorms, 2/8 at 2000 feet 5/8 at 2500 feet\". The crew then attempted to get an update one hour from Mildenhall, but was unable to contact the base. Another station reported \"4/8 Thunderstorms tops to FL260\". During the enroute decent they entered the clouds. At FL150, they requested vectors around the weather. Because the primary radar was inoperative, the controller advised that he would have difficulty providing avoidance vectors. The aircraft then entered the leading edge of a very strong line of thunderstorm cells. One estimate indicated they encountered a 100 mph downward vertical airshaft. The right wing had failed, followed quickly by the upper half of the vertical stabilizer, and the four engines.\r\nSource: C-141 Lifetime Mishap Summary / Lt. Col. Paul M. Hansen", "probable_cause": "Loss of control due to severe atmospheric turbulences in thunderstorm activity. "}