{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-munson-2-killed", "date": "Jun 25, 1999 at 1014 LT", "type": "Beechcraft 90 King Air", "operator": "AeroCenter", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Zephyrhills – Mobile", "msn": "LJ-639", "yom": 1974, "flight_number": null, "city": "Munson", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3965, "circumstances": "The pilot received a preflight weather briefing and was advised of thunderstorms with tops to 45,000 feet along a portion of the route of flight. En route, the pilot was advised of significant areas of heavy precipitation to which the pilot responded, 'uh roger one nine whiskey it looks like on our radar here that uh we go straight ahead we'll be all right there.' The flight was cleared to descend to 11,000 feet and the pilot requested deviation to the right for weather avoidance. The pilot made several routine radio communications while descending at a calculated average rate of descent of approximately 2,571 fpm before encountering adverse weather. During this time while descending, the calculated calibrated airspeed increased from approximately 190 knots to approximately 265 knots (the design dive speed Vd). The flight encountered a level 5 weather echo then began a high rate of descent. Both horizontal stabilizers with elevators and both outer portions of both wings failed in a down direction. Examination of the flight control cables, fracture surfaces of the wings and horizontal stabilizers, engines, and propellers revealed no evidence of preimpact failure or malfunction. The pilot did not request pilot reports. The design maneuvering speed of the airplane is 169 knots indicated; the POH indicates to slow to this speed for turbulence penetration. ", "probable_cause": "The poor in-flight weather evaluation by the pilot-in-command and his operation of the airplane at an indicated airspeed greater than the design maneuvering speed (Va) in a thunderstorm contrary to the pilot's operating handbook resulting in an in-flight breakup. A contributing factor in the accident was the failure of the pilot to obtain in-flight weather advisories with any air traffic control facility before encountering the adverse weather. "}