{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-520-near-skilak-lake-6-killed", "date": "Apr 9, 1956 at 1000 LT", "type": "Rockwell Aero Commander 520", "operator": "Cordova%20Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Anchorage – Seward", "msn": "520-7", "yom": 1952, "flight_number": "CDV006", "city": "Skilak Lake", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 7000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1136, "circumstances": "The aircraft departed Anchorage international Airport at 0905LT (scheduled time of departure 0845), destination Seward. The flight plan filed with the company by Pilot John Arthur Waide contained the following: Anchorage to Seward VFR via Skilak Lake, airspeed 145 knots, estimated time en route 45 minutes. All fuel tanks were full and the fuel on board was sufficient for six hours. The estimated time for arrival at Seward was 0950. Witnesses saw the airplane flying southeast toward Seward, heard it circle Upper Russian Lake and saw it pass them again flying west-northwest at 0951. At 1255 Flight 6 was still unreported and search and rescue procedures were initiated. On April 10, 1956, at approximately 1400, the wreckage was reported on the south slope of an unnamed mountain east of Skilak Lake at an elevation of approximately 3,000 feet MSL, near latitude 60 degree 24 'N, longitude 150 degree 03'W. The aircraft was destroyed and all six occupants have been killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the pilot's action in continuing flight during instrument weather conditions on a planned VFR flight through a mountain pass, and striking a mountainside while attempting to climb out. The following findings were reported:\r\n- The gross weight at the time of takeoff exceeded the allowable gross. The weight was properly distributed. The overload was not a factor in the accident,\r\n- At the time of takeoff the weather observations and forecast indicated that VFR flight over the route involved would be extremely marginal. These forecasts were available to the dispatcher and the pilot,\r\n- The dispatching of the flight was at the discretion of the pilot in command. The assistance of the dispatcher in planning the flight was solely advisory in nature,\r\n- Pilot Waide partially traversed a route segment through mountain passes in which conditions of ceiling and visibility were below VFR minimums, and were deteriorating,\r\n- In attempting return through a pass after reversing his course, he lost visual contact and attempted to climb above the terrain,\r\n- During the climb through the clouds the aircraft struck a mountain slope."}