{"url": "https://www.baaa-acro.com/crash/crash-pac-cresco-08-600-tarata-1-killed", "date": "Dec 14, 2008 at 1155 LT", "type": "PAC Cresco 08-600 (08-750)", "operator": "Wanganui%20Aero%20Work", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Tarata - Tarata", "msn": "20", "yom": 1997, "flight_number": null, "city": "Tarata", "zone": "Taranaki Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 12100, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3272, "circumstances": "On Sunday 14 December 2008, the aircraft departed from Stratford Aerodrome at 0630 hours for a transit flight to a farm airstrip near Tarata. Shortly after becoming airborne the pilot noticed the engine chip detector warning light on the instrument panel was illuminated. He diverted to the company maintenance base at Wanganui aerodrome for the defect to be rectified. The aircraft engineer found a light metallic fuzz on the engine magnetic (mag) plug. The fuzz was cleaned off and the mag plug refitted. The aircraft was released to service with a condition that a further inspection of the mag plug was to be performed after 10 hours flight time. The topdressing job, which involved the spreading of 450 tonnes of lime, had commenced on Thursday 11 December 2008 and continued on Friday 12 December 2008. No flying took place on Saturday 13 December 2008 due to a local horse-riding event being held on the farm property. The aircraft arrived at the farm airstrip at 0940 hours on the Sunday morning, and shortly thereafter commenced operations to complete the spreading of the lime. At the time of the accident, 423 tonnes of lime had been spread. The pilot flew a series of topdressing flights before needing to stop for the first refuel. When interviewed, the loader driver stated that the pilot informed him that he was having some difficulty with the lime product not flowing consistently from the aircraft hopper during the sowing runs. At approximately 1145 hours the pilot stopped again to refuel. On completion of the refuel, this gave the aircraft an estimated fuel load of 300 litres. The pilot completed a further two flights. On the third flight, the aircraft became airborne at the end of the airstrip and then descended 55 feet below the level of the airstrip where the aft fuselage struck a fence line. A concentration of lime along the aircraft’s take-off path indicated that the pilot had initiated an attempt to jettison his load at the end of the airstrip. Following the collision with the fence, the aircraft remained airborne for a further 450 metres before it impacted the side of a small hill in a slight nose down attitude. The aircraft then came to rest 12 metres to the left of the initial impact point. The accident occurred in daylight, at approximately 1155 hours NZDT, at Tarata, at an elevation of 410 feet amsl. Latitude: S39° 08.169', longitude: E174° 21.710'.", "probable_cause": "Conclusions:\r\n- The pilot was appropriately licensed, held the appropriate Medical Certificate, was experienced and fit to carry out aerial topdressing operations.\r\n- The aircraft had been operating normally from the airstrip up to the time of the accident.\r\n- The aircraft descended after take-off and struck a fence. The collision with the fence damaged the elevator control cable system which jammed the elevator control surface. This resulted in the pilot being unable to adequately control the aircraft in pitch, and the aircraft subsequently struck the ground.\r\n- The aircraft was loaded with 1900 kg of lime product on the accident flight, this was in excess of the 1860 kg maximum structural hopper load. No variation above the maximum structural hopper load is allowed for in CAR Part 137. The aircraft’s all-up weight at the time of the accident was under the maximum allowed under the overload provisions of CAR Part 137 by 145 kg.\r\n- The Aircraft Flight Manual does not provide take-off performance data for operation over the maximum certificated take-off weight and up to the maximum agricultural weight as allowed by CAR Part 137.\r\n- A change in wind direction had occurred in the late morning which may have presented the pilot with a slight tail-wind or possible low level turbulence, including down draught conditions, during and after take-off.\r\n- The windsock was not in the most suitable position to indicate the wind conditions to the pilot.\r\n- Partial or full load jettisons had taken place on previous flights, indicating that the pilot was having difficulty achieving the required aircraft performance during or after take-off.\r\n- On the accident flight, the aircraft was probably overloaded for the prevailing environmental conditions.\r\n- The reported poor flowing qualities of the lime product being spread may have hampered the pilot’s efforts to jettison the load after take-off. The effectiveness of the jettison may have also been reduced by the downward flight path of the aircraft on leaving the end of the airstrip. It is unlikely that the pilot could comply with the CAR Part 137.103 requirement to jettison 80% of the load within five seconds.\r\n- The possibility of a pre-existing airframe or engine defect that could have contributed to the accident was eliminated as far as practicable by the investigation.\r\n- The ELT fitted to the aircraft was no longer an approved type, therefore the aircraft was not airworthy in accordance with CARs. The ELT was incapable of being detected by satellite and therefore would not automatically alert rescue services, however, this did not hamper rescue efforts in this accident.\r\n- The accident was not survivable. "}