{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-25-dk-guwahati-3-killed", "date": "Jan 21, 1955 at 0729 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Indian%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Calcutta – Guwahati", "msn": "13569", "yom": 1944, "flight_number": null, "city": "Guwahati", "zone": "Assam", "country": "India", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off from Calcutta-Dum Dum Airport on a scheduled freighter service flight at 0546 hours Indian Standard Time and set course for Guwahati, carrying a crew of three. At 0722 hours, the aircraft contacted Air Traffic Control, Guwahati, on radio telephony and reported flying under visual flight rules, 25 miles away from Guwahati Airport at an altitude of 6 000 feet. The Air Traffic Control Officer on duty passed the altimeter setting to the aircraft, cleared it to descend under VFR and instructed it to call when ten miles from the airport. The aircraft asked for a bearing on frequency 119.7 (Homer) at 0725 hours and a bearing of 045° class 'A' was given. This was confirmed as correct by the aircraft, which also reported being 15 miles from the airport at a height of 3 000 feet at that time. The next contact with Guwahati Tower was at 0727 hours when it reported being at a distance of 10 miles from the airport. Landing instructions were passed to the aircraft and it was asked to call again on joining circuit. There was no further communication with the aircraft. At approximately 0729 the duty officer at the tower noticed black smoke at the top of a patch of fog to the south of the airport. Repeated calls were made to the aircraft on 118.1 Mc/S and 6 440 Kc/S but no response was received. At about the same time persons in Tarapati village saw the aircraft hit some arecanut trees, crash in a field and burst into flames. The captain and the copilot died instantly and the radio officer died en route to the hospital. The aircraft was destroyed. ", "probable_cause": "The aircraft crashed in the course of a premature descent, during the final approach, as a result of hitting arecanut trees which were obscured from view by fog in the area. Some other points which call for observations have come out in the course of the evidence and though they do not directly pertain to the cause of this accident are well worth mentioning. \r\n- Operational control was not exercised for this flight and the operator had not designated a representative for this purpose as required by Notice to Air- men No. 29 of 1952,\r\n- The meteorological briefing of the pilot was not complete in as much as the terminal weather forecast for the alternate aerodrome was not obtained by him,\r\n- The manuals used by the crew of this aircraft were not complete or up-to-date. "}