{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-26-islander-cocos-islands-3-killed", "date": "Jan 16, 1999 at 1430 LT", "type": "Britten-Norman Islander", "operator": "Uzu%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Horn Island - Cocos Islands", "msn": "763", "yom": 1975, "flight_number": null, "city": "Cocos Islands (Keeling Islands)", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2540, "captain_hours_type": 197, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Uzu Air conducted passenger and freight operations between Horn Island and the island communities in the Torres Strait. It operated single-engine Cessna models 206 and 208 aircraft, and twin-engine Britten Norman Islander aircraft. On the morning of the accident, the pilot flew a company Cessna 206 aircraft from Horn Island to Yam, Coconut, and Badu Islands, and then returned to Horn Island. The total flight time was about 93 minutes. The pilot's schedule during the afternoon was to fly from Horn Island to Coconut, Yam, York, and Coconut Islands and then back to Horn Island, departing at 1330 eastern standard time. The flight was to be conducted in Islander, VH-XFF. Three passengers and about 130 kg freight were to be carried on the Horn Island - Coconut Island sector. Another company pilot had completed three flights in XFF earlier in the day for a total of 1.9 hours. He reported that the aircraft operated normally. Witnesses at Horn Island reported that the preparation for the flight, and the subsequent departure of the aircraft at 1350, proceeded normally. The pilot of another company aircraft heard the pilot of XFF report 15 NM SW of Coconut Island at 3,500 ft. A few minutes later, the pilot reported downwind for runway 27 at Coconut Island. Both transmissions sounded normal. Three members of the Coconut Island community reported that, at about 1410, they were on the beach at the eastern extremity of the island, about 250 m from the runway threshold and close to the extended runway centreline. Their recollections of the progress of the aircraft in the Coconut Island circuit are as follows: the aircraft joined the downwind leg and flew a left circuit for runway 27; the aircraft appeared to fly a normal approach until it passed over their position at an altitude of 200-300 ft; and it then veered left and commenced a shallow climb before suddenly rolling right and descending steeply onto a tidal flat, about 30 m seaward from the high-water mark, and about 200 m from their position. A passenger was seriously injured while three other occupants were killed. ", "probable_cause": "The following findings were identified:\r\n- The pilot initiated a go-around from final approach because of a vehicle on the airstrip.\r\n- The left propeller showed little evidence of rotation damage. The reason for a possible loss of left engine power could not be determined.\r\n- For reasons that could not be established, the pilot lost control of the aircraft at a low height."}