{"url": "https://www.baaa-acro.com/crash/crash-fokker-f28-fellowship-1000-near-oslo-40-killed", "date": "Dec 23, 1972 at 1634 LT", "type": "Fokker F28 Fellowship", "operator": "Braathens2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Ålesund - Oslo", "msn": "11011", "yom": 1969, "flight_number": "BU239", "city": "Oslo-Fornebu", "zone": "Oslo City", "country": "Norway", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 42, "pax_fatalities": 37, "other_fatalities": 0, "total_fatalities": 40, "captain_hours": 12960, "captain_hours_type": 2163, "copilot_hours": 5150, "copilot_hours_type": 910, "aircraft_hours": 8228, "circumstances": "Following an uneventful flight from Ålesund, the crew started a night approach to runway 06 at Oslo-Fornebu Airport. During the descent in limited visibility due to the night and fog, the captain and the approach controller exchanged several messages of sympathy for Christmas. 13 seconds after passing 3,500 feet, the airplane descended 1,510 feet below the MDA. In a gear and flaps down configuration, the airplane struck tree tops and crashed in flames in a dense wooded area located about 16 km west of the airport. The aircraft was totally destroyed and only five passengers survived the crash while 40 other occupants were killed, among them all three crew members.", "probable_cause": "The probable cause of the accident was incorrect navigation under a truncated instrument approach to runway 06 at Fornebu Airport. For reason that could not be determined with certainty, the aircraft descended well below the MDA and was off course by 2,5° at the time of the accident. The following factors were reported: \r\n- The second ADF was probably tuned on a false frequency by mistake, \r\n- It is possible that interferences has occurred with the ILS which may have transmitted wrong information to the aircraft,\r\n- The captain did not have a rest period in accordance with legislation,\r\n- The captain exchanged messages with ATC that were not authorized during the initial approach, \r\n- The control tower bearing indicator was moved from its fixed position in the control desk, so that the possibility of random directional control was reduced."}