{"url": "https://www.baaa-acro.com/crash/crash-antonov-12bp-near-tatal-7-killed", "date": "May 11, 2004 at 1018 LT", "type": "Antonov AN-12", "operator": "El%20Magal%20Aviation", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Juba - El Obeid", "msn": "14 001 01", "yom": 1961, "flight_number": null, "city": "Tatal", "zone": "South Kordofan (جنوب كردفان)", "country": "Sudan", "region": "Africa", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16609, "circumstances": "En route from Juba to El Obeid, while cruising at an altitude of 24,000 feet, all four engines flamed out. The crew feathered the propeller, reduced his altitude and attempted an emergency landing when the aircraft struck the ground and crashed against trees. One occupant was seriously injured while six others were killed. Few hours later, the only survivor died from his injuries. It was reported that the aircraft was performing several round trips between Juba and El Obeid since May 9, each time with 9018 kgs of fuel uplifted in El Obeid while the average fuel consumption for a round trip was 10000 kgs. The crew was composed of an Armenian captain and ground engineer, a Sudanese first officer, a Sudanese navigator, a Sudanese radio operator, an Iraqi navigator and an Iraqi flight engineer.", "probable_cause": "The following findings were identified:\r\n- Fuel starvation due to Company fuel planning policy,\r\n- The exhaustion of the Captain as he was handling all flights during the three days preceding the accident flight in addition to the weather on day of accident,\r\n- Some of the crew members had limited experience on the type and three of them even did not fly on AN-12 for a long time which might aggravate the situation before the crash,\r\n- The Sudanese navigator license was expired since July 2001,\r\n- The Iraqi crew members did not have any valid licenses and their experience on the An-12 dated back from 1994,\r\n- The aircraft's Certificate of Release to Service and Certificate of Maintenance Review both expired on April 30, 2004."}