{"url": "https://www.baaa-acro.com/crash/crash-fairchild-f27-salt-lake-city-3-killed", "date": "Jan 17, 1963 at 1553 LT", "type": "Fairchild F27", "operator": "West%20Coast%20Airlines-2", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Salt Lake City - Salt Lake City", "msn": "6", "yom": 1958, "flight_number": "WC703", "city": "Salt Lake City", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 14460, "captain_hours_type": 10, "copilot_hours": 15509, "copilot_hours_type": 578, "aircraft_hours": 11708, "circumstances": "This flight was designated by West Coast Airlines, Inc., (WCA) as Pilot Training Flight No. 703. It was for the purpose of rating a company DC-3 captain for F-27 aircraft. N 2703 arrived at Salt Lake City Municipal Airport January 17, 1963, at 1431 1 as West Coast Flight 752 from Seattle, Washington, with stops at Yakima, Pasco, Walla Walla, all in Washington; Lewiston, Montana; and Boise and Twin Falls, both in Idaho. The flight had been uneventful and there were no carryover discrepancies entered in the aircraft's flight log. After completion of turnaround servicing, N 2703 departed the West Coast Airlines ramp at approximately 1506 with Company Cheek Pilot Instructor William Harvey Lockwood, Trainee Captain Elmer J. Cook, and FAA Carrier Inspector Buell Z. Davis aboard. A flight plan was prepared and signed by Captain Lockwood. It listed Elmer J. Cook as the first officer, FAA Inspector Buell Z. Davis as a crew member, and specified that the flight would be in the local area, under VFR conditions, and of 1 hour and 30 minutes duration. At departure Captain Cook occupied the left pilot seat, Captain Lockwood the right pilot seat, and Inspector Davis the observer's (jump) seat. The aircraft carried approximately 3,500 pounds of fuel which was ample for the intended flight. The aircraft's computed gross weight was 28,310 pounds, approximately 7,000 pounds less than maximum allowable for takeoff, and the center of gravity was within prescribed limit. Flight 703 took of f at 1510 and remained in the traffic pattern for a practice landing which was made at 1517. At 1522, Flight 703 made a second takeoff and was last observed three miles south of the airport by the local controller in the tower. The tower clearance for this takeoff was the last radio contact with the flight. The next known sighting of Flight 703 was from the air by the crew of Western Airlines Flight No. 38. At 1531 they observed it at an estimated altitude of 8,000 feet mean sea level (m.s.l.) descending to an estimated altitude of 7,000 feet m.s.l. with the left propeller feathered. It was headed southeasterly, and in the vicinity of the southern tip of Antelope Island in Great Salt Lake, some 10 miles west-northwest of the airport. Several minutes later, the ground controller in the Salt Lake City Tower observed Flight 703 for a few minutes. He saw it approaching the airport from the west at an estimated altitude of 8,000 feet above the ground. It appeared to be flying level as it came approximately over him, continuing a few miles to the east and over Salt Lake City. It then made a right turn to a west-northwesterly heading and continued in that direction until the controller discontinued watching it at a point approximately five miles west of the airport. He did not notice anything unusual about the aircraft's appearance or performance. The next observation of Flight 703 was by a motorist near the southeastern shore of the Great Salt Lake who saw it at an estimated 3,000 feet above the ground descending. He estimated the time of his initial observation to be 1550. The aircraft appeared to be on a northwesterly heading making a normal descent considerate west of the Salt Lake City Airport and continued descent until it appeared \"to actually go into the lake itself.\" He did not see any splash; his position was about six miles from where the wreckage was later found. The official U.S. Weather Bureau observation at Salt Lake City Municipal Airport at 1555 on the day of the accident was: Ceiling estimated 12,000 feet broken, high overcast, visibility 12 miles, temperature 34 degrees F., dewpoint 2 degrees F., wind from south-southwest at 5 knots, altimeter setting 30.05, smoky, snow showers of unknown intensity east. Weather conditions were not appreciably different an hour earlier nor an hour later. At 1700, the Salt Lake City Flight Service Station (FSS) received a request from the Salt Lake City Air Route Traffic Control Center (ARTCC) to initiate a call to Flight 703 on all available frequencies. There was no reply from Flight 703 to these calls. At 1758 the Salt Lake City FSS received information from the Salt Lake City ARTCC that West Coast Flight 703 was overdue and unreported. On January 18, 1963, at approximately 1140, one body and aircraft debris was seen floating in Great Salt Lake. This floating debris was 10.4 nautical miles to the Salt Lake City Very High Frequency Omni Directional Range (VOR) or the 248 de radial. Early next morning the other two bodies were sighted and all three were recovered from the lake.", "probable_cause": "The probable cause of the accident was the crew's lack of vigilance, for undetermined reasons, in not checking a simulated emergency descent before striking the water. "}