{"url": "https://www.baaa-acro.com/crash/crash-iai-1124a-westwind-ii-taos-2-killed", "date": "Nov 8, 2002 at 1457 LT", "type": "IAI 1124 Westwind", "operator": "Richmor%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Las Vegas - Taos", "msn": "384", "yom": 1983, "flight_number": null, "city": "Taos", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5251, "captain_hours_type": 877, "copilot_hours": 14234, "copilot_hours_type": 682, "aircraft_hours": 3428, "circumstances": "After passing the initial approach fix, during an instrument approach to the destination airport, radar and radio contact were lost with the business jet. One witness reported hearing \"distressed engine noises overhead,\" and looked up and saw what appeared to be a small private jet flying overhead. The engine seemed to be \"cutting in and out.\" The witness further reported observing the airplane in a left descending turn until his view was blocked by a ridge. The witness then heard an explosion and saw a big cloud of smoke rising over the ridge. A second witness heard a loud noise and looked up and saw a small white airplane with two engines. The witness stated that the airplane started to turn left with the nose of the airplane slightly pointing toward the ground. The airplane appeared to be trying to land on a road. A third witness heard the roar of the airplane's engines, and looked toward the noise and observed the airplane in a vertical descent (nose dive) impact the ground. The witness \"heard the engines all the way to the ground.\" Examination of the airframe and engines did not disclose any structural or mechanical anomalies that would have prevented normal operation. The National Weather Service had issued a SIGMET for severe turbulence and mountain wave activity. Satellite images depicted bands of altocumulus undulates and/or rotor clouds over the accident site.", "probable_cause": "The pilot's inadvertent flight into mountain wave weather conditions while IMC, resulting in a loss of aircraft control."}