{"url": "https://www.baaa-acro.com/crash/crash-iai-1124-westwind-ii-santa-ana-5-killed", "date": "Dec 15, 1993 at 1733 LT", "type": "IAI 1124 Westwind", "operator": "Martin%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "La Verne - Santa Ana", "msn": "350", "yom": 1991, "flight_number": null, "city": "Santa Ana-John Wayne", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 8228, "captain_hours_type": 756, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3027, "circumstances": "A Beech liner, Boeing 757 and Israel Westwind (WW) were vectored for landings on runway 19R. The 757 and WW were sequenced for visual approaches behind the Beech. Before being cleared for visual approach, the WW was closing 3.5 miles from the 757 on a converging course. The 757 and WW crews were told to slow to 150 knots. The 757 slowed below 150 knots and was high on final approach with a 5.6° descent. The WW continued to converge to about 2.1 miles behind the 757 on a 3° approach. ATC did not specifically advise, and was not required by ATC handbook to advise, the WW pilots that they were behind a Boeing 757. Captain discussed possible wake turbulence, flew ILS 1 dot high, noted closeness to the 757 and indicated there should be no problem. While descending thru approximately 1,100 feet msl, the WW encountered wake turbulence from the 757, rolled into a steep descent and crashed. The crew lacked specific wake turbulence training. Chlorpheniramine (common over-the-counter anti-histamine; not approved for flying) detected in pilot's lung tissue (0.094 ug/ml). ", "probable_cause": "The pilot-in-command's failure to maintain adequate separation behind the Boeing 757 and/or remain above its flight path during the approach, which resulted in an encounter with wake vortices from the 757. Factors related to the accident were: an inadequacy in the ATC procedure related to visual approaches and VFR operations behind heavier airplanes, and the resultant lack of information to the Westwind pilots for them to determine the relative flight path of their airplane with respect to the boeing 757's flight path."}