{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-cheyenne-bankstown-2-killed", "date": "Jun 15, 2010 at 0805 LT", "type": "Piper PA-31 Cheyenne", "operator": "Skymaster-Air-Services", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "City", "schedule": "Bankstown - Brisbane - Albury", "msn": "31-8414036", "yom": 1984, "flight_number": null, "city": "Bankstown", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2435, "captain_hours_type": 779, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6266, "circumstances": "The twin engine aircraft, with a pilot and a flight nurse on board, was being operated by Skymaster Air Services under the instrument flight rules (IFR) on a flight from Bankstown Airport, New South Wales (NSW) to Archerfield Airport, Queensland. The aircraft was being positioned to Archerfield for a medical patient transfer flight from Archerfield to Albury, NSW. The aircraft departed Bankstown at 0740 Eastern Standard Time.  At 0752, the pilot reported to air traffic control (ATC) that he was turning the aircraft around as he was having ‘a few problems. At about 0806, the aircraft collided with a powerline support pole located on the eastern side of the intersection of Sackville Street and Canley Vale Road, Canley Vale, NSW. The pilot and flight nurse sustained fatal injuries and the aircraft was destroyed by impact damage and a post-impact fire.", "probable_cause": "Contributing safety factors:\r\n• While the aircraft was climbing to 9,000 feet the right engine sustained a power problem and the pilot subsequently shut down that engine.\r\n• Following the shutdown of the right engine, the aircraft's descent profile was not optimized for one engine inoperative flight.\r\n• The pilot conducted a descent towards Bankstown Airport that was consistent with a normal arrival profile without first verifying that the aircraft was capable of achieving adequate performance with one engine inoperative.\r\n• Following the engine problem, the aircraft's flightpath and the pilot’s communication with air traffic control indicated that the pilot's situation awareness was less than optimal.\r\n• The aircraft collided with a powerline support pole on the eastern side of the intersection of Sackville Street and Canley Vale Road, Canley Vale, about 6 km north-west of Bankstown Airport.\r\nOther safety factors:\r\n• The pilot did not broadcast a PAN following the engine shutdown and did not provide air traffic control with further information about the nature of the problem in order for the controller to positively establish the severity of the situation.\r\n• Section 4 of Civil Aviation Advisory Publication (CAAP) 5.23-2(0), Multi-engine Aeroplane Operations and Training of July 2007 did not contain sufficient guidance material to support the flight standard in Appendix A subsection 1.2 of the CAAP relating to Engine Failure in the Cruise. [Minor safety issue]\r\nOther key finding:\r\n• Given the pilot’s extensive experience and testing in the PA-31 aircraft type, and subsequent endorsement training on a high performance turboprop multi-engine aircraft since the issue by CASA in 2008 of a safety alert in respect of the pilot’s PA-31 endorsement, it was unlikely that any deficiencies in that endorsement training contributed to the accident.\n"}