{"url": "https://www.baaa-acro.com/crash/crash-vickers-490-wellington-xviii-hudswell-6-killed", "date": "Aug 13, 1951", "type": "Vickers 490 Wellington XVIII", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Leeming - Leeming", "msn": null, "yom": null, "flight_number": null, "city": "Richmond", "zone": "North Yorkshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At the time of the accident RAF Leeming was using the Martinet aircraft as a target aircraft for crews training in the use of the interception radar flying in larger bomber-aircraft. In the Wellington on this day were Cadets from 1869 (Middlesbrough) Squadron ATC who were visiting Leeming in August 1951 during their summer camp and the boys were being given flights in both aircraft to demonstrate such techniques done in the RAF's training role. In the mid-afternoon of 13th August 1951 such a training flight was being carried out. Each aircraft was carrying one ATC Cadet and any other day such a flight would have been a fantastic experience for these young boys. There were three trainee navigators on the Wellington, all taking turns in doing the interceptions. Some would appear to have flying experience though and many were commissioned officers and it is probable that all has seen Wartime service. One of men these was certainly no novice, F/Lt Quinton had been a night-fighter navigator who was awarded the DFC in 1946 but was retraining at Leeming at the time of this accident. He had been de-mobbed after the War but had found civilian life hard and after five years had re-applied for a short-service commission. For him this training flight would have been very much run of the mill and really only a refresher course. As the two flights begun the Martinet took off and flew away in one direction, a short time later the Wellington took off with seven on board and flew off in the opposite direction. The radar operators would then guide their pilot to the Martinet to practice their skills. Both aircraft were flying at between 8-10,000 feet and the area of the sky was free of cloud, without warning cloud closed in and soon after the Martinet appeared out of the cloud and was too close to the Wellington, it's wing struck the Wellington. The Martinet then went into a dive and crashed killing the two in the aircraft which included the ATC Cadet. Both probably stood no chance of being able to get out of the aircraft. The Wellington went into an uncontrollable spin and began to break up in midair. By the time of the collision the Cadet and F/Lt Quinton in the Wellington had taken up a position in the astrodome, Quinton had carried out his part of the exercise and had moved to one side to let one of the others have their turn. The tail section of the Wellington began to break away from the aircraft and there would have been very little the pilot would have been able to do to land the aircraft. In the Wellington at the time the parachutes of the aircrew were stowed awaiting use, seeing a parachute pack nearby F/Lt Quinton picked up this and clipped it on ATC Cadet Derek Coates' harness. He jestured to the Cadet how to deploy his parachute and then pushed him through a hole where the tail section of the aircraft was once attached and thus clear of the crashing aircraft. Such an action then prevented F/Lt Quinton's own survival as further parachutes were stowed in the rear of the aircraft and were by now impossible to get to. F/Lt Quinton would have known this and by these actions his own chances were limited. The aircraft crashed in fields around Hudswell, near Catterick, North Yorkshire and sadly the six remaining aircrew were killed in the crash. In all eight were killed in the collision.\r\nCrew (228th OCU):\r\nF/O Peter Frederick Keeling, pilot, †\r\nF/O Dawyck George McLeod Veitch, pilot, †\r\nF/O George Michael Trotman, navigator, †\r\nF/Lt John Alan Quinton, navigator, †\r\nP/O Frank Leslie Farrell, navigator, †\r\nP/O Edwin George Percival Garratt, navigator, †\r\nCad Derek Coates.\r\nSource:\r\nhttp://www.yorkshire-aircraft.co.uk/aircraft/planes/dales/pg367.html", "probable_cause": null}