{"url": "https://www.baaa-acro.com/crash/crash-cessna-t303-crusader-denham", "date": "Aug 5, 2006 at 1810 LT", "type": "Cessna 303 Crusader", "operator": "Prive1", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Durham Tees Valley - Denham Green", "msn": "T303-00306", "yom": 1984, "flight_number": null, "city": "Denham", "zone": "Buckinghamshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1717, "captain_hours_type": 662, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was completing a day VFR flight from Durham Tees Valley Airport to Denham Airfield. As the pilot turned on to the final approach for Runway 06, the right engine ran down. The pilot attempted to increase power on the left engine but it did not appear to respond. The airspeed decayed and the right wing dropped. The aircraft descended into a wooded area short of the runway, seriously injuring all those on board. The investigation identified that fuel starvation of both engines was the cause of the accident. ", "probable_cause": "The pilot was properly licensed and qualified to conduct the flight. The aircraft was fully serviceable and the weather was suitable for the flight and was not a factor in the accident. From the evidence provided, the loading of the aircraft was such that it was operated initially above the MTOW of 5,150 lbs and throughout the flight the aircraft was operated outside the aft CG limit of 157.2 inches aft of datum. With the payload being carried, the aircraft was not capable of safely completing the ‘round trip’ flight and remaining within the permitted weight and balance envelope without refuelling at Durham Tees Valley. Insufficient fuel was carried for adequate reserves and contingency fuel to complete the flight. The pilot had consumed alcoholic beverage during the day but the effect on his decision making and aircraft handling ability is not known. During the approach, the fuel crossfeed was used, which was not permitted. The selection of crossfeed from the left tank to the right engine was probably the cause of the right engine running down. This was due to insufficient fuel contents being available to allow fuel to be drawn from the left tank by the crossfeed pick-up. Pulling the crossfeed emergency shutoff control therefore did not contribute to the accident. The accident was caused by fuel starvation of both engines with the right engine ceasing to produce power and the left engine operating at reduced power or stopping. Control was then lost when the airspeed decayed and the aircraft stalled, dropping the right wing."}