{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-moscow-6-killed", "date": "Sep 4, 1948 at 0352 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow – Kharkiv – Zaporozhie – Simferopol", "msn": "44 09", "yom": 0, "flight_number": "SU253", "city": "Moscow-Bykovo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 20, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 113, "circumstances": "Takeoff from Moscow-Bykovo Airport was completed by night. Shortly after liftoff, during the initial climb, the captain ordered to switch off the landing light and to raise the undercarriage. The aircraft encountered problems to gain height and banked left, causing the left engine and its propeller to hit the ground. After a course of some 150 meters, the aircraft hit a telephone pole and wires and then crashed in flames in a garden. Five passengers and the radio operator were killed while 8 other people were injured, some of them seriously. The remaining then occupants were unhurt. The aircraft was destroyed by impact forces and a post crash fire. ", "probable_cause": "It was determined that the pilot in command suffered a spatial disorientation shortly after liftoff when the landing light was switched off. Due to the absence of ground visual reference and the poor visibility caused by night, the pilot lost his orientation and the control of the aircraft. It was also determined that the crew was tired at the time of the accident because he accumulated more than 11 flying hours per day during the last three days prior to the accident. Also, the lack of assistance on part of the copilot was considered as a contributory factor. "}