{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31p-425-pressurized-navajo-myrtle-beach-1-killed", "date": "May 21, 2021 at 1814 LT", "type": "Piper PA-31-310 Navajo", "operator": "PJS", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Myrtle Beach - North Myrtle Beach", "msn": "31-7730003", "yom": 1977, "flight_number": null, "city": "Myrtle Beach", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 20000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4826, "circumstances": "The airplane departed Myrtle Beach International Airport (MYR), Myrtle Beach, South Carolina, at 1812, with the intended destination of Grand Strand Airport (CRE), North Myrtle Beach, South Carolina. According to automatic dependent surveillance-broadcast and air traffic control (ATC) communications information, the pilot established contact with ATC and reported that he was ready for departure from runway 18. He was instructed to fly runway heading, climb to 1,700 ft mean sea level (msl), and was cleared for takeoff. Once airborne, the controller instructed the pilot to turn left; however, the pilot stated that he needed to return to runway 18. The controller instructed the pilot to enter a right closed traffic pattern at 1,500 ft msl. As the airplane continued to turn to the downwind leg of the traffic pattern, it reached an altitude of about 1,000 ft mean sea level (msl). While on the downwind leg of the traffic pattern, the airplane descended to 450 ft msl, climbed to 700 ft msl, and then again descended to 475 ft msl before radar contact was lost. About 1 minute after the pilot requested to return to the runway, the controller asked if any assistance was required, to which the pilot replied, “yes, we’re in trouble.” There were no further radio communications from the pilot. The airplane crashed in a field and was destroyed by impact forces and a post crash fire. The pilot, sole on board, was killed. ", "probable_cause": "The mechanic’s inadvertent installation of the elevator trim tabs in reverse, which resulted in the pitch trim system operating opposite of the pilot’s input and the pilot’s subsequent loss of control."}