{"url": "https://www.baaa-acro.com/crash/crash-cessna-425-conquest-near-las-vegas-7-killed", "date": "Jan 11, 1992 at 1808 LT", "type": "Cessna 425 Conquest", "operator": "George N. Derenia", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Las Vegas - Torrence", "msn": "425-0057", "yom": 1981, "flight_number": null, "city": "Las Vegas", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 1900, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "No record could be found showing the pilot received a weather briefing prior to takeoff. Unfavorable weather was in the vicinity. Several times the pilot had difficulties understanding and complying with instructions from clearance delivery, ground control, and departure control. After takeoff the pilot requested and received an IFR clearance. During the last five minutes of flight radar returns showed the airplane changing heading from 45° to as much as 180° about 10 times and descending or ascending several times from altitudes ranging from 4,500 feet msl to 11,500 feet msl. The altitude and heading changes were not directed by controllers. About 3 minutes before the accident departure control asked the pilot if he had a problem. The pilot indicated that he did and 'we're trying to get straight.' One minute later, the pilot said 'we're all right.' Shortly afterwards, radar data showed a loss of control. Radar and communications were lost and an on ground explosion was observed as the accident occurred. An FAA flight surgeon reviewed the pilot's medical records. Within one year of the accident the pilot had 3 physical conditions and was taking 3 separate prescriptions which would have prevented him from being medically qualified to pilot an aircraft. All seven occupants were killed. ", "probable_cause": "The pilot's failure to maintain aircraft control due to spatial disorientation. Factors in this accident were: \r\n1) the pilot's failure to obtain a preflight weather briefing and to properly evaluate the existing weather conditions prior to flight, and \r\n2) reported unfavorable weather conditions, including turbulence, snow, rain, and obscuration at flight altitudes along the pilot's route of flight.  "}