{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-231-ejirin-144-killed", "date": "Nov 7, 1996 at 1703 LT", "type": "Boeing 727-200", "operator": "ADC%20Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Port Harcourt - Lagos", "msn": "20054", "yom": 1969, "flight_number": "ADK086", "city": "Ejirin", "zone": "Lagos", "country": "Nigeria", "region": "Africa", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 134, "pax_fatalities": 134, "other_fatalities": 0, "total_fatalities": 144, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 64956, "circumstances": "After takeoff from Port Harcourt Airport, the crew was cleared to climb to FL240. At 15:47 the flight established initial contact with Lagos Approach Control, and was assigned a transponder code. At 15:54 the flight reported crossing SEPER point. After this position report, the flight appeared not to be maintaining a listening watch, as it gave no reply to two consecutive calls from Approach Control, and then after some time replied to a transmission not meant for it. At the same time a Triax Airlines Boeing 727 (Flight TIX185) had departed Lagos and was flying at FL160 towards Enugu. The Lagos controller had terminated contact with the Triax aircraft when the ADC crew requested to descend. The permission to descend was delayed to allow a corporate jet (5N-APN) to pass beneath the 727 at FL210. At 15:59 Lagos Approach Control then cleared the flight to FL160 and subsequently requested the flight to contact Lagos Radar. The flight was identified by Lagos Radar 41 miles south-east of the airport, and instructed it to fly the heading of 320° to avoid Triax flight 185, and to descend to FL50. At 16:02.50 Lagos Radar instructed the aircraft two times in succession to maintain heading 300. The captain then took over control from the copilot by stating: \"I have it.\" At 16:03.08 the flight reported: \"I have the traffic... and I continue my heading to 330 to avoid him\". This was the last transmission. The records of the FDR show that flight 086 was maintaining a steady coordinated turn towards heading 330 for the first 10 seconds of the last 50 seconds of the flight. After 15 seconds, the airplane was put in bank angle of 43.2°. It maintained this configuration for 10 seconds before the bank angle increased to 68.8 degrees. This attitude was observed for 5.5 seconds before it was further increased to 83 degrees. The airplane must have suffered from high speed stall and gone into a roll with a nose down attitude. The aircraft appeared to be recovering just before it impacted the lagoon water because it succeeded in reducing the vertical acceleration from 8.44 to 2.1 G and the bank angle to 61.6°. But it did not have sufficient height to make a full recovery and crashed in the lagoon about 7,5 km west of Ejirin. The wreckage was found in the afternoon of the following day. The aircraft disintegrated on impact and all 144 occupants were killed.  ", "probable_cause": "It was determined that the accident was the consequence of the untidy traffic separation by the radar controller which resulted from the vectoring of ADK086 towards the track of the opposite traffic TIX185. The error of judgement by the pilot of ADK086 to continue his turn to heading 330 to avoid TIX185 and his subsequent collision avoidance manoeuvre constituted the remote causes of this accident. "}