{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-near-tajique-1-killed", "date": "Dec 3, 2002 at 2035 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Air Transport - Air Med El Paso", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Alamogordo – Albuquerque", "msn": "421C-0121", "yom": 1976, "flight_number": null, "city": "Tajique", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8539, "circumstances": "Prior to departing on the first leg of the flight, the dispatcher advised the pilot that he needed him to check the weather. After advising the pilot that he would be flying an additional leg, the\r\ndispatcher again advised the pilot that he needed him to check the weather, which the pilot did, as observed by the dispatcher. After reaching 14,500 feet at 2028 the pilot contacted Albuquerque Approach Control, advising the controller that he had information \"Yankee\" and was requesting a lower altitude. The controller instructed the pilot to proceed via his own navigation and to descend at pilot's discretion. The pilot replied \"Roger.\" From 2034 to 2041 the controller made four attempts to contact the pilot, each without success. At 2039 and 2042 the controller asked two other aircraft in the area to try establishing radio communication with the pilot; neither were successful. At 2033:19 the last radar return with altitude information was received from the aircraft, with a reported altitude of 10,200 feet MSL. A primary radar contact, with no transponder or altitude information, was received at 2033:32, 2.2 nautical miles southeast of the accident site, putting it on a straight line between the last radar contact and destination airport. The accident site was located at the 9,012 foot level of a mountain range, 19 nautical miles southeast of the destination airport. Post-accident examination revealed no anomalies with the airframe or engines which would have prevented normal operations. At 1956, the weather observation facility located at the destination airport reported a few clouds at 800 feet, scattered clouds at 2,500 feet, and overcast clouds at 4,200 feet. The remarks section stated rain ended at 35 minutes past the hour, and mountains obscured northeast to southeast. At 2024, the same weather facility reported scattered clouds at 600 feet and overcast clouds at 4,200 feet.", "probable_cause": "The pilot's failure to maintain terrain clearance. Factors contributing to the accident were the high mountains, mountain obscuration, the dark night condition, and the pilot's improper inflight planning/decision making."}