{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-manchester", "date": "Nov 8, 2005 at 0725 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Airnow", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "City", "schedule": "Manchester - Bangor", "msn": "110-228", "yom": 1979, "flight_number": "BEN352", "city": "Manchester", "zone": "New Hampshire", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3612, "captain_hours_type": 137, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 25704, "circumstances": "According to the pilot, the airplane took off with a flaps setting of 25 percent, per the operator’s procedures at the time. He stated that, immediately after raising the landing gear after takeoff, he heard an explosion and saw that all gauges for the left engine, a Pratt & Whitney Canada (P&WC) PT6A-34, pointed to zero, indicating a loss of power to the left engine. He also noted that the left propeller had completely stopped so he added full power to the right engine, left the flaps at 25 percent, and left the landing gear up. He further stated that, although he “stood on the right rudder,” he could not stop the airplane’s left turning descent. The pilot later noted that, after the left engine lost power, he “couldn’t hold V speeds” and “the stall warning horn was going off the whole time.” Post accident examination of the accident airplane’s left engine revealed that that it had failed and that the propeller had been feathered. Examination of the trim positions revealed that the rudder was at neutral trim and the aileron was at full left trim. Although these trim positions could have been altered when the wings separated from the fuselage during ground impact, the pilot’s comment that he “stood on the rudder” suggests that he either had not trimmed the airplane after the engine failure or had applied trim opposite the desired direction. The activation of the stall warning horn and the pilot’s statement that he “couldn’t hold V speeds” indicate that he also did not lower the nose sufficiently to maintain best single-engine rate of climb or best single-engine angle of climb airspeed. In addition, a performance calculation conducted during the National Transportation Safety Board’s investigation revealed that the airplane, with flaps set at 25 degrees, would have been able to climb at more than 400 feet per minute if the pilot had maintained best single-engine rate of climb airspeed and if the airplane had been properly trimmed. Post accident examination of the accident airplane’s left engine revealed fatigue fracturing of the first-stage sun gear.[1] According to the airplane’s maintenance records, during an October 1998 engine overhaul, the first-stage planet gear assembly was replaced due to “frosted and pitted gear teeth.” The planet gear assembly’s mating sun gear was also examined during overhaul but was found to be serviceable and was reinstalled with the new planet gear assembly, which was an accepted practice at the time. However, since then, the engine manufacturer determined that if either the sun gear or planet gear assembly needed to be replaced with a zero-time component, the corresponding mating gear/assembly must also be replaced with a zero-time component; otherwise, the different wear patterns on the gears could potentially cause “distress” to one or both of the components. Review of maintenance records showed that the engines were maintained, in part, under a Federal Aviation Administration (FAA)-approved “on-condition” maintenance program;[2] Business Air’s maintenance program was approved in May 1995. In April 2002, P&WC, the engine manufacturer, issued Service Bulletin (SB) 1403 Revision 7, which no longer mentioned on-condition maintenance programs and required, for the first time for other time between overhaul extension options, the replacement of a number of PT6A-34, -35, and -36 life-limited engine components, including the first-stage sun gear at 12,000 hours total time since new. The first-stage sun gear on the accident airplane failed at 22,064.8 hours. In November 2005 (when the Manchester accident occurred), Business Air was operating under an engine on-condition maintenance program that did not incorporate the up-to-date PT6A 34, -35, and -36 reliability standards for the life-limited parts listed in SB 1403R7 because the SB did not address previously approved on-condition maintenance programs. Three months later, in an e-mail message to Business Air, P&WC stated that it would continue to “endorse” Business Air’s engine on-condition maintenance program. Although SB 1403R7 improves PT6A-34, -35, and -36 engine reliability standards, allowing grandfathered on condition maintenance programs for these engines is less restrictive and does not offer the same level of reliability. The National Transportation Safety Board’s review of maintenance records further revealed numerous deficiencies in Business Air’s on-condition engine maintenance program that appear to have gone undetected by the Portland, Maine, Flight Standards District Office (FSDO), which is in charge of monitoring Business Air’s operations. For example, one infraction was that Business Air did not specify which parts were included in its on-condition maintenance program and which would have been removed by other means, such as hard-time scheduling.[3] Also, the operator used engine condition trend monitoring as part of determining engine health; however, review of records revealed missing data, inaccurate data input, a lack of regular trend analyses, and a failure to update trends or reestablish baselines when certain maintenance was performed. Another example showed that, although Business Air had an engine-oil analysis program in place, the time it took to send samples for testing and receive results was lengthy. According to maintenance records, the operator took an oil sample from the accident engine more than 2 weeks before the accident and sent it for testing. The oil sample, which revealed increased iron levels, would have provided valuable information about the engine’s health. However, the results, which indicated a decline in engine health, were not received until days after the accident. If the FAA had been properly monitoring Business Air’s maintenance program, it may have been aware of the operator’s inadequate maintenance practices that allowed, among other things, an engine with a sun gear well beyond what the manufacturer considered to be a reliable operating timeframe to continue operation. It also took more than 2 1/2 years after the accident for the FAA to finally present a consent order[4] to the operator, in which both parties not only acknowledged the operator’s ongoing maintenance inadequacies but also the required corrective actions. [1] A sun gear is the center gear around which an engine’s planet gear assembly revolves; together, the sun gear and planet gear assembly provide a means of reducing the engine’s rpm to the propeller’s rpm. [2] According to FAA Advisory Circular (AC) 120-17A, “Maintenance Control by Reliability Methods,” under on-condition maintenance programs, components are required to be periodically inspected or checked against some appropriate physical standard to determine whether they can continue in service. [3] According to FAA AC 120-17A, “Maintenance Control by Reliability Methods,” under hard time maintenance programs, components are required to be periodically overhauled or be removed from service. [4] A consent order is a voluntary agreement worked out between two or more parties to a dispute. It generally has the same effect as a court order and can be enforced by the court if anyone does not comply with the orders. [4] A consent order is a voluntary agreement worked out between two or more parties to a dispute. It generally has the same effect as a court order and can be enforced by the court if anyone does not comply with the orders.", "probable_cause": "The pilot’s misapplication of flight controls following an engine failure. Contributing to the accident was the failure of the sun gear, which resulted in the loss of engine power. Contributing to the sun gear failure were the engine manufacturer’s grandfathering of previously recommended, but less reliable, maintenance standards, the Federal Aviation Administration’s (FAA) acceptance of the engine manufacturer’s grandfathering, the operator’s inadequate maintenance practices, and the FAA’s inadequate oversight of the operator."}