{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-328b-maiquetia-62-killed", "date": "Dec 3, 1969 at 1805 LT", "type": "Boeing 707", "operator": "Air-France-31", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Santiago de Chile – Caracas – Pointe-à-Pitre – Lisbon – Paris", "msn": "18459/335", "yom": 1963, "flight_number": "AF212", "city": "Caracas-Maiquetía-Simón Bolívar", "zone": "Vargas", "country": "Venezuela", "region": "South America", "crew_on_board": 21, "crew_fatalities": 21, "pax_on_board": 41, "pax_fatalities": 41, "other_fatalities": 0, "total_fatalities": 62, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Three minutes after takeoff from Maiquetía-Simon Bolivar Airport, while climbing to a height of 3,000 feet at night, the aircraft went out of control, nosed down and plunged into the sea about 5 km offshore. The wreckage sank by a depth of 50 metres and all 62 occupants were killed. ", "probable_cause": "The exact cause of the accident could not be determined. It was suspected that the loss of control was the consequence of a spatial disorientation on part of the pilot-in-command. No official investigation report was published either by the Venezuelan Authorities or by the French Government. All official documents referring to this tragedy are classified 'secret-defense' by the French Authorities until 2029. Nevertheless, in a classified document dated August 7, 1970, the French Bureau of Investigations (BEA-Bureau Enquêtes-Accidents) asked the French government to make a contact through the diplomatic way with the Venezuelan Authorities, to establish any evidence relating to suspicious traces found on clothes and some debris, some of them coming from the left main gear. On 17 November 1970, the Central Armament Laboratory of Paris confirmed that acetone washes were carried out on certain parts such as the fuselage, the bottom floor of the landing hatch and the landing gear. On the neighboring parts of the left main gear, it has been possible to demonstrate the presence of nitrocellulose, nitroglycerine and a nitro derivative in the form of traces that could come from the decomposition of dinitrotoluene or possibly trinitrotoluene. Consequently, in a letter dated November 27, 1970, the Chief of the General Inspectorate of the French Civil Aviation confirms in an official letter that the technical analysis carried out by the various laboratories highlighted a high probability that the destruction in flight of the aircraft should be attributable to an act of malicious intent. Indeed, the chemical and metallurgical analysis showed that a powerful explosive device may have been placed in the well zone of the left main gear. "}