{"url": "https://www.baaa-acro.com/crash/crash-fokker-f28-fellowship-1000-dryden-24-killed", "date": "Mar 10, 1989 at 1209 LT", "type": "Fokker F28 Fellowship", "operator": "Air%20Ontario.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Thunder Bay - Dryden - Winnipeg", "msn": "11060", "yom": 1972, "flight_number": "GX1363", "city": "Dryden", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 65, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": 24100, "captain_hours_type": 82, "copilot_hours": null, "copilot_hours_type": 65, "aircraft_hours": 20852, "circumstances": "Air Ontario Flight 1363, a Fokker F-28 jet, crashed during takeoff from Dryden Municipal Airport, Ontario, Canada. Of the 69 persons on board, 24 suffered fatal injuries. The aircraft in question, registration C-FONF, had suffered from a malfunctioning auxiliary power unit (APU) for the five days preceding the accident. Throughout the week preceding March 10, Air Ontario maintenance attempted, with limited success, to cure the APU problems. On March 9 it was decided to defer the repair of the APU until the aircraft returned to Toronto on the night of March 10. This meant that the aircraft was dispatched with the APU inoperable. On the morning of March 10, C-FONF departed Winnipeg on a round trip flight to Dryden, Thunder Bay and back as flight 1362/3. Since no external power unit was available at Dryden, the engines couldn't be restarted in case of engine shutdown on the ground. The flight to Thunder Bay was uneventful apart from a slight delay due to poor weather at Thunder Bay. As the aircraft was prepared for the return flight, it appeared that the aircraft was overweight as a result of ten additional passengers having transferred to the flight due to an earlier cancellation. The Air Ontario duty manager decided to off-load fuel and to arrange refuelling at Dryden. This caused an additional delay of 35 minutes. The Fokker F-28 departed Thunder Bay at 11:55 hours EST, about one hour behind schedule. The aircraft landed at Dryden at 11:39 hours CST. It began to snow lightly when the aircraft landed. Between 11:40 and 12:01, Air Ontario 1363 was refuelled with the right engine operating and with the passengers remaining on board the aircraft. This so called 'hot refuelling' procedure was followed because the APU was unserviceable. Eight passengers deplaned in Dryden and seven passengers boarded the aircraft. Meanwhile, snow was accumulating on the wings, forming a layer of 1/8-1/4 inch. No de-icing was done because de-icing with either engine running was prohibited by both Fokker and Air Ontario. The aircraft then taxied to runway 29 for departure, but was instructed to hold as there was a Cessna 150 on approach. The snow was continuing to fall heavily, becoming increasingly thick on the wings. At 12:09 the aircraft started it's takeoff roll on the slush-covered runway 29. There was an accumulation of at least one-half inch of wet, layered snow on the wings of the F-28 as it began its takeoff roll. After a longer than normal takeoff roll, the aircraft was rotated near taxiway Alpha, at approximately the 3500 foot mark. The aircraft lifted off slightly, began to shudder, and then settled back down onto the runway. The takeoff roll then continued and the aircraft was rotated a second time, finally lifting off at approximately the 5700 mark of the 6000 foot runway. It flew over the end of the runway approximately 15 feet above the ground. It thereafter failed to gain altitude and mushed through the air in a nose-high attitude, before commencing to strike trees. The aircraft crashed and came to rest in a wooded area, 3156 feet past the runway end and caught fire.", "probable_cause": "The captain, as the pilot-in-command, must bear responsibility for the decision to land and take off in Dryden on the day in question. However, it is equally clear that the air transportation system failed him by allowing him to be placed in a situation where he did not have all the necessary tools that should have supported him in making the proper decision."}