{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-8eh-near-peixoto-de-azevedo-154-killed", "date": "Sep 29, 2006 at 1657 LT", "type": "Boeing 737-800", "operator": "GOL2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Manaus – Brasília – Rio de Janeiro", "msn": "34653", "yom": 2006, "flight_number": "GLO1907", "city": "Peixoto de Azevedo", "zone": "Mato Grosso", "country": "Brazil", "region": "South America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 148, "pax_fatalities": 148, "other_fatalities": 0, "total_fatalities": 154, "captain_hours": 15498, "captain_hours_type": 13521, "copilot_hours": 3981, "copilot_hours_type": 3081, "aircraft_hours": 202, "circumstances": "The B737-8EH airplane was operating as flight GLO1907, regular passenger transport, under the rules of RBHA 121. It had departed Eduardo Gomes International Airport (SBEG) in Manaus – Amazonas State, at 18:35 UTC, destined to Rio de Janeiro – Rio de Janeiro State (SBGL), carrying 6 crewmembers and 148 passengers. The aircraft was scheduled to make a technical stop at Brasilia International Airport (SBBR), in the Brazilian capital city. The EMB-135BJ Legacy airplane, with 2 crewmembers and 5 passengers onboard, departed from São José dos Campos (SBSJ), São Paulo State, at 17:51 UTC, destined to Manaus (SBEG), from where it would later proceed to Fort Lauderdale (KFLL), Florida, USA. The B737-8EH airplane made its last radio contact with the Amazonic Area Control Center (ACC AZ) at 19:53 UTC, and was instructed to call the Brasilia Area Control Center (ACC BS) at NABOL position, but the contact was not made. At 20:14 UTC, the ACC AZ received a message from Polar Air Cargo 71, in relay for the Legacy airplane, stating that the N600XL was declaring emergency, having difficulties with its flight control system, and that it would proceed for an emergency landing at SBCC (military aerodrome of the Command of Aeronautics (COMAER), known as Campo de Provas Brigadeiro Veloso, in Novo Progresso county, Pará State). After landing, the N600XL crew reported that their airplane had collided in flight with an unknown object. The airplane sustained damages at the left wingtip and left elevator. The wreckage of the B737-8EH was found the next day, 30 September, in a region of thick forest, in the county of Peixoto de Azevedo, Mato Grosso State. All the 154 occupants of the PR-GTD had perished in the accident.", "probable_cause": "The following factors were identified: \r\nHuman Factor\r\nPR-GTD - Neither active failures were identified in relation to the crew, nor latent failures in relation to the organizational system of the company.\r\nN600XL - Relatively to the crew of the N600XL, the following active failures were identified: lack of an adequate planning of the flight, and insufficient knowledge of the flight plan prepared by the Embraer operator; non-execution of a briefing prior to departure; unintentional change of the transponder setting, failure in prioritizing attention; failure in perceiving that the transponder was not transmitting; delay in recognizing the problem of communication with the air traffic control unit; and non-compliance with the procedures prescribed for communications failure. The low situational awareness of the pilots (airmanship) was a relevant factor for the occurrence of the accident. It began during the phase of preparation for the operation, which was considered by them as 'routine'. The attitude of the pilots about the mission permeated their behavior during the other phases, with the addition of several factors that contributed to aggravate the lowering of the situational awareness: \r\n• The non-elaboration of an adequate planning of the flight, a behavior that was influenced by the habitual procedure of the company, an aspect not favorable for the construction of a mental model to guide the conduction of the flight;\r\n• The haste to depart and the pressure from the passengers, hindering adequate knowledge of the flight plan, and negatively influencing the sequence of actions during the pre-flight and departure phases;\r\n• The crew dynamics, characterized by lack of division of tasks, lack of an adequate monitoring of the flight, and by informality. It was influenced by the lack of knowledge of the weight and balance calculations, and by the predominant little experience of the pilots in that aircraft model; and\r\n• The lack of specific Standard Operational Procedures (SOP’s) set by the company for that aircraft model to be complied with by the pilots.\r\nWithin this context, the inadvertent switch-off of the transponder occurred, possibly on account of the pilots’ little experience in the aircraft and its avionics. The transponder switch off was not perceived by the crew, due to the reduction of the situational awareness relative to the alert of the TCAS condition, which did not draw the attention of the pilots. The lack of situational awareness also contributed to the crew’s not realizing that they had a communication problem with the ATC. Although they were maintaining the last flight level authorized by the ACC BS, they spent almost an hour flying at a non-standard flight level for the heading being flown, and did not ask for any confirmation from the ATC. The performance deficiencies shown by the crew have a direct relationship with the organizational decisions and processes adopted by the operator: the inadequate designation of the pilots for the operation; the insufficient training for the conduction of the mission, and the routine procedures relative to the planning of the flight, in which there was not full participation of the crew. Considering the diversity and complexity of the non-conformities observed in the air traffic control domain, they will be presented in topics. It is important to point out that the refusal of the Brasilia ACC controllers involved in the accident to participate in the interviews hindered the precise identification of the individual aspects that contributed to the occurrence of the non-conformities. Some of these aspects were kept in the field of hypotheses.\n\r\na) Transmission of an incomplete flight clearance by the assistant controller of the São Paulo Region of Brasilia ACC, and by the Ground controller of DTCEA-SJ. There was a deviation from the procedure, together with an informal procedure pattern concerning the transmission of clearances, originated at Brasilia ACC, and disseminated at DTCEA-SJ, as an outcome of daily practice, in replacement of the model prescribed by the legislation. The reception and transmission of incomplete clearances were erroneously adopted as normal, routine practices, rationally justifiable, within the DTCEA-SJ. The incomplete clearance transmitted to the N600XL crew favored the understanding by the pilots that they had to maintain FL 370 all the way to Manaus.\n\r\nb) The ATCO of sectors 5 and 6 of Brasilia ACC did not provide the ATCO 1 of sectors 7, 8 and 9 with the necessary information, when coordinating and handing off the N600XL aircraft.\r\nThe incomplete information transmitted by the ATCO of sectors 5 and 6 is an indication that he had a low situational awareness concerning the N600XL in his sector. He, possibly, considered that his priority in relation to the mentioned aircraft would be an early transfer to the next sector, as his own sector was showing an increasing volume of traffic at that moment (09 aircraft), although it was below the limits prescribed for grouped sectors.\n\r\nc) The ATCO 1 of sectors 7, 8 and 9 of ACC BS did not make a radio contact with N600XL to change the aircraft flight level and to switch the frequency from sector 9 to sector 7; did not perceive the N600XL loss of mode C; he assumed that the N600XL was at flight level FL360; did not perform the procedures prescribed for the loss of transponder in RVSM airspace, and for the control position relief, by both omitting information and transmitting incorrect information. The non-transmission of important information to the ATCO 1 of sectors 7, 8 and 9, concerning the N600XL in sector 5, contributed to the diminishing of the situational awareness of that controller in relation to the aircraft and the need to change its level and frequency. The failure of the ATCO 1 of sectors 7, 8 and 9 to act in relation to the change of frequency allowed the aircraft to get out of the coverage of the frequency 125.05 MHz, making it impossible to receive the transmissions. By not contacting the aircraft to change its level at the vertical of Brasilia, the ATCO 1 of sectors 7, 8 and 9 let the N600XL join the UZ6 airway at an incorrect level in relation to the active flight plan. Although the system presented the prescribed indications for the loss of the N600XL transponder, they did not draw the attention of the controller to the need of changing the flight level. The lack of action after the loss of the N600XL Transponder mode C allowed the aircraft to maintain a flight level that was incorrect in relation to the active flight plan. When he passed the information to the ATCO 2 of sectors 7, 8 and 9 that the aircraft was at flight level FL360, the ATCO inserted a false assumption, which became very difficult to be detected, on account of the lack of the Transponder altitude information and the impossibility of communication due to the failure to timely instruct the aircraft to change the frequency. Misjudging that the aircraft was at the flight level planned for the segment (FL360), the ATCO 1 possibly disregarded the risks resulting from the inaccurate 3D radar altitude information. The controller, also, failed to resort to the support of the regional supervisor. His attitude of evaluating the resulting risks in an incorrect manner may have influenced on the lack of information/ transmission of incorrect information, when he was relieved by the ATCO 2 of sectors 7, 8 and 9. \n\r\nd) The ATCO 2 of sectors 7, 8 and 9 of ACC BS did not perform the procedures prescribed for the loss of transponder and loss of radar contact within RVSM airspace, and for communications failure, and failed to communicate with the assistant controller. By failing to perform the prescribed procedures for the loss of Transponder and radar contact, as well as for communications failure, the ATCO 2 of sectors 7, 8 and 9 allowed the N600XL to maintain the incorrect flight level (FL370) on the UZ6 airway. The lack of communication with the Assistant-Controller allowed a deficient hand-off of the N600XL to the ACC AZ, with incomplete information, by not mentioning the difficulties of the ACC BS in relation to the radar contact and communications. The attitudes and incorrect evaluation of the resulting risks by the controller may have been generated by the wrong assumption that the N600XL was at FL 360. Such attitudes may have influenced his behavior of not resorting to the support of the regional supervisor, and of not advising his assistant-controller to inform the ACC AZ about the conditions of the aircraft.\n\r\ne) Lack of communication between controllers and supervisors: lack of information and/or transmission of incorrect information by the ATCO of sectors 5 and 6, the ATCO’s 1 and 2, and Assistant-ATCO of sectors 7, 8 and 9, during the execution of the procedures for coordination and handoff of the N600XL between sectors and between Control Centers, and at the control position relief; lack of communication between controllers and supervisors. Deviations from the procedures regarding the prescribed phraseology were observed, in various situations of the air traffic control activity and in the various control units involved in the accident. Such deviations contributed to the lowering of the situational awareness of the controllers responsible for controlling the N600XL flight. The supervisors were not advised by the controllers about the problems experienced in the control of the N600XL, an aspect that generated the making of inadequate decisions, which occurred isolatedly and individually, reflecting a deficient coordination of the team resources.\n\r\nf) Supervisors of the Brasilia ACC: lack of involvement in the events concerning the control of the N600XL. The lack of involvement of the supervisors allowed the decisions to be made and the actions to be taken in relation to the N600XL in an individual manner, without due monitoring, advisory and guidance prescribed for the air traffic control. Among the duties of the regional supervisors, listed in the Operational Model of the ACC BS, there is the following: “to supervise the provision by the controllers under his/her responsibility of the air traffic services in their respective sectors, and to correct errors, omissions, irregularities or inadequate employment of ATS procedures”. Thus, when the supervisors did not participate in the events, an opportunity was lost, with the participation of more people in the process, to detect the need of efficient actions for the reestablishment of the radar contact and radio contact with the N600XL, in addition to other procedures prescribed. It was not possible to define the aspects that contributed to the non-involvement of the supervisors in the events, as there was a refusal to participate in interviews.\n\r\ng) The ATCO of the Manaus Sub Center of the ACC AZ showed deviation from the standard procedure during the hand-off of the PR-GTD and the take-over of the N600XL; erroneously confirmed the existence of the N600XL traffic; and did not perform the procedure prescribed for the loss of radar contact. The ATCO did not perceive the control condition of the N600XL as critical, and did not demonstrate discomfort with the situation, thus displaying a low situational awareness. This may have been influenced by the information received from the ACC BS that the aircraft was at flight level FL360, and by not being informed that the aircraft had been without radar contact and radio contact for some time. Again, this allowed the two airplanes to fly in opposite directions, along the same airway and at the same flight level. The personnel shortage at CINDACTA IV hindered the maintenance of a continued training of the controllers, by means of refreshers, TRM trainings and English courses. It was observed that the annual theoretical evaluation (TGE) was not being able to aid in the identification and diagnostic of the controllers’ performance deficiencies, thus failing to assist in the process of determination of the training needs. There were difficulties in re-creating the operational profile of the ATCO’s involved, due to the shortage of records relative to the instruction and technical qualification. Lastly, it is important to point out that the personnel shortage hindered the structuring of the operational work-shifts, as well as the instructional activities, as mentioned earlier. The effects of the personnel shortage were reflected in the quality of the services as they contributed to the degradation of the controllers’ performance and/or to the insufficient technical qualification.\n\r\n1.2. Physiological Aspect - not a contributor\r\nNo factors of physiological origin were evidenced that may have contributed directly or indirectly to the occurrence of the accident.\n\r\n1.3. Operational Aspect.\r\na) Training - a contributor\r\n(Participation of the received training process, due to a qualitative or quantitative deficiency, for not providing the trainee with full knowledge and other technical skills required for the\r\nperformance of the activity). The FSI refused to receive the visit of the CIAA at the unit of Houston-Texas and brought considerable difficulties for the investigation of the instruction given to the pilots in the simulator. The training provided to the N600XL pilots proved insufficient for the conduction of the repositioning flight from Brazil to the USA. The lack of interaction between the pilots was apparent in the difficulties with the division of tasks and in the coordination of the cockpit duties, with both of them devoting their attention to the calculations of the aircraft weight and balance during the flight. The lack of theoretical knowledge became evident when they showed difficulty operating the aircraft systems, mainly the fuel system, according to the CVR.\r\nThese gaps in the received training favored a deviation of the pilots’ attention to other aspects during the flight, in detriment of the aircraft operation. Such distraction allowed the discontinuance of the transponder transmission to go unperceived, resulting in the incorrect maintenance of the FL370 on the UZ6 airway and lack of TCAS collision alert. Upon completion of the training at the FSI, both pilots would be entitled to fly domestic and international flights, under the aegis of the 14 CFR Part 91, without previous interaction as a crew. Since the prescriptions of the regulation mentioned were complied with, it was observed that they were not adequate to meet the minimum required levels for a safe operation of high performance jet aircraft in acceptance and repositioning flights.\n\r\nb) Air traffic control - a contributor\r\n(Participation of the air traffic service provider, on account of inadequate service provision)\r\nThe authorization to maintain flight level FL370 was given to the crew of the N600XL, as the result of a clearance transmitted in an incorrect manner. The vertical navigation conducted by the crew ended up being different from the one prescribed in the flight plan that was filed and activated, on account of the instruction incorrectly transmitted that led the N600XL crew to maintain flight level FL370. The air traffic control units involved, although providing radar surveillance (radar monitoring) service, did not correct the flight level and did not perform the prescribed procedures for altitude verification when they stopped receiving essential information from the Transponder due to the loss of mode C. The controllers assumed that the traffic was at a different flight level, without even being in two-way radio contact with the N600XL for confirmation. They did not make a correct handoff of the traffic between sectors and between FIRs. They maintained RVSM separation when the necessary requirements no longer existed. As a final consequence, they did not provide the proper traffic separation as prescribed in the ICAO Doc. 4444, item 5.2 “Provisions for the Separation of Controlled Traffic”, thus allowing the in-flight collision between the two airplanes. Neither material nor design failures were found in the pieces of equipment of the air traffic infrastructure that might have contributed to the accident. The various contributing non-conformities found by the investigation are presented in the item 1.1 of this report, as they are directly related to the Human Factor. \n\r\nc) Cockpit coordination - a contributor\r\n(Error resulting from an inadequate utilization of the human resources for the operation of the aircraft, on account of an ineffective distribution and management of the tasks affecting each crew member, failure or confusion in the interpersonal communication or relationship, inobservance of operational rules)\r\nThe attention of both pilots of the N600XL focused on solving the question relative to the performance of the aircraft for the operation in Manaus, as they had learned of a NOTAM limiting the length of the runway of that airport. This hindered the routine of monitoring the evolution of the flight, because both pilots got busy with the same subject, creating the environment in which the interruption of the Transponder transmission was not perceived. There was not a good division of the flight management tasks, culminating with a prolonged absence of the PIC from the cockpit, thus overburdening the SIC when he tried to establish contact with the control units. The utilization of the screens by both pilots to show the fuel system, consequently without visualization of the TCAS, contributed to the lack of perception of the inoperative TCAS.\n\r\nd) Judgment - a contributor\r\n(Error committed by the pilot, resulting of an inadequate assessment of certain aspects of the operation, despite his being qualified for that operation) \r\nThe pilots judged that they would be able to conduct the flight even with their little adjustment as a crew and with their little knowledge of the aircraft systems, mainly the fuel system and the calculations of the weight and balance. They believed they could hasten the departure, resulting that they had just a short time to verify the flight plan and other documents, such as the NOTAM informing about the reduction of the runway length available at Manaus airport. On account of that, they judged that they both could concentrate on the calculations of the weight and balance in flight, something that allowed the non-functioning of the Transponder and TCAS to occur unperceived. There was an incorrect evaluation of the situation relative to the attempts to contact the ATC, as more than 43 minutes had elapsed without communication with the ACC BS, and they were late to recognize the need to contact the control center. The PIC left the cockpit and stayed away 16 minutes, not considering the consequences of overburdening the SIC.\n\r\ne) Planning - a contributor\r\n(Pilot error, resulting of inadequate preparation for the flight, or part of the flight)\r\nThe planning of the flight was inadequate. Before the departure, there was not a monitoring of the elaboration of the flight plan that was being prepared by the Embraer employee, not allowing the pilots to have a previous knowledge of the proposed route and flight levels, although, in accordance with the Excelaire Manual of Operations, the PIC had to open and close the flight plan at the nearest FAA FSS or ATC office. There are numerous situations recorded in the CVR showing the lack of an adequate concern of the crew with details of the pre-flight planning. An example was that only in flight did they learn of NOTAM of SBEG containing information about the reduction of the runway length available. This fact, added to the little familiarization of the pilots with the fuel system and with the aircraft weight and balance calculations, favored the deviation of their attention, during the flight, from the aspects relative to the operation of the aircraft, allowing the non functioning of the Transponder and TCAS to go by unperceived.\n\r\nf) Oversight - a contributor\r\n(participation of third parties, not belonging to the crew, on account of lack of adequate supervision of the planning or execution of the operation, at administrative, technical or operational levels)\r\nThe oversight conducted by the operator for the flight proposed was inadequate. The composition of the crew, with two pilots that had never flown together before, to receive, in a foreign country, an airplane in which they had little experience, with air traffic rules different from those with which they were used to operate, favored the lack of a good adjustment between the pilots, along with the already mentioned difficulties of cockpit coordination. Besides, there was not a specific SOP for the receipt of aircraft from the manufacturer, resulting that their decisions were made according to the individual experience of the pilots, who had never received an aircraft in those conditions. The decisions made, as seen in the contributing factors “Judgment” and “Planning” influenced the sequence of events that led to the accident. The monitoring of the instruction provided to the pilots was inadequate, because the operator did not perceive that the acquired knowledge was not sufficient for the conduction of the intended flight. The performance of the N600XL crew had a direct relationship with the decisions and organizational processes adopted by the operator, on account of culture and attitudes of informality. All of this was considered as a chain of errors, without violations on the part of the operator.\n\r\ng) Little flight experience in the airplane - Undetermined\r\n(Pilot error, resulting from little experience in the aviation activity, in the aircraft, or, specifically, in the circumstances of the operation)\r\nThe CVR indicated that, shortly before the moment of silence and the moment at which the Transponder discontinued the transmission, the PIC was looking at the fuel page of the MFD, and solved a doubt about fuel management with the SIC. It is possible that the PIC may have continued to look at other pages of the MFD and, possibly, to pages of the RMU. The little experience of the PIC in this aircraft possibly made him look for information about the fuel consumed on the RMU fuel page, and, when leaving from this page and pushing the pertinent buttons, he unintentionally changed the setting of the Transponder from TA/RA to STANDBY, thus interrupting the altitude information of the mode C; The insufficient adaptation of the crew with this type of aircraft and with the DISPLAYS of the respective avionics may have contributed to the unintentional selection of the STANDBY mode and to the subsequent lack of perception of the Transponder/TCAS status."}