{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-near-eagleville-5-killed", "date": "Nov 21, 2001 at 1126 LT", "type": "Rockwell Shrike Commander 500", "operator": "Commander Northwest", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Reno - Wenatchee", "msn": "500-3070", "yom": 1970, "flight_number": null, "city": "Eagleville", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 20069, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8101, "circumstances": "The airplane collided with mountainous terrain during cruise after encountering turbulence and downdrafts associated with mountain wave conditions. According to Federal Aviation Administration (FAA) records, the pilot called the Reno Automated Flight Service Station at 0941 and filed an IFR flight plan, then asked for the winds aloft forecast, which was provided. The pilot did not request any additional weather briefing information for the flight. No other record was found that the pilot obtained additional weather forecast information from any official source associated with the FAA or the National Weather Service. At the time of the pilot's call to the Reno AFSS, several AIRMET weather advisories had been issued hours prior detailing warnings for turbulence and clear icing along the route of flight. The advisories warned of occasional moderate turbulence below 18,000 feet in moderately strong westerly winds especially in the vicinity of mountainous terrain. Clear Air Turbulence (CAT) between 18,000 and 40,000 feet was forecast over the area of the accident site due to jet stream wind shear and mountain wave activity. The pilot departed under visual flight rules (VFR) and picked up his instrument flight rules (IFR) clearance en route and climbed to 14,000 feet. The pilot later asked if he could maintain 12,500 feet. The controller advised him that the minimum IFR altitude on this segment of his route was 14,000 feet, and the pilot cancelled his IFR flight plan. The controller advised the pilot that he had lost radar contact, and instructed the pilot to squawk VFR and the pilot acknowledged the transmission. The last radar target was about 1/2 mile east of Eagle Peak (elevation 9,920 feet) in the Warner Mountains. Rescuers discovered the wreckage near the crest of Eagle Peak on November 23. Investigators found no anomalies with the airframe, engines, or propellers that would have precluded normal operation. The NWS had a full series of AIRMETs current over the proposed route of flight, which included mountain obscuration, turbulence, and icing. Analysis of the weather conditions disclosed a layer between 9,500 and 11,000 feet over the accident site area as having a high likelihood of severe or greater turbulence. A pilot on the same route of flight reported at 1127 that he was in instrument conditions at 11,000 feet, and experiencing light turbulence and light clear icing conditions. He also reported encountering updrafts of 2,000 feet per minute, which was indicative of mountain wave activity. A company pilot was in a second Aero Commander trailing the accident airplane and he reported that at 1147, at a position near the accident site, he encountered a severe downdraft. He applied full climb power, but as the  airplane passed over the accident site position, the airplane continued to lose altitude even at maximum power. At 1159, he was able to gain altitude, and return to his assigned cruising altitude of 14,000 feet. The second Aero Commander was turbocharged, the accident airplane was not. Analysis showed that the topography of the area was critical in this case, given that the accident site was at an elevation of 9,240 feet on the eastern slope of Eagle Peak. The accident airplane's flight track was normal along the airway until immediately downwind of the higher terrain. As the flight approached the lee side of the mountain, it came under the influence of the mountain wave and first encountered an updraft and then a downdraft, which increased in amplitude as the flight progressed towards Eagle Peak. Eagle Peak was the tallest point along the Warner Mountain range and the steep slope of this terrain was significant when the mountain wave action was encountered. Such terrain features have been known to enhance the vertical downdrafts and updrafts associated with the most intense mountain wave turbulence.", "probable_cause": "The pilot's encounter with forecast mountain wave conditions, moderate or greater turbulence, and icing, with downdrafts that likely exceeded the climb capability of the airplane, which was encountered at an altitude that precluded recovery. Also causal in the accident was the failure of the pilot to obtain an adequate preflight weather briefing which would have included a series of Airmets that were in effect at the time."}