{"url": "https://www.baaa-acro.com/crash/crash-cessna-s550-citation-ii-indianapolis-2-killed", "date": "May 22, 2019 at 1243 LT", "type": "Cessna 550 Citation II", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Indianapolis - Minden", "msn": "550-0041", "yom": 1985, "flight_number": null, "city": "Indianapolis-Regional", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3530, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was conducting a personal cross-country flight in a turbofan-powered airplane. Shortly after departure, the airplane entered a witness-estimated 90° left bank with the nose parallel to the horizon; as the airplane began to roll out of the turn, the nose remained at or below the horizon before it dropped and the airplane impacted the ground. Flight track data revealed that, shortly after departure, the airplane's ground speed immediately began decreasing from its maximum of 141 knots during takeoff and continued decreasing until the last recorded data point, which showed that the airplane had a ground speed of 100 knots. The surface wind reported about 10 minutes before the accident was from 170° at 9 knots, gusting to 14 knots, which resulted in a 1- to 2-knot tailwind component. Given this information and the airplane's configuration at the time of the accident, the airplane's indicated airspeed (IAS) would have been between about 86 and 93 knots. The airplane's stall speed was calculated to be 100 knots IAS (KIAS) with a bank angle of 45° and 118 KIAS with a bank angle of 60°. Thus, the pilot failed to maintain airspeed or accelerate after departure, which resulted in an aerodynamic stall A pilot who had flown with the accident pilot twice before the accident reported that, during these flights, the pilot had flown at reduced power settings and slower-than-normal airspeeds. During the flight 1 year before the accident, he reached over and pushed the power levers forward himself. He also stated that every time he had flown with the pilot, he was \"very behind the airplane.\" Postaccident examination of the engines revealed no signs of preimpact mechanical failures or malfunctions that would have precluded normal operation, and both engines exhibited circumferential rub marks on all rotating stages, blade tip bending opposite the direction of rotation, and debris ingestion through the gas path, indicating that the engine had power at impact. Further, the right engine full authority digital electronic control (FADEC) nonvolatile memory recorded no faults. (The left engine FADEC could not be downloaded due to damage.) The Airplane Flight Manual stated that the pilot must, in part, advance the throttle lever to the maximum  takeoff detent for the FADEC's nonvolatile memory to record a logic trend snapshot 2 seconds after takeoff. The lack of a FADEC logic trend snapshot is consistent with the pilot not fully advancing the throttles during the takeoff and initial climb and is likely why he did not attain or maintain sufficient airspeed. The flight track data, pilot witness account, and airplane damage are consistent with the pilot failing to fully advance the power levers while maneuvering shortly after takeoff, which led to his failure to maintain sufficient airspeed and resulted in the exceedance of the airplane's critical angle of attack and a subsequent aerodynamic stall.", "probable_cause": "The pilot's failure to fully advance the power levers during the takeoff and initial climb, which led to his failure to maintain sufficient airspeed and resulted in the exceedance of the airplane's critical angle of attack and a subsequent aerodynamic stall. "}