{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-40-solitaire-eleuthera-island-4-killed", "date": "May 15, 2017 at 1329 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Ithaca Consulting", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Aguadilla – Space Coast", "msn": "450", "yom": 1981, "flight_number": null, "city": "Eleuthera Island", "zone": "All Bahamas", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1483, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4634, "circumstances": "The commercial pilot and three passengers were making a personal cross-country flight over ocean waters in the MU-2B airplane. During cruise flight at flight level (FL) 240, the airplane maintained the same relative heading, airspeed, and altitude for about 2.5 hours before radar contact was lost. While the airplane was in flight, a significant meteorological information notice was issued that warned of frequent thunderstorms with tops to FL440 in the accident area at the accident time. Satellite imagery showed cloud tops in the area were up to FL400. Moderate or greater icing conditions and super cooled large drops (SLD) were likely near or over the accident area at the accident time. Although the wreckage was not located for examination, the loss of the airplane's radar target followed by the identification of debris and a fuel sheen on the water below the last radar target location suggests that the airplane entered an uncontrolled descent after encountering adverse weather and impacted the water. Before beginning training in the airplane about 4 months before the accident, the pilot had 21 hours of multi engine experience accumulated during sporadic flights over 9 years. Per a special federal aviation regulation, a pilot must complete specific ground and flight training and log a minimum of 100 flight hours as pilot-in-command (PIC) in multi engine airplanes before acting as PIC of a MU-2B airplane. Once the pilot began training in the airplane, he appeared to attempt to reach the 100-hour threshold quickly, flying about 50 hours in 1 month. These 50 hours included about 40 hours of long, cross-country flights that the flight instructor who was flying with the pilot described as \"familiarization flights\" for the pilot and \"demonstration flights\" for the airplane's owner. The pilot successfully completed the training required for the MU-2B, and at the time of the accident, he had accumulated an estimated 120 hours of multi engine flight experience of which 100 hours were in the MU-2B. Although an MU-2B instructor described the pilot as a good, attentive student, it cannot be determined if his training was ingrained enough for him to effectively apply it in an operational environment without an instructor present. Although available evidence about the pilot's activities suggested he may not have obtained adequate restorative sleep during the night before the accident, there was insufficient evidence to determine the extent to which fatigue played a role in his decision making or the sequence of events.The pilot's last known weather briefing occurred about 8 hours before the airplane departed, and it is not known if the pilot obtained any updated weather information before or during the flight. Sufficient weather information (including a hazardous weather advisory provided by an air traffic control broadcast message about 25 minutes before the accident) was available for the pilot to expect convective activity and the potential for icing along the accident flight's route; however, there is no evidence from the airplane's radar track or the pilot's communications with air traffic controllers that he recognized or attempted to avoid the convective conditions or exit icing conditions.\n", "probable_cause": "The pilot's intentional flight into an area of known icing and convective thunderstorm activity, which resulted in a loss of control of the airplane.\n"}