{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-310-flotta", "date": "Apr 20, 1983 at 1300 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Air%20Ecosse", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Aberdeen - Flotta", "msn": "545", "yom": 1977, "flight_number": null, "city": "Flotta", "zone": "Orkney", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9010, "captain_hours_type": 1503, "copilot_hours": 184, "copilot_hours_type": 100, "aircraft_hours": 7000, "circumstances": "Strong winds were reported at Flotta as the Twin Otter approached Orkney Island. The aircraft first contacted the airport at 11:56, and was informed that the surface wind was indicating 260°/26 knots. The pilot accordingly elected to make a straight in approach to runway 35. The pilot preferred the cross-wind to come from his left-hand side, so that he could 'see' the left main wheel onto the runway. The aircraft touched down left main wheel first, then on the right main wheel and, as the nosewheel touched, the commander selected reverse thrust from the propellers. As the aircraft touched down, the audible stall warning sounded momentarily. Shortly after reverse thrust from the propellers had been selected and achieved, the aircraft’s left wing started to rise. The captain applied full left wing down aileron and full left rudder, then cancelling reverse thrust from the right-hand propeller and increasing forward power on that engine. However, he was still unable to prevent the left wing from rising further. The right-hand wing-tip contacted the ground, the aircraft yawed to the right and then fell back momentarily onto the main wheels before ‘cartwheeling’ through an aerodrome boundary fence and coming to rest on its left side, with both wings detached. All 12 occupants escaped uninjured while the airplane was damaged beyond repair. ", "probable_cause": "The accident was caused by a loss of control, shortly after touchdown, following a strong lateral gust which was in excess of the maximum cross-wind capability of the aircraft. The lack of accurate surface wind information at the runway threshold was a contributory factor."}