{"url": "https://www.baaa-acro.com/crash/crash-learjet-25d-detroit-6-killed", "date": "Jan 19, 1979 at 1934 LT", "type": "Learjet 25", "operator": "Massey%20Ferguson", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Des Moines – South Bend – Detroit – Toronto", "msn": "25-237", "yom": 1978, "flight_number": null, "city": "Detroit-Metropolitan-Wayne County", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 7171, "captain_hours_type": 550, "copilot_hours": 3740, "copilot_hours_type": 96, "aircraft_hours": 299, "circumstances": "The airplane crashed while landing on runway 09 at Detroit-Metropolitan-Wayne County Airport. The airplane was returning executives of Massey-Ferguson, Inc., to South Bend, Indiana, Detroit, Michigan, and Toronto, Canada, following a meeting at the company's headquarters in Des Moines, Iowa. During the descent, the aircraft flew in light to moderate, occasionally severe icing conditions. Shortly before the Learjet was to land, a McDonnell Douglas DC-9 was cleared for takeoff. Witnesses saw the Learjet cross the threshold in a normal landing attitude and seconds later roll violently. The airplane was in a steep right bank when the wing tip tank struck the runway 2,440 feet from the threshold and the airplane burst into flames. The two pilots and four passengers were killed.\n", "probable_cause": "The National Transportation Safety Board determines that the probable cause of the accident was the pilot's loss of control. The loss of control may have caused by an accumulation of wing ice, by a delayed application of engine thrust been caused by wake turbulence of a departing aircraft, by a premature stall during an attempted go-around, or by any combination of these factors. "}