{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-134a-near-kurilovka-94-killed", "date": "Aug 11, 1979 at 1335 LT", "type": "Tupolev TU-134", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Chelyabinsk - Voronezh - Kichinev", "msn": "4 35 22 10", "yom": 1974, "flight_number": "SU7628", "city": "Kurilovka", "zone": "Dnipropetrovsk Oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 88, "pax_fatalities": 88, "other_fatalities": 0, "total_fatalities": 94, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12739, "circumstances": "The airplane departed Voronezh Airport at 1254LT on the last leg of a flight from Chelyabinsk to Kishinev, Moldavia, carrying 88 passengers and a crew of six. At 1317LT, the airplane entered the Kharkiv ARTCC at an altitude of 8,400 meters. The crew requested several times the permission to climb to 9,600 meters but this was denied due to heavy traffic. Eight minutes later, a second Aeroflot Tupolev TU-134AK entered the same ARTCC at an altitude of 5,700 meters. Registered CCCP-65735, it was completing flight SU7880 from Tashkent to Minsk with an intermediate stop in Donetsk. On board were 77 passengers and a crew of seven, among them all staff from the Pakhtakor Tashkent Football Team who should play against the  Dynamo Minsk Team in two days. The crew of the second TU-134 was first cleared to climb to 7,200 meters and later to 8,400 meters. The air traffic controller miscalculated the distance and timing between both aircraft. About 90 seconds later, at an altitude at 8,400 meters but on crossing airways, both airplanes collided at an angle of 95° from each other. The right wing of CCCP-65735 struck the cockpit of CCCP-65816. Both aircraft spiralled to the ground, partially disintegrated in the air and eventually crashed in fields located around the villages of Kurilovka, Nikolaevka and Elizavetovka, about 35 km northwest of Dnipropetrovsk. Debris were found on a large area and none of the 178 occupants survived the accident. ", "probable_cause": "The in-flight collision was the consequence of multiple errors on part of the Air Traffic Controller and his instructor in charge of the Kharkiv Southwest Sector. The following factors were reported:\r\n- Violations of the published procedures,\r\n- Poor assistance and negligence on part of ATC in level assignment,  \r\n- Non compliance with requirements and regulations in force on part of ATC,\r\n- Non compliance with standard radio phraseology,\r\n- Lack of coordination, \r\n- Intense traffic, \r\n- Stress situation. "}