{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-iliamna-0", "date": "Aug 8, 2016 at 1651 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Rapids%20Camp%20Lodge_0", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Crosswind Lake - King Salmon", "msn": "970", "yom": 1956, "flight_number": null, "city": "Iliamna", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9780, "captain_hours_type": 535, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7632, "circumstances": "The airline transport pilot of the float-equipped airplane was attempting a takeoff with the load of passengers that he had flown to the lake earlier in the day. The pilot's calculated takeoff distances for the water run and over a 50-ft obstacle were 1,050 ft and 2,210 ft, respectively. The pilot did not add a safety margin to his takeoff distance calculations. The approximate shore-to-shore distance of the takeoff path was 1,800 ft. During taxi, the pilot retracted the wing flaps, where they remained for the takeoff. GPS data showed that the airplane attained a speed of about 49 knots before impacting terrain just beyond the shoreline. The airplane's stall speed with flaps retracted was about 52 knots. Postaccident examination revealed that the left wing flap was in the fully retracted position; the right wing flap assembly was damaged. The airplane flight manual takeoff checklist stated that flaps were to be selected to the \"TAKE-OFF\" position before takeoff. Additionally, the takeoff performance data contained in the flight manual was dependent upon the use of \"TAKE-OFF\" flaps and did not account for no-flaps takeoffs. Even if the pilot had used the correct flap setting for takeoff, the calculated takeoff distances were near the available takeoff distance, and it is likely that the airplane would still not have been able to avoid a collision with terrain. The pilot stated that there was no mechanical malfunction/failure with the airplane, and he should have \"done the right thing,\" which was to conduct two flights, each with a half load of passengers. ", "probable_cause": "The pilot's decision to perform the takeoff despite calculations showing that the distance available was inadequate, which resulted in impact with terrain. "}