{"url": "https://www.baaa-acro.com/crash/crash-boeing-247d-chesterton-7-killed", "date": "Oct 10, 1933 at 2100 LT", "type": "Boeing 247", "operator": "United-Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Newark – Cleveland – Chicago – Oakland", "msn": "1685", "yom": 1933, "flight_number": "UA023", "city": "Chesterton", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The transcontinental flight, carrying three crew and four passengers, had originated in Newark, New Jersey, with its final destination in Oakland, California. It had already landed in Cleveland and was headed to its next stop in Chicago when it exploded en route. All aboard died in the crash, which was proven to have been deliberately caused by an on-board explosive device. Eyewitnesses on the ground reported hearing an explosion shortly after 2100LT, and saw the plane in flames at an altitude of about 1,000 feet (300 m). A second explosion followed after the plane crashed. The crash scene was adjacent to a gravel road about 5 miles (8 km) outside of Chesterton, centered in a wooded area on the Jackson Township farm of James Smiley. Pilot Captain Terrant, his co-pilot, flight attendant Alice Scribner and all four passengers were killed. Scribner was the first United flight attendant to be killed in a plane crash.", "probable_cause": "Investigators who combed through the debris were confronted with unusual evidence: the toilet and baggage compartment had been smashed into fragments. Shards of metal riddled the inside of the toilet door while the other side was free of the metal fragments. The tail section had been severed just aft of the toilet and was found mostly intact almost a mile away from the main wreckage. Melvin Purvis, head of the Chicago office of the United States Bureau of Investigation described the damage, \"Our investigation convinced me that the tragedy resulted from an explosion somewhere in the region of the baggage compartment in the rear of the plane. Everything in front of the compartment was blown forward, everything behind blown backward, and things at the side outward.\" He also noted: \"The gasoline tanks, instead of being blown out, were crushed in, showing there was no explosion in them.\" An investigator from the Porter County coroner's office, Dr. Carl Davis, and experts from the Crime Detection Laboratory at Northwestern University examined evidence from the crash, and concluded that the crash had been caused by a bomb, with nitroglycerin as the probable explosive agent. One of the passengers was seen carrying a brown package onto the plane in Newark, but investigators who found the package amidst the wreckage ruled it out as being the cause of the explosion. A rifle was found in the wreckage but it was determined to have been carried aboard as baggage for a passenger who was en route to attend a shoot at Chicago's North Shore Gun Club. Despite the efforts of the investigators, no suspect was ever identified or charged in this incident, and it remains unsolved. This is thought to be the first proven act of air sabotage in the history of commercial aviation. "}