{"url": "https://www.baaa-acro.com/crash/crash-nal-saras-near-bangalore-3-killed", "date": "Mar 6, 2009 at 1534 LT", "type": "NAL Saras", "operator": "National%20Aerospace%20Laboratories", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Bangalore - Bangalore", "msn": "SP002", "yom": 2007, "flight_number": null, "city": "Bangalore", "zone": "Karnataka", "country": "India", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2414, "captain_hours_type": 310, "copilot_hours": 2080, "copilot_hours_type": 315, "aircraft_hours": 50, "circumstances": "On 06.3.2009 Saras Prototype PT2 aircraft VT-XRM manufactured and owned by National Aerospace Laboratories, Bangalore was scheduled for carrying out its test flight n°49. Test flight programme includes general a ir tests/handling checks to ascertain the aircraft flying characteristics after the 50 hrs Scheduled servicing, dummy approach in simulated single engine configuration at 5000' AMSL, go around at 300' AGL in a simulated one engine inoperative condition, landing in a simulated one engine inoperative condition and to carry out in-flight engine shut down and relight procedure at 10000' AMSL within 130 - 150 kts speed. Tests are to be carried out as per existing SOP and test procedures and limitations and pre flight test briefing meeting. Aircraft was cleared by approved inspectors of NAL after carrying out daily inspection on 6.3.2009 for test flight n°49 and was duly accepted by the Chief test pilot. Preflight briefing was taken by the Wg Cdr (22917-S), F(P), chief test pilot was on commander seat , Wg Cdr (23165-H), F(P) - test pilot was on co-pilot seat and Sqn Ldr (24746-M), AE(M) was on Flight test engineer on board. The test team also accepted flight test schedule of flight n°49. Total duration of the tests was estimated to about 45 minutes. Engines were started at 0913 UTC at ASTE, dispersal area . All engine parameters were reported normal. After carrying out post startup and pre taxi checks, aircraft taxied out for Runway 09 at HAL airport. As pe r departure instructions after departure R/W 09 aircraft to climb on R/W heading 5000’, turn right set course to southwest -2 and in coordination with approach radar to operate upto 10 miles and level 100. Aircraft was cleared for takeoff from R/W 09 with surface wind 090º/06kts. Aircraft took-off at 0925 UTC and changed over to radar at 0926 UTC. There was no event. Aircraft was then cleared to level 100, operating up to 10 miles. After completing general handling checks at 9000’ AMSL without any events, Aircraft was stabilized with simulated single engine approach to the landing r/w 09. Single engine simulated approach was carried out. At about 0941 UTC aircraft was cleared for overshoot, wind 090/06 kts. Aircraft made overshoot at 300’ AGL. Aircraft was then changed over to radar again. At 0942 UTC aircraft was cleared to climb level 100 and proceed sector southwest 2. Aircraft right engine was throttled up to match left engine and aircraft climbed out to 9000’ AMSL in sector southwest. At about 0948 UTC aircraft reported 15 miles and FL90 and reported turning around. But HAL radar as well as BIAL radar showing level was 72 for which aircraft replied that it has descended and climbing back to 9000’ AMSL. At about 0955 UTC aircraft reported “OPS NORMAL” at 20 Nm in sector southwest 2. This was the last contact by aircraft with radar. After 0955 UTC Radar contact with the aircraft was completely lost. As per ASTE Telemetry, after turned round to point towards HAL airfield aircraft was observed about 20 miles at 9000’ AMSL with 140 kts speed. Telemetry link was good at this position Left engine was then shut down and secured following the test procedure at about 10:00:40 UTC. Pilot was in touch with Flight test director on R/T at telemetry desk. After about 47 secs, left engine relight procedure was initiated at around 9200’ AMSL. Pilot also reported to Telemetry the start of relight of the engine. Telemetry indications also showed the rise in Ng and ITT. At about 100 secs prior to crash aircraft went into sudden dive from 9200’ to 7300’ for about 13 secs. Meanwhile During the relighting of left engine, FTD desk also lost RT contact with aircraft about 37 secs prior to crash and telemetry link with the aircraft was also intermittent. At 37 secs prior to crash when Telemetry called aircraft “ can you call up. What is going on”, aircraft replied “Standby” this was the last contact of Telemetry with aircraft. After that there was no contact from the pilot. Just before 7 secs of crash when the telemetry data signal was restored aircraft already lost to the height of 4260’ AMSL(1900’AGL) and in continuous loss of height and Ng was about 31%. There was no response from pilots even after repeated calls from FTD desk. Aircraft was rapidly losing the height without any control. Cockpit voice recording clearly showed that on last moments just 10 secs prior to crash ,commander called out “ Aircraft has departed” indicating aircraft completely gone out of control. During the last moment of crash telemetry recorded Ng : about 54% (63% as per FDR), Engine oil pressure 88, fuel flow 94%,ITT 647 deg C, indicating engine relight was successful. But by the time aircraft was almost on ground. Aircraft crashed at about 1004 UTC (10:03:44). All possible communication means including through en -route traffic to contact the aircraft went in vain. Search operation by ALH helicopter (A67) ,Chetak(T45) and T55 was effected. At about 1033 UTC police control room reported that an aircraft had crashed near Bidadi. After extensive search efforts, at about 1100 UTC, A67 found out the crash site having bearing 251° and 17 Nm from HAL airport. Later it was affirmed that the aircraft crashed at a village called Sehsagirihalli (close to wonderland amusement park) near Bidadi and 37 km by road(off Mysore road) Southwest of HAL airport, Bangalore. The crash site was a wide -open residential plot area of uneven hard terrain surrounded by poles and wild plants. It was on a radial of 251° /17 NM from HAL, Bangalore airport having coordinates LAT : N12° 50’56”, LONG: E077° 23’46”). All the three persons on board were charred to death and were on their seats. There was post impact fire. Aircraft fuselage was broken from rear of the main plane and found in an inverted position. The vertical fin leading edge was facing the ground and the respective tail mounted engines by the side of it. The nose portion of the aircraft was facing East direction. Aircraft was completely destroyed due impact and fire.", "probable_cause": "Incorrect relight procedure devised by the designer and adopted by the crew at insufficient height leading to rapid loss of altitude and abnormal behavior of aircraft resulted into accident.\r\nContributory factors:\r\na) Lack of crew coordination and cockpit procedures,\r\nb) Handling of the controls,\r\nc) Non-aborting of flight by the crew in coordination with the flight test Director after failure of first relight attempt,\r\nd) Devising engine relight procedures by NAL without consulting the propeller manufacturer."}