{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b100-king-air-montmagny", "date": "Sep 22, 2010 at 1700 LT", "type": "Beechcraft 100 King Air", "operator": "Max-Aviation2", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Montmagny - Montreal", "msn": "BE-39", "yom": 1978, "flight_number": null, "city": "Montmagny", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4500, "captain_hours_type": 2500, "copilot_hours": 7800, "copilot_hours_type": 675, "aircraft_hours": null, "circumstances": "The aircraft was operating as flight MAX100 on an instrument flight rules flight from Montmagny to Montreal/St-Hubert, Quebec, with 2 pilots and 4 passengers on board. At approximately 1700 Eastern Daylight Time, the aircraft moved into position on the threshold of 3010-foot-long runway 26 and initiated the take-off. On the rotation, at approximately 100 knots, the flight crew saw numerous birds in the last quarter of the runway. While getting airborne, the aircraft struck the birds and the left engine lost power, causing the aircraft to yaw and roll to the left. The aircraft lost altitude and touched the runway to the left of the centre line and less than 100 feet from the runway end. The take-off was aborted and the aircraft overran the runway, coming to rest in a field 885 feet from the runway end. All occupants evacuated the aircraft via the main door. There were no injuries. The aircraft was substantially damaged.", "probable_cause": "Findings As To Causes and Contributing Factors: \r\nThe bird strike occurred on take-off at an altitude of less than 50 feet. Gulls were ingested in the left engine, which then lost power.\r\nAfter the loss of engine power, the flight crew had difficulty controlling the aircraft. The aircraft touched the ground, forcing the pilot flying to abort the take-off when the runway remaining was insufficient to stop the aircraft, resulting in the runway overrun.\r\nFindings As To Risks: \r\nAlthough a cannon was in place, it was not working on the day of the accident, which increased the risk of a bird strike.\r\nThe presence of a goose and duck farm outside the airport perimeter but near a runway increases the risk of attracting gulls.\r\nOperators subject to Canadian Aviation Regulations Subpart 703 are not prohibited from having an aircraft take off from a runway that is shorter than the accelerate-stop distance of that aircraft as determined from the performance diagrams. Consequently, travellers carried by these operators are exposed to the risks associated with a runway overrun when a take-off is aborted.\r\nThe absence of a CVR makes it harder to ascertain material facts. Consequently, investigations can take more time, resulting in delays which compromise public safety."}