{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c-45g-expeditor-hinckley-12-killed", "date": "Sep 7, 1992 at 1240 LT", "type": "Beechcraft C-45 Expeditor", "operator": "EXA", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Hinckley - Hinckley", "msn": "AF-461", "yom": 1951, "flight_number": null, "city": "Hinckley", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 3030, "captain_hours_type": 867, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7780, "circumstances": "After takeoff, the airplane was seen at low altitude trailing smoke from the left engine. Witnesses saw the wings 'tipping' back and forth, then a wing dropped and hit the ground. Examination revealed that a supercharger bearing had failed in the left engine. The left engine had been recently installed by non-certificated personnel after being inactive for 18 years without preservation. The airplane had flown about 184 hours since the last annual inspection; no record of subsequent 100-hr inspection. The left prop blades were found in an intermediate position between the operating range and the feathered position. The left prop was changed several weeks prior to the accident. There is no evidence that the left prop had ever been successfully cycled to the full feather position. The operator and pilots were not aware of hamilton standard SB 657 recommending full-feather checks every 30 days. Left prop feathering motor relays not recovered. All 11 parachutists were found in center part of fuselage; no evidence of restraint usage. All 12 occupants were killed. ", "probable_cause": "Inadequate maintenance and inspection by the operator which resulted in an engine power loss during the critical takeoff phase of flight. In addition, the pilot did not, or was unable to, attain a full feather position on the left engine propeller, which would have most likely enabled the airplane to sustain minimum control airspeed."}