{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-whitsunday-island", "date": "Mar 6, 2003 at 1615 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Air%20Whitsunday", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Hamilton Island - Whitsunday Island", "msn": "1257", "yom": 1958, "flight_number": null, "city": "Whitsunday Island", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1757, "captain_hours_type": 50, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot  was conducting a charter positioning flight from Hamilton Island Marina to Whitehaven Beach, Whitsunday Island. At approximately 1615LT, pilot was landing the aircraft towards the south, about 600 metres off the beach, to avoid mechanical turbulence associated with terrain at the southern end of Whitehaven Beach. He reported that the approach and flare were normal, however, as the aircraft touched down on the right float, the aircraft swung sharply right and then sharply left. The left wing contacted the water, and the aircraft overturned. The pilot exited the upturned aircraft through the left rear passenger door and activated a 121.5 MHz distress beacon. ", "probable_cause": "The wind strength and sea state at the time of the occurrence were not ideal for floatplane operations, particularly given the pilot's relative lack of experience in open water operations. In comparison, it was unlikely the non-standard floats contributed significantly to the development of the accident. The loss of directional control suggests a lower than ideal pitch attitude at touchdown, a configuration which reduces a floatplane's directional stability. The pilot's use of a distress beacon for search and rescue purposes was appropriate, however the timeliness of his rescue from the upturned aircraft can be attributed to the effectiveness of the company's flight monitoring system and subsequent search and rescue actions."}