{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-buttles-farm-4-killed", "date": "Nov 14, 2015 at 1134 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "WWSL Inc. Trustee", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Fairoaks – Dunkeswell", "msn": "46-22085", "yom": 1989, "flight_number": null, "city": "Buttles Farm", "zone": "Somerset", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 600, "captain_hours_type": 260, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was approaching Dunkeswell Airfield, Devon after an uneventful flight from Fairoaks, Surrey. The weather at Dunkeswell was overcast, with rain. The pilot held an IMC rating but there is no published instrument approach procedure at Dunkeswell. As the aircraft turned onto the final approach, it commenced a descent on what appeared to be a normal approach path but then climbed rapidly, probably entering cloud. The aircraft then seems to have stalled, turned left and descended to “just below the clouds”, before it climbed steeply again and “disappeared into cloud”. Shortly after, the aircraft was observed descending out of the cloud in a steep nose-down attitude, in what appears to have been a spin, before striking the ground. All four occupants were fatally injured. ", "probable_cause": "Whilst positioning for an approach to Dunkeswell Airfield, the aircraft suddenly pitched nose-up and entered cloud. This rapid change in attitude would have been disorientating for the pilot, especially in IMC, and, whilst the aircraft was probably still controllable, recovery from this unusual attitude may have been beyond his capabilities. The aircraft appears to have stalled, turned left and descended steeply out of cloud, before climbing rapidly back into cloud. It probably then stalled again and entered a spin from which it did not recover. All four occupants were fatally injured when the aircraft struck the ground. The investigation was unable to determine with certainty the reason for the initial rapid climb. However, it was considered possible that the pilot had initiated the preceding descent by overriding the autopilot. This would have caused the autopilot to trim nose-up, increasing the force against the pilot’s manual input. Such an out-of-trim condition combined with entry into cloud could have contributed to an unintentional and disorientating pitch-up manoeuvre. "}