{"url": "https://www.baaa-acro.com/crash/crash-avro-652-anson-i-ballycastle-3-killed", "date": "Oct 18, 1943 at 2115 LT", "type": "Avro 652 Anson", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Mountains", "schedule": "Squires Gate - Squires Gate", "msn": null, "yom": null, "flight_number": null, "city": "Ballycastle", "zone": "Antrim", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 1, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft left RAF Squires Gate at approx 1940LT to carry out a night non-operational navigation B3 exercise. It crashed at 2115LT hours in Ballycastle, County Antrim, North Ireland. Two of the crew were killed and two injured. The aircraft was being flown by Flying Officer Cooper and he attempted a forced-landing, but struck a tree before crashing into a house in Drumavoley Road, Glenxhesk, Ballycastle, which at the time was owned by Charles Blaney. Mr Blaney’s wife and their five children were at home as was a young girl from County Donegal, 22 year old Josephine McGroarty, who was staying there at the time. She was standing outside the house with her boyfriend John Greer from Ballycastle. John was thrown clear as the aircraft came sliding into a fatal impact with the house. Josephine McGroarty was tragically killed as were two of those on board the aircraft. One of these was a high-ranking free-Polish officer, Wing Commander Heller, who was based at Jurby in the Isle of Man. The pilot, Flying Officer Cooper, was thrown from the aircraft and he landed in the children’s room, none of whom miraculously were injured, nor were the Blaneys themselves. Wing Commander Heller was later buried in Movilla cemetery, Newtownards, Co Down. The Pilot who survived the crash, later stated; “On the last leg of the exercise, the aircraft was flying at 2,400 feet. It was however eleven miles to the starboard of track, a fact not known to the crew. I decided to descend to 2,000 feet to avoid another aircraft. We approached from the downwind side of the mountain, and the wind was 150 degrees at 35/40 kms per hour. There would have been an extensively strong down draft as we approached the mountainside. After the aircraft struck Knockgavd, SOS procedures were carried out and preparations were made for a ditching.” \nCrew: \nF/O J. G. Cooper, pilot,\nW/Cdr W. R. Heiler, navigator, †\nF/Lt J. H. Dunn, navigator, \nW/O E. G. Clarke, wireless operator and air gunner. †\nSource: \nhttp://www.secondworldwarni.org/details.aspx?id=2&pagerecordid=1079&themeid=2", "probable_cause": null}