{"url": "https://www.baaa-acro.com/crash/crash-airbus-a310-324-khartoum-30-killed", "date": "Jun 10, 2008 at 2026 LT", "type": "Airbus A310", "operator": "Sudan%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Amman – Damascus – Khartoum", "msn": "548", "yom": 1990, "flight_number": "SD109", "city": "Khartoum", "zone": "Khartoum (الخرطوم)", "country": "Sudan", "region": "Africa", "crew_on_board": 11, "crew_fatalities": 1, "pax_on_board": 203, "pax_fatalities": 29, "other_fatalities": 0, "total_fatalities": 30, "captain_hours": 14180, "captain_hours_type": 3088, "copilot_hours": 9879, "copilot_hours_type": 3347, "aircraft_hours": 53233, "circumstances": "The Airbus 310 serial number 548 owned by Sudan Airways Was entered in Sudan Civil Register on 15/09/2007 , designated registration marks ST-ATN in accordance to registration certificate No. 0493 dated 15/09/2007 and issued with Certificate of airworthiness No AWP/COA/0203/2007 dated 19/09/2007. On the morning of 10th June at 8:30 hrs (local time 05:30 UTC) after arriving from Cairo with a deactivated no 1 engine reverse as being a carry forward defect and being labeled according to MEL, the captain accepted the aircraft to carry out its scheduled flight to Amman via Damascus. The trip en-route to Amman was uneventful. Same day in the afternoon, the Airbus A310, ST-ATN, was en-route flying from Damascus (Syria) to Khartoum (Sudan) with 203 passengers and 11 crew members on board. The Airbus approached Khartoum in the afternoon and due to bad weather conditions, the captain decided to divert to Port Sudan. The aircraft landed Port Sudan Airport normally and was refuelled with 20 tons of Jet A1. As mentioned by the Captain that he was in contact with Khartoum enquiring about the weather. After staying on ground at Port Sudan for about 1:15 hour, and being informed that the weather was getting better, the Captain decided to return back to Khartoum. A310, ST-ATN, took off to Khartoum where the captain initiated a night approach for the runway 36 as pilot flying. He got the clearance to land after the controller provided him with wind information (320° / 7 Kt) and runway condition (wet). The left engine thrust reverser was unserviceable and inhibited as per Minimum Equipment List (MEL) procedures. The aircraft landed smoothly about 17:26 UTC. R/W 36 landing and within 900 meters range from the threshold of R/W 36 as stated by the flying pilot. The captain reported that he experienced some difficulties in maintaining the aircraft on the centre line just after setting both thrust levers in the reverse position. Then he did not succeed in slowing down the aircraft nor could stop it before the end of the runway. The aircraft longitudinally overran the runway and came to a stop 215 meters after the runway end. Then it caught fire on its right side. The right hand slides could not be deployed, the crew and the passengers evacuated the aircraft from the left front slide, twenty nine passengers and one cabin crew were fatally injured.", "probable_cause": "The accident was due to a long flaring distance (900 meters from R/W threshold) on a wet slippery runway without selecting Auto brake and with one deactivated engine reverse in such rainy conditions. The remaining available landing distance turned out to be too short to allow the captain to stop the aircraft before the end of the runway.\r\nContributing factors:\r\nThe wind information was not appropriate as it was tailwind at time of landing. The crew was not aware about the aircraft ground speed and the tailwind."}