{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-049-constellation-al-mayadin-14-killed", "date": "Jun 19, 1947 at 0140 LT", "type": "Lockheed L-049 Constellation", "operator": "Pan%20Am.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Desert", "schedule": "New York – Los Angeles – Honolulu – Tokyo – Calcutta – Karachi – Istanbul – London – Gander – Shannon – New York", "msn": "2045", "yom": 1946, "flight_number": "PA121", "city": "Al Mayadin", "zone": "Deir ez-Zor Governorate (مُحافظة دير الزور‎)", "country": "Syria", "region": "Asia", "crew_on_board": 10, "crew_fatalities": 7, "pax_on_board": 26, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 12768, "captain_hours_type": 1009, "copilot_hours": 3178, "copilot_hours_type": 674, "aircraft_hours": 2645, "circumstances": "Flight 121 departed from Karachi at 1537 June 18, 1947, for a return trip to the United States. The climb to the cruising altitude of' 18,500 feet was routine, and the flight was proceeding “direct” to Istanbul, the first intended point of landing, estimating its arrival there to be 0208 the next day. Five hours after take-off trouble developed in the No. 1 engine, and the No. 1 propeller was feathered. The captain, J H. Hart, decided to continue to Istanbul with the use of three engines, however, it soon became evident that at an altitude of 18,500 feet the airspeed obtainable was not sufficient to provide adequate cooling for the engines. even though climb power was applied. Power was accordingly reduced and altitude was gradually lost. At 17,500 feet the engines still overheated and the descent was continued to 10,000 feet. At 2140, approximately one hour after the failure of engine No 1, the flight advised its company radio in Karachi of the engine trouble, following which it reported its 2200 position. This report placed the aircraft at 14,000 feet, 50 miles east of Baghdad, Iraq, and 90 miles east of the Royal Air Force Field at Habbaniya, Iraq Shortly after this report Habbaniya Tower was advised by the flight that its approximate position was over Baghdad. at an altitude of 10,000 feet, and the flight requested Habbaniya Tower to inform the civilian airfields in their area that the aircraft was proceeding with the use of only three engines to Istanbul Habbaniya Tower replied, stating that no airfields would be open until dawn, and suggested that an emergency landing be made at Habbaniya Flight 121, however, affirmed Its intention to continue, and added that if it were impossible to reach Istanbul, a landing would be made at Damascus, Syria Habbaniya Tower answered, at 2225, that all airfields in the Damascus area were closed until 0400 and again suggested that the flight land at Habbaniya. The flight again stated that It would continue to Istanbul, but that it would turn back to Habbaniya if it experienced any more trouble. Contemporaneous with this communication to Habbaniya Tower the flight sent a message, received in Karachi, and relayed to Damascus, requesting that Damascus Radio be alerted to stand by, and that the airport be opened. At 2308, June 18, Damascus Radio was on the air, and the field was opened as had been re quested. At approximately 2300 the flight reported its position to be 75 miles north west of Habbaniya at 10,000 feet Fifteen to thirty minutes later the purser seated in the passenger cabin noticed that the \"fasten seat belt-no smoking” sign had come on, and he Immediately started to awaken the passengers so that they might fasten themselves in their seats. Suddenly. the entire cabin became illuminated from a fire which had started in Zone 1 of the No 2 engine nacelle. A report of this fire was received at 2330. by the Habbaniya direction finding station. at which time the flight was reporting a position of 34 38 degrees north and 41 05 degrees east, a point 170 statute miles northwest of Habbaniya, and 290 miles northeast of Damascus Immediately after the fire started in engine No. 2 a rapid descent was made for the purpose of crash landing the aircraft, and six to seven minutes later on the landing approach the No. 2 engine fell from the aircraft The wing in the area of the No 2 engine, however, continued to burn intensely. Less than a minute after the No 2 engine fell from the aircraft a wheels-up landing was made on relatively smooth, hard-packed desert sand. The left wing tip made the first contact with the ground, then the No 1 propeller and then the left wing at the No 2 engine position. The impact tore the left wing from the fuselage near its root, and caused the aircraft to ground loop violently to the left. During the course of the ground loop the aircraft turned around its longitudinal axis 180 degrees, skidded backwards for a distance of 210 feet, then came to rest in flames 400 feet from the first point of impact, and headed opposite to its course of landing.", "probable_cause": "The Board determines that the probable cause of this accident was a fire which resulted from an attempt to feather the No. 2 propeller after the failure of the No. 2 engine thrust bearing"}