{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-20-marquise-kenefic-1-killed", "date": "May 7, 1991 at 0510 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Corporate Aviation Services", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Tulsa - Dallas", "msn": "0184", "yom": 1970, "flight_number": null, "city": "Kenefic", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3850, "captain_hours_type": 1400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilots of Mitsubishi MU-2, N106MA, and a Cessna 310 with no registration number elected to fly in formation at night, though neither pilot had formal training in formation flying nor experience in night formation. They joined up in flight and the MU-2 pilot was flying on the wing of the Cessna 310. The MU-2 pilot communicated that he was going to change positions from the right side to the left side of the 310C. The Cessna 310 pilot and his passenger lost sight of the MU-2 when it dropped back to a position in the rear of the Cessna 310. Soon thereafter, the two aircraft collided and the MU-2 went out of control and crashed. The right horizontal stabilizer was torn from the Cessna 310 and the 310's empennage, right wing and props were damaged, but it was landed without injury to its occupants. An investigation revealed the tail light of the Cessna 310 was inoperative. Sole on board, the pilot was killed. \n", "probable_cause": "Improper planning/decision by the pilots of both aircraft, and the mitsubishi pilot's misjudgment of his position, while attempting to fly formation at night with an aircraft that did not have all navigation lights operative. Factors related to the accident were: both pilot's lack of training in the type of operation, darkness, inoperative navigation (tail) light on the Cessna 310, and the lack of visual perception that would have been available to the mitsubishi pilot."}