{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-3k2-cuzco", "date": "Oct 23, 2015 at 1115 LT", "type": "Boeing 737-300", "operator": "Peruvian-Airlines.png", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lima - Cuzco", "msn": "24329/1858", "yom": 1990, "flight_number": "P9216", "city": "Cuzco-Alejandro Velasco Astete", "zone": "Cuzco", "country": "Peru", "region": "South America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 133, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6352, "captain_hours_type": 1971, "copilot_hours": 1455, "copilot_hours_type": 1219, "aircraft_hours": 74018, "circumstances": "Following an uneventful flight from Lima, the crew started the descent to Cuzco-Alejandro Velasco Astete Airport Runway 28. On approach, the aircraft was configured for landing and flaps were deployed to 15°. Following a smooth landing, the crew started the braking procedure when, eight seconds after touchdown, he noticed vibrations coming from the left main gear. At a speed of 100 knots, the right main gear collapsed. The aircraft rolled for few hundred metres then came to a halt on the runway. All 139 occupants evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": "Unstable approach and inadequate landing technique for high altitude fields, which resulted in increased landing speed, the start of the flare manoeuvre at higher altitude, and low descent speed, which made the OB-2040-P aircraft make soft contact with the runway, causing inefficiency in operation of the shimmy damper, which did not prevent uncontrolled oscillation of the shock absorbers.\r\nContributing factors:\r\n- Lack of instruction and training in simulators that include techniques and maneuvers of landing at high altitude fields, with emphasis on speed control at landing.\r\n- Lack of a performance analysis process, through the use of flight recorders or other installed data recording equipment and flight parameters, by the operating company, to enable supervision, control and corrective measures in the operational use of its aircraft."}