{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-i-houston-2-killed", "date": "Nov 5, 2005 at 0958 LT", "type": "Cessna 500 Citation", "operator": "HCEA", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Houston - Corpus Christi", "msn": "500-0004", "yom": 1972, "flight_number": null, "city": "Houston-William P. Hobby", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4100, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6230, "circumstances": "The 4,100-hour commercial pilot lost directional control of the single-pilot twin-engine turbojet while taking off from runway 22 (7,602-feet long by 150-feet wide), and impacted the ground about 3,750 feet from the point of departure. Several witnesses reported that the airplane climbed to approximately 150 feet, rolled to the right, descended, and then struck the ground inverted. The weather was day VFR and the wind was reported from 170 degrees at 10 knots. Examination of the wreckage revealed that none of the main-entry door latching pins were in their fully locked position. The airplane's flight controls and engines did not disclose any mechanical discrepancies. The flaps were in the takeoff position and the control lock was unlocked. The pilot had not flown the airplane for over nine months because of extensive maintenance; the accident occurred on its first test flight out of maintenance. Since the pilots flight records were not found, it is unknown how much flight time the pilot had flown in the last nine months. The other airplane that the pilot owned was a Cessna 650, but witnesses stated that the pilot was only qualified as a co-pilot. Most of the maintenance records that were located were not completed; an approval for return-to-service was not found. Another airplane that had declared an emergency was on a 10-mile final when the tower cleared the accident airplane for takeoff, with no delay on the takeoff roll. No additional communication or distress calls were reported from the accident airplane. The airplane was not equipped with either a flight data recorder or a cockpit voice recorder. No anomalies were found on either engine that could have prevented normal engine operation.", "probable_cause": "The pilot's failure to maintain directional control of the airplane resulting in an inadvertent stall/mush. Contributing factors were the unsecured passenger door and the pilot's diverted attention."}