{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-e20-near-rio-bonito-19-killed", "date": "Mar 31, 2006 at 1739 LT", "type": "Let L-410", "operator": "TEAM", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Macaé – Rio de Janeiro", "msn": "91 25 32", "yom": 1991, "flight_number": "TIM6865", "city": "Rio Bonito", "zone": "Rio de Janeiro", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 17, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 19, "captain_hours": 10000, "captain_hours_type": 39, "copilot_hours": 5220, "copilot_hours_type": 1719, "aircraft_hours": 2739, "circumstances": "The twin engine aircraft departed Macaé Airport at 1719LT on a flight to Rio de Janeiro-Santos Dumont Airport with 17 passengers and two pilots on board. Few minutes later, the copilot cancelled the IFR flight plan and continued under VFR mode at an altitude of 4,500 feet. Approaching São Pedro da Aldeia, the copilot was cleared to descend to 2,000 feet to avoid poor weather conditions. Later, while approaching Saquarema, the crew initiated a left turn to avoid clouds when shortly later, at an altitude of 1,920 feet, the aircraft struck the Pedra Bonita Peak. The wreckage was found six km southeast of Rio Bonito in a dense wooded area. The aircraft was totally destroyed and all 19 occupants were killed. ", "probable_cause": "Controlled flight into terrain after the crew decided to continue under VFR mode in IMC conditions. The following contributing factors were identified:\r\n- Overconfidence on part of the captain who was familiar with the area, \r\n- The organizational culture of the company proved to be complacent by not inhibiting the adoption of procedures incompatible with flight safety, such as the low altitude flights made by the instructor captain,\r\n- There was inadequate assessment of the situation by the crew, causing them to fly at a lower altitude than the safe limits under visual conditions unsuitable for visual flight, resulting in the collision of the aircraft with high ground,\r\n- The use of human resources for the operation of the aircraft was unsuitable because of failure to comply with operational standards, leading the crew to perform a passenger flight to the lower altitude limits of safety, under inadequate visual conditions,\r\n- The preparation for the flight proved inadequate because the crew did not have a meteorological analysis of the appropriate level of flight performed, considering that the conditions for the region were overshadowing the Serra do Mar and surrounding areas of low clouds and / or mist, especially on the slopes of the mountain,\r\n- The weather conditions prevailing in the region made visual flight impossible, resulting in the concealment of the elevation at which the aircraft crashed,\r\n- The pilots intentionally not complying with rules of air traffic and civil aviation rules, without grounds, performing flight at low altitude, under conditions of visibility below the limits established for VFR flight, colliding with high grounD,\r\n- The company has not taken appropriate supervisory measures, enabling the existence of a culture of undeveloped flight safety, which prevented advance identification of actions taken by the crew and injured misconception exists in the CRM business, which represented a potential risk to their operations, as well as by the failure of some educational measures provided for in its PPAA (Plan for the Prevention of Aeronautical Accidents)."}