{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-15-dc-skymaster-near-edmonton-2-killed", "date": "Oct 27, 1948 at 1650 LT", "type": "Douglas C-54 Skymaster", "operator": "Northwest%20Airlines2", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Minneapolis – Edmonton – Anchorage – Tokyo", "msn": "10406", "yom": 1944, "flight_number": "NW6427", "city": "Edmonton", "zone": "Alberta", "country": "Canada", "region": "North America", "crew_on_board": 5, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8114, "captain_hours_type": 1669, "copilot_hours": 2406, "copilot_hours_type": 406, "aircraft_hours": null, "circumstances": "First Officer Upham made the takeoff, and shortly after the airplane became airborne Captain Christian cut the left outboard engine and feathered the propeller, creating a simulated engine failure on takeoff. The purpose was to instruct the first officer in emergency procedures. The airplane climbed very slowly and, veering slightly to the left, passed over the center of Edmonton at an altitude of 400 to 500 feet. Then the flight turned to the right approximately 180 degrees to get on course toward Anchorage. This brought it back over town and Captain Christian unfeathered the propeller. Power was restored to left outboard engine and the airplane continued to climb. During this interval the tower asked the crew if they had taken off on three engines and received a negative reply. At 1645 Trans-Canada Airlines Communications received the following message from Flight 6427, \"We were off at 32, cruising 7000 at 44, estimating Whitecourt at 02, out (from the ramp) at 22.\" No indication of trouble was given and no further messages were received from the flight. Although this message indicates the flight had reached its assigned cruising altitude of 7000 feet MSL, all evidence points to the fact that it was never above 3000 feet MSL, (700 feet above the terrain). Surviving crew members stated that after reaching an altitude of approximately 700 feet above the terrain, Captain Christian feathered the propellers of both left engines and continued to instruct First Officer Upham in emergency procedures. Shortly after this, the crew began to realize that the airplane was getting dangerously low over a wooded area and rising terrain and that the situation was rapidly developing into an actual emergency. The captain took over the controls and attempted to restart the left engines. However, before sufficient power could be restored the airplane began striking the tree tops. It crashed and burned several hundred feet beyond the point of initial contact with the trees. Two crew members were killed while three others were injured. The aircraft was destroyed by impact forces and a post crash fire. ", "probable_cause": "Investigation disclosed no evidence of mechanical failure or malfunctioning of the aircraft or engines and, according to surviving crew members, the only irregularity during the flight was the intentional cutting of the left engines. According to Northwest Airlines, this flight, while not subject to scheduled air carrier rules, was to be operated in a manner similar to their scheduled flights operating over the same route. A company representative stated that Northwest has at no time authorized the practicing of emergency procedures while the airplane is at a low altitude over a congested area, or the feathering of propellers immediately after takeoff. Simulated emergency procedures are permissible only during pilot checks and training flights. The Board determines that the probable cause of the accident was the captain's action in undertaking simulated emergency procedures at a dangerously low altitude."}