{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-dysart-2-killed", "date": "Mar 3, 1982 at 0453 LT", "type": "Piper PA-31-310 Navajo", "operator": "Coal Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Rockhampton – Dysart", "msn": "31-588", "yom": 1969, "flight_number": null, "city": "Dysart", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was being operated on a regular freight carrying run between Dysart and Rockhampton. On the evening preceding the accident, the aircraft departed Dysart at 2045 hours, arriving at Rockhampton at 2139 hours. At 0222 hours on the following morning the pilot telephoned Brisbane Flight Service Centre to obtain an update on the weather for the return flight to Dysart. The forecast indicated that at the time of arrival at Dysart, light rain with 5 oktas of cloud at 700 feet above ground level, could be expected. The pilot nominated Rockhampton as the alternate for Dysart in the event that weather conditions at the latter aerodrome precluded a safe approach and landing. The aircraft was refuelled to give a total fuel endurance of 290 minutes, and after loading departed Rockhampton at 0354 hours. At 0435 hours, the pilot reported that descent had been commenced into Dysart and because of poor reception on High Frequency radio channels further communications with VH-CLU were relayed by another aircraft in the area, VH-EEF on Very High Frequency channels. After communications with VH-CLU, the pilot of VH-EEF advised Brisbane Flight Service Unit (FSU) at 0453 hours, that the runway lighting was not yet displayed. The runway lighting at Dysart was provided by a number of hand-lit flares. The lighting of these flares was carried out by an employee of the company operating VH-CLU, and normally took about ten minutes. On this occasion the employee had overslept and arrived at the aerodrome at about the same time that the aircraft flew overhead. At 0501 hours further attempts by the pilot of VH-EEF and Brisbane FSU to contact VH-CLU were unsuccessful. The wreckage of the aircraft was later located about 800 metres to the west of the aerodrome. The aircraft had struck trees while heading in a direction aligned with runway 14 but displaced to the west of the runway. It had been destroyed as a result of the impact forces. Witnesses reported that when VH-CLU arrived at Dysart it was not raining, however, low cloud was present. The aircraft was observed to complete three orbits of the aerodrome and at times during these orbits it was obscured by cloud. Both occupants were killed. ", "probable_cause": "The only fault found with the aircraft during the investigation was a failed fuel pump on the right engine. It was established that the right engine was operating on impact and the failure of the fuel pump is not considered to have substantially affected the operation of the aircraft. The reason the aircraft crashed was not established.\r\nSignificant Factors:\r\n1. Low cloud was present at Dysart for the arrival of VH-CLU.\r\n2. The runway lighting had not been illuminated by the time VH-CLU arrived overhead the aerodrome.\r\n3. The pilot attempted to hold in the vicinity of the aerodrome at low level, at night and in marginal weather conditions."}