{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-99a-airliner-missoula", "date": "Oct 17, 1998 at 0230 LT", "type": "Beechcraft 99 Airliner", "operator": "Alpine-Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Billings - Missoula", "msn": "U-102", "yom": 1969, "flight_number": "AIP5010", "city": "Missoula", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4567, "captain_hours_type": 667, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 39685, "circumstances": "While flying a night visual approach, the co-pilot flared too high above the runway. As the aircraft floated down the runway, the speed decreased, and the pilot-in-command took control. Because he felt the aircraft was approaching a stall, he initiated a go-around. During the attempted go-around, the pilot-in-command found it necessary to keep both hands on the control wheel due to the fact that the aircraft had been trimmed to the full nose-up position during the landing flare. Even with both hands on the control wheel, the aircraft became very difficult to control. Although the co-pilot moved the throttles to maximum power and began retraction of the flaps, the pilot-in-command's remedial action had occurred too late to successfully execute the go-around. It was later discovered that during the operator's initial training, both crew members had been taught to apply full nose-up trim after crossing the runway threshold and reducing the power to idle. This action, which the operator eliminated from the landing sequence procedure after this accident, was inconsistent with the instructions in the Beech 99 Pilots Operating Manual. ", "probable_cause": "The pilot-in-command's delayed remedial action in response to the co-pilot's improper landing flare, and the co-pilot's application of excessive (full nose-up) trim during the landing flare as taught in the operator's initial aircrew training program. Factors include the co-pilot's improper flare and his lack of total experience in this type of aircraft. "}