{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-90-dl-numancia-1-killed", "date": "Dec 21, 1964 at 1840 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Fleming Airways System Transport", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Kalibo – Manila", "msn": "20396", "yom": 1944, "flight_number": null, "city": "Numancia", "zone": "Aklan", "country": "Philippines", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 36, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6000, "captain_hours_type": 4000, "copilot_hours": 1000, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a non-scheduled flight from Kalibo to Manila. It took off from runway 05 at 1740 hours Philippine local time and the co-pilot testified that the take-off was normal and all engine instruments were indicating within normal operating range throughout the take-off and during the initial climb. He further testified that approximately 20 minutes after take-off, severe vibration and misses, decreasing oil pressure and increasing oil temperature of the left-hand engine, were noted as the airplane was climbing to 2,200 feet. The left-hand engine was shut down, its propeller feathered, and shortly after the pilot-in-command reversed course and descended with the intention of landing at either Kalibo or Roxas Airports. Neither airport was rated for night operations. The flight proceeded to Kalibo. Precipitation was encountered on the way and the visibility was so poor that the crew failed to make visual contact with Kalibo Airport. At 1823 hours, a climb to 2,000 feet was attempted to clear the terrain on the way to Bacolod Airport, the nearest airport available for night operations. However, with METO power on the remaining engine, the aircraft not only failed to climb but also failed to maintain altitude with the airspeed decreasing to 80 mph. Several attempts to climb were made but were discontinued due to pre-stall warning. At 1835 hours with 500 feet altitude, the pilot-in-command decided to ditch and warned the passengers accordingly. At 1839 hours, the ditching was attempted but the airplane collided with coconut trees located approximately 500 feet from the Barrio Camansi Norte shoreline and crashed on the muddy bed of an abandoned fishpond on a heading of 300°, approximately 160 feet from the point of initial collision. The accident occurred around 1840 hours. ", "probable_cause": "The Board determined that the probable cause of the accident was failure to maintain safe single-engine speed and altitude following failure of the left engine. The precipitation and poor visibility prevailing at the time of the accident over Kalibo and its vicinity and the failure on the part of the maintenance personnel to take action to correct discrepancies logged in the aircraft logbook, individually or collectively contributed to the cause of the accident. "}