{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-20c-jamestown", "date": "Dec 21, 2008 at 0100 LT", "type": "Dassault Falcon 20", "operator": "Ameristar%20Jet%20Charter2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tulsa – Jamestown", "msn": "65", "yom": 1966, "flight_number": null, "city": "Jamestown-Chautauqua County", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3028, "captain_hours_type": 1160, "copilot_hours": 2086, "copilot_hours_type": 80, "aircraft_hours": 16360, "circumstances": "The co-pilot was performing a nighttime approach and landing to runway 25. No runway condition reports were received by the flight crew while airborne, and a NOTAM was in effect, stating, “thin loose snow over patchy thin ice.” After landing, the co-pilot called out that the airplane was sliding and the wheel brakes were ineffective. The captain took the controls, activated the air brakes, and instructed the co-pilot to deploy the drag chute. The crew could not stop the airplane in the remaining runway distance and the airplane overran the runway by approximately 100 feet. After departing the runway end, the landing gear contacted a snow berm that was the result of earlier plowing. The captain turned the airplane around and taxied to the ramp. Subsequent inspection of the airplane revealed a fractured nose gear strut and buckling of the fuselage. The spring-loaded drag chute extractor cap activated, but the parachute remained in its tail cone container. Both flight crewmembers reported that the runway was icy at the time of the accident and braking action was “nil.” The airport manager reported that when the airplane landed, no airport staff were on duty and had not been for several hours. He also reported that when the airport staff left for the evening, the runway conditions were adequate. The runway had been plowed and sanded approximately 20 hours prior to the accident, sanded two more times during the day, and no measurable precipitation was recorded within that time frame. The reason that the drag chute failed to deploy was not determined.", "probable_cause": "The inability to stop the airplane on the remaining runway because of icy runway conditions. A factor was the failure of the drag chute to properly deploy."}