{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-820c-navajo-londrina-8-killed", "date": "Jul 31, 2016 at 2057 LT", "type": "Embraer EMB-820 Navajo/Carajá", "operator": "Fenatracoop", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Cuiabá – Londrina", "msn": "820-030", "yom": 1976, "flight_number": null, "city": "Londrina", "zone": "Paraná", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 2833, "captain_hours_type": null, "copilot_hours": 1567, "copilot_hours_type": null, "aircraft_hours": 3674, "circumstances": "Owned by Fenatracoop (Federação Nacional dos Trabalhadores Celestitas nas Cooperativas no Brasil), the twin engine aircraft departed Cuiabá-Marechal Rondon Airport on a flight to Londrina, carrying two pilots and six passengers, three adults and three children. On final approach to Londrina-Governador José Richa Runway 13, the pilot informed ATC about a loss of power on the left engine. Shortly later, control was lost and the aircraft crashed on a hangar housing six tanker trucks and located 9,2 km short of runway. Several explosions occurred and the aircraft and the hangar were totally destroyed. All eight occupants were killed but there were no injuries on the ground. ", "probable_cause": "Contributing factors.\r\n- Communication – undetermined\r\nIt is possible that difficulties for the dialogue between pilots on matters related to the operation of the aircraft have favored a prejudicial scenario to the expression of assertiveness in the communication in the cabin, interfering in the effective management of the presented abnormal condition.\r\n- Team dynamics – undetermined\r\nIt is possible that a more passive posture of the copilot combined with the commander's decisions and actions from the presentation of the abnormal condition in flight interfered with the quality of the team's integration and in the efficiency of the cabin dynamics during the occurrence, bringing losses to the emergency management presented.\r\n- Emotional state – undetermined\r\nIt is not possible to discard the hypothesis that a more anxious emotional state of the pilots contributed to an inaccurate evaluation of the operational context experienced, favoring ineffective judgments, decisions and actions to manage the abnormal condition presented.\r\n- Aircraft maintenance – a contributor\r\nOn the right engine, it was found that the fuel tube fixing nut that left the distributor for No. 3 cylinder was loose, favoring the fuel leakage, as well as the bypass valve clamp of the turbocharger that was bad adjusted, providing leakage of gases from the exhaust that would be directed to the compressor and, later to the engine, to equalize its power. On the left engine, impurity composed of an agglomerate of soil and fuel were found on the side of the nozzles n° 2, 4 and 6, which migrated to the inside of these nozzles, causing them to become clogged. It was not possible to determine the origin of this material, but there is a possibility that it may have been deposited during the long period the aircraft spent in the maintenance shop, undergoing general overhaul and the revitalization of its interior (13DEC2012 until 29APR2016).\r\n- Insufficient pilot’s experience – undetermined\r\nThe pilots had little experience with the GARMIN GTN 650 navigation system. The lack of familiarity with this equipment may have favored the misidentification of the approach fixes for Londrina. This way, it is possible that they have calculated their descent to the final approach fix (waypoint LO013), believing that it was the position relative to threshold 13 (waypoint RWY13).\r\n- Decision-making process – undetermined\r\nThe decision to take off from Cuiabá to Londrina without the identification of the reason for the warning light to be ON in the alarm panel and the possible late declaration of the emergency condition showed little adequate decisions that may have increased the level of criticality of the occurrence. \r\n- Support systems – undetermined\r\nThe similarity of the waypoints names in the RNAV procedure, associated with the lack of familiarity of the pilots with the new navigation system installed in the aircraft, may have confused the pilots as to their real position in relation to the runway."}