{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900c-1-saint-augustin", "date": "Jan 4, 1999 at 0859 LT", "type": "Beechcraft 1900C", "operator": "R%C3%A9gionnair", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Lourdes-de-Blanc-Sablon – Saint-Augustin", "msn": "UC-085", "yom": 1989, "flight_number": "RH1707", "city": "Saint-Augustin", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6500, "captain_hours_type": null, "copilot_hours": 4000, "copilot_hours_type": 500, "aircraft_hours": null, "circumstances": "The Régionnair Inc. Beechcraft 1900C, serial number UC-85, with two pilots and 10 passengers on board, was making an instrument flight rules (IFR) flight between Lourdes-de-Blanc-Sablon, Quebec, and Saint-Augustin, Quebec. Just before initiation of descent, the radiotelephone operator of the Saint-Augustin Airport UNICOM (private advisory service) station informed the crew that the ceiling was 300 feet, visibility a quarter of a mile in snow flurries, and the winds from the southeast at 15 knots gusting to 20 knots. The crew made the LOC/DME (localizer transmitter / distance-measuring equipment) non-precision approach for runway 20. The approach proceeded normally until the minimum descent altitude (MDA). When the first officer reported sighting the ground beneath the aircraft, the captain decided to continue descending below the MDA. Thirty-five seconds later, the ground proximity warning system (GPWS) [email protected] audible alarm sounded. Three seconds later, the aircraft flew into the frozen surface of the Saint-Augustin River. The occupants escaped the accident unharmed. The aircraft was heavily damaged.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The crew did not follow the company's SOPs for the briefing preceding the approach and for a missed approach.\r\n2. In the approach briefing, the captain did not specify the MDA or the MAP, and the first officer did not notice these oversights, which shows a lack of coordination within the crew.\r\n3. The captain continued descent below the MDA without establishing visual contact with the required references.\r\n4. The first officer probably had difficulty perceiving depth because of the whiteout.\r\n5. The captain did not effectively monitor the flight parameters because he was trying to establish visual contact with the runway.\r\n6. The chief pilot (the captain of C-FGOI) set a bad example to the pilots under him by using a dangerous method, that is, descending below the MDA without establishing visual contact with the required references and using the GPWS to approach the ground.\r\nFindings as to Risks:\r\n1. The operations manager did not effectively supervise air operations.\r\n2. Transport Canada did not detect the irregularities that compromised the safety of the flight before the occurrence.\r\n3. Régionnair had not developed GPWS SOPs for non-precision approaches.\r\nOther Findings:\r\n1. The GPWS 'MINIMUMS' alarm sounded at a height that did not leave the captain time to initiate pull-up and avoid striking the ground because of the aircraft=s rate of descent and other flight\r\nparameters.\r\n2. Neither the captain nor the first officer had received PDM training or CRM training.\r\n3. At the time of the approach, the ceiling and visibility unofficially reported by the AAU were below the minima published on the approach chart.\r\n4. The decision to make the approach was consistent with existing regulations because runway 02/20 was not under an approach ban.\r\n5. Some Régionnair pilots would descend below the MDA and use the GPWS to approach the ground if conditions made it impossible to establish visual contact with the required references."}