{"url": "https://www.baaa-acro.com/crash/ground-fire-boeing-747-357-dhaka", "date": "Mar 25, 2008 at 0827 LT", "type": "Boeing 747-300", "operator": "Saudia", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Madinah - Dhaka", "msn": "22996/586", "yom": 1983, "flight_number": "SV810", "city": "Dhaka-Hazrat Shahjalal (ex Zia Ul-Haq)", "zone": "Dhaka", "country": "Bangladesh", "region": "Asia", "crew_on_board": 19, "crew_fatalities": 0, "pax_on_board": 307, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 18137, "captain_hours_type": 5637, "copilot_hours": 7161, "copilot_hours_type": 261, "aircraft_hours": 99327, "circumstances": "TF-ARS (B747-300) was on a scheduled flight from Medina (Saudi Arabia) to Dhaka (Bangladesh), flight number SVA810. The flight crew consisted of a commander, copilot and a flight engineer. The cabin crew consisted of 15 crew members including one senior cabin attendant. Additionally to the cabin crew, one “off duty” cabin crew member was in the cabin. According to the commander, the flight from Medina and the landing at Dhaka was uneventful. During the landing roll, approximately 50 seconds after touchdown, the flight crew received a call from the tower controller where the tower controller inquired whether the aircraft was under control. The flight crew responded to the call by stating that the aircraft was completely under control and asked what the problem seemed to be. The controller then informed the flight crew that fire was observed at the right wing area. At this point the Aerodrome Fire Operator had already activated the fire fighters as well as the rescue team. As soon as the controller had informed the flight crew about the fire, the flight crew received a No. 3 engine fire alarm. The co-pilot immediately discharged the first engine fire bottle and the flight crew requested firefighter assistance and shut down all engines. The co-pilot waited 20 seconds until the second fire bottle was discharged. At this time the commander called the senior cabin attendant to the flight deck using the public address system (PA). This command was followed by a command to the cabin crew to remain seated. The commander informed the senior cabin attendant of the situation and instructed him to evaluate the situation and to evacuate the passengers if necessary. The senior cabin attendant went back down to the main deck and saw the smoke and the fire through the windows. He then commanded the cabin crew as well as passengers, by using a megaphone, to evacuate the aircraft. The cabin attendant at location L2 (see figure 6-7, page 21) had already operated the emergency exit and started evacuating the passengers. Cabin attendants at locations L1 and R2 (see figure 6-7, page 21) also operated their respective emergency exits. After realizing that smoke and fire were at the right hand side, the emergency exit at R2 was blocked by one of the cabin attendants. All passengers managed to evacuate without serious injuries and the fire department at Zia International Airport managed to extinguish the fire successfully. The damage to the aircraft was later evaluated as beyond economical repair. ", "probable_cause": "When TF-ARS was decelerating after landing on runway 14 at Zia International Airport, fuel leak at engine No. 3 resulted in a fire within the strut. The cause of the fire was that fuel was leaking through the flexible half coupling to the hot surface of the engine. The fuel leak was because the O-ring and retaining rings were not properly assembled within the coupling and one retaining ring was missing. The IAAIB considers unclear instructions in the aircraft maintenance manual (AMM) to be a contributing factor of the incorrect installation. Another incorrect installation was also found at the flexible half coupling at the front spar for engine No. 1. However there were no signs of a fuel leak in that area, most likely due to the fact that both the retaining rings and the O-ring were within the coupling even though they were incorrectly placed. During the investigation, it was not possible to determine the quantity of the fuel leak. However it is likely that the draining system within the strut of engine No. 3 could not manage the fuel leak. According to the manufacturer, the intention of the draining system is to drain drips or small running leaks. Furthermore the drain was clogged by debris, but IAAIB believes that this was a result of the fire. Two out of six suitable emergency exits on the left side were used (L1 and L2) to evacuate most of the passengers during the emergency evacuation. The reason for not opening doors at location L3, L4 and L5 initially was most likely due to the fact that the commander ordered the cabin crew to remain seated prior to the emergency evacuation. The cabin crew members at locations L3 to L5 most likely did not hear the emergency evacuation command from the senior cabin crew member as he was only using a megaphone. Furthermore these exits were not opened later since the passengers moved aggressively to the opened exits, L1 and L2. The reason for not opening emergency exit UDL at the upper deck was evaluated by the crew to be too risky for the passengers. The flight crew discharged both fire bottles for engine No. 3 without managing to extinguish the fire. The flight crew did not discharge fire bottles on other engines. According to the passenger evacuation checklist (see Appendix 2), the crew should discharge all fire bottles before evacuation.\r\nFindings as to causes and contributing factors:\r\n- Incorrect assembly of the flexible half coupling at the front spar of engine No. 3.\r\n- Retaining ring missing in flexible half coupling at the front spar engine No. 3.\r\n- Lock wire fastened in such a way that the coupling nut might rotate slightly.\r\nFindings as to risk:\r\n- Unclear command made to the cabin crew to start emergency evacuation.\r\n- Cabin crew did not open all suitable emergency exits.\r\n- Flight crew did not follow company’s procedure regarding evacuation.\r\nOther findings:\r\n- Retaining rings and O-ring incorrectly inserted in the flexible half coupling on engine No. 1.\r\n- Pliers used to tighten or loosen the coupling nuts, even though maintenance manual instructs to only hand tight the nuts."}