{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-330b-new-delhi", "date": "Dec 20, 1973 at 0103 LT", "type": "Boeing 707", "operator": "Lufthansa-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bangkok - New Delhi - Frankfurt", "msn": "18463", "yom": 1964, "flight_number": "LH645", "city": "New Delhi-Palam", "zone": "National Capital Territory of Delhi", "country": "India", "region": "Asia", "crew_on_board": 11, "crew_fatalities": 0, "pax_on_board": 98, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10992, "captain_hours_type": 5503, "copilot_hours": 1303, "copilot_hours_type": 81, "aircraft_hours": 41731, "circumstances": "The approach to New Delhi-Palam Airport was initiated by night and marginal weather conditions with a limited visibility due to haze/fog. The copilot was the pilot-in-command and about 8 km on final, the airplane was too high on the glide with an approach speed in excess of 65 knots. Flaps were configured in a down position and the airplane started to lose height and speed. The captain failed to intervene and to realize that the airplane was too low when it struck approach lights and various equipments about 460 meters short of runway threshold. Out of control, the airplane crashed on the ground, lost its four engines and slid for few hundred meters before coming to rest in flames. Fire brigade and rescuers arrived on the scene 18 minutes later and the aircraft was largely consumed by fire. All 109 occupants were evacuated, among them 40 were injured. ", "probable_cause": "The accident was the consequence of several errors on part of the flying crew during a night approach. The following factors were reported:\r\n- Deviation from the approved published procedure caused the aircraft to be unstable, \r\n- Failure to exercise an adequate monitoring of the flight, \r\n- Lack of supervision on part of the captain, \r\n- Poor flight control on part of the copilot who was the pilot-in-command, \r\n- Poor crew coordination, \r\n- Poor crew resources management, \r\n- Lack of adequate weather information, \r\n- Lack of visibility due to haze/fog down to 200 feet above ground which may cause an optical illusion to pilots. "}