{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-hartford", "date": "Jul 12, 1996 at 1115 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Delta Mike Inc.", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Hartford – Block Island", "msn": "46-8408043", "yom": 1984, "flight_number": null, "city": "Hartford-Brainard", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4918, "captain_hours_type": 488, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot reported that he performed a rolling takeoff from the 2315 ft runway. He said that as soon as the airplane broke ground on the takeoff roll, he experienced a loss of engine power. The pilot said that he retracted the gear to help clear a 42 ft dike at the departure end of the runway. Also, he reported that after clearing the dike, he turned gradually to the left, and the left wing stalled. Two witnesses reported hearing loud, steady sounds from the airplane's engine and propeller. They said they saw the airplane in a high nose-up attitude, and watched the airplane descend behind the dike. The engine could be heard until the airplane contacted the river. During an operational check after the accident, the engine performed at recommended levels. According to performance data provided by the FAA, at the given takeoff weight, with a zero degree flap setting, the airplane required 2850 feet of runway to clear a 50 ft obstacle. The charts were based on full power before brake release. ", "probable_cause": "The pilot's inadequate preflight planning/preparation, and his failure to attain the proper liftoff airspeed, which resulted in a stall and collision with the terrain (river). "}