{"url": "https://www.baaa-acro.com/crash/crash-cessna-401a-arnsberg", "date": "Aug 28, 2020 at 1602 LT", "type": "Cessna 401", "operator": "Aircraft%20Guaranty%20Corp%20Trustee", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Marl – Arnsberg", "msn": "401A-0046", "yom": 1969, "flight_number": null, "city": "Arnsberg-Menden", "zone": "North Rhine-Westphalia", "country": "Germany", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6300, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4568, "circumstances": "At 1541 hrs, the airplane took off from Marl-Lohmühle Airfield with the pilot and 2 passengers on board to a VFR flight to Arnsberg-Menden Airfield which is located approximately 30 NM to the south-east. One of the passengers was seated in the right-hand seat next to the pilot and the other in the passenger seat behind the pilot. The radar recording of the air navigation service provider showed that the airplane climbed up to 2,200 ft AMSL. Ten minutes after take-off, the pilot established radio contact with Dortmund Tower with the request to cross Dortmund Airport control zone via the reporting point WHISKEY towards reporting point ECHO on his way to Arnsberg. At 1552:14 hrs, the tower controller answered: “[…] melden Sie WHISKEY und dann erwarten Sie Durchflug nach Arnsberg oder ECHO, wie Sie möchten, QNH eins null null eins (report WHISKEY and then expect cross flight to Arnsberg or ECHO, as you like, QNH one zero zero one)“. The pilot confirmed QNH and approach point. At 1555:22 hrs, the pilot reported having reached reporting point WHISKEY at 2,200 ft AMSL. The controller approved the flight through the control zone towards the south. The GPS and radar data showed that at 1556 hrs, the airplane turned tight towards 120° to a direct heading to Arnsberg. At 1559 hrs, as the airplane had left the control zone the controller issued the clearance to leave Tower frequency. At 1600 hrs, about 2.5 NM west of the destination aerodrome, the airplane turned left towards the east. About one minute later the airplane intersected the extended runway centre line of runway 23 at a distance of 0.7 NM from the threshold with an eastern heading. At the time, ground speed was approximately 150 kt. At 1601:39 hrs, the airplane turned left towards the final approach of runway 23. At 1602 hrs, about 1 NM from the threshold of runway 23 at about 1,500 ft AMSL, the airplane reached the extended runway centre line.  The Flugleiter (A person required by German regulation at uncontrolled aerodromes to provide aerodrome information service to pilots.) stated that during final approach flaps and landing gear of the airplane had been extended. The approach looked normal. For a short time he had no longer observed the airplane because he had made some entries in the computer. His colleague had then addressed him and drew his attention to the speed of the airplane. The Flugleiter saw that the airplane had an upward large pitch angle, then plunged and disappeared from his sight. The airplane impacted the ground and the 3 occupants suffered severe injuries. The Flugleiter stated he had tried in vain to contact the pilot twice and then raised the alarm. His colleague and other first aiders had driven to the accident site immediately. ", "probable_cause": null}