{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-36-marquise-west-memphis-1-killed", "date": "Sep 22, 2005 at 1958 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "McNeely%20Charter%20Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "West Memphis - Gainesville", "msn": "673", "yom": 1975, "flight_number": null, "city": "West Memphis", "zone": "Arkansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 12600, "captain_hours_type": 1900, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10892, "circumstances": "The twin-engine airplane was destroyed when it impacted an earthmoving scraper and terrain in a field about 2.5 miles north of the departure airport in night visual meteorological conditions. Witnesses reported that the pilot had aborted an earlier flight when he returned to the airport and told the mechanic that he had a right engine fire warning light. The discrepancy could not be duplicated during maintenance, and the airplane departed. About 23 minutes after departure, the pilot reported to air traffic control that he needed to return to the airport to have something checked out. The pilot did not report to anyone why he decided to return to the departure airport, and he flew over four airports when he returned to the departure airport. Radar track data indicated that the airplane flew over the departure end of runway 35 at an altitude of about 1,600 feet agl, and made a descending left turn. The airplane's altitude was about 800 feet agl when it crossed the final approach course for runway 35. The airplane continued the descending left turn, but instead of landing on runway 35, the airplane flew a course that paralleled the runway, about 0.8 nm to the right of runway 35. The airplane continued to fly a northerly heading and continued to descend. The radar track data indicated that the airplane's airspeed was decreasing from about 130 kts to about 110 kts during the last one minute and fifty seconds of flight. The last reinforced beacon return indicated that the airplane's altitude was about 200 feet agl, and the airspeed was about 107 kts. The airplane impacted terrain about 0.75 nm from the last radar contact on a 338-degree magnetic heading. A witness reported that the airplane was going slow and was \"extremely low.\" He reported that the airplane disappeared, and then there was an explosion and a fireball that went up about 1,000 feet. Inspection of the airplane revealed that it impacted the earthmover in about a wings level attitude. The landing gear handle was found to be in the landing gear UP position. The inspection of the left engine and propeller revealed damage indicative of engine operation at the time of impact. Inspection of the right engine revealed damage indicative of the engine not operating at the time of impact, consistent with an engine shutdown and a feathered propeller. No pre-existing conditions were found in either engine that would have interfered with normal operation. The inspection of the right engine fire detection loop revealed that the connector had surface contamination. When tested, an intermittent signal was produced which could give a fire alarm indication to the pilot. After the surface contamination was removed, the fire warning detection loop operated normally. ", "probable_cause": "The pilot's improper in-flight decision not to land at the departure runway or other available airports during the emergency descent, and his failure to maintain clearance from a vehicle and terrain. Contributing factors were a false engine fire warning light, inadequate maintenance by company personnel, a contaminated fire warning detection loop, and night conditions."}