{"url": "https://www.baaa-acro.com/crash/crash-cessna-560-citation-v-near-warm-springs-1-killed", "date": "Jan 9, 2021 at 1337 LT", "type": "Cessna 560 Citation V", "operator": "SX Transport", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Troutdale – Boise", "msn": "560-0035", "yom": 1989, "flight_number": null, "city": "Warm Springs", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 12350, "captain_hours_type": 15, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13727, "circumstances": "During the first 15 minutes of the flight, the pilot of the complex, high performance, jet airplane appeared to have difficulty maintaining the headings and altitudes assigned by air traffic controllers, and throughout the flight, responded intermittently to controller instructions. After reaching an altitude of 27,000 ft, the airplane began to deviate about 30° right of course while continuing to climb. The controller alerted the pilot, who did not respond, and the airplane continued to climb. Two minutes later, the airplane entered a tight, spiraling descent that lasted 8 minutes until the airplane impacted the ground at high speed in a rightwing-low attitude. The airplane was highly fragmented on impact; however, examination did not reveal any evidence of structural failure, in-flight fire, a bird strike, or a cabin depressurization event, and both engines appeared to be producing power at impact. Although the 72-year-old private pilot had extensive flight experience in multiple types of aircraft, including jets, he did not hold a type rating in the accident airplane, and the accident flight was likely the first time he had flown it solo. He had received training in the airplane about two months before the accident but was not issued a type rating and left before the training was complete. During the training, he struggled significantly in high workload environments and had difficulty operating the airplane’s avionics suite, which had recently been installed. He revealed to a fellow pilot that he preferred to “hand fly” the airplane rather than use the autopilot. The airplane’s heading and flight path before the spiraling descent were consistent with the pilot not using the autopilot; however, review of the flight path during the spiraling descent indicated that the speed variations appeared to closely match the airplane’s open loop phugoid response as documented during manufacturer flight tests; therefore, it is likely that the pilot was not manipulating the controls during that time.", "probable_cause": "A loss of airplane control due to pilot incapacitation for reasons that could not be determined."}