{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-20-dk-yogyakarta-7-killed", "date": "Jul 29, 1947", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Indonesian Government", "flight_phase": "Landing (descent or approach)", "flight_type": "Humanitarian", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Singapore - Yogyakarta", "msn": "15471/26916", "yom": 1944, "flight_number": null, "city": "Yogyakarta", "zone": "Special Region of Yogyakarta", "country": "Indonesia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was performing a humanitarian flight from Singapore on behalf of the Indonesian Red Cross with drugs on board. On final approach to Yogyakarta-Maguwo Airport, the Dakota was shot down by the pilots of two NEIAF (Netherlands East Indies Air Force) fighters and crashed in an open field located few km from the airport. All five occupants were killed. Indonesian authorities confirmed that the aircraft was flying under civilian color scheme but did not have any Red Cross painted on its fuselage. So it is most probable that the fighters' pilots mistook the aircraft and thought it was a military plane carrying soldiers. Both pilots were Australian citizens as all three passengers were high ranking Indonesian Army Officers. Still registered in India, the aircraft was offered few days ago to the Indonesian government by Jawaharlal Nehru, future Indian Prime Minister. Following this tragedy, Indonesian Authorities will rename the airport of Yogyakarta that became Adisutjipto instead of Maguwo. \r\nCrew: \r\nA. N. Constantine, pilot, \r\nR. Hazlehurst, copilot,\r\nB. Ram, flight engineer, \r\nA. Q. Wirjokoesoemo, radio navigator.\r\nPassengers: \r\nAgustinus Adisutjipto,\r\nAbdulrahman Saleh,\r\nAdisumarmo Wirjokusumo.", "probable_cause": "Shot down by the pilots of two ML-KNIL (Royal Dutch Indies Air Force) Curtiss P-40 fighter."}