{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-nashville", "date": "Dec 29, 2016 at 1345 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Cambusmoon", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Memphis – Nashville", "msn": "46-36407", "yom": 2007, "flight_number": null, "city": "Nashville-John C. Tune", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1550, "captain_hours_type": 1092, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1332, "circumstances": "According to the pilot, during the landing roll, the airplane \"began to drift sharply to the left.\" The pilot reported that, although there were no wind gusts reported, he felt as though a wind gust was pushing the airplane to the left. He attempted to maintain directional control with rudder pedal application, and he applied full right aileron. The airplane continued to drift to the left, and the pilot attempted to abort the landing by applying full throttle and 25° of flaps. He reported that the airplane continued to drift to the left and that he was not able to achieve sufficient airspeed to rotate. The airplane exited the runway, the pilot pulled the throttle to idle, and he applied the brakes to avoid obstacles. However, the airplane impacted the runway and taxiway signage and came to rest in a drainage culvert. The airplane sustained substantial damage to both wings. The published METAR for the accident airport reported that the wind was from 290° at 15 knots, and wind gusts exceeded 22 knots 1 hour before and 1 hour after the accident. The pilot landed the airplane on runway 20. The maximum demonstrated crosswind component for the airplane was 17 knots. The pilot reported that there were no preaccident mechanical malfunctions or failures with the airplane that would have precluded normal operation.", "probable_cause": "The pilot's loss of directional control during the aborted landing in gusting crosswind conditions, which resulted in a runway excursion."}