{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-476-bergamo", "date": "Aug 5, 2016 at 0407 LT", "type": "Boeing 737-400", "operator": "ASL-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris-Roissy-CDG - Bergamo", "msn": "24437/2162", "yom": 1991, "flight_number": "QY7332", "city": "Bergamo-Orio al Serio", "zone": "Lombardy", "country": "Italy", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9787, "captain_hours_type": 2254, "copilot_hours": 343, "copilot_hours_type": 86, "aircraft_hours": 65332, "circumstances": "The aircraft departed Paris-Roissy-Charles de Gaulle Airport at 0254LT on a cargo flight (service QY7332) to Bergamo on behalf of DHL Airways. Upon arrival at Bergamo-Orio al Serio Airport, the crew encountered poor weather conditions with thunderstorm activity, heavy rain falls and strong wind. The aircraft crossed the runway threshold at a speed of 156 knots and landed 18 seconds later, 2,000 metres pas the runway threshold. Unable to stop within the remaining distance (runway 28 is 2,807 metres long), the aircraft overran, went through the perimeter fence, lost its undercarriage and both engines and eventually stopped in a motorway, some 520 metres pas the runway end. Both crew members evacuated safely and the aircraft was destroyed.", "probable_cause": "The causes of the accident are mainly due to the human factor. In particular, the accident was caused by the runway overrun during the landing phase, caused by a loss of situational awareness relating to the position of the aircraft with respect to the runway itself. This loss of situational awareness on the part of the crew caused a delay in contact with the runway, which occurred, at a still high speed, in a position too far to allow the aircraft to stop within the remaining distance.\r\nContributing to the dynamics of the event:\r\n- The commander's prior decision not to carry out a go-around procedure (this decision is of crucial importance in the chain of events that characterized the accident),\r\n- Inadequate maintenance of flight parameters in the final phase of landing,\r\n- Failure of the crew to disconnect the autothrottle prior to landing,\r\n- Poor lighting conditions with the presence of storm cells and heavy rain falls at the time of the event (environmental factor), which may have contributed to the loss of situation awareness,\r\n- The attention paid by the crew during the final phase of the flight, where both pilots were intent to acquire external visual references and did not realize that the aircraft crossed over the runway at high speed for 18 seconds before touchdown,\r\n- The lack of assertiveness of the first officer in questioning the commander's decisions.\r\nFinally, it cannot be excluded that a condition of tiredness and fatigue may have contributed to the accident, even if not perceived by the crew, which may have influenced the cognitive processes, in particular those of the captain, interfering with his correct decision making process."}