{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-mammoth-lakes", "date": "Dec 3, 2015 at 1220 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Mammoth Lakes - Mammoth Lakes", "msn": "46-36626", "yom": 2014, "flight_number": null, "city": "Mammoth Lakes-Yosemite", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4000, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 230, "circumstances": "According to the pilot, he checked the winds via his onboard weather reporting device during the run-up, and he stated that the 25 knot wind sock was about ¾ full just moments before the takeoff roll. He reported that during the takeoff roll the airplane encountered a significant wind gust from the right. He stated that the wind gust forced the airplane to exit the left side of the runway, the landing gear collapsed, and the airplane collided with metal pylons which surrounded the wind sock. The airplane sustained substantial damage to both wings, fuselage, horizontal stabilizer and elevator. The pilot reported that there were no mechanical failures or anomalies prior to or during the flight that would have prevented normal flight operation. According to the Airport/Facility Directory, the Airport Remarks state: Airport located in mountainous terrain with occasional strong winds and turbulence. Lighted windsock available at runway ends and centerfield. With southerly crosswinds in excess of 15 knots, experiencing turbulence and possible windshear along first 3000´ of Runway 27. The reported wind at the airport during the time of the accident was from 200 degrees true at 22 knots, with gusts at 33 knots, and the departure runway heading was 27. According to the pilot operating hand book the maximum demonstrated crosswind component for this airplane is 17 knots. The crosswind component during the time of the accident was 26 knots.", "probable_cause": "The pilot's decision to takeoff in high crosswind conditions resulting in the inability to maintain an adequate crosswind correction, consequently failing to maintain directional control and departing the runway, and subsequently colliding with fixed airfield equipment. "}