{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2b-21-islander-datah-dawai", "date": "Nov 18, 2000 at 1053 LT", "type": "Britten-Norman Islander", "operator": "Dirgantara%20Air%20Service-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Datah Dawai - Samarinda", "msn": "2133", "yom": 1981, "flight_number": "AW3130", "city": "Datah Dawai", "zone": "East Kalimantan", "country": "Indonesia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 17, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7560, "captain_hours_type": 3632, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 21336, "circumstances": "The aircraft departed from Datah Dawai Airport for a regular commercial flight with destination airport, Samarinda, East Kalimantan. There were 18 persons on board including the pilot. Minutes after airborne, the aircraft crashed at a location of about 2 km north of the runway 02 extension. The pilot and 11 passengers were found seriously injured, while six sustained minor injuries or none. Weather was reported clear at the time of the occurrence. ", "probable_cause": "The following findings were identified:\r\n- There are no signs of engine failure prior to the impact, \r\n- The aircraft exceeded its manufacturer's MTOW on the flight from Datah Dawai to Samarinda, \r\n- The aircraft center of gravity is near the aft limit of the CG flight envelope, \r\n- The PIC apparently has a wrong perception on takeoff procedure. He thought that the optimum takeoff performance could be achieved by taking-off with a higher velocity. Meanwhile, in achieving high velocity one has to roll closer to the obstacle, which forced the aircraft to maintain a higher rate of climb,\r\n- The PIC and Datah Dawai ground crews have endangered his passengers by letting more passengers loaded into the aircraft than the number of seats available, \r\n- The PIC and Datah Dawai ground crews have endangered their passengers by improperly calculating the weight of aircraft payload, \r\n- The operator did not have proper supervision system that may prevent such practice to happen,\r\n- The operator has never filled out Flight Clearance, for its Samarinda - Datah Dawai operation, \r\n- There are a lot more passengers or demand than the capacity of the Pioneer Flight Samarinda - Datah Dawai, \r\n- There are not enough flight operation documents published (such as visual track and single engine emergency return guidance) to fly safely in and out of Datah Dawai,\r\n- The exceeding MTOW, small stability margin, PIC takeoff habit, and lack of published safety documents for the area are the contributing factors to the accident. \r\nThere were found indications of practices that fit into the category of negligence, willful misconduct and violations of existing flight safety rules and regulations. "}