{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47-dl-near-roccatamburo-8-killed", "date": "Nov 3, 1958 at 1900 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Yemen%20Airlines", "flight_phase": "Flight", "flight_type": "Government", "survivors": "No", "site": "Mountains", "schedule": "Rome – Belgrade", "msn": "4345", "yom": 1941, "flight_number": null, "city": "Roccatamburo", "zone": "Umbria", "country": "Italy", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 3165, "captain_hours_type": 2125, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on an official government flight from Rome, Italy to Yugoslavia, taking the Under Secretary of Foreign Affairs of Yemen to Belgrade. Four crew and four passengers were aboard. The flight departed Ciampino Airport (Rome) at 1645Z on an IFR flight plan and was to proceed via Viterbo, Pescara and Split to Belgrade. Due to the fact that the aircraft gave an impossible estimate for its ETA over Viterbo, Ciampino Tower, at 1729Z on its own initiative, notified the aircraft that it was on a bearing of 315°, which indicated that it was to the west of Viterbo. At 1736Z, YE-AAB advised it was over the Viterbo NDB giving its ETA at Pescara as 1817Z. At 1738Z the Tower cleared the aircraft to climb from 8,500 feet to 13,000 feet and requested it to transfer from VHF to HF for further en route navigation messages. The aircraft acknowledged, and this was the last effective radio contact. At approximately 1800Z the aircraft crashed on the western slopes of Monte Porretta at a height of 2,690 feet. All aboard were killed and the aircraft was destroyed.", "probable_cause": "The accident was due to faulty conduct of the flight. The following factors were reported: \r\n- Inadequately trained crew, \r\n- Faulty use of the radio compass, \r\n- Failure to request assistance of D/F facilities, \r\n- Erroneous estimates, \r\n- The pilot-in-command and the crew had an inadequate knowledge of the Italian and English phraseology to be used in ground-air-ground radio communications,\r\n- Erroneous assessment of adverse weather conditions, particularly at the destination airport, bearing in mind the lack of adequate facilities under such conditions,\r\n- Errors in compilation of the flight plan, error of approximately 12 minutes in estimated time for the Rome-Viterbo segment,\r\n- Inaccurate indication of frequencies available in aircraft, in actual fact, the control frequency of the Rome ACC (120.1 Kc) was not available although it was essential for flight assistance,\r\n- Inadequacy of charts covering the area along the route. It appears that there was no chart of Europe on board and the flight guide which was found in the wreckage was out of date."}