{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-williston-lake", "date": "Feb 7, 2000 at 1055 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Terry Air", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Mackenzie – Bear Valley – Tsay Keh – Mackenzie", "msn": "31-7752151", "yom": 1977, "flight_number": null, "city": "Williston Lake", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4500, "captain_hours_type": 1500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot of a Piper PA-31-350 Navajo Chieftain, serial number 31-7752151, encountered an area of heavy snow and reduced visibility while on a visual flight rules flight from Bear Valley, British Columbia, logging camp to Tsay Keh. The pilot was unable to maintain visual references and executed a 180-degree turn in an attempt to regain visual flight. Shortly after completing the turn, at about 1055 Pacific standard time, the aircraft collided with the ice on the Peace Reach Arm of Williston Lake, British Columbia. The pilot was the sole occupant of the aircraft and received serious injuries. There was no fire. The aircraft was destroyed during the collision.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. Weather conditions at the time and location of the occurrence were not suitable for visual flight.\r\n2. While the pilot was attempting to regain visual flight, he allowed the aircraft to descend and it struck the ice surface. The weather and surface conditions were such that it would have been virtually impossible to visually detect the ice surface.\r\nOther Finding:\r\n1. In the absence of en route weather reporting facilities, the pilot could only estimate weather conditions based on the area forecast and informal reports received from lay personnel."}