{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c-45-expeditor-dieppe-8-killed", "date": "Nov 8, 1948 at 1739 LT", "type": "Beechcraft C-45 Expeditor", "operator": "Mercure1", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Paris – Croydon", "msn": "6336", "yom": 1944, "flight_number": null, "city": "Dieppe", "zone": "Seine-Maritime", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 3000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Due to a strike by Air France, all flights from Paris to London were cancelled and the Ice Hockey National Team of Czechoslovakia was grounded in Paris. As the  team should fly to London to take part to a tournament, it was decided that few players rent a plane by Mercure Taxis Aériens. The founder and Chief Pilot of this company disagreed to do the flight due to poor weather conditions above The Channel but was finally convinced to fly to London. The twin engine aircraft left Paris-Le Bourget at 1638 bound for Croydon. About an hour later, while flying over The Channel, the crew encountered poor weather conditions (mist) and maybe, the pilot elected to return to Paris or to divert to Cherbourg when the aircraft went out of control and crashed into the sea off Dieppe. As the aircraft failed to arrive in Croydon, SAR operations were conducted but eventually suspended few days later as no trace of the aircraft nor the eight occupants was found. A year later, human remains were found on a beach and analysis suggest that they belonged to the pilot. \r\nCrew:\r\nRené de Narbonne, pilot   1.\r\nPassengers:\r\nLadislav Trojak, \r\nKarel Stibor, \r\nZdenek Svarc, \r\nVilibald Sorrel, \r\nMiloslav Pokorny,\r\nZdeněk Jarkovský.", "probable_cause": null}