{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601p-greater-cumberland-1-killed", "date": "Sep 19, 1990 at 1655 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "National Jet Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Williamsburg – Greater Cumberland", "msn": "61-0653-7963302", "yom": 1979, "flight_number": null, "city": "Greater Cumberland", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1350, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was cleared for an approach to the airport. He received airport advisories from the airport unicom operator and asked that the runway lights be turned up. Soon afterwards, the airplane was seen approaching runway 23, which was served by a localizer approach. A witness at the airport said he saw the plane flying in and out of low hanging clouds. He said the airplane appeared to be at level flight, about 400 to 500 feet agl, then it passed over the airport and went in a steep left turn. After about 90° of turn, the airplane began a shallow descent. It rolled out of the turn before it descended into the ground about 1/4 mile from the approach end of runway 28. The witness said he heard engine sounds throughout the descent. An examination of the airplane did not disclose evidence of mechanical malfunction. A post-mortem examination did not reveal evidence of impairment or incapacitation of the pilot. The pilot, sole on board, was killed. ", "probable_cause": "The pilot's improper ifr procedure by not maintaining sufficient altitude, while circling to land. Factors related to the accident were: the low ceiling and visibility conditions in fog."}