{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh106-comet-4b-demre-66-killed", "date": "Oct 12, 1967 at 0325 LT", "type": "De Havilland DH.106 Comet", "operator": "BEA", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "London - Athens - Nicosia - Cairo", "msn": "6449", "yom": 1961, "flight_number": "BE284", "city": "Demre", "zone": "Mediterranean Region (Akdeniz Bölgesi)", "country": "Turkey", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 59, "pax_fatalities": 59, "other_fatalities": 0, "total_fatalities": 66, "captain_hours": 14563, "captain_hours_type": 2637, "copilot_hours": 6318, "copilot_hours_type": 2471, "aircraft_hours": 15470, "circumstances": "G-ARCO left London-Heathrow Airport at 2145 hours on 11 October 1967, operating British European Airways (BEA) flight BE284 to Athens. It carried 38 passengers and 2 154 kg of freight, including 920 kg for Nicosia. The aircraft arrived at Athens at 0111 hours on 12 October and reached its parking area on the apron at about 0115 hours. Six Athens passengers were disembarked. At Athens the flight became Cyprus Airways flight CY 284 for Nicosia. Four passengers and the captain remained on board the aircraft whilst it was refuelled and serviced for the flight to Nicosia. The Captain and the two First Officers continued with the aircraft but the cabin staff was changed, the new staff being those of Cyprus Airways. Twenty-seven passengers joined the aircraft at Athens for the flight to Nicosia. From the evidence of the BEA and Olympic Airways staff at Athens the aircraft's transit was normal. It was refuelled to .a total of approximately 17 000 kg and only one minor defect, relating to the Captain's beam compass, was recorded in the technical log. This defect was dealt with by the ground crew. The baggage for the passengers joining the aircraft for the flight to Nicosia and the freight was placed in holds 1 and 2; the baggage and freight from London to Nicosia remained in holds 4 and 5. The aircraft taxied out at 0227 hours and was airborne on schedule at 0231 hours; it was cleared by Athens Control to Nicosia on Upper Airway Red 19 to cruise at flight level (FL) 290. After take-off it climbed to 4 000 ft on the 180' radial of Athens VOR and then turned direct to Sounion, which it reported crossing at 0236 hours. At 0246 hours, the aircraft reported that it was crossing R19B at FL 290 and was estimating Rhodes at 0303 hours. At 0258 hours at an estimated position 3fi041'N, 27O13'E, the aircraft passed a westbound BEA Comet which was flying at FL 280. Each aircraft saw the other; the Captain of the westbound aircraft has staked that flight conditions were clear and smooth. G-ARC0 passed Rhodes at 0304 hours and at 0316 hours reported passing R19C at FL 290 and that it estimated passing abeam of Myrtou, Cyprus, at 0340 hours. This message was not received by Athens direct but was relayed by the westbound aircraft. G-ARC0 was then cleared by Athens to change to the Nicosia FIR frequency. The recording of the R/T communications with Nicosia shows that G-ARC0 called them to establish contact; the time of this call was 0318 hours + 9 seconds and it is estimated that the aircraft would then have been at a position 35° 51'N 30°17' E, approximately 15 NM to the east of R19C. Nicosia replied to the aircraft with an instruction to go ahead with its message but no further transmission was heard. Nicosia continued to try to contact the aircraft but without result and overdue action was therefore taken. At 0440 hours R.A.F. Search and Rescue aircraft took off from Akrotiri; at 0625 hours wreckage from G-ARC0 was sighted in the vicinity of R19C, the last reported position. None of the 66 occupants survived the crash. ", "probable_cause": "The aircraft broke up in the air following detonation of a high explosive device within the cabin. A high explosive device detonated within the cabin while the aircraft was cruising at FL290. The explosion severely damaged the aircraft causing an out-of-control condition followed by structural break-up at a lower altitude."}