{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-14p-near-boysun-30-killed", "date": "Dec 13, 1959 at 0928 LT", "type": "Ilyushin II-14", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Kabul – Termez – Tashkent", "msn": "1470 014 16", "yom": 17, "flight_number": "SU120", "city": "Boysun", "zone": "Surxondaryo Province (Surxondaryo viloyati)", "country": "Uzbekistan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 25, "pax_fatalities": 25, "other_fatalities": 0, "total_fatalities": 30, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3029, "circumstances": "At 0927LT, while cruising at an altitude of 3,600 meters, the radio operator informed ATC he was cruising under VFR and spotted Derbent. A minute later, while in clouds, the airplane struck the southeast slope of Mt Kushtang located about 27 km northeast of Boysun. SAR operations were conducted but eventually suspended few days later as no trace of the aircraft nor the 30 occupants was found. All operations were abandoned one month later. The accident was officially announced by the Soviet Authorities on 19JAN1960. On 02JUN1960, alpinists found the wreckage of the airplane in a rocky and craggy area at an altitude of 3,501 meters. Among the passengers were two Chinese and three Germans, the rest of the passengers being Soviet soldiers and members of their families. ", "probable_cause": "The accident was the consequence of several navigation errors on part of the flying crew who decided to cut the route, apparently to save time. The captain decided to continue under VFR in IMC conditions and at the time of the accident, the aircraft was about 40 to 50 km off course to the right of the intended route. It was not possible to distinguish the mountain that was shrouded in clouds. Also, the crew failed to take into consideration the wind component, which remains a contributing factor. "}