{"url": "https://www.baaa-acro.com/crash/crash-antonov-12bk-near-skopje-8-killed", "date": "Jul 24, 1992 at 2023 LT", "type": "Antonov AN-12", "operator": "Volga%20Dnepr.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": "Simferopol - Skopje", "msn": "00 347 607", "yom": 1970, "flight_number": null, "city": "Skopje", "zone": "Skopje City District", "country": "Macedonia", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4537, "circumstances": "The aircraft departed Simferopol on a positioning flight to Skopje, carrying two passengers and six crew members. In Skopje, a load of automobile spare parts should be loaded and the aircraft was then scheduled to continue to Ukraine. A second AN-12 from the same operator approached Skopje few minutes prior to the accident and its crew decided to divert to Sofia Airport due to poor weather conditions (thunderstorm activity and heavy rain falls) at destination. On approach to Skopje, the crew modified his route to avoid the thunderstorm and followed a wrong heading of 230° instead of the planned 163°. Few minutes later, the crew was cleared for an approach to runway 34 and followed heading 140°. At an altitude of 5,200 feet on approach, the aircraft struck the slope of Mt Lisec (1,934 metres high) located 26 km south of runway 34 threshold. The wreckage was found at an altitude of 1,600 metres and all 8 occupants were killed. ", "probable_cause": "Controlled flight into terrain after the crew decided to continue the approach in poor weather conditions without visual contact with the ground and unaware of his exact position. The following contributing factors were reported:\r\n- Weather conditions were extremely difficult and unfavorable with the presence of thunderstorm activity and heavy rain falls, \r\n- No call-out during the approach, \r\n- Information regarding weather deterioration were not efficiently transmitted to the crew,\r\n- Poor ATC assistance, \r\n- The crew was unable to effectively use its Distance Measuring equipment either because of its failure or because of a momentary shutdown of the ground equipment, maybe after being switched to an emergency power unit,\r\n- The crew's decision to continue the approach and his failure to initiate a go-around procedure."}