{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-cortez", "date": "Sep 3, 2014 at 1238 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Philburto Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cortez - Cortez", "msn": "46-36200", "yom": 1999, "flight_number": null, "city": "Cortez", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4000, "captain_hours_type": 2050, "copilot_hours": 4184, "copilot_hours_type": 1648, "aircraft_hours": 2900, "circumstances": "The accident occurred during a local instructional flight to satisfy the commercial pilot's annual insurance currency requirements in the accident airplane. The flight instructor reported that the pilot was demonstrating a simulated loss of engine power during initial climb and return for a downwind landing. During initial climb, upon reaching 1,200 ft above ground level (agl), the flight instructor reduced engine power to flight idle and feathered the propeller. In response, the pilot reduced airplane pitch and entered a left, 45-degree-bank turn back toward the airport. The flight instructor stated that, upon rolling wings level, the airplane appeared to be lower than he had expected as it glided toward the runway; however, he believed there was sufficient altitude remaining to safely land on the runway and told the pilot to continue without increasing the engine power. The flight instructor ultimately decided to abort the maneuver as the airplane crossed over the runway threshold at 40 ft agl. The flight instructor advanced the engine power lever to the full-forward position and increased airplane pitch to arrest the descent; however, he did not perceive an increase in engine thrust. Without an increase in engine thrust and with the increased pitch, the airplane's airspeed decreased rapidly, and the airplane entered an aerodynamic stall about 30 ft above the runway. The airplane impacted the runway before sliding into a grassy area. The flight instructor reported that he did not recall advancing the propeller control when he decided to abort the maneuver, and, as such, the perceived lack of engine thrust was likely because the propeller remained feathered after he increased engine power. Additionally, the flight instructor postulated that the airplane's landing gear had not been retracted after takeoff, which resulted in a reduced climb gradient, and, as such, the airplane entered the maneuver farther away from the airport than anticipated. Further, with the landing gear extended, the airplane experienced a reduction in glide performance during the simulated forced landing. The flight instructor reported that the accident could have been prevented if he had maintained a safe flying airspeed after he took control of the airplane. Additionally, he believed that his delayed decision to abort the maneuver resulted in an insufficient margin of safety.", "probable_cause": "The flight instructor's delayed decision to abort the simulated engine out maneuver, his failure to unfeather the propeller before restoring engine power, and his inadequate airspeed management, which led to an aerodynamic stall at low altitude.\n"}