{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b60-duke-fairfield", "date": "Jul 16, 1993 at 1405 LT", "type": "Beechcraft 60 Duke", "operator": "Ronald W. Garner", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hermiston – Fairfield", "msn": "P-337", "yom": 1975, "flight_number": null, "city": "Fairfield-Camas County", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1062, "captain_hours_type": 363, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2256, "circumstances": "On Friday afternoon, July 16, 1993, at 1405 mountain daylight time, a Beech B-60, N75CX, registered to the pilot, overran the end of the runway and impacted terrain while landing at the Camas County Airport, Fairfield, Idaho. An IFR flight plan was filed for the business flight, conducted under 14 CFR 91, which departed Hermiston, Oregon at 1244, July 16, 1993. Visual meteorological conditions prevailed in the area. The private certificated pilot and passenger Peter W. VanKomen were seriously injured. Passenger Chris A. Carrow suffered minor injuries in the accident. The aircraft was destroyed in the mishap. There was no fire. Witnesses reported the pilot landed on runway 7, near the center of the 2950 feet long gravel airstrip and was unable to stop on the runway. The aircraft skidded off the east end of the runway where it impacted a ditch and dirt embankment. The Camas County Sheriff reported he examined the aircraft tire marks on the runway, which according to his measurement, started 1400 feet from the west end of the runway (See Sheriff Report). The sheriff indicated in his report that a witness, Bill Simon, stated in an interview that the pilot landed in downwind conditions, estimated to be 15 to 20 knots. Witness David Coffin, a private pilot, reported the two wind socks on the strip were fully extended, indicating the wind was blowing from west to east at a velocity in excess of 25 MPH, and gusting 30 to 35 MPH. The surface aviation weather observation, taken at Hailey, Idaho, 24 miles northeast of the accident site at 1350 MDT, July 16, 1993, was recorded as 3000 feet scattered clouds, visibility 30 miles, temperature 65 degrees F., dew point 29 degrees F., wind 210 degrees at 10 knots and altimeter 30.05 inches Hg. The density altitude at the Camas County Airport was calculated to be 6488 feet. The airport facility directory indicates the Camas County Airport has a single 2950 by 40 feet dirt runway, oriented 070 and 250 degrees. The elevation at the airport is 5058 feet above mean sea level. ", "probable_cause": "The pilot's improper inflt planning/decision in selecting the wrong runway for landing. A factor relating to the accident was the strong tailwind weather conditions."}