{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-atlanta-1-killed", "date": "Jan 18, 1990 at 1904 LT", "type": "Beechcraft 100 King Air", "operator": "EPPS", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Atlanta - Atlanta", "msn": "B-140", "yom": 1973, "flight_number": null, "city": "Atlanta-William Berry Hartsfield", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1653, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During arrival at night, Beechcraft A100 (King Air, N44UE) was cleared for an ILS runway 26R approach behind Continental flight 9687, then Eastern Airline (EA) flight 111 (Boeing 727, N8867E) was cleared for the same approach behind the King Air. After landing, flight 9687 had a radio problem and the tower controller had difficulty communicating with flight 9687. Meanwhile, the King Air landed and its crew had moved the aircraft to the right side of the runway near taxiway Delta (the primary taxiway for general aviation aircraft). The turnoff for taxiway Delta was about 3,800 feet from the approach end of runway 26R. Before the King Air was clear of the runway, EA111 landed and converged on the King Air. The crew of EA111 did not see the King Air until moments before the accident. The captain tried to avoid a collision, but the Boeing's right wing struck the King Air, shearing the top of its fuselage and cockpit. Some of the King Air's strobe/beacon lights were inoperative, though they most likely would have been extinguished for the IMC approach. The local controller did not issue a traffic advisory to EA111 with the landing clearance. One of the pilot on board the King Air was killed while the second was seriously injured. ", "probable_cause": "1) Failure of the Federal Aviation Administration to provide air traffic control procedures that adequately take into consideration human performance factors such as those which resulted in the failure of the north local controller to detect the developing conflict between N44UE and EA111, and \r\n2) the failure of the north local controller to ensure the separation of arriving aircraft which were using the same runway. \r\nContributing to the accident was the failure of the north local controller to follow the prescribed procedure of issuing appropriate traffic information to EA111, and failure of the north final controller and the radar monitor controller to issue timely speed reductions to maintain adequate separation between aircraft on final approach."}