{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa26t-merlin-iia-thompson-2-killed", "date": "Jun 1, 1994 at 0001 LT", "type": "Swearingen SA26T Merlin II", "operator": "Keewatin%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Coral Harbour – Churchill – Thompson", "msn": "T26-36", "yom": 1969, "flight_number": null, "city": "Thompson", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 20000, "captain_hours_type": 3160, "copilot_hours": 3700, "copilot_hours_type": 375, "aircraft_hours": 12633, "circumstances": "The twin-engine turboprop aircraft had just completed a medical evacuation (MEDEVAC) flight from Coral Harbour, Northwest Territories (NWT), to Churchill, Manitoba. At 2257 central daylight saving time (CDT), the aircraft departed Churchill for a night, instrument flight rules (IFR) flight to return to the aircraft's base of operations at Thompson, Manitoba. The en route portion of the return leg was conducted at an altitude of 18,000 feet above sea level (asl). Approximately one hour after take-off, the aircraft commenced an approach to the Thompson Airport. The crew remained in radio contact with air traffic control (ATC) personnel until approximately 2359 CDT. Just after midnight (0001 CDT), the Hotel non-directional beacon (NDB), which is located 3.4 miles northeast of the Thompson Airport, stopped transmitting. Ninety minutes later, the search and rescue satellite system (SARSAT) picked up an emergency locator transmitter (ELT) signal to the northeast of the airport. Thompson Airport staff, who had been dispatched to the site of the failed navigation beacon, found the wreckage of the aircraft in and around the NDB transmitter compound. Emergency responses were initiated by various airport and local authorities.", "probable_cause": "The flight crew lost altitude awareness during the localizer back course approach and allowed the aircraft to descend below a mandatory level-off altitude. Contributing factors to this occurrence were the crew's deviation from a published approach procedure, ineffective in-flight monitoring of the approach, rapidly developing localized fog conditions, and, probably, pilot fatigue."}