{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-iii-2-trislander-nyeri-5-killed", "date": "Jul 24, 1978 at 0900 LT", "type": "Britten-Norman Trislander", "operator": "Amphibians Air Charters", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Samburu – Nairobi", "msn": "1032", "yom": 1976, "flight_number": null, "city": "Nyeri", "zone": "Central", "country": "Kenya", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 3430, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was making a charter flight in visual meteorological conditions (VMC from blombasa, Malindi, Amboseli, Wilson, Meru Mulika, Samburu, Wilson, Governor's Camp, Kilaguni and then back to Mombasa). The aircraft left Mombasa on 23 July, 1978, at 0400 hours with 6 passengers on board and 180 US gallons of usable fuel. On arrival at Malindi four more passengers came on board. The aircraft departed from Malindi at 0445 hours on the same day, taking 1 hour 15 minutes to Amboseli for a short stopover. The flight departed from Amboseli at 0830 hours for Wilson Airport for more fuel; the fuel uplift was 351 litres. The flight left Nairobi Wilson with the same party, i.e. ten passengers and the same pilot and a total of 160 US gallons of fuel. The flight time to Meru Mulika was 50 minutes. On arrival at Meru Mulika at 1040 hours, they decided to night stop. On 24 July, 1978, the party departed from Meru Mulika at 0500 hours arriving at Samburu at 0525 hours. At 0830 hours the flight departed from Samburu for Nairobi Wilson (a flight of 50 minutes). Since departure from Mombasa on 23 July until departure from Samburu on 24 July, 1978, the flight was conducted in VMC weather and was an uneventful flight. Upon departure from Samburu, in clear weather, the pilot climbed to 8 500 feet on a standard setting of 1 013 mb. The pilot contacted Nanyuki Airforce base and asked for a clearance to cross Nanyuki zone and was asked to report time inbound, then abeam and then Naro Moru outbound. The pilot had flown this route several times before in the past in different types of aeroplanes and quite often had to make diversion including continuing by instrument flight rules (IFR) to Nairobi. The flight passed abeam Nanyuki at approximately 0855 hours. The pilot states that at this time, i.e. abeam Nanyuki, they could not see the top of Mt. Kenya but could see the lower slopes, Mt. Kenya Safari Club and Nanyuki and that visibility was more than 15 NM. The pilot further states that further along their flight p a t h , t h e r e was a heavy build up of stratus clouds with scattered cumulonimbus sprouting out of the top The clouds seemed to extend from 2 000 feet up to 11 000 feet and more. The pilot called Nanyuki Airforce tower when abeam Naro Moru and was told to continue with East Air Centre. The flight left Naro Moru and the main road to Nanyuki was on the right. The pilot states that at the prevailing temperature of 14OC (outside air temperature) the density altitude was 10 000 feet. Considering the performance of the aircraft (which has a service ceiling of 10 000 feet) the pilot decided to fly below the clouds and continue VFR. Therefore he started to descend from 8 500 feet. He then realized that the weather was deteriorating very rapidly and within the next minute or two the visibility had been reduced to a few yards. The pilot states he realized his proximity to the ground and at the same time realized the chances of turning back were not good, since he would have had to make a steep turn which would result in losing more height. He decided to climb, in almost zero visibility, to a safe height and so applied full power and initiated a climb. At this stage, he saw a glimpse of trees approaching on the flight path. So he increased the angle of attack for a more rapid ascent but to no avail. He felt the undercarriage hitting trees and the whole aircraft crashing through the trees. The aircraft had normal R/T with East Air Centre and Nanyuki Airforce control but during the accident, the pilot had no time to radio either East Air Centre or Nanyuki Tower of this predicament. The airplane was totally destroyed by impact forces, five passengers were killed and six other occupants were injured. ", "probable_cause": "The probable cause of this accident was that the pilot flew VFR in IMC weather at a very low altitude, thereby flying blindly into a hill. Although the pilot was fully qualified he made a misjudgement of the weather therefore making a wrong decision to descend from a safe altitude and broke the VFR flight rules."}