{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-440-38-san-juan-2-killed", "date": "Mar 15, 2012 at 0738 LT", "type": "Convair CV-440 Metropolitan", "operator": "Fresh Air", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "San Juan - Sint Marteen", "msn": "117", "yom": 1953, "flight_number": null, "city": "San Juan-Luis Muñoz Marín (Isla Verde)", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 22586, "captain_hours_type": 9000, "copilot_hours": 2716, "copilot_hours_type": 700, "aircraft_hours": null, "circumstances": "The airplane, operated by Fresh Air, Inc., crashed into a lagoon about 1 mile east of the departure end of runway 10 at Luis Muñoz Marín International Airport (SJU), San Juan, Puerto Rico. The two pilots died, and the airplane was destroyed by impact forces. The airplane was operated under the provisions of 14 Code of Federal Regulations (CFR) Part 1251 as a cargo flight. Visual meteorological conditions prevailed at the time of the accident, and a visual flight rules flight plan was filed. The flight had departed from runway 10 at SJU destined for Princess Juliana International Airport, St. Maarten. Shortly after takeoff, the first officer declared an emergency, and then the captain requested a left turn back to SJU and asked the local air traffic controllers if they could see smoke coming from the airplane (the two tower controllers noted in postaccident interviews that they did not see more smoke than usual coming from the airplane). The controllers cleared the flight to land on runway 28, but as the airplane began to align with the runway, it crashed into a nearby lagoon (Laguna La Torrecilla). Radar data shows that the airplane was heading south at an altitude of about 520 ft when it began a descending turn to the right to line up with runway 28. The airplane continued to bank to the right until radar contact was lost. The estimated airspeed at this point was only 88 knots, 9 knots below the published stall speed for level flight and close to the 87-knot air minimum control speed. However, minimum control speeds increase substantially for a turn into the inoperative engine as the accident crew did in the final seconds of the flight. As a result, the airplane was operating close to both stall and controllability limits when radar contact was lost. Pilots flying multiengine aircraft are generally trained to shut down the engine experiencing a problem and feather that propeller; thus, the flight crew likely intended to shut down the right engine by bringing the mixture control lever to the IDLE CUTOFF position and feathering the right propeller, as called out in the Engine Fire In Flight Checklist. This would have left the flight crew with the left engine operative to return to the airport. However, postaccident examinations revealed that the left propeller was found feathered at impact, with the left engine settings consistent with the engine at takeoff or climb setting. The right engine settings were generally consistent with the engine being shut down; however, the right propeller’s pitch was consistent with a high rotation/takeoff power setting. The accident airplane was not equipped with a flight data recorder or a cockpit voice recorder (nor was it required to be so equipped); hence, the investigation was unable to determine at what point in the accident sequence the flight crew shut down the right engine and at what point they feathered the left propeller, or why they would have done so. Post accident examination of the airplane revealed fire and thermal damage to the airframe on the airplane’s right wing rear spar, nacelle aft of the power section, and in the vicinity of the junction between the augmentor assemblies and the exhaust muffler assembly. While the investigation was unable to determine the exact location of the ignition source, it appears to have been aft of the engine in the vicinity of the junction between the augmentor assemblies and exhaust muffler assembly. The investigation identified no indication of a fire in the engine proper and no mechanical failures that would have prevented the normal operation of either engine. ", "probable_cause": "The flight crew's failure to maintain adequate airspeed after shutting down the right engine due to an in-flight fire in one of the right augmentors. The failure to maintain airspeed resulted in either an aerodynamic stall or a loss of directional control."}