{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-214-karachi-98-killed", "date": "May 22, 2020 at 1439 LT", "type": "Airbus A320", "operator": "Pakistan%20International%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "City", "schedule": "Lahore - Karachi", "msn": "2274", "yom": 2004, "flight_number": "PK8303", "city": "Karachi-Muhammad Ali Jinnah-Quaid-e-Azam", "zone": "Sindh (سنڌ سندھ)", "country": "Pakistan", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 91, "pax_fatalities": 89, "other_fatalities": 1, "total_fatalities": 98, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 47124, "circumstances": "On 22 May 2020 at 13:05 hrs PST, the Pakistan International Airlines aircraft Airbus A320-214, registration number AP-BLD, took off from Lahore (Allama Iqbal International Airport – AIIAP) Pakistan to perform a regular commercial passenger flight (PK8303) to Karachi (Jinnah International Airport – JIAP) Pakistan, with 8 crew members (01 Captain, 01 First Officer, and 06 flight attendants) and 91 passengers on board. At 14:35 hrs the aircraft performed an ILS approach for runway 25L and touched down without landing gears, resting on the engines. Both engines scrubbed the runway at high speed. Flight crew initiated a go-around and informed “Karachi Approach” that they intend to make a second approach. About four minutes later, during downwind leg, at an altitude of around 2000 ft, flight crew declared an emergency and stated that both engines had failed. The aircraft started losing altitude. It crashed in a populated area, short of runway 25L by about 1340 meters. An immediate subsequent post impact fire initiated. Out of 99 souls on-board, 97 were fatally injured and 02 passengers survived. On ground 04 persons were injured however 01 out of these reportedly expired later at a hospital.\n\r\nBelow, the preliminary report published by the Pakistan AAIB. \n", "probable_cause": null}