{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b99-airliner-allentown-4-killed", "date": "Oct 24, 1971 at 2307 LT", "type": "Beechcraft 99 Airliner", "operator": "Monmouth%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Wilkes Barre - Allentown", "msn": "U-044", "yom": 1968, "flight_number": "VM098", "city": "Allentown-Lehigh Valley (Bethlehem-Easton)", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 4600, "captain_hours_type": 800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Monmouth Airlines Flight 98 departed Wilkes-Barre at 2253LT for a short IFR flight to Allentown. Allentown Approach Control cleared the flight for a VOR approach and instructed the pilot to report when it was 12 miles North of the Allentown VOR. At 2307LT, upon receiving the flight's position estimate, Allentown Approach Control cleared Monmouth 98 for a VOR approach to a landing on runway 06. Monmouth 98 was requested to report when inbound over the Allentown VOR. The airplane then collided with the ridge of Blue Mountain at an elevation of 1540 ft (470 m). The wreckage was found 11,3 miles north of Allentown-Bethlehem Easton Airport. Both pilots and two passengers were killed while four other passengers were injured. The aircraft was destroyed. ", "probable_cause": "The pilot's nonadherence to approved approach procedures for executing a non precision instrument approach in instrument flight conditions. The Board further finds that there is a high degree of probability that the extensive on-duty time and actual instrument flight time prior to this accident resulted in the fatigue of both pilots and affected their judgment and decisions during the approach."}