{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-landsdowne-house-4-killed", "date": "Nov 23, 1983", "type": "De Havilland DHC-6 Twin Otter", "operator": "Austin%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sandy Lake – Landsdowne House – Thunder Bay", "msn": "632", "yom": 1979, "flight_number": null, "city": "Landsdowne House", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Twin Otter was completing a schedule service from Sandy Lake to Thunder Bay with an intermediate stop in Landsdowne House, carrying five passengers and two pilots. On approach, the crew encountered marginal weather conditions and the captain decided to initiate a go-around procedure. A second circuit was completed without losing sight of the airfield. During the second attempt to land, the pilot-in-command reported 'runway in sight' and the copilot called for radioaltimer at 200 feet altitude. On short final, the captain reported he was encountering whiteout conditions when the airplane struck the snow-covered and icy surface of the lake about 1,200 feet short of runway threshold. Upon impact, the nose gear was torn off then the aircraft struck rocky terrain and eventually came to rest in flames about 600 feet short of runway. A passenger was seriously injured while both pilots escaped with minor injuries. Four passengers were killed in the accident. ", "probable_cause": "The accident occurred during a visual approach in reduced visibility and difficult weather conditions (white conditions). Investigations were unable to determine the exact cause of the accident resulting in a controlled flight into terrain. "}