{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54e-5-do-skymaster-sandspit-36-killed", "date": "Jan 19, 1952 at 0138 LT", "type": "Douglas C-54 Skymaster", "operator": "Northwest%20Airlines2", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Seoul – Tokyo – Shemya – Elmendorf – McChord", "msn": "27279", "yom": 1944, "flight_number": "NW324", "city": "Sandspit", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 40, "pax_fatalities": 33, "other_fatalities": 0, "total_fatalities": 36, "captain_hours": 8557, "captain_hours_type": 1762, "copilot_hours": 4197, "copilot_hours_type": 1698, "aircraft_hours": 18859, "circumstances": "Flight 324 departed Elmendorf Air Force Base at 2111, January 18, with the same 40 passengers who had enplaned at Haneda Air Force Base, Tokyo. The aircraft had 2,600 gallons of fuel and 100 gallons of oil aboard. Gross weight at takeoff was 68,275 pounds (permissible 71,800), and the load was properly distributed with relation to the center of gravity. The flight climbed to the 10,000-foot assigned altitude and at 2213, shortly after passing Middleton Island, requested permission to descend to 8,000 feet. ARTC cleared the flight to descend and the new cruising altitude was reached at 2222. The trip was uneventful until opposite Sitka, Alaska, when the pilot reported, at 0003 (January 19), that No. 1 propeller had been feathered. In another radio transmission (0029), the pilot ascribed the trouble to a \"broken\" oil cooler, and advised that the flight was proceeding to Sandspit. In other transmissions, he requested weather forecasts for Annette, Sandspit, and Port Hardy. Following receipt of this information, which revealed that Annette weather was below minimums, he again advised that a precautionary landing would be made at Sandspit, and gave 0128 as the estimated time of arrival. The flight was cleared to that point and proceeded without further incident on three engines. The aircraft touched down at a point about one-third down the runway. After a short roll, power was applied at about the mid-point of the strip and the aircraft took off, barely clearing a low fence and driftwood which was approximately two feet high at the end of the runway. After it failed to reappear at the approach end of the landing strip, the Sandspit radio operator discovered from the shouting of survivors that the flight had crashed in Hecate Strait. The radio operator immediately sent notification messages to place Search and Rescue facilities in operation. The wreckage could not be seen because of limited visibility, In company with a Canadian customs official, he launched his small boat and effected the rescue of the seven survivors standing on and clinging to the right wing tip of the partially submerged aircraft. Following the alerting of Search and Rescue facilities, messages were relayed by Annette Flight Control to two other aircraft in the area. They attempted to light the area with flares and locate the wreckage, but were unsuccessful in their efforts. ", "probable_cause": "The Board determines that the probable cause of this accident was the high approach to the airstrip and the attempt to again become airborne at insufficient air speed, which resulted in the aircraft settling into the water. The following findings were pointed out:\r\n- The No. 1 engine suffered an oil loss, which necessitated shutting down the engine and feathering the propeller,\r\n- In accordance with company operating procedures, the captain elected to land at Sandspit, British Columbia, the first available airport, rather than continue to destination on three engines,\r\n- The aircraft, following an aborted landing at Sandspit and when last observed by a ground witness, was in a shallow left bank at low altitude,\r\n- The aircraft, at near stalling speed during the attempted climb-out, settled into the water, bounced, and came to rest 26 degrees to the left and approximately 4,500 feet from the end of the runway,\r\n- All or nearly all of the passengers evacuated the aircraft, with no known serious injuries,\r\n- Air and water temperatures were near freezing; drowning and exposure accounted for 36 fatalities,\r\n- No steps were taken to prepare passengers for a crash landing or possible ditching,\r\n- Emergency lighting in the cabin was not utilized, nor were any effective measures taken to remove life rafts at the rear of the cabin,\r\n- Search and Rescue facilities were not alerted until after the accident because three-engine operation over water was considered a potential, not an actual, emergency."}