{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3a-191-near-fairfield-17-killed", "date": "Dec 15, 1942 at 0122 LT", "type": "Douglas DC-3", "operator": "Western%20Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Salt Lake City – Las Vegas – Burbank", "msn": "1900", "yom": 1936, "flight_number": "WA013", "city": "Fairfield", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 15, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 17, "captain_hours": 2885, "captain_hours_type": 533, "copilot_hours": 596, "copilot_hours_type": 126, "aircraft_hours": 14773, "circumstances": "While cruising at the assigned altitude of 10,000 feet, the aircraft went out of control and crashed in a field located near Fairfield, Utah. The rescuers arrived on the scene around 1125LT and were able to evacuate two passengers seriously injured while 17 other occupants were killed. It appears that the aircraft reached a wrong attitude and lost part of its wings and stabilizer prior to be out of control.\r\nCrew:\r\nEdward John Loeffler, pilot,\r\nJames Clifton Lee, copilot,\r\nDouglas Mortimer Soule, copilot,\r\nCleo Lorraine Booth, stewardess.", "probable_cause": "On the basis of all of the facts, conditions and circumstances known to the Board at this time, it is concluded that failure of the left, or possibly both wing tips, and of the horizontal tail surfaces occurred in the air during a severe pull-up. However, no definite conclusion can be drawn from the evidence as to whether the pull-up was caused by operation of the controls by the crew, or by some other forces beyond their control. Due to the lack of any plausible theory for the latter, it seems more probable that the maneuver was initiated by the crew, possibly in an attempt to avoid collision with a bird, another aircraft, or some object which they saw or thought they saw.\r\nProbable cause:\r\nFailure of the left, or possibly both wing tips and of the horizontal tail surfaces as a result of a sever pull-up which caused unusual and abnormally high air loads. The reason the pull-up maneuver was not determined. \n"}