{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-jellicoe-2-killed", "date": "Dec 16, 2003 at 1200 LT", "type": "De Havilland DHC-3 Otter", "operator": "Huron%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": null, "msn": "65", "yom": 1954, "flight_number": null, "city": "Jellicoe", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5016, "captain_hours_type": 540, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At approximately 0900 eastern standard time (EST), the pilot arrived at the airstrip and prepared the ski-equipped de Havilland DHC–3 (Otter) aircraft (registration C–GOFF, serial number 65) for the morning flight. This Otter was equipped with a turbine engine. Two passengers, with enough supplies for an extended period of time, including a snowmobile and camping gear, were to be flown to a remote location. The pilot loaded the aircraft and waited for the weather to improve. At approximately 1200 EST, the pilot and passengers boarded the aircraft and took off in an easterly direction. The aircraft got airborne near the departure end of the airstrip, and, shortly after take-off, the right wing struck a number of small bushes and the top of a birch tree. The aircraft descended and struck the frozen lake surface, approximately 70 feet below the airfield elevation in a steep, nose-down, right-wing-low attitude. When it came to rest, the aircraft was inverted and partially submerged, with only the aft section of the fuselage remaining above the ice. All of the occupants were wearing lap belts. The pilot and front seat passenger received fatal injuries. The rear seat passenger survived the impact and evacuated the aircraft with some difficulty due to leg injuries. The following morning, about 22 hours after the accident, a local air operator searching for the missing aircraft located and rescued the surviving passenger.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The pilot attempted to take off from an airstrip that was covered with approximately 18 inches of snow, and the aircraft did not accelerate to take-off speed because of the drag; the aircraft was forced into the air and was unable to climb out of ground effect and clear the obstacles.\r\n2. The pilot did not abort the take-off when it became apparent that the aircraft was not accelerating normally and before the aircraft became airborne.\r\nFindings as to Risk:\r\n1. Unidirectional G switches, which are found on many types of ELTs, do not always activate the unit when impact forces are not aligned with the usual direction of flight. \r\nOther Findings:\r\n1. The validity of the aircraft’s certificate of airworthiness was affected while it flew more flights than allowed by the ferry permit issued by Transport Canada.\r\n2. The rear passenger seat was found to be installed incorrectly, contrary to de Havilland Alert Service Bulletin A3/49, dated 19 July 1991."}