{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-141a-10-lm-starlifter-hueva-24-killed", "date": "Aug 28, 1973 at 2145 LT", "type": "Lockheed C-141 Starlifter", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Mountains", "schedule": "Athens - Madrid - McGuire", "msn": "6008", "yom": 1963, "flight_number": null, "city": "Hueva", "zone": "Castile-La Mancha", "country": "Spain", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 7, "pax_on_board": 17, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14372, "circumstances": "The C-141 departed Athens for a night-time flight to Madrid, the first leg of a flight back to McGuire AFB. The crew were cleared for an ILS approach to Torrejon's runway 23. Weather was reported as 20,000 foot overcast, with 10 NM visibility. During the descent the crew forgot to use the Descent Checklist. Thus, the crew had failed to set their altimeters from 29.92\" to the local altimeter setting of 30.17\". Additionally, they did not turn on the radar altimeter. While at FL60 the crew was given a clearance to a lower altitude. Because of heavy radio traffic, the clearance was garbled. They were not sure if the controller had cleared them down to 5000 or 3000 feet. They agreed that it must have been 3000 feet. They read back \"three thousand feet\", but the controller failed to notice the error. When reporting \"passing 5000 for 3000\" to another controller, the error again was not noticed. Nearing 3000 feet, the navigator noticed a hill ahead and above their altitude, but the pilot reassured him that \"everything looks clear ahead\", with the lights of the air base visible in the valley below. At an altitude of 3050 feet, at a speed of 250 kts, the airplane impacted terrain near the edge of a plateau, 40 km east of the Torrejón Air Force Base. It became airborne again, rolled over and disintegrated in a field. The navigator survived while 24 other occupants were killed. \r\nCrew:\r\nCpt Clinton Clifford Corbin, pilot, †\r\nCpt Thomas R. Dietz, pilot, †\r\n1st Lt William A. Kuhn, copilot, †\r\nT/Sgt Edward Peter Babcock, flight engineer, †\r\nT/Sgt Donald R. Wells, flight engineer, †\r\nMaj Friedrich Hugo Lamers, navigator, †\r\n1st Lt William Haskel Ray, navigator\r\nT/Sgt Sidney Nathaniel Hillsman, load master. †\r\nPassengers:\r\nCpl Edward Anthony Fanelli,\r\nLt Col Austin Frederick Balkman\r\nTeresa Ann Wilcox\r\nT2c Donald Lee Rhodes\r\nCharles 'Chuck' Edward Hyatt\r\nWilliam Moore O'Connor\r\nCpl Sandra Rae Canton\r\nSgt Barry Gale Canton\r\nGeorgia Lord\r\nCharles Edward Lord\r\nMonteal Massey\r\nFrank Bullard Massey\r\nJanice Lynn Barron\r\nClifford Elbert Barron\r\nMichael L. Merricks\r\nRobert L. Holloway\r\nLt Chris Louis Katsetos.", "probable_cause": "No technical anomalies were found in the airplane and its components, equipment and instruments. The flying crew failed to follow approach procedures and descended to an unsafe altitude following a misinterpretation of the ATC clearance. A lack of crew coordination, a wrong planned approach and crew fatigue (eight hours of rest during last 60 hours) were considered as contributing factors. "}