{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c99-airliner-conover-3-killed", "date": "Aug 28, 1985 at 0145 LT", "type": "Beechcraft 99 Airliner", "operator": "Sunbird%20Airlines", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "City", "schedule": "Hickory - Charlotte", "msn": "U-170", "yom": 1981, "flight_number": null, "city": "Conover", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 5309, "captain_hours_type": 950, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7651, "circumstances": "Aircraft was on training flight for initial copilot qualification for commuter air carrier. Instructor and two trainees were on board. The aircraft departed Charlotte at about 2314 edt for the Hickory area for training. At about 0015 edt, it was reported that the crew visited the Hickory FSS. After departing Hickory, the aircraft climbed to 5,500 feet and remained generally between Charlotte. At about 0145 edt, radar data showed the aircraft to be in a steep descent and gaining speed. The aircraft collided with tree limbs, a utility pole and the ground in about 35° angle of descent in a residential area of Conover, NC. Investigation revealed a nose up trim, which was approximately 75% of the available up-trim (3.38° upnose). This is an abnormal setting; so the entire trim unit was retained and sent to the Talley Corp for detailed exam. The ram end fittings were sent to ga tech research for surface fracture analysis. The exam showed ductile overstress and no indication of pre-cracked condition. Pitch trim emergencies are a part of sunbirds c-99 training program (fit 1 & 2). All three occupants were killed. ", "probable_cause": "Occurrence #1: loss of control - in flight\r\nPhase of operation: cruise\r\nFindings\r\n1. (c) emergency procedure - selected - pilot in command (cfi)\r\n2. (c) remedial action - not performed - dual student\r\n3. (c) lack of familiarity with aircraft - dual student\r\n4. (c) remedial action - delayed - pilot in command (cfi)\r\n5. (c) fatigue (flight and ground schedule) - pilot in command (cfi)\r\n6. (c) supervision - not maintained - pilot in command (cfi)\r\n7. (f) complacency - pilot in command (cfi)\r\n8. (c) fatigue (flight and ground schedule) - pilot in command (cfi)\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}