{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-orlando", "date": "Sep 10, 2016 at 1530 LT", "type": "Beechcraft 200 Super King Air", "operator": "Joaquin Hurricane", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Marathon – Orlando", "msn": "BB-110", "yom": 1976, "flight_number": null, "city": "Orlando-Apopka", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5000, "captain_hours_type": 50, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10321, "circumstances": "The pilot of a multi-engine turboprop airplane reported that during the landing flare he encountered a crosswind gust, which pushed the airplane to the right of the runway centerline. The pilot further reported that he applied power to abort the landing, but the airplane touched down in the grass to the right of the runway. After the wheels touched down in the grass, he reported that the power added \"caught up with the aircraft,\" but the airplane was rolling toward trees and hangars. Subsequently, the pilot pulled the power to idle, but the right wing impacted a tree and the right main landing gear and nose wheel collapsed. A post-crash fire ensued after the collision and the right wing sustained substantial damage. The pilot reported no preaccident mechanical malfunctions or failures with the airplane that would have precluded normal operation. There was no record of the observed weather at the airport during the accident. An automated weather observing system about 14 nautical miles from the accident airport, near the time of the accident, recorded the wind variable at 5 knots. ", "probable_cause": "The pilot's failure to maintain directional control during an attempted aborted landing in gusty crosswind conditions, which resulted in a runway excursion and an impact with a tree."}