{"url": "https://www.baaa-acro.com/crash/crash-raytheon-390-premier-i-thomson-5-killed", "date": "Feb 20, 2013 at 2006 LT", "type": "Raytheon 390 Premier I", "operator": "The%20Vein%20Guys", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nashville - Thomson", "msn": "RB-208", "yom": 2007, "flight_number": null, "city": "Thomson-McDuffie County", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 13319, "captain_hours_type": 198, "copilot_hours": 2932, "copilot_hours_type": 45, "aircraft_hours": 635, "circumstances": "Aircraft was destroyed following a collision with a utility pole, trees, and terrain following a go-around at Thomson-McDuffie Regional Airport (HQU), Thomson, Georgia. The airline transport-rated pilot and copilot were seriously injured, and five passengers were fatally injured. The airplane was registered to the Pavilion Group LLC and was operated by the pilot under the provisions of 14 Code of Federal Regulations Part 91 as a business flight. Night visual meteorological conditions prevailed, and an instrument flight rules flight plan was filed. The flight originated at John C. Tune Airport (JWN), Nashville, Tennessee, about 1828 central standard time (1928 eastern standard time). The purpose of the flight was to transport staff members of a vascular surgery practice from Nashville to Thomson, where the airplane was based. According to initial air traffic control information, the pilot checked in with Augusta approach control and reported HQU in sight. About 2003, the pilot cancelled visual flight rules flight-following services and continued toward HQU. The last recorded radar return was observed about 2005, when the airplane was at an indicated altitude of 700 feet above mean sea level and 1/2 mile from the airport. There were no distress calls received from the crew prior to the accident. Witnesses reported that the airplane appeared to be in position to land when the pilot discontinued the approach and commenced a go-around. The witnesses observed the airplane continue down the runway at a low altitude. The airplane struck a poured-concrete utility pole and braided wires about 59 feet above ground level. The pole was located about 1/4 mile east the departure end of runway 10. The utility pole was not lighted. During the initial impact with the utility pole, the outboard section of the left wing was severed. The airplane continued another 1/4 mile east before colliding with trees and terrain. A postcrash fire ensued and consumed a majority of the airframe. The engines separated from the fuselage during the impact sequence. On-scene examination of the wreckage revealed that all primary airframe structural components were accounted for at the accident site. The landing gear were found in the down (extended) position, and the flap handle was found in the 10-degree (go-around) position. An initial inspection of the airport revealed that the pilot-controlled runway lights were operational. An examination of conditions recorded on an airport security camera showed that the runway lights were on the low intensity setting at the time of the accident. The airport did not have a control tower. An inspection of the runway surface did not reveal any unusual tire marks or debris. Weather conditions at HQU near the time of the accident included calm wind and clear skies.", "probable_cause": "The pilot's failure to follow airplane flight manual procedures for an antiskid failure in flight and his failure to immediately retract the lift dump after he elected to attempt a go-around on the runway. Contributing to the accident were the pilot's lack of systems knowledge and his fatigue due to acute sleep loss and his ineffective use of time between flights to obtain sleep."}