{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-b-near-san-miguel-de-tucuman", "date": "Apr 24, 2002 at 1915 LT", "type": "Piper PA-31-310 Navajo", "operator": "Aeronautica%20SA_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "San Miguel de Tucumán - Estancia La Juliana - Estancia El Descanso - San Miguel de Tucumán", "msn": "31-738", "yom": 1971, "flight_number": null, "city": "San Miguel de Tucumán-Teniente Benjamin Matienzo", "zone": "Tucumán", "country": "Argentina", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1686, "captain_hours_type": 28, "copilot_hours": 2437, "copilot_hours_type": 1, "aircraft_hours": 3230, "circumstances": "The twin engine aircraft departed San Miguel de Tucumán-Teniente Benjamin Matienzo Airport at noon on a positioning flight to a private airstrip located in Estancia La Juliana, 75 km from there. Before departure, the crew was unable to add more fuel in the tanks because they did not have sufficient cash. At Estancia La Juliana, the crew waited for two hours before the owner of the farm was taken to another of his property in Estancia El Descanso, about 70 km from there. Again, the crew waited for two hours before the final flight back to San Miguel de Tucumán. The return flight was completed under VFR mode at an altitude of 3,500 feet. While approaching San Miguel de Tucumán-Teniente Benjamin Matienzo Airport, the crew declared an emergency after both engines stopped. In a flaps and gear up configuration, he attempted to make an emergency landing when the aircraft impacted a tree and crashed in an open field located near El Chañar, about 13 km northeast of the runway 20 threshold. All three occupants were injured, two seriously, and the aircraft was damaged beyond repair. ", "probable_cause": "Double engine failure in flight due to a fuel exhaustion. Poor flight planning on part of the crew who failed to correctly calculate the amount of fuel necessary for all day trips. "}