{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2-shalkar-7-killed", "date": "Sep 16, 1982 at 2138 LT", "type": "PZL-Mielec AN-2", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": null, "msn": "1G76-44", "yom": 1968, "flight_number": null, "city": "Shalkar", "zone": "Aktobe", "country": "Kazakhstan", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was engaged in the control of gas compression stations n° 10, 11 and 12 located in the region of Shalkar. In the afternoon, the crew consumed alcohol and took off at 1745LT with two unauthorized people on board (a young couple who just got married). The crew made a short stop few minutes later to pick up three additional people who were invited to the wedding party. The crew continued the flight at an altitude of 100-150 meters. The visibility was poor because of night, mist and light rain. Several cars were parked at destination with light ON to allow the airplane to land. Unfortunately, the crew was unable to located precisely the landing area and decided to go-around. At a relative low height, the aircraft entered a nose-down attitude then banked right to an angle of 60° and crashed at a speed of 200 km/h in a field. At impact, all seven occupants were ejected and some of them were found 136 meters from the point of impact. The aircraft was destroyed and all seven occupants were killed. ", "probable_cause": "It was determined that the crew was intoxicated at the time of the accident. He was not authorized to perform such flight and did not have any qualification to fly by night. Also, there were five unauthorized passengers on board. "}