{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a60-duke-abilene", "date": "Feb 24, 2013 at 1020 LT", "type": "Beechcraft 60 Duke", "operator": "Frank Leroy Bell", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Smith – Abilene", "msn": "P-139", "yom": 1970, "flight_number": null, "city": "Abilene", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7500, "captain_hours_type": 800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3725, "circumstances": "The pilot reported that he had added fuel at the previous fuel stop and that he was using a fuel totalizer to determine the quantity of fuel onboard. After climbing to a cruise altitude of 14,000 feet above ground level, he discovered that the fuel mixture control was frozen and that he was unable to lean the mixture to a lower fuel flow setting. The pilot reported that because of the increased fuel consumption, he briefly considered an en route stop for additional fuel but decided to continue. During descent, the airplane experienced a complete loss of power in both engines, and the pilot made an emergency off-field, gear-up landing about 7 miles from the destination. The airplane impacted terrain and thick scrub trees, which resulted in substantial damage to both wings, both engine mounts, and the fuselage. A postaccident examination found that only a trace of fuel remained. The pilot also reported that there was no mechanical malfunction or failure and that his inadequate fuel management was partly because he had become overconfident in his abilities after 50 years of flying.", "probable_cause": "The pilot’s improper fuel management, which resulted in a loss of engine power due to fuel exhaustion."}