{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-near-sverdlovsk-1-killed", "date": "Oct 11, 1951 at 0340 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Sochi – Krasnodar – Rostov-on-Don – Voronezh – Penza – Kazan – Sverdlovsk", "msn": "184 285 02", "yom": 28, "flight_number": "SU521", "city": "Sverdlovsk", "zone": "Sverdlovsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4169, "circumstances": "The aircraft departed Kazan Airport at 2250LT in good weather conditions bound for Sverdlovsk-Koltsovo Airport. The crew was cleared to climb to 3,000 meters and later, encountered marginal weather conditions with clouds, icing conditions and light snow. In such conditions, the crew requested permission to reduce his altitude and descended to 1,800 meters in icing conditions. The radio operator tried several times to contact ATC in Koltsovo without success. Unable to locate his position due to low visibility and the failure of the radiocompas, the crew lost his orientation and due to a imminent fuel exhaustion, the captain decided to attempt an emergency belly landing. The airplane hit trees and crashed in a prairie located about 70 km west of Sverdlovsk and was damaged beyond repair. All 10 occupants were wounded and the copilot died from his injuries a day later. ", "probable_cause": "It was determined that the accident resulted from a loss of orientation on part of the crew leading to an emergency landing attempt due to exhausted fuel reserves. The following factors were considered as contributory:\n- weather conditions deteriorated en route with icing conditions that were not reported in the weather forecast bulletin transmitted to the crew prior to departure,\n- malfunction or failure of the radiocompas and a communication antenna, probably due to icing conditions,\n- negligence on part of the crew who failed to follow the procedures for a radiocompas navigation, failed to perform the appropriate heading and tracking calculations and failed to refer to the direction-finding (ADF) values,\n- failure of the air traffic controller who authorized the crew to climb to the altitude of 3,000 meters with the presence of severe icing conditions,\n- crew fatigue due to a near 14 consecutive hours duty time,\n- a copilot was refused on board before departure due to intoxication and the captain decided to do the flight without him. As a result, the flight was started with a limited crew which was also considered as a contributing factor."}