{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6b2-h4-turbo-porter-livrasco-2-killed", "date": "Sep 20, 2020 at 0949 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "Sky%20Team%20Cremona", "flight_phase": "Landing (descent or approach)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cremona - Cremona", "msn": "902", "yom": 1993, "flight_number": null, "city": "Livrasco", "zone": "Lombardy", "country": "Italy", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4400, "captain_hours_type": 2500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4920, "circumstances": "The single engine airplane departed Cremona-Migliaro Airport in the morning on a local skydiving flight, carrying eight skydivers and one pilot. This was the second sortie of the day. Once the altitude of 4,000 metres was reached, all eight skydivers successfully jumped out and the pilot started the descent to return to the airport. While descending to runway 11, the airplane collided with the eighth skydivers that hit the left wing and the vertical stabilizer. A large section of the left wing separated, causing the airplane to enter an uncontrolled descent and to crash in a cornfield located in Livrasco, about two km north of the airport. The pilot and the skydiver were killed. The airplane was totally destroyed. ", "probable_cause": "The cause of the accident was an in-flight collision between the Pilatus PC-6 descending and a free-falling track-suit parachutist. This collision resulted in a loss of control of the aircraft in flight and the destruction of the left wing of the aircraft, which fell to the ground uncontrolled.\r\nThe following factors contributed to the accident:\r\n- Inadequate coordination between pilot and parachutist in relation to their respective descent and drift paths,\r\n- The meteorological conditions at the time of the parachutist's exit from the aircraft, which took place in cloud and in the absence of visual contact with the ground, in a situation, therefore, incompatible with VFR flight rules and ENAC regulations for parachuting,\r\n- The absence of codified procedures at the Italian level, integrating the procedures for jumps with those of aircraft operators used for parachute jumps, including deconfliction between descending aircraft and parachutists performing drift or wingsuit jumps.\r\nThe inadequate coordination between the pilot and parachutist in relation to their respective descent and drift paths could also be attributable to the absence of a responsible person to ensure that the above mentioned coordination was in place. In addition to the above mentioned criticalities, the ANSV investigation activity revealed, also in the present case, a general lack of rules and controls regarding parachuting activities carried out outside of training activities, which reasonably contributed to the occurrence of the investigated aircraft accidents."}