{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-4y0-east-midlands-47-killed", "date": "Jan 8, 1989 at 2025 LT", "type": "Boeing 737-400", "operator": "British%20Midland%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "London - Belfast", "msn": "23867", "yom": 1988, "flight_number": "BD092", "city": "East Midlands", "zone": "Leicestershire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 118, "pax_fatalities": 47, "other_fatalities": 0, "total_fatalities": 47, "captain_hours": 13176, "captain_hours_type": 763, "copilot_hours": 3290, "copilot_hours_type": 192, "aircraft_hours": 521, "circumstances": "British Midland Airways Flight BD092 took off from London-Heathrow Airport at 1952LT on a flight to Belfast, Northern Ireland. Some 13 minutes later, while climbing through FL283, moderate to severe vibration was felt, accompanied by a smell of fire in the cockpit. The outer panel of one of the n°1 engine fan blades detached, causing compressor stalls and airframe shuddering. Believing the n°2 engine had been damaged the crew throttled it back. The shuddering stopped and the n°2 engine was shut down. The crew then decided to divert to East Midlands Airport. The flight was cleared for an approach to runway 27. At 900 feet, 2.4 nm from the runway threshold, the n°1 engine power suddenly suffered a decrease in power. As the speed fell below 125 knots, the stick shaker activated and the aircraft struck trees at a speed of 115 knots. The aircraft continued and impacted the western carriageway of the M1 motorway 10 meters lower and came to rest against a wooded embankment, 1'023 meters short of runway threshold. 47 passengers were killed while all other occupants were injured, some of them seriously. ", "probable_cause": "The operating crew shut down the n°2 engine after a fan blade had fractured in the n°1 engine. This engine subsequently suffered a major thrust loss due to secondary fan damage after power had been increased during the final approach to land. \r\nThe following factors contributed to the incorrect response of the flight crew: \r\n1. The combination of heavy engine vibration, noise, shuddering and an associated smell of fire were outside their training and experience; \r\n2. They reacted to the initial engine problem prematurely and in a way that was contrary to their training; \r\n3. They did not assimilate the indications on the engine instrument display before they throttled back the n°2 engine; \r\n4. As the n°2 engine was throttled back, the noise and shuddering associated with the surging of the n°1 engine ceased, persuading them that they had correctly identified the defective engine; \r\n5. They were not informed of the flames which had emanated from the n°1 engine and which had been observed by many on board, including 3 cabin attendants in the aft cabin."}