{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-500a-near-livermore-4-killed", "date": "May 19, 1994 at 1754 LT", "type": "Rockwell Aero Commander 500", "operator": "Michelle M. Mellor", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Hayward - Hayward", "msn": "500-1073-47", "yom": 1961, "flight_number": null, "city": "Livermore", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 23700, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft had not flown for 2 years. Before flight, a mechanic saw evidence of fuel leaking at drain holes in the left wing root, just aft of the main cabin door. He brought this to the attention of the pilotrated passenger, who shortly thereafter, departed in the aircraft with the pilot (pic), the aircraft owner and a passenger/mechanic. About 14 minutes after takeoff, radar data showed the aircraft transitioning from a climb to a descent, while in a 180°turn. Also, witnesses saw smoke/flames trailing from the aircraft. Subsequently, the aircraft impacted trees and power lines, then it crashed in a small flat field in hilly terrain. Post-crash examination revealed melted aluminum spatters on the leading edge and underside of the left horizontal stabilizer. Also, 'focalized' fire damage was noted on the cabin behind the drain holes in the left wing root. Tetrahydrocannabinol carboxylic acid (marijuana) was detected in the pilot-rated passenger's blood (0.004 ug/ml) and urine (0.010 ug/ml).", "probable_cause": "A fuel system leak, inadequate preflight by the pilot (pic), and by the non-flying pilot/passenger intentionally allowing operation of the aircraft with a known deficiency (fuel leak). A factor related to the accident was: the lack of suitable terrain for a forced landing."}