{"url": "https://www.baaa-acro.com/crash/crash-canadair-regionaljet-crj-100er-kigali-1-killed", "date": "Nov 12, 2009 at 1315 LT", "type": "Canadair RegionalJet CRJ-100", "operator": "Jetlink%20Express", "flight_phase": "Taxiing", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kigali - Entebbe", "msn": "7197", "yom": 1997, "flight_number": "WB205", "city": "Kigali", "zone": "Kigali City", "country": "Rwanda", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 11, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 11478, "captain_hours_type": 1110, "copilot_hours": 1558, "copilot_hours_type": 533, "aircraft_hours": 17140, "circumstances": "Shortly after takeoff, when the Copilot pulled back the thrust levers of both engines to the desired positions, the thrust lever on left engine could not move and the engine remained in full power. The Pilot in Command (PIC) then informed Air Traffic Controller (ATC) that the aircraft had a technical problem and requested to return to the airport. The crew managed to land safely with the Copilot and accompanying company maintenance engineer struggling to control the left engine which was on high power setting and the PIC controlling the aircraft using only the right hand engine. The aircraft taxied to parking bay number 4 with the left engine still in full power. The captain applied the parking brake and the aircraft stopped for a while and before putting on the chocks, the aircraft started moving forward at a high speed through the jet blast fence and crashed into Control Tower building. A passenger was killed, six people were injured, three seriously.", "probable_cause": "The flight crew’s failure to identify corrective action and their lack of knowledge of applicable airplane and engine systems in response to a jammed thrust lever, which resulted in the number 1 engine operating at high power and the airplane configured in an unsafe condition that led to the need to apply heavy braking during landing. Also causal was the flightcrew failure to recognize the safety hazard that existed from overheated brakes and the potential consequence on the braking action needed to park the airplane. Contributing factors included the possible failure by maintenance crew to correctly stow the upper core cowl support strut after maintenance, Flight crew’s failure to follow standard operating procedures, the company’s failure to be availed to manufacturer safety literature on the subject, and the susceptibility of the cowl core support shaft to interfere with the throttle control mechanism when the core strut is not in its stowed position. "}