{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c-45h-expeditor-longmont", "date": "Jul 19, 2007 at 0900 LT", "type": "Beechcraft C-45 Expeditor", "operator": "American%20Airpower%20Heritage%20Museum", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Hudson - Boulder", "msn": "AF-12", "yom": 1946, "flight_number": null, "city": "Longmont", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15000, "captain_hours_type": null, "copilot_hours": 20000, "copilot_hours_type": 13, "aircraft_hours": 3925, "circumstances": "During the instructional flight, the instructor shut down the right engine and feathered the propeller. It was subsequently restarted, but the left engine started running rough and began to vibrate. The left engine was shut down and the propeller feathered. Level flight was maintained from power produced by the right engine. The left engine was then restarted but instead of producing thrust, the engine produced more drag so it was secured again. Then the right engine began losing power. Full power was applied but the airplane continued to descend. The instructor lowered the landing gear and while in-transit, the airplane clipped the tops of trees. He was able to guide the airplane between two houses and impacted an open field. The airplane bounced across the road, struck a power pole, and caught fire. The two pilots evacuated the airplane via the main cabin door. Examination at the airport of departure disclosed two pools of oil at the approximate positions of the two engines. There were two trails of oil leading from the parking spot down the taxiway and onto the runway. Both engines were partially disassembled and examined. There was evidence that both engines had failed catastrophically due to oil starvation. The left engine crankshaft was broken and all the piston heads were at the tops of their cylinders. Pieces of metal were recovered from the right engine oil sump. According to the operator, the engine rocker box recovery system must be drained during preflight to avoid hydraulic lock. The instructor stated that when they preflighted the airplane, the drain valves were open (the drained oil is captured and recycled). He thought they had closed both valves. According to the operator, either the pilot's failed to close the drain valves or they were jammed in the open position. The operator said the latter was unlikely \"because you can feel it move when you close it.\"\n", "probable_cause": "The instructor pilot's improper preflight in that he failed to close the rocker box recovery system drain valves, resulting in a total loss of lubricating oil and subsequent oil starvation to both engines. A contributing factor was the trees.\n"}