{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-sandersville", "date": "Aug 9, 2001 at 0948 LT", "type": "Beechcraft 200 Super King Air", "operator": "Warren Manufacturing", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dublin - Sandersville", "msn": "BB-1637", "yom": 1998, "flight_number": null, "city": "Sandersville-Kaolin", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4900, "captain_hours_type": 978, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 996, "circumstances": "The flight made two instrument approaches to minimums and executed two missed approaches before the crew elected to land about 25 miles south and wait for the low ceiling condition to improve. An hour later, having topped off fuel tanks, confirmed by telephone that destination weather was improving, the flight re-launched to their original destination. They executed a GPS-A, (circling) instrument approach, broke out of instrument conditions about 100 ft. above minimums, (600 feet, agl) and about one mile from the runway, and started a right downwind turn to enter a left base leg for landing runway 30. During the turn to final approach, the crew extended the landing gear and flaps for landing, and according to the copilot, the pilot flew through the extended runway centerline requiring a, \" teardrop turn back toward the runway. In the turn the bank angle was about 45 degrees, the descent rate increased rapidly and a faint warning [stall warning] sounded, the nose then pitches down and [the PIC] screams as he shoves both throttles full forward and using both hands pulls the yoke back and as soon as the nose came above the horizon the plane impacted the ground wings were fairly level mains hit first and we paralleled the runway about fifty feet or so to the right of the runway\". The impact sheared the landing gear, shed the propellers, broke the engines from their mounts, started a fire in the left engine, and broke open the fuselage 3 feet aft of the cabin pressure bulkhead. The two pilots and three of four passengers received minor injuries, and one passenger received serious injuries. The cockpit voice recorder was shipped to the NTSB Vehicle Recorders Laboratory in Washington, DC. Readout of data recorded from the cockpit area microphone revealed that 6.4 seconds before impact the stall warning sounded, and 4.4 seconds before impact the altitude alerter sounded.", "probable_cause": "The pilot-in command's failure to maintain airspeed during the approach, resulting in an inadvertent stall and in-flight collision with the terrain during an uncontrollable descent."}