{"url": "https://www.baaa-acro.com/crash/crash-sncase-se161-languedoc-nice-38-killed", "date": "Mar 3, 1952 at 0810 LT", "type": "SNCASE SE.161 Languedoc", "operator": "Air-France-31", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tunis – Nice – Paris", "msn": "43", "yom": 1948, "flight_number": null, "city": "Nice", "zone": "Alpes-Maritimes", "country": "France", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 34, "pax_fatalities": 34, "other_fatalities": 0, "total_fatalities": 38, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Forty-five seconds after takeoff from runway 04 at Nice Airport, while in initial climb, the four engine aircraft banked left, overturned and crashed in a huge explosion near the Saint-Augustin station, north of the airfield. The airplane disintegrated on impact and only a female passenger was found alive. Unfortunately, she died from her injuries four days later. Among those killed were both French actresses Michèle Verly and Lise Topart, and also the Welsh politician John Emlyn-Jones. \r\nCrew:\r\nMr. Farrugia, pilot,\r\nMr. Fraillon, radio operator, \r\nMr. Cavaille, mechanic, \r\nMr. Biancheri, steward. ", "probable_cause": "It was decided that the unusual path of the aircraft immediately following the take-off, was due to the blocking of the ailerons to the left at an angle of approximately 10 degrees. It was determined on the basis of analysis that the probable cause of the blocking was the unclamping of a link cheek of the upper rear chain of the co-pilot's control column, as a result of which the chain slipped off the sprocket and jammed against the internal boss of the pin which locks the ailerons in the neutral position. More broadly, the investigation brought to light the difficulty of setting and inspecting the chains inside the dual control columns. This difficulty is directly attributable to the design, and may cause certain chains which have not been properly studied in relation to the type of service for which they are intended, to become unclamped by torsion during maintenance and setting work."}