{"url": "https://www.baaa-acro.com/crash/crash-cessna-208-caravan-i-lake-seul", "date": "Mar 8, 2022 at 1310 LT", "type": "Cessna 208A Caravan", "operator": "Bamaji%20Air", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Sioux Lookout – Springpole Lake", "msn": "208-0343", "yom": 2001, "flight_number": null, "city": "Lake Seul", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1315, "captain_hours_type": 126, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 08 March 2022, the Bamaji Air Inc. (Bamaji) wheel-equipped Cessna 208 Caravan aircraft (registration C-GIPR, serial number 20800343) was conducting a series of visual flight rules (VFR) flights from Sioux Lookout Airport (CYXL), Ontario. At 1031, after checking the aerodrome forecast (TAF) valid from 0900 to 2000, and the graphic area forecast (GFA) valid from 0600 to 1800, the pilot departed on a flight to an ice runway on Springpole Lake, Ontario, about 78 nautical miles (NM) north-northwest of CYXL. The aircraft returned to CYXL with 2 passengers at 1200. In preparation for a second flight to Springpole Lake, the pilot loaded approximately 900 pounds of freight into the cabin and secured it under a cargo net. The aircraft had 750 pounds of fuel remaining on board, which was sufficient for the planned flight. The pilot and 1 passenger boarded the aircraft. The pilot occupied the left cockpit seat and the passenger occupied the right cockpit seat. Both occupants were wearing the available 5-point-harness safety belt system. At 1250, a snow squall began to move across CYXL, reducing ground visibility. The pilot taxied the aircraft to a position on the apron and waited for the fast-moving snow squall to pass. At 1301, the pilot taxied the aircraft to Runway 34 and took off in visual meteorological conditions. The aircraft climbed to approximately 1800 feet above sea level (ASL), then, once clear of the control zone, it descended to approximately 1600 to 1700 feet ASL, roughly 500 to 600 feet above ground level (AGL), to remain below the overcast ceiling. As the aircraft began to cross Lac Seul, Ontario, the visibility straight ahead and to the west was good. However, when the aircraft was roughly midway across the lake, it encountered turbulence and immediately became enveloped in whiteout conditions generated by a snow squall. The pilot turned his head to inspect the left wing and saw that ice appeared to be accumulating on the leading edge. He turned his attention back to the flight instruments and saw that the altimeter was descending rapidly. He then pulled back on the control column to stop the descent; however, within a few seconds, the aircraft struck the frozen surface of Lac Seul, approximately 17 NM north-northwest of CYXL. The aircraft was substantially damaged. There was no fire. The aircraft occupants received minor injuries. The Artex Model Me406 emergency locator transmitter (ELT) activated on impact and the signal was detected by the Cospas-Sarsat satellite system. The Joint Rescue Coordination Centre in Trenton, Ontario, re-tasked a Royal Canadian Air Force aircraft that was in the area and 3 search and rescue technicians (SAR Techs) parachuted into the site within 1 hour of the accident. The aircraft occupants and the SAR Techs were extracted from the site by a civilian helicopter later that day.", "probable_cause": "The accident occurred while the aircraft was crossing a large, frozen, snow-covered lake at low altitude. Other than some small islands and the distant treed shorelines, there were few features to provide visual references. The terrain, coupled with the snow squalls that were passing through the area generated circumstances conducive to the creation of localized whiteout conditions."}