{"url": "https://www.baaa-acro.com/crash/crash-learjet-c-21a-talil-afb", "date": "Nov 2, 2009 at 1430 LT", "type": "Learjet C-21A", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "35-540", "yom": 1985, "flight_number": null, "city": "Talil AFB (Imam Ali)", "zone": "Dhī Qār (ذي قار)", "country": "Iraq", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was completing a positioning flight to Talil AFB (Imam Ali), Iraq. On approach, the aircraft was too high and descended with an excessive speed and a tailwind component of 10 knots. The crew failed to initiate a go-around and the aircraft landed about two-third down the runway. Unable to stop within the remaining distance, the aircraft overran, lost its undercarriage and came to rest in a sandy area about 60 metres past the runway end. Both pilots escaped uninjured while the aircraft was damaged beyond repair and later destroyed by soldiers from the 68th Transportation Company. ", "probable_cause": "The accident investigation board (AIB) president found clear and convincing evidence that the mishap crew failed to sufficiently reduce speed and altitude during their approach to execute a normal landing, failed to complete the appropriate checklist for a high speed partial flap landing, and failed to recognize that there was insufficient runway remaining to safely land. Finally, the mishap crew failed to initiate a 'Go-Around' to correct the aforementioned deviations. Additionally, the AIB president also found sufficient evidence that skill-based errors, judgment and decision-making errors, cognitive factors, psycho-behavioural factors, coordination, communication and planning factors, and planning inappropriate operations all were substantially contributing factors to the mishap."}