{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-near-morton-3-killed", "date": "Oct 25, 2010 at 0745 LT", "type": "Cessna 340", "operator": "PCLI", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Chehalis – Lewiston", "msn": "340A-1527", "yom": 1982, "flight_number": null, "city": "Morton", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 5493, "captain_hours_type": 1525, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6102, "circumstances": "About 14 minutes after departing on the cross-country flight in instrument meteorological conditions, the airplane was observed on radar climbing through 14,800 feet mean sea level (msl). At this time, the pilot radioed to air traffic control (ATC) that he was returning to the departure airport. About 7 seconds later, the pilot transmitted that he had lost an engine and again stated that he was returning to the departure airport. About 50 seconds later, the pilot transmitted, “We’re losing it.” There was no further communication with the pilot. Radar data revealed that at 14,800 feet msl the airplane began a right 360-degree turn at 8 degrees per second, and about 120 degrees into the turn, it began a descent averaging 5,783 feet per minute. The airplane remained in a right turn until radar contact was lost at 10,700 feet msl. The airplane impacted a 30-degree slope of a densely forested mountain about 2,940 feet msl in a near vertical, slightly right-wing-low attitude. A logger working in the area reported hearing a “very loud roaring sound,” like an airplane diving toward his location and that it seemed to be “really under power.” The logger described the weather as being “socked in,” with light rain and not much wind. Post accident examination revealed that propeller damage was the result of impact forces, with no indications of fatigue or propeller failure before impact. It was also noted that the left propeller was being operated under conditions of some power at impact, while the right propeller was not operating under conditions of significant power at impact. Based on these findings, it is most likely that the pilot experienced a partial loss of power of the right engine and, after incorrectly initiating a right turn into the failed engine, allowed the rate of turn to increase to the point that the airplane became uncontrollable before impact with terrain. The reason for the partial loss of engine power was not determined because postaccident examination of the airframe and both engines did not reveal any mechanical malfunctions or failures that would have precluded normal operation.", "probable_cause": "The pilot’s failure to arrest the excessive rate of turn into the failed engine, which resulted in a loss of control and subsequent impact with terrain. Contributing to the accident was a partial loss of engine power for reasons that could not be determined because postaccident examination did not reveal any mechanical malfunctions or failures that would have precluded normal operation."}