{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-near-homestead-2-killed", "date": "Jan 31, 2004 at 1632 LT", "type": "Beechcraft 90 King Air", "operator": "Global Aerofleet", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Marathon – Fort Lauderdale", "msn": "LJ-727", "yom": 1977, "flight_number": null, "city": "Homestead AFB", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4528, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8208, "circumstances": "The instrument rated pilot received three weather briefings on the date of the accident from the Miami Automated Flight Service Station. The pilot obtained his IFR clearance while airborne, was advised to climb to 9000 feet mean sea level (MSL), then later advised to descend and maintain 2000 feet, and to fly heading 030 degrees. Radar data indicates that following the instruction from the controller, the airplane made a right descending turn to a southeasterly heading, followed by a left turn to an easterly heading where the airplane was lost from radar while at 2,200 feet mean sea level. The crash was located 138 degrees and .38 nautical mile from the last radar target. Between 1631:04, and 1631:16, the airplane descended from 7,600 to 6,100 feet. Between 1631:16, and the last radar target 12 seconds later at 1631:28, the airplane descended 3,900 feet. Weather radar data indicates the airplane encountered video integrator and processor (VIP) Level 2, or \"moderate intensity\" echoes in the area of the in-flight loss of control. Approximately 10 and 20 miles east-northeast through southeast of the accident site, maximum echoes of VIP Level 5 to 6, or \"intends to extreme intensity\" echoes were noted. The strongest reflectivities were located 20 miles east of the accident site. Disintegration of the airplane was noted; there was no evidence of in-flight, or post crash fire of any recovered components. The full span of the left wing, left aileron, left horizontal, and left elevator were accounted for. A section of the right wing and right outboard flap was identified; the right wing was fragmented. Examination of the engine and propellers revealed no evidence of preimpact failure or malfunction. No determination was made whether the pilot met the instrument recency of experience requirement of 14 CFR Part 61.57 (c).", "probable_cause": "The pilot's inadequate in-flight planning/decision which resulted in an encounter with rain showers and turbulence, a loss of aircraft control, and overstress of the airframe."}