{"url": "https://www.baaa-acro.com/crash/crash-pac-750xl-near-yahukimo-2-killed", "date": "Oct 3, 2012 at 1120 LT", "type": "PAC 750XL - Pacific Aerospace Corporation", "operator": "Tariku%20Aviation", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Jayapura - Korupun - Dekai", "msn": "157", "yom": 2009, "flight_number": null, "city": "Yahukimo", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1546, "captain_hours_type": 1315, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 03 October 2012, a Pacific Aerospace LTD, PAC 750 XL aircraft registration PK-RWT was being operated by Yayasan Pelayan Penerbangan Tariku on a cargo supply flight from Koropun to Dekai in Papua area. This flight was the 9 th flight of that day. All flights were performed in accordance to the Visual Flight Rules (VFR). The first flight was from Sentani to Langda which was arrived at 2220 UTC (0720 LT). The aircraft arrived Koropun at 0120 UTC (1020 LT) as reported by the pilot through the company flight following system . The aircraft then departed Koropun to Dekai and lost contact during this flight. On board in this flight were one pilot, one passenger and 975 kg of cargo when departure from Sentani. The distance between Koropun to Dekai is about 24.6 Nm and normally takes about 11 minutes. The weather information issued by Badan Meteorologi Klimatologi and Geofisika/BMKG (Indonesia Meteorology Climatology and Geophysics Agency) between 0200 UTC to 0300 UTC, showed the development of cumulus cloud classified as Middle Cloud formation along the route from Koropun to Dekai. According to the company flight following procedure, the pilot should report after the aircraft lands by mentions “aircraft on the ground” which this means that the aircraft had arrived at destination. After aircraft airborne, the pilot should report aircraft airborne time and give the estimate of time arrival at destination. The last contact of the pilot was “the aircraft on the ground Koropun” at 0120 UTC. Normally, the next report would be within 15 up to 20 minutes after arrival. There was no report from the pilot after 20 minutes of the last report. The flight following officer tried to contact the pilot and was unsuccessful. At 0145 UTC, the Operation Manager of the aircraft operator received information from the New Zealand Search and Rescue Agency that informed that Local User Terminal (LUT) has received ELT distress signal from PK-RWT. This information was followed by information through email, which was received at 0150 UTC. Based on this information, the Indonesia Search and Rescue operation was initiated. The aircraft was found on 5 October 2013, in mountainous area with approximate elevation of 7,000 feet, at coordinate 04°28.62’S 139°39’E. The crew and passenger on board were fatally injured and the aircraft substantially damaged.", "probable_cause": "The accident was classified as Controlled Flight into Terrain (CFIT), which most likely the aircraft was flown into the weather environment below the VFR margins. "}