{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-620-cheyenne-ii-lebanon-springfield-8-killed", "date": "Feb 16, 1982 at 2019 LT", "type": "Piper PA-31 Cheyenne", "operator": "GNC Energy Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Mobile - Lebanon-Springfield", "msn": "31-8166004", "yom": 1981, "flight_number": null, "city": "Lebanon-Springfield", "zone": "Kentucky", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 2500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 140, "circumstances": "The flight was cleared to maintain 3,000 ft msl until over the airport, then cruise. The pilot had previously stated that he could see the lights on the ground and that he was 15 miles from the airport. At 2013 the pilot stated \"we oughta be able to cancel here.\" The aircraft would have been about 6 mi from the airport. The airport operator heard an aircraft low overhead and was able to see stars. Other ground witnesses closer to the point of impact observed very thick patchy fog with visibility about 200 ft. One witness observed the aircraft navigation lights do some unusual maneuvering, while another witness saw the lights very low. The aircraft impacted the ground in a left wing low, near level flight attitude. The wreckage was co-located with an approximate downwind to base leg turn. There is a single VOR/DME approach to rwy 11. The MDA is 1,260 ft and requires a minimum visibility of 1 mile. The circling approach has an MDA of 1,420 ft and also requires a minimum visibility of 1 mile. The pilot had received an altimeter setting of 29.77. The aircraft's altimeter was set between 30.29 and 30.30.", "probable_cause": "Occurrence #1: in flight collision with terrain/water\r\nPhase of operation: approach - VFR pattern - base turn\r\nFindings\r\n1. (f) light condition - dark night\r\n2. (f) weather condition - fog\r\n3. (c) aborted landing - not performed - pilot in command\r\n4. (c) proper altitude - not maintained - pilot in command\r\n5. (f) altimeter setting - improper - pilot in command\n"}