{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690a-little-rock-1-killed", "date": "May 17, 1988 at 0532 LT", "type": "Rockwell Grand Commander 690", "operator": "Bankair", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Atlanta – Memphis – Little Rock", "msn": "690-11305", "yom": 1976, "flight_number": null, "city": "Little Rock", "zone": "Arkansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6410, "captain_hours_type": 1562, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6577, "circumstances": "The pilot had just returned from vacation in the Bahamas before starting a flight from Little Rock to Atlanta with an intermediate stop at Memphis. This itinerary was followed by a return flight to Little Rock via a reverse routing. Witnesses reported the pilot said he had only 2 hours of sleep before departing Little Rock and that he was really tired. Also, company personnel noted the pilot looked 'extremely tired' and was 'really dragging' prior to the last leg of the flight from Memphis to Little Rock. According to ATC personnel, the flight was routine until the aircraft was arriving at Little Rock. During arrival, the pilot was cleared to descend from 7,000 feet to 2,000 feet at his discretion for a visual approach to runway 22. At 0522 cdt, the pilot reported the airport in sight and was cleared for a visual approach. About 4 minutes later, he again reported the airport in sight and was cleared to land. At 1031, radar contact was lost and the aircraft crashed about 4 miles west of the airport. Initial impact was in an open field while descending in a relatively level attitude. The aircraft became airborne for about 3/4 mile, then crashed out of control in the Arkansas River. The pilot, sole on board, was killed. ", "probable_cause": "Occurrence #1: loss of control - in flight\r\nPhase of operation: approach\r\nFindings\r\n1. (c) judgment - poor - pilot in command\r\n2. (f) light condition - dawn\r\n3. Descent - initiated\r\n4. (c) level off - not performed - pilot in command\r\n5. (c) fatigue (lack of sleep) - pilot in command\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: approach"}