{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-440f-metropolitan-spokane", "date": "Jan 4, 1996 at 1853 LT", "type": "Convair CV-440 Metropolitan", "operator": "SalAir", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Phoenix - Spokane", "msn": "153", "yom": 1954, "flight_number": null, "city": "Spokane-Intl (Geiger Field)", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5194, "captain_hours_type": 817, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8642, "circumstances": "Before the ferry flight, the pilot (PIC) & inexperienced copilot noted the left & right, float-type, underwing, fuel gauges indicated about 3,900 & 4,050 lbs of fuel, respectively. After takeoff, they noted that the cockpit gauges showed an opposite fuel imbalance of 4,100 & 3,600 lbs in the left & right tanks. Due to this indication, the PIC crossfed fuel from the left tank to both engines for about 30 min to rectify the perceived fuel imbalance. Later as they approached the destination, the left tank was exhausted of fuel, & the left engine lost power, although the left gauge indicated about 500 lbs of fuel remaining in that tank. The PIC then crossfed fuel from the right tank to both engines, & left engine power was restored. ATC vectored the flight for an emergency ILS runway 3 approach. The PIC was distracted during the approach & maneuvered the airplane to re-intercept the localizer. About 500' agl in IMC, both engines lost power. During a forced landing at night, the airplane struck a raised berm & was damaged. No evidence of fuel was found in the left tank; 125 gal of fuel was found in the right tank. Unusable fuel was published as 3 gal. During an exam of the engines & fuel system components, no preimpact failure was found. Historical data from the manufacturer indicated that when the airplane had a low fuel state, unporting of fuel tank outlets could occur during certain maneuvers. This information was not in the Convair 340 flight manual, although unporting of the outlets on this flight was not verified. ", "probable_cause": "The pilot's improper management of the fuel/system, which resulted in loss of power in both engines, due to fuel starvation. Factors relating to the accident were: false indications of the cockpit fuel gauges, darkness, and the presence of a berm in the emergency landing area. "}