{"url": "https://www.baaa-acro.com/crash/crash-cessna-650-citation-vii-guarda-mor-4-killed", "date": "Nov 10, 2015 at 1904 LT", "type": "Cessna 650 Citation VII", "operator": "Bradesco", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Brasília – São Paulo", "msn": "650-7083", "yom": 1998, "flight_number": null, "city": "Guarda-Mor", "zone": "Minas Gerais", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 13143, "captain_hours_type": null, "copilot_hours": 2527, "copilot_hours_type": 1633, "aircraft_hours": null, "circumstances": "The aircraft took off from the Presidente Juscelino Kubitschek (SBBR) Aerodrome, Brasília - DF, to the Congonhas Aerodrome (SBSP), São Paulo - SP, at 2039 (UTC), to carry out a personnel transportation flight with two crewmembers and two passengers on board. During the cockpit preparation procedure, the crew members commented about the operation of the Pitch Trim System. The first flight of the day, that occurred in the morning, was from São Paulo to Brasilia and with no abnormalities. About thirty minutes after take-off from Brasília, still during the climb, near the FL370, the cabin voice recorder recorded a characteristic sound of the aircraft’s horizontal stabilizer moving. Then, the aircraft made a downward trajectory with high speed and a big rate of descent until the impact against the ground. The aircraft was destroyed. All occupants perished at the site, among them Lúcio Flávio de Oliveira and Marco Antonio Rossi, two Directors of Banco Brasdesco.", "probable_cause": "Contributing factors:\r\n- Control skills – undetermined\r\nIt is possible that, after inadvertent movement of the horizontal stabilizer, the crewmembers did not operate on the control switches of the secondary pitch trim system, since no other warning sound (Clacker) was recorded on the CVR recordings. The action prevised in the emergency procedures Pitch Trim Runaway or Failure, item 3, regarding trimming of the aircraft through the secondary system, possibly, was not performed. The performance of the crew may have been restricted only to the elevator control on the aircraft controls or to the control of the stabilizer associated with the primary trimming mode.\r\n- Attitude – undetermined\r\nThe decision to make the flight without the proper functioning of the primary pitch trim and autopilot system may have been the result of the pilot's self-confidence because of the successful previous flight under similar operating conditions. Considering the hypothesis that the updated Shutdown Checklist, which should incorporate the Stabilizer Trim Backdrive Monitor - TEST, was not performed after the precrash flight, one could consider that there was a lack of adhesion to the aircraft operating procedures. Such an attitude could be associated with the pilot's self-confidence about the aircraft's operating routine, whose acquired experience could have given him the habit of ignoring some of the procedures deemed less important during the flight completion phase.\r\n- Crew Resource Management – a contributor\r\nThroughout the flight, there was an absence of verbalization and communication of the actions on the checklist. Similarly, in the face of the emergency situation of the horizontal stabilizer (Pitch Trim Runaway or Failure), no statements were identified regarding the actions required to manage this situation among the crew. These characteristics denote inefficiency in the use of human resources available for the aircraft operation.\r\n- Training – undetermined\r\nIt is possible that the absence of a periodic training in simulator, especially the emergency Pitch Trim Runway or Failure, has affected the performance of the crew, as far as the CVR did not record statements related to the actions required by the abnormal condition experienced.\r\n- Organizational culture – undetermined\r\nThe operator did not usually properly fill out the PT-WQH flight logbook. This condition evidenced the existence of informal rules regarding the monitoring of the operational conditions of the aircraft. In this context, it is possible that the history of failures related to the pitch trim system has not been registered.\r\n- Piloting judgment – undetermined\r\nMoments prior to takeoff, it was recorded in the CVR speeches related to the flight without the autopilot, possibly related to a failure or inoperativeness of the primary pitch trim system. The takeoff with a possible failure in the pitch trim system of the aircraft, showed an inadequate assessment of the risks involved in the operation under those conditions.\r\n- Aircraft maintenance – undetermined\r\nIt was not possible to establish a link between the maintenance services performed on the aircraft in September 2015 and the events that resulted in the accident occurred on 10NOV2015. However, it was not ruled out that an incomplete crash survey was carried out in the pitch trim system of the aircraft, due to the lack of detail of the service orders.\r\n- Decision-making process – a contributor\r\nThe sounds related to the test positions of the Rotary Test Switch have not been recorded in the CVR recording, so it is possible to conclude that the Warning Systems - Check item of the Cockpit Preparation Checklist has not been performed. The decision to perform the flight without the complete execution of all items of the Cockpit Preparation Checklist, prevented the correct verification of the primary longitudinal Trim system of the aircraft and reflected an inadequate judgment about the risks involved in that operation.\r\n- Interpersonal relationship – undetermined\r\nAccording to the CVR data, there was a possible rush of the crew to take-off, even though it was verified that the aircraft's pitch trim system did not work properly. It was not possible to determine if this rush was motivated by passengers’ pressure or self-imposed by the pilot.\r\n- Support systems – undetermined\r\nIt is possible that the Pilots' Abbreviated Checklist - NORMAL PROCEDURES, aboard the aircraft, was outdated, without the incorporation of the Stabilizer Trim Backdrive Monitor - TEST procedure in the Shutdown Checklist. The possible completion of Shutdown Checklist with outdated procedures would have hampered the manufacturer's suggested verification for identification of abnormalities in the aircraft's pitch trim system.\r\n- Managerial oversight – undetermined\r\nThe records and control of the operational check flights, both by the maintenance shop and by the operator, prevised in documentation issued by the manufacturer (SB650- 27-53 and ASL650-55-04) were not performed in an adequate manner, indicating possible weaknesses in the supervision of the maintenance activities."}