{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-340-31-grand-island", "date": "Dec 21, 1962 at 2030 LT", "type": "Convair CV-340", "operator": "Frontier%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kansas City – Saint Joseph – Omaha – Lincoln – Grand Island – North Platte – Scottsbluff – Denver", "msn": "59", "yom": 1953, "flight_number": "FL363", "city": "Grand Island", "zone": "Nebraska", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 39, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16411, "captain_hours_type": 2939, "copilot_hours": 4602, "copilot_hours_type": 1375, "aircraft_hours": 19654, "circumstances": "The first officer, who was flying, started the approach to runway 17 which does not have approach lights nor Instrument landing System. At the time the aircraft was northbound in the holding pattern of the Grand Island VOR. A 90 degree left turn, then a 270 degree right turn was accomplished which aligned the aircraft, with the runway. The following sequence of events was described by the captain and substantiated by the first officer. The captain stated “. . . We completed the approach checklist and made a turn north of the low frequency range (8391 feet from the threshold of runway 17) which was visible as we went over it. The area around the range and the south half of the distance to the airport was absolutely clear. Our path was one which had the runway lights clearly aligned. (The runway lights were on at position 3 which is medium intensity.) The approach was a normal gradual descent. The radios were tuned to the low frequency range and the Omni. Since we were not ready to land our checklist was complete with the exception of approach flaps and landing flaps and ADI on. There were no ground witnesses to the approach or crash which was in a large level open field. There was no moonlight and the captain testified that except for the lights on the range station, there were no ground lights seen under the approach path. Both he and the first officer testified that they did not observe the runway light appear to \"spread,\" which amounts to a visual warning of being very low - nearly at the level of the lights upon approaching the runway. A weather observation at 2037. seven minutes after the accident was: special, clear, visibility 7 miles, temperature 26 degrees F, dewpoint 26 degrees F, wind south 10 knots, altimeter setting 29.80 inches (aircraft accident) (observation recorded but not transmitted via teletype). The initial point of contact of the nosewheel was about three feet to the right of the extended centerline of runway 17 and approximately 4,061 feet short of the threshold of that runway. Additional marks indicate that the aircraft struck while nearly level longitudinally, in a yaw of about six degrees to the right, and in a shallow left bank. Upon initial impact, the left main landing gear collapsed and was torn free. Both propellers struck the ground and were also torn off with the nose cones of their respective engines. The left wing became detached as the aircraft rolled to the left onto its back and slid, inverted, swerving to the left and coming to rest on a heading of about 045 degrees at a distance of 1,275 feet from the place of first contact. Fire developed in the detached left wing, but not in the fuselage. Consequently all 43 occupants were able to evacuate the aircraft quickly, with the majority going out through the galley service door, which the stewardess opened and the others leaving via the emergency exit at seat 8D. The captain left through a cockpit window; the first officer and one passenger through a hole in the fuselage. Injuries were sustained by both pilots and three passengers. The aircraft was destroyed by a post crash fire. ", "probable_cause": "The Board determines the probable cause of this accident was failure of the crew to monitor altitude properly during a landing approach."}