{"url": "https://www.baaa-acro.com/crash/ground-explosion-douglas-c-54b-1-dc-skymaster-ganes-creek", "date": "May 7, 2004 at 2130 LT", "type": "Douglas C-54 Skymaster", "operator": "Brooks%20Fuel", "flight_phase": "Parking", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ganes Creek – Fairbanks", "msn": "10461", "yom": 1945, "flight_number": null, "city": "Ganes Creek", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11250, "captain_hours_type": 5630, "copilot_hours": 7465, "copilot_hours_type": 1560, "aircraft_hours": 29667, "circumstances": "The crew of the 4 engine airplane started its engines for a positioning flight from a remote mining airstrip. Following the startup of the engines, an explosion occurred in the left wing area aft of the number 1 engine firewall and number 1 auxiliary fuel tank. The airplane was parked next to the mine's fuel storage tank, and the pilot added power on the remaining engines to move away from the storage tank. Within seconds of beginning to move, the number 1 engine fell off the burning wing, followed by separation and aft folding of the outboard end of the left wing. The outboard end of the wing, however, was still attached via control cables. The pilot taxied the airplane about 200 feet, dragging the partially burning left wing segment to a pond of water and shut down the remaining engines. The crew evacuated with no injuries. Water was applied to the airplane until the fire was extinguished, about 3 1/2 hours later. NTSB and FAA personnel did not travel to the scene, and the airplane was not recovered from the mining strip. The airplane's left wing powerplant and fuel system consists of the number 1 and 2 engines. Each engine is separated from the wing by a firewall. Within the wing, from outboard to inboard, the fuel tank system consists of the number 1 fuel tank, the left wing auxiliary fuel tank, and the number 2 fuel tank. Each wet-wing type fuel tank contains a submerged electrical boost pump, sump drain valves and fuel quantity transmitters. The fuel system has selector valves, crossfeed valves, and shut-off valves for each tank. An FAA inspector examined portions of the airplane that the operator supplied. The inspector examined a portion of the upper wing surface that had been blown away from the airplane during the initial explosion. He noted that the inside of the upper wing surface, normally positioned over the auxiliary tank, was not charred or sooted. A separated portion of the lower wing surface, near the auxiliary boost pump, was sooted and charred. The aft side of the number 1 engine firewall was not charred. A portion of the number 1 engine nacelle was oily, but not sooted or charred. The operator located the auxiliary in-tank boost pump and sent it to the FAA. The boost pump impeller, encased in a small wire cage, was not melted and could be turned by hand. The body of the pump was sooted but not thermally damaged. Its wire connectors and one fuel line were melted. A smaller line, what appeared to be a return line, was not melted.", "probable_cause": "A fuel tank explosion in the left wing auxiliary fuel tank, and subsequent fuel fire that occurred during engine start for an undetermined reason.\n"}