{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-minneapolis", "date": "Aug 28, 1958 at 0329 LT", "type": "Douglas DC-6", "operator": "Northwest%20Airlines2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Washington DC – Pittsburgh – Cleveland – Detroit – Milwaukee – Minneapolis – Portland – Seattle", "msn": "45200", "yom": 1957, "flight_number": "NW537", "city": "Minneapolis-Saint Paul", "zone": "Minnesota", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 58, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12376, "captain_hours_type": 572, "copilot_hours": 9089, "copilot_hours_type": 148, "aircraft_hours": 4471, "circumstances": "At approximately 0329LT, the airplane crashed on takeoff from Wold-Chamberlain Field, Minneapolis, Minnesota. A number of the 62 persons (including 2 infants) aboard suffered serious injuries but there were no fatalities. Fire, which broke out a short time after all occupants were evacuated, consumed the aircraft. The aircraft took off normally and climbed to a height of about 100 feet. It then gradually nosed over and entered a descent which continued until it struck the ground. Sky conditions were clear; however, the prevailing visibility was about three miles in fog, and in localized areas around the airport it was reduced to lens than a mile by patches of denser fog. Takeoff was made on runway 22 and the climbout was a from a lighted, built-up section toward an open, unlighted area. The Board believes that the pilot while trying to remain contact in reduced visibility allowed the nose of the aircraft to drop when flaps were retracted because of inattention to flight instruments. The darkness and reduced visibility during climbout contributed to a sensory illusion which completely obscured the fact of descent from the pilot.", "probable_cause": "The Board determines that the probable cause of this accident was the pilot's inattention to flight instruments during takeoff in conditions of reduced visibility."}