{"url": "https://www.baaa-acro.com/crash/crash-partenavia-p68b-wilsons-promontory-national-park-2-killed", "date": "Jul 2, 1978 at 1622 LT", "type": "Partenavia P.68", "operator": "I. Tippett", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Flinders Island - Melbourne", "msn": "46", "yom": 1975, "flight_number": null, "city": "Wilsons Promontory National Park", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 420, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the morning of 2.7.78 the pilot obtained the relevant meteorological forecasts and submitted a flight plan to the Moorabbin Briefing Office for a flight from Moorabbin to Flinders Island and return. He did not hold an instrument rating and was therefore restricted to flight in accordance with the Visual Flight Rules (VFR). The forecasts indicated patches of fog over the route initially, with areas of rain developing later in the day. Broken layers of stratus and strato-cumulus cloud were forecast but there was nothing to suggest that VFR flight would not be possible. The VFR flight plan submitted indicated an estimated flight time of 89 minutes to Flinders Island and 72 minutes for the return flight. The fuel endurance was stated as 300 minutes. After being refuelled to capacity, the aircraft departed from Moorabbin at 1007 hours and the pilot subsequently reported in the Flinders Island circuit area at 1143 hours. The aircraft landed at Flinders Island Aerodrome and the pilot and passenger proceeded by motor vehicle to a farming property some 40 kilometres distant. On returning to the aerodrome later in the day the pilot attempted to obtain up-to-date weather information for the return flight but the telephone was found to be unserviceable. By this time, the earlier forecasts covering the route had been amended and generally indicated some deterioration in conditions, particularly in relation to increased cloud at the lower levels. Nevertheless, the forecast conditions suggested that VFR flight could be possible over the route. The amended terminal forecast for Moorabbin also indicated increasing low cloud. The pilot and the passenger were seen to board the aircraft which then took off and circled the aerodrome before being obscured by cloud. At this time the weather to the south of Flinders Island Aerodrome was squally and the nearby mountain was partly covered by cloud. At 1543 hours the pilot established radio communication with Launceston Flight Service Unit (FSU) and reported his departure from Flinders Island at 1541 hours, his intention to cruise below 5000 feet and his estimated time over South East Point (southern end of Wilson's Promontory) as 1617 hours. He also asked for confirmation that Moorabbin Airport was open to VFR traffic. He was advised that Moorabbin was \"not closed to VFR at the moment however they expect it to be\". He was also given the current terminal forecast for Moorabbin and the sections of the relevant area forecasts relating to cloud. He was requested to call Melbourne FSU at 1550 hours. At 1551 hours the pilot established communication with Melbourne FSU and, at 1600 hours, he again asked for confirmation that Moorabbin Airport was open to VFR operations and was advised in the affirmative. He then reported that he was climbing to his planned altitude of 6500 feet and, at 1607 hours, reported that he was climbing to 8500 feet. At 1620 hours he reported an amended estimated time over South East Point as 1625 hours and again requested confirmation that Moorabbin was still open to VFR operations. He was again advised in the affirmative. At 1622 hours the pilot broadcast the call sign of the aircraft once very rapidly and the pitch of his voice was raised above normal. The flight service officer heard but did not understand the call and twice requested the calling aircraft to repeat its call. There was no reply and no further communications were received from the aircraft. Following failure of the aircraft to report position at South East Point, the Uncertainty Phase of search and rescue procedures was declared at 1640 hours. When widespread checks failed to establish the location of the aircraft, the Alert Phase was declared at 1713 hours and this was upgraded to the Distress Phase at 1745 hours. A search of the probability area was carried out by air, land and sea during the next three days and, on the morning of 3. 7. 78, two seats and a left main wheel assembly from a Partenavia P68B aircraft were found on the eastern shoreline of Wilson's Promontory. Additionally, three life jackets with the name \"TIPPETT\" stencilled on them were found in the same area. No trace of the main wreckage of the aircraft, or of the occupants, has been found. Damage to the recovered aircraft seats and wheel assembly was consistent with them having been attached to an aircraft which had struck the water at high speed in a nose down, left wing down attitude. Post analysis of the meteorological situation at the time of the accident indicated that a complex low pressure system was moving across Victoria. There was extensive cloud cover in the Wilson's Promontory area and the base of the lowest cloud was 1000/2000 feet. Visibility was reduced in areas of heavy rain showers. The interaction of differing air masses could have produced conditions conducive to severe airframe icing In respect of aircraft operating at altitudes between 5000 and 7000 feet.", "probable_cause": "There is insufficient evidence available to enable the cause of this accident to be determined. "}