{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54d-10-dc-skymaster-da-nang-77-killed", "date": "Sep 20, 1969 at 1600 LT", "type": "Douglas C-54 Skymaster", "operator": "Air%20Vietnam", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Saigon – Pleiku – Đà Nẵng", "msn": "10860", "yom": 1945, "flight_number": null, "city": "Đà Nẵng", "zone": "Đà Nẵng City District", "country": "Vietnam", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 71, "pax_fatalities": 69, "other_fatalities": 2, "total_fatalities": 77, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Saigon via Pleiku, the crew started the descent to Đà Nẵng in marginal weather conditions. The visibility was relatively limited due to clouds. On final, the DC-4 was cleared to land on runway 17L. At the same time, the crew of a USAF F4E Phantom II registered 67-0393 was approaching runway 17R when he was contacted by ATC and also cleared to land. The crew of the DC-4 understood this message was dedicated to him so the captain made a turn to the right to join the runway 17R approach path. Doing so in limited visibility, he failed to see the Phantom that was approaching from his right side. Both airplane collided and while the Phantom was able to land, the Skymaster entered a dive and crashed in a huge explosion in a rice paddy field located about three km from the runway threshold. Two passengers were seriously injured while 75 other occupants and two people on the ground were killed. Two other people working in the field were also injured. ", "probable_cause": "Misinterpretation of ATC clearance on part of the pilot who modified his approach path, causing the aircraft to collide with a USAF fighter. "}