{"url": "https://www.baaa-acro.com/crash/crash-cessna-414a-chancellor-lawrenceville-3-killed", "date": "Dec 25, 2006 at 2030 LT", "type": "Cessna 414 Chancellor", "operator": "ATA of Broward", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Pahokee - Lawrenceville", "msn": "414-0086", "yom": 1970, "flight_number": null, "city": "Lawrenceville-Gwinett County-Briscoe", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 631, "captain_hours_type": 406, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4313, "circumstances": "According to Atlanta Air Route Traffic Control Center (ARTCC) personnel, the pilot was given the current weather information before attempting his first instrument approach into Gwinnett County Airport-Briscoe Field (LZU), Lawrenceville, Georgia, which included: winds calm, visibility 1/2-mile in fog, and ceiling 100 feet. The pilot acknowledged the current weather information and elected to continue for the instrument landing system (ILS) runway-25 approach. During the first landing attempt, the pilot reported that he was going to execute a missed approach, but that he saw the airport below and wanted to attempt another approach. The ARTCC controller provided the pilot with radar vectors back to the ILS runway-25 approach and again updated the pilot with current weather conditions. During the second approach the tower controller advised the pilot that he was left of the runway-25 centerline. Shortly after the pilot acknowledged that he was left of the centerline, the tower controller saw a bright \"orange glow\" off of the left side of the approach end of runway 25. Although the weather conditions were below approach minimums for the runway 25-approach, the pilot elected to attempt the landing. A flight inspection of the ILS was completed on December 26, 2006, and the results of the inspection revealed that the ILS runway-25 approach system was satisfactory. Examination of the airframe, flight control system components, engines and system components revealed no evidence of preimpact mechanical malfunction.", "probable_cause": "The pilot's failure to follow the instrument approach procedure. Contributing to the accident was the pilot's descent below the prescribed decision height altitude."}