{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2tp-near-vilyuisk", "date": "Aug 16, 2013 at 1345 LT", "type": "PZL-Mielec AN-2", "operator": "Polyarnye%20Avialinii", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Vilyuisk - Kyubeinde-Ugulet", "msn": "1G230-59", "yom": 1988, "flight_number": "PI9977", "city": "Vilyuisk", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3973, "captain_hours_type": 480, "copilot_hours": 374, "copilot_hours_type": 52, "aircraft_hours": 7587, "circumstances": "Few minutes after takeoff from Vilyuisk Airport, on a schedule service (flight n° PI9977) to Kyubeinde-Ugulet, while cruising at an altitude of about 400 metres, the engine overheated and lost power while the oil pressure dropped. The crew decided to return to Vilyuisk when the engine failed shortly later. The captain attempted an emergency landing in a swampy area located 26 km northwest of Vilyuisk (at N63°54.584\" E121°18.048\"). The main wheels got stuck in soft ground, the engine was ripped off, and the aircraft came to rest, bursting into flames. Both pilots and all 9 passengers escaped uninjured and the aircraft was totally destroyed by fire. \n", "probable_cause": " The accident with An-2Т RA-01419 aircraft was caused by emergency landing at the landing place in marsh area selected from air that resulted in main landing gear dipping in soft ground, dynamic pitch-down moment followed by engine ground impact and fuselage separation along engine mounting fitting, airframe structure and gear damage. Gasoline pipeline destruction during engine separation from aircraft frame and gasoline ingestion on the hot parts of power unit caused fire which almost completely destroyed the aircraft. Wrong PIC's actions who didn't turn off ignition and shut off fuel before aircraft landing could contribute to the fire. The emergency landing at the landing place selected from air was caused by oil temperature increase and pressure drop below specified by the aircraft FOM values in flight. It wasn't possible to determine the cause of temperature increase and oil pressure drop due to engine component substantial damage during fire. "}