{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-601p-ted-smith-601-eagle-county-5-killed", "date": "Nov 17, 1996 at 1505 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "David S. Ladow", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Eagle County – Minneapolis", "msn": "61-0812-8063422", "yom": 1980, "flight_number": null, "city": "Eagle County-FlyVail", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 752, "captain_hours_type": 16, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The non instrument-rated pilot filed an IFR flight plan, but did not request nor was given a weather briefing. Shortly after taking off into low instrument meteorological conditions, he reported he was returning to the airport, but did not give a reason why. He never declared an emergency. The last transmission was when the pilot said he had 'the problem resolved,' and was continuing on to his destination. Various witnesses said the engines were 'revvying' and 'unsynchronized,' and that the propellers were being 'cycled.' One witness said brownish-black smoke trailed from the right engine. The airplane struck one ridge, then catapulted approximately 1,000 feet before striking another ridge. There was post impact fire. Both propellers bore high rotational damage. Disassembly of the engines, propellers, turbochargers, and various components failed to disclose what may have prompted the pilot to want to return to the airport. Internal components of the right engine, however, were black and, according to a Textron Lycoming representative, were indicative of 'an excessively rich mixture.' A psychiatrist had recently treated the pilot for depression, attention deficit and bipolar disorders. The pilot also had a history of alcohol and drug abuse. Postmortem toxicology protocol disclose the presence of Fluoxetine (an antidepressant), Norfluoxetine (its metabolite), and Hydrocodone (the most commonly prescribed opiate). ", "probable_cause": "The pilot initiating flight into known adverse weather conditions without proper certification. Factors were the meteorological conditions that existed --- low ceiling, low visibility, and falling\r\nsnow --- and his use of contraindicated drugs. "}