{"url": "https://www.baaa-acro.com/crash/crash-avro-748-108-2a-nailstone-3-killed", "date": "Jun 26, 1981 at 1811 LT", "type": "Avro 748", "operator": "Dan-Air%20London", "flight_phase": "Landing (descent or approach)", "flight_type": "Postal (mail)", "survivors": "No", "site": "Plain, Valley", "schedule": "Londres-Gatwick – East Midlands", "msn": "1560", "yom": 1964, "flight_number": "DA240", "city": "Nailstone", "zone": "Leicestershire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 8418, "captain_hours_type": 1393, "copilot_hours": 5611, "copilot_hours_type": 1711, "aircraft_hours": 34592, "circumstances": "The aircraft was engaged on a mail flight from London-Gatwick Airport to East Midlands Airport. During the initial descent in preparation for landing at its destination, the attendant in the cabin reported that the mechanical indicators on one of the cabin doors were showing an unlocked condition. Shortly afterwards the right hand rear door (baggage door) came open, detached from its hinge mountings and became lodged on the leading edge of the right horizontal tailplane. The aircraft became uncontrollable and went into an increasingly steep dive which terminated in several abrupt pitch oscillations. Both the mainplanes and the horizontal tailplanes were subjected to overstressing in upload which resulted in their detachment from the fuselage. The aircraft was totally destroyed and all three crew members were killed. ", "probable_cause": "The accident was caused by the baggage door becoming lodged on the leading edge of the right tailplane after it had opened and detached in flight. This produced changes in the aerodynamic characteristics of the aircraft which rendered it uncontrollable resulting in overstressing of the wings and tailplane leading to an in-flight structural failure. A contributory factor was the mis-rigged state of the door operating mechanism which allowed the top and the bottom pairs of claw catches to lose synchronisation. The failure of the door warning arrangements to give adequate warning of door safety was a further contributory factor."}