{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-sainte-radegonde", "date": "Mar 29, 2013 at 1250 LT", "type": "Beechcraft 90 King Air", "operator": "Aircraft%20Guaranty%20Corp%20Trustee", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Bordeaux – Bergerac", "msn": "LJ-542", "yom": 1971, "flight_number": null, "city": "Sainte-Radegonde", "zone": "Gironde", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2640, "captain_hours_type": 300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot and two passengers departed Sarlat-Domme Airport for a training mission over the region of Bordeaux. A precision approach was completed at Bordeaux-Mérignac Airport followed by a go-around procedure. The IFR flight plan was closed and the pilot continued under VFR mode to Bordeaux-Léognan-Saucats Aerodrome where he landed. A passenger deplaned, the engine remained running and the aircraft took off few minutes later to Bergerac where a refueling was planned. Approximately 10 minutes after takeoff, while cruising at an altitude of 2,000 feet, both engines failed. The pilot reduced his altitude, selected gear down and attempted and emergency landing in a vineyard. Upon landing, the undercarriage were torn off and the aircraft slid for few dozen metres before coming to rest. Both occupants escaped uninjured and the aircraft was damaged beyond repair. ", "probable_cause": "Failure of both engines in flight due to fuel exhaustion. It was determined that the pilot took off with 800 lbs of fuel on board, thinking having enough fuel for an hour and a half flight which corresponds to an autonomy with 800 liters. In such conditions, the fuel quantity was not sufficient to complete the flight and there were no required reserves. It is believed that the double engine failure was caused by the fact that the pilot mistook pounds for liters (livres - litres in French). The lack of a preflight visual check of the fuel gauges could did not allow the pilot to notice his mistake."}