{"url": "https://www.baaa-acro.com/crash/crash-iai-1124a-westwind-ii-treasure-cay-2-killed", "date": "Jul 5, 2021 at 1545 LT", "type": "IAI 1124 Westwind", "operator": "Transenergie", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Treasure Cay – Nassau", "msn": "424", "yom": 1984, "flight_number": null, "city": "Treasure Cay", "zone": "Central Abaco", "country": "Bahamas", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the 5th July, 2021 at approximately 3:45PM, EDT (1945UTC), an Israeli Aircraft Industries, (IAI) Westwind 1124A aircraft, United States registration N790JR, crashed a short distance from the end of runway 32 at the Treasure Cay International Airport (MYAT), Treasure Cay, Abaco, Bahamas. The aircraft plowed through airport lighting equipment at the end of the runway, hitting and breaking several trees along its path. A trail of aviation fuel and pieces of the aircraft and avionics equipment from the flight deck, were left behind before the aircraft finally hit a small mound (hill), spinning, hitting several additional trees, breaking apart and bursting into flames. The aircraft came to rest at coordinates 26°45’21.50”N, 77°24’7.26”W, approximately 2,000 feet (.33 miles) from the end of runway 32. As this airport did not have a fire truck or crash and rescue personnel stationed on site, assistance with fire services were requested from the town. Two firetrucks from the township responded, however, due to the location of the crash, and no access road available, the trucks were unable to reach the crash site and assist in extinguishing the blaze. The fire continued unimpeded, dampened only by the intermittent downpour of rain, which did not aid in extinguishing the blaze, but rather, only limited the spread of the fire to surrounding bushes. The raging fire totally destroyed the aircraft and much of the control surfaces and components in the direct area of the blaze. On July 6, a team of investigators from the AAIA and CAA-B were dispatched to the scene. Upon arrival of the investigation team, surrounding brush and trees, as well as some parts and components of the aircraft were still burning. Initial assessments pointed to a possible failure of the aircraft to climb and perform as required. Runway 14/32 is 7,001 x 150 feet with an asphalt surface and based on the distance the aircraft traveled from the end of the runway to its final resting place, the signature marking on trees and airport lighting fixtures struck by the aircraft, in addition to the ground scars, along with pieces of the aircraft beyond the runway, up to the final resting place of the aircraft, it appears the aircraft was approximately 2 to 5 feet about the surface and not developing any lift or climb performance, while developing full power over the ground, striking trees and brush along its path. Investigations uncovered the private flight with a crew of two (2), proposed a flight time departure of 2:10PM EDT from the Treasure Cay International Airport (MYAT), with a planned destination of Nassau, Bahamas (MYNN) and an arrival time of 2:33PM EDT, according to flight plan retrieved from Flightaware.com. The flight plan did not specify whether the flight would be operated under Visual Flight Rules (VFR) or Instrument Flight Rules (IFR). According to witness statements taken at Treasure Cay, witnesses recalled two pilots entering the ramp after 3 pm. Witnesses also stated that one of the persons onboard advised customs that they will be departing for Marsh Harbor for fuel in the aircraft (N790JR). ", "probable_cause": "The AAIA has classified the accident as a controlled flight into terrain (CFIT) and determined the probable cause of the CFIT accident is due to the failure of the aircraft to climb (perform) as required.\r\nContributing factors which resulted in the failure of the aircraft to perform as required includes:\r\n- Failure of the crew to configure the aircraft for the proper takeoff segment,\r\n- Crew unfamiliarity with the aircraft systems."}