{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46d-5-cu-commando-san-juan-53-killed", "date": "Jun 7, 1949 at 0025 LT", "type": "Curtiss C-46 Commando", "operator": "Strato Freight", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "San Juan – Miami", "msn": "30506", "yom": 1944, "flight_number": null, "city": "San Juan", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 6, "crew_fatalities": 1, "pax_on_board": 75, "pax_fatalities": 52, "other_fatalities": 0, "total_fatalities": 53, "captain_hours": 6400, "captain_hours_type": 3200, "copilot_hours": 3860, "copilot_hours_type": 2000, "aircraft_hours": 2002, "circumstances": "Shortly before midnight, June 6, seventy-five passengers, including five Infants in arms and 14 children between the ages of two and 12, boarded the air craft. There was also placed on board 1,116 pounds of baggage, and according to the Weight and Balance Manifest there was 7,125 pounds of fuel and oil on board. With the addition of a third pilot, Alfred Cockrill, and a Steward, Ismael Gonzalez, the crew for the northbound flight was the same as that of the flight of June 4 and 5 to San Juan. According to the crew, all occupants in the cabin were seated at the time of takeoff and had available safety belts. However, there were only 65 seats In the cabin which necessitated seating some of the passengers double in one seat. Although the Weight and Balance Manifest for the flight indicated a total weight of 44,500 pounds, the aircraft actually weighed 48.709 pounds, which was 3,709 pounds in excess of the 45,000 pounds certificated aircraft weight. At approximately 0010 with Alfred Cockrill acting as pilot, and John Connell as copilot, the aircraft taxied to Runway 27 where the \"pre-takeoff cheek\" was accomplished at which time engines and flight controls operated normally. Takeoff was accomplished at 0021 after the San Juan Tower had transmitted an instrument clearance to the flight authorizing it to cruise at 8,500 feet to Miami. The ceiling at San Juan was reported to be 12,500 feet, visibility, 12 miles, and the wind, calm. One minute after the aircraft left the ground and at an indicated air speed of approximately 115 miles per hour and at an indicated altitude of 250 feet, the right engine began to backfire severely and lose power. No attempt was made to feather the propeller of the right engine. An emergency was declared, and the tower cleared the flight to land on Runway 9. But, since air speed was low and altitude could not be maintained, the aircraft was flown straight ahead for a crash landing 200 yards off the shore at Punta Salinas. Immediately before impact with the water the landing lights were extended. During a six minute period that the aircraft remained afloat the crew pushed two uninflated life rafts into the water and furnished several passengers with life preservers. Considerable confusion existed during the ditching operation since none of the passengers had received any instruction in the location or use of emergency equipment. Of the 81 occupants, only 23 passengers and five crew members survived.", "probable_cause": "The Board determines that the probable cause of this accident was the loss of power of the right engine before the aircraft attained the optimum single engine climb speed which, together with the overloaded condition of the aircraft, resulted in it losing altitude and settling into the sea.\r\nThe following factors were considered as contributory:\r\nAt takeoff the gross weight of the aircraft exceeded by 3,709 pounds its certificated takeoff weight.\r\n- Thirty of the thirty-six spark plugs installed in the right engine were not approved by the manufacturer of the spark plug, by the manufacturer of the engines, or by the U. S. Air Forces,\r\n- The magneto switch for the right engine was found set to the \"Left\" position which fires the rear spark plugs only,\r\n- All of the rear row of spark plugs in the right engine showed evidence of excessive heat,\r\n- The center electrode of the rear spark plug of the No. 4 cylinder had fused with the outer electrode,\r\n- The front row of spark plugs snowed no evidence of high temperatures with the exception of the one in the No. 4 cylinder which had burned out flush with the porcelain,\r\n- Heavy deposits of carbon were found on the neoprene adapter sleeve and the carburetor air intake screen of the right engine, an indication of severe backfiring."}