{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-near-dihidanda-18-killed", "date": "Feb 16, 2014 at 1330 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Nepal-Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Pokhara – Jumla", "msn": "302", "yom": 1971, "flight_number": "RNA183", "city": "Dihidanda", "zone": "Lumbini", "country": "Nepal", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 15, "pax_fatalities": 15, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": 8373, "captain_hours_type": 8131, "copilot_hours": 365, "copilot_hours_type": null, "aircraft_hours": 43947, "circumstances": "On 16 February 2014, the Twin Otter (DHC6/300) aircraft with registration number 9N-ABB, owned and operated by Nepal Airlines Corporation (NAC), departed Kathmandu at 0610 UTC (1155 LT) on its schedule flight to Jumla carrying 18 persons on board including 3 crews. Detailed sectors to be covered by the flight No. RA 183/718 was Kathmandu–Pokhara–Jumla-Nepālganj (Night stop). Flight from Kathmandu to Pokhara completed in normal condition. After 17 minutes on ground at Pokhara airport and refueling 9N-ABB departed Pokhara at 0658 for Jumla. After Jumla flight, the aircraft was scheduled to Night stop at Nepālganj. Next day it was to do a series of shuttle flights from Nepālganj. Prevailing westerly weather had a severe impact on most of the domestic flights since last two days. A.M.E. of Engineering Department of NAC who had performed D.I. of 9N ABB had mentioned in his written report to the Commission that he had reminded the diversion of Bhojpur flight of NAC due weather and asked the Captain whether he had weather briefing of the Western Nepal or not. In response to the AME's query the Captain had replied casually that- \"weather is moving from west to east and now west is improving\". Pilots behavior was reported normal by the ground staffs of Kathmandu and Pokhara airports prior to the commencement of flight on that day. All the pre and post departure procedure of the flight were completed in normal manner. Before departure to Jumla from Pokhara, Pilots obtained Jumla and Bhairahawa weather and seems to be encouraged with VFR Weather at both stations. However, they were unable to make proper assessment of en route weather. PIC decided to remain south of track to avoid the terrain and weather. CVR read out revealed that pilots were aware and concerned about the icing conditions due to low outside air temperature. After around 25 minutes, probably maneuvering to avoid weather, the PIC instructed the co-pilot to plan a route further south of their position, to fly through the Dang valley. The copilot selected Dang in the GPS, on a bearing of 283°, and determined the required altitude was 8500ft. He then raised concerns that the aircraft may not have enough fuel to reach the planned destination. Approximately two and a half minutes before the accident, the PIC initiated a descent, and the copilot advised against this. As per CVR read out, last heading recorded by copilot, approximately one minute before the crash, was 280. The last one minute was a very critical phase of the flight during which PIC said I am entering (perhaps inside the cloud). At that time copilot called Bhairahawa Tower on his own and got latest Bhairahawa weather. While copilot was transmitting its last position report to Bhairahawa Control Tower (approximately 25 miles from Bhairahawa), PIC interrupted and declared to divert Bhairahawa. Bhairahawa Control Tower wanted the pilots to confirm their present position. But crews were very much occupied and copilot said STANDBY. Just few seconds before crash copilot had told PIC not to descend. Copilot also suggested PIC in two occasions - sir don't turn. Very unfortunately aircraft was crashed. The aircraft disintegrated on impact and all 18 occupants were killed. ", "probable_cause": "Controlled flight into terrain after the pilot-in-command lost situation awareness while cruising in IMC. \r\nThe following factors were considered as contributory:\r\n- Deteriorated weather associated with western disturbance, unstable in nature and embedded CB,\r\n- Inappropriate and insufficient crew coordination while changing course of action."}