{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-329-brussels-73-killed", "date": "Feb 15, 1961 at 1005 LT", "type": "Boeing 707", "operator": "Sabena.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Brussels", "msn": "17624", "yom": 1959, "flight_number": "SN548", "city": "Brussels", "zone": "Flemish Brabant", "country": "Belgium", "region": "Europe", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 61, "pax_fatalities": 61, "other_fatalities": 1, "total_fatalities": 73, "captain_hours": 15384, "captain_hours_type": 21, "copilot_hours": 16231, "copilot_hours_type": 20, "aircraft_hours": 3038, "circumstances": "Following an uneventful transatlantic flight from New York, the crew started the approach to runway 20 at Brussels-Zaventem Airport. On short final, while at an altitude of 900 feet, the crew raised the landing gear, increased engine power and made a go around. The plane made three 360° turns to the left and climbed to 1,500 feet. During these turns the bank angle increased more and more until the aircraft was in a near vertical bank. The wings then leveled, followed by an abrupt pitch up. The 707 lost speed, started to spiral rapidly towards the ground nose down, crashed and caught fire. All 72 occupants were killed as well as one farmer working in the field. Among the passengers were 17 members of the US National Hockey Team who were flying to Prague to take part to the World Championship. ", "probable_cause": "Having carried out all possible reasonable investigations, the Commission concluded that the cause of the accident had to be looked for in the material failure of the flying controls. However, while it was possible to advance certain hypotheses regarding the possible causes, they could not be considered entirely satisfactory. Only the material failure of two systems could lead to a complete explanation, but left the way open to an arbitrary choice because there was not sufficient evidence to corroborate it. The FAA commented that the most plausible hypothesis was a malfunction of the stabilizer adjusting mechanism permitting the stabilizer to run to the 10.5° nose-up position."}