{"url": "https://www.baaa-acro.com/crash/crash-cessna-421a-golden-eagle-i-lisbon-7-killed", "date": "Dec 4, 1980 at 2016 LT", "type": "Cessna 421A Golden Eagle I", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Government", "survivors": "No", "site": "City", "schedule": "Lisbon - Porto", "msn": "421A-0040", "yom": 1969, "flight_number": null, "city": "Lisbon-Portela de Sacavém", "zone": "Estremadura - Lisbon District", "country": "Portugal", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 1613, "captain_hours_type": 42, "copilot_hours": 744, "copilot_hours_type": null, "aircraft_hours": 1500, "circumstances": "The twin engine airplane, chartered by the Portuguese Government, was engaged in a special flight from Lisbon to Porto, carrying various members of the Portuguese Government. Shortly after takeoff from Lisbon-Portela de Sacavém Airport, while climbing by night, the twin engine airplane lost height and crashed onto several houses located in the district of Camarate. The aircraft was totally destroyed and all seven occupants were killed. There were no casualties on ground. \r\nOccupants:\r\nMr. Francisco Sa Carneiro, Prime Minister, \r\nMrs. Francisco Sa Carneiro, \r\nMr. Amaro da Costa, Minister of Defence, \r\nMrs. Amaro da Costa,\r\nOne Chief of Cabinet and two pilots. ", "probable_cause": "The loss of control during initial climb was the consequence of the combination of the following factors: \r\n- Poor flight preparation on part of the crew,\r\n- Inadvertent shutdown of the left engine during initial climb for unknown reasons, \r\n- The left propeller was not feathered, causing high drag,\r\n- The flaps were not deployed in the correct position for takeoff, \r\n- The CofG was off limits, \r\n- Negligences of those responsible for planning and safety in the air transport of important figures of State, in an aircraft of foreign registration whose maintenance status was not previously maintained rated,\r\n- Crew fatigue, \r\n- Crew psychic stress accumulation."}