{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-188a-electra-cranbrook-2-killed", "date": "Jul 16, 2003 at 1221 LT", "type": "Lockheed L-188 Electra", "operator": "Air%20Spray", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Mountains", "schedule": "Cranbrook - Cranbrook", "msn": "1040", "yom": 1959, "flight_number": "Tanker 86", "city": "Cranbrook", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 38775, "circumstances": "The aircraft took off from Runway 16 at the Cranbrook Airport, British Columbia. Two pilots were on board to conduct a fire-management mission on a small ground fire (designated N10156) two nautical miles southwest of the township of Cranbrook. Seven minutes earlier, the partner “bird dog” aircraft, a Turbo Commander, also departed Cranbrook to assess the appropriate aircraft flight path profiles and to establish the most suitable fire-retardant delivery program for the ground fire. Following the flight path demonstrations by the bird dog aircraft, Tanker 86 proceeded to carry out the retardant drop on the fire. After delivering the specified retardant load, Tanker 86 was seen to turn right initially then entered a turn to the left. At 1221 MST, the Electra struck the terrain on the side of a steep ridge at about 3900 feet above sea level. The aircraft exploded on impact and the two pilots were fatally injured. An intense post-crash fire consumed much of the wreckage and started a forest fire at the crash site and the surrounding area. The on-board emergency locator transmitter was damaged by the impact forces and did not activate.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. For undetermined reasons, the Electra did not climb sufficiently to avoid striking the rising terrain.\r\n2. Given the flight path and the rate of climb chosen, a collision with the terrain was unavoidable.\r\n3. The characteristics of the terrain were deceptive, making it difficult for the pilots to perceive their proximity and rate of closure to the rising ground in sufficient time to avoid it.\r\nOther Findings:\r\n1. Performance calculations show that the Electra—in the absence of limiting mechanical malfunction—could have climbed at a rate that would have allowed the aircraft to avoid the terrain.\r\n2. Although a functional cockpit voice recorder was installed in the aircraft, it was not required by regulation and it was not used; as a result, vital clues that could have shed light on the circumstances of this accident were not available.\r\n3. The emergency locator transmitter could not transmit a signal as a result of severe impact forces that exceeded the design criteria."}