{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-749-constellation-gander", "date": "Aug 25, 1954 at 2145 LT", "type": "Lockheed L-749 Constellation", "operator": "Air-France-31", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris – Shannon – Gander – New York – Mexico City", "msn": "2513", "yom": 1947, "flight_number": "AF075", "city": "Gander", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 9, "crew_fatalities": 0, "pax_on_board": 58, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17036, "circumstances": "The crew started the approach to Gander Airport by night and in good weather conditions. Following a stabilized approach, the four engine aircraft landed normally on runway 32. After touchdown, the reverse thrust system were activated when the aircraft veered to the left. Despite several corrections on part of the flying crew such as braking action, movement on the nose wheel steering and power added on both left engines number one and two, the aircraft continued down the runway, overran, lost its undercarriage and came to rest into a ravine. While all 67 occupants were evacuated safely, the aircraft was damaged beyond repair. ", "probable_cause": "The approach configuration to Gander Airport was correct and the aircraft was stabilized until touchdown. No technical anomalies were found on the aircraft and all piloting techniques were normal. The analysis of the aircraft's path after touchdown did not show any trace of rough braking action. An exam of the pilot reports indicated that the aircraft was quite difficult to be maneuvered during a turn to the right. At the time of the accident, a lateral wind was blowing to 16 knots, which could be considered as a contributory factor. "}