{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-salt-lake-city-8-killed", "date": "Jan 15, 1987 at 1252 LT", "type": "Swearingen SA226 Metro II", "operator": "Skywest-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "City", "schedule": "Pocatello - Salt Lake City", "msn": "TC-327", "yom": 1980, "flight_number": "OO1834", "city": "Salt Lake City", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 3885, "captain_hours_type": 1863, "copilot_hours": 4555, "copilot_hours_type": 1205, "aircraft_hours": 15116, "circumstances": "On January 15, 1987, at 1216 mountain standard time, SkyWest flight 1834, a Fairchild Swearingen SA-226TC (METRO II), registration Nl635W, departed Pocatello, Idaho, on a regularly scheduled passenger flight to Salt Lake City, Utah (SLC). The flight was operating under the provisions of Title 14 Code of Federal Regulations Part 121 with two pilots and six passengers aboard. Flight 1834 was handed off from the SLC Air Route Traffic Control Center to the Bear Sector controller at the SLC Terminal Radar Approach Control (TRACON) for a left downwind arrival to SLC International Airport. At 1237:49, the Bear sector controller issued a heading of 100” to flight 1834 and advised the flight to expect vectors for a visual approach to runway 34L. (See Air Traffic Control Transcript in appendix C). During the next few minutes, flight 1834 was given further vectors and descent clearances, and at 1247:21, it was given a frequency change to the TRACON Final controller. At 1250:28, after being cleared to descend to 7,000 feet mean sea level (msl), the Final controller advised, “SkyWest eight thirty four, traffic ten to nine o’clock, four miles, six thousand, Boeing seven, ah, thirty seven three hundred.” Flight 1834 acknowledged, “SkyWest eight thirty four has the traffic.” At 1250:35, the Final controller advised, “SkyWest eight thirty four, plan to follow that traffic, there’s traffic south of him eleven o’clock, six miles north bound, [a] seven thirty seven out of seven thousand five hundred, for the right.” Flight 1834 responded, “OK, we’ll follow the first one, SkyWest eight thirty four.” At 1250:44, the Final controller advised, “SkyWest eight thirty four, wait a minute, report the other one in sight.” Flight 1834 responded, “We’re looking for him.” At 1251:02, the Final controller transmitted, “SkyWest eight thirty four, ten o’clock four miles, seven thousand four hundred.” Flight 1834 replied, “Eight thirty four, we’re looking.” The Final controller then issued instructions at 1251: 15 for flight 1834 to make a left turn to 070”, and the flight acknowledged. At 1251:32, the Final controller transmitted, “SkyWest eight thirty four, traffic’s ten to eleven o’clock, three miles.” Flight 1834 did not acknowledge that transmission, and at 1251:43, the Final controller advised, “SkyWest eight thirty four, turn left heading zero five zero.” The flight acknowledged and reported, “Still have no contact on that traffic.” At 1251:50, the Final controller transmitted, “SkyWest eight thirty four, roger, turn further left heading three six zero.” Flight 1834 acknowledged and at 1251:58, an expletive was transmitted over the TRACON Final control frequency during a transmission from SkyWest flight 575. There were no further transmissions from flight 1834. According to the UNICOM I/ operator at SLC Municipal 2 Airport (SLC 2) about 1115 or 1120, a pilot in Mooney M20C, registration N6485U, operating under 14 CFR Part 91, called to inquire if the runway was clear. The Mooney was occupied by a private pilot in the left seat and an instructor pilot in the right seat. The UNICOM operator advised that the runway was clear, and a few minutes later, a pilot in the Mooney called for and was given an airport advisory. The UNICOM operator observed the Mooney taxi to runway 34 and take off about 1125 or 1130. The Mooney remained in the traffic pattern at SLC 2 performing touch-and-go landings. There were no other aircraft in the traffic pattern at the time. The UNICOM operator stated that she last talked to the Mooney about 1145 to 1150 when a pilot called, “Final for 34.” The UNICOM operator said that she observed the airplane perform a touch-and: go landing, but she did not observe the direction of departure of the airplane. There were no further known communications with the Mooney regarding departing the traffic pattern or any additional aspects of the flight. According to recorded air traffic control (ATC) radar data, after the Mooney departed the SLC 2 traffic pattern at 1235, y the airplane flew south and maneuvered about 25 miles south southeast of SLC International Airport before beginning a turn to the northwest. The airplane continued in a northwesterly direction until it was about 9 miles south of SLC International Airport where it began a gradual left turn until its target merged with the target of SkyWest flight 1834. The targets merged at 1257 :58--the time the expletive was recorded on the ATC tape at the SLC TRACON. The Final approach controller stated that he did observe a visual flight rules (VFR) target about 3 to 4 miles southwest of SLC 2 moving north to northwest when flight 1834 was on downwind. He said he had no more than normal cause to monitor the target. He also stated that it was not unusual to observe VFR targets in the pattern near SLC 2 during visual meteorological conditions. Other controllers at SLC TRACON also stated that it was not uncommon to observe numerous targets operating in the traffic pattern at SLC 2. The Final controller and other controllers added that they normally would observe the VFR targets near SLC 2 disappear from the radarscope and then reappear during practice touch-and-go landings. The Final controller said that he did not recall seeing any VFR targets in the vicinity of SkyWest 1834 as it was turning toward final just before the collision. The Fin.al controller stated that his workload was moderate, and all of his equipment was operating normally before the accident. In addition, the Local controller in the SLC tower stated that he did not observe the target of the Mooney on the tower Bright Radar Indicator Tower Equipment display. There was no evidence that the Mooney pilots were in radio contact with any ATC facility at the time of the accident. Several eyewitnesses were interviewed who observed the airplanes before and after the collision. Some of the witnesses stated that the nose of the METRO II pitched up just before impact. The witnesses stated that the METRO II was headed northeasterly and the Mooney was headed northwesterly just before impact. They stated that the METRO II had made a few left turns as it turned toward the northeast. In general, the eyewitnesses agreed that the two airplanes collided with the Mooney striking the METRO II’s right forward fuselage area with its nose. After the collision, both airplanes fell to the ground with wreckage scattered over 2 square miles in a residential section of Kearns, Utah. There was no fire. The collision occurred at 7,000 feet msl in daylight visual meteorological conditions. All 10 occupants in both aircraft were killed. There were no casualties on the ground. ", "probable_cause": "Lack of navigational vigilance by the Mooney instructor pilot which led to the authorized intrusion into the Salt Lake City airport radar service area. Contributing to the accident were the absence of a Mode-C transponder on the Mooney airplane and the limitations of the air traffic control system to provide collision protection under the circumstances of this accident."}