{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-21a-goose-thormanby-island-7-killed", "date": "Nov 16, 2008 at 1032 LT", "type": "Grumman G-21A Goose", "operator": "Pacific%20Coastal%20Airlines", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Vancouver - Powell River", "msn": "1187", "yom": 1942, "flight_number": null, "city": "Thormanby Island", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 12000, "captain_hours_type": 8000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At about 1013 Pacific Standard Time, the amphibious Grumman G-21A (registration C-FPCK, serial number 1187), operated by Pacific Coastal Airlines, departed from the water aerodrome at the south terminal of the Vancouver International Airport, British Columbia, with one pilot and seven passengers for a flight to Powell River, British Columbia. Approximately 19 minutes later, the aircraft crashed in dense fog on South Thormanby Island, about halfway between Vancouver and Powell River. Local searchers located a seriously injured passenger on the eastern shoreline of the island at about 1400. The aircraft was located about 30 minutes later, on a peak near Spyglass Hill, British Columbia. The pilot and the six other passengers were fatally injured, and the aircraft was destroyed by impact and post-crash fire. The emergency locator transmitter was destroyed and did not transmit. ", "probable_cause": "Findings as to Causes and Contributing Factors\r\n1. The pilot likely departed and continued flight in conditions that were below visual\r\nflight rules (VFR) weather minima.\r\n2. The pilot continued his VFR flight into instrument meteorological conditions (IMC),\r\nand did not recognize his proximity to terrain until seconds before colliding with\r\nThormanby Island, British Columbia.\r\n3. The indication of a marginal weather improvement at Powell River, British Columbia,\r\nand incorrect information from Merry Island, British Columbia, may have\r\ncontributed to the pilot’s conclusion that weather along the route would be sufficient\r\nfor a low-level flight.\r\nFindings as to Risk:\r\n1. The reliance on a single VHF-AM radio for commercial operations, particularly in congested airspace, increases the risk that important information is not received.\r\n2. Flights conducted at low altitude greatly decrease VHF radio reception range, making it difficult to obtain route-related information that could affect safety.\r\n3. The lack of pilot decision making (PDM) training for VFR air taxi operators exposes pilots and passengers to increased risk when faced with adverse weather conditions.\r\n4. Some operators and pilots intentionally skirt VFR weather minima, which increases risk to passengers and pilots travelling on air taxi aircraft in adverse weather conditions.\r\n5. Customers who apply pressure to complete flights despite adverse weather can negatively influence pilot and operator decisions.\r\n6. Incremental growth in Pacific Coastal’s support to Kiewit did not trigger further risk analysis by either company. As a result, pilots and passengers were exposed to increased risks that went undetected.\r\n7. Transport Canada’s guidance on risk assessment does not address incremental growth for air operators. As a result, there is increased risk that operators will not conduct the appropriate risk analysis as their operation grows.\r\n8. Previous discussions between Pacific Coastal and the pilot about his weather decision making were not documented under the company’s safety management system (SMS). If hazards are not documented, a formal risk analysis may not be prompted to define and mitigate the risk. \r\n9. There were no company procedures or decision aids (that is, decision tree, second pilot input, dispatcher co-authority) in place to augment a pilot’s decision to depart. \r\n10. Because the aircraft’s emergency locator transmitter (ELT) failed to operate after the crash, determining that a crash had occurred and locating the aircraft were delayed.\r\n11. On a number of flights, pilots on the Vancouver–Toba Inlet route, British Columbia, departed over maximum gross weight due to incorrectly calculated weight and balances. Risks to pilots and passengers are increased when the aircraft is operating outside approved limits.\r\n12. The over-reliance on global positioning system (GPS) in conditions of low visibility and ceilings presents a significant safety risk to pilots and passengers.\r\nOther Finding:\r\n1. The SPOT Satellite Messenger data transmitted before the crash helped to narrow the search area and reduce the search time to find the aircraft. The fact that the wrong data were consulted caused an initial delay in reporting the missing aircraft."}