{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-63cf-colombo-183-killed", "date": "Nov 15, 1978 at 2330 LT", "type": "Douglas DC-8", "operator": "Loftleidir", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jeddah - Colombo - Surabaya", "msn": "46020/415", "yom": 1968, "flight_number": "LL001", "city": "Colombo-Bandaranaike", "zone": "Western Province (மேல் மாகாணம்)", "country": "Sri Lanka", "region": "Asia", "crew_on_board": 13, "crew_fatalities": 8, "pax_on_board": 249, "pax_fatalities": 175, "other_fatalities": 0, "total_fatalities": 183, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine airplane was chartered by Garuda Indonesia Airways to fly back to Surabaya 249 Indonesian pilgrims who were returning home following a 'haj' in Mecca. Following an uneventful flight, the crew was cleared to descend from FL330 to FL220 then was informed that runway 04 was in use. The captain requested a runway 22 landing and was cleared for. On final approach by night, while at an altitude of 650 feet, the crew was cleared to land on runway 22, a clearance that was  acknowledged by the crew. Few seconds later, the approach controller realized that the aircraft was too low and tried to contact the crew. Unfortunately, this was not possible as the crew already switched to the tower frequency. On short final, the airplane struck tree tops and crashed in a huge explosion in a coconut grove located 2,1 km short of runway 22 threshold. 79 occupants were rescued while 183 others were killed, among them eight crew members. The aircraft was totally destroyed by a post crash fire. ", "probable_cause": "It was determined that the accident was the consequence of the combination of the following factors:\r\n- The flight crew's failure to conform to the laid down approach procedures, \r\n- The crew failed to check and utilize all instruments available for altitude and descent rate awareness, \r\n- The copilot failed to provide the captain with the required altitude and sink rate call-outs at the various levels, \r\n- The captain failed to initiate a missed approach procedure at the appropriate height when the runway was not in sight, \r\n- The sink rate was very excessive during most part of the descent, \r\n- There is a possibility that the radio altimeter bug on the captain's panel had been erroneously set at 150' which resulted in the captain being deprived of the warning light of the altimeter and of the audiovisual warnings of the GPWS as the break-off altitude of 250' which he had intended to set, \r\n- Contributing to the accident was the fact that there was a down draught of the wind which probably rendered recovery more difficult when the captain realized that the aircraft had descended too low and called for maximum power to overshoot. "}