{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226t-merlin-iii-helsinki-7-killed", "date": "Feb 24, 1989 at 2350 LT", "type": "Swearingen SA226T Merlin III", "operator": "Predator", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Southend - Helsinki", "msn": "T-216", "yom": 1971, "flight_number": null, "city": "Helsinki-Vantaa", "zone": "Uusimaa", "country": "Finland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 12991, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4401, "circumstances": "The twin engine aircraft was completing a night charter flight from Southend to Helsinki, carrying seven passengers and one pilot. On final approach to Helsinki-Vantaa Airport runway 22, the pilot elected to reduce the speed when the aircraft lost altitude, descended below the MDA, struck the ground and came to rest inverted in a snow covered field located about one km short of runway threshold. A passenger was seriously injured while seven other occupants were killed. ", "probable_cause": "It is believed that the pilot probably encountered difficulties in controlling the altitude and an excessive speed during the final approach procedure. As a result, he retarded engine power by pulling both speed levers backwards. Investigations revealed that the flight idle gate allowing the speed levers to be stopped before being positioned at idle was worn, which allowed the pilot to position both levers to idle position while still on approach. This caused the aircraft to lose speed and altitude and to descend below the minimum descent altitude (MDA) until it struck the ground. \r\nThe following contributing factors were reported:\r\n- The pilot did not have sufficient experience on this type of aircraft,\r\n- The pilot's training on such operation was insufficient,\r\n- The accident occurred in demanding instrument flight conditions."}