{"url": "https://www.baaa-acro.com/crash/crash-martin-202-williamsport-25-killed", "date": "Dec 1, 1959 at 0947 LT", "type": "Martin 202", "operator": "Allegheny-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Philadelphia – Harrisburg – Williamsport – Bradford – Erie – Cleveland", "msn": "9159", "yom": 1947, "flight_number": "AL371", "city": "Williamsport", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 22, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 25, "captain_hours": 9790, "captain_hours_type": 1180, "copilot_hours": 1153, "copilot_hours_type": 92, "aircraft_hours": null, "circumstances": "Flight 371 of December 1, 1959, was scheduled between Philadelphia, Pennsylvania, and Cleveland, Ohio, with stops at Harrisburg, Williamsport, Bradford, and Erie The flight originated at Philadelphia after departing Atlantic City at 0718 1 as Ferry Flight 174 to Philadelphia. Prior to the departure of Flight 371 Captain Goldsmith received the available en route and terminal weather reports and forecasts. The flight was dispatched IFR but the captain elected to depart VFR because of the existing VFR weather en route. Allegheny company policy is to dispatch all flights IFR unless load conditions or navigation facilities require a VFR release. Flight 371 departed Philadelphia at 0815 with 17 revenue passengers At the time of takeoff the gross weight of the aircraft, was 36,477 pounds, which was 2,083 pounds below the allowable gross takeoff weight at Philadelphia for landing at Harrisburg. Following the takeoff from Philadelphia the flight proceeded VFR to Harrisburg where it landed at 0851 without incident and deplaned four passengers and 404 pounds of cargo. Flight 371 departed Harrisburg at 0906 with 22 revenue passengers, one additional crew member, and 598 pounds of baggage, mail, and cargo The gross weight at time of takeoff was 36,429 pounds, which was 2,081 pounds below the allowable takeoff weight at Harrisburg for landing at Williamsport. The Williamsport weather at 0855 was reported as Partial obscuration, 1,000 feet scattered, estimated 2,500 overcast, visibility 2 miles, light snow; temperature 32, dewpoint 30, wind west-northwest at seven knots; altimeter 30.26 Remarks - 4/10 sky obscured by snow few fracto-stratus at 1,000 feet along mountains. This weather was not available to the pilot at the time of his departure. At 0923 Flight 371 reported to Williamsport radio that it was making 360-degree turns five minutes south of the Williamsport low frequency range at an altitude of 3,500 feet, VFR, and requested an instrument clearance to the Williamsport Airport Williamsport radio responded by giving the 0917 Williamsport weather observation, which was: Precipitation ceiling 1,000 feet, sky obscured; visibility one mile in light snow, wind west at five knots; altimeter 30.26 At this time Williamsport radio requested that the flight stand by for clearance At 0927 Flight 371 was cleared direct to the Williamsport low frequency range from its present position, to maintain 4,000 feet At 0928 New York Center instructed Williamsport radio to advise Flight 371 to report north of Victor Airway 232. The flight received this information at 0930 At 0931 Flight 371 advised that it was north of Victor Airway 232 At 0933 Flight 371 was cleared for an approach to the Williamsport Airport, to report on the ground, or cancelling IFR. At this time Flight 371 reported over the Williamsport low frequency range, leaving 4,000 feet, and commencing an approach At 0935 the Williamsport 0934 weather observation was given to Flight 371 as being 1,000-feet scattered, precipitation observation 7,000 feet; visibility 1-1/2 miles in light snow, wind west at four knots, altimeter setting 30 26 inches Allegheny minimums for this approach to the Williamsport Airport are 900 feet ceiling and 1-1/2 miles visibility. At 0941 Flight 371 reported over the low frequency range on final approach and the communicator noted the time as being 0941 At this time the flight was advised of the surface wind, altimeter setting, and that the runway lights were on high brilliancy on runway 9-27 Flight 371 acknowledged all of these transmissions from Williamsport radio At 0942 the flight reported in range to the company on company frequency At this time the company advised that their altimeter setting was 30 25 inches and requested the arrival and departure times of the flight at Harrisburg Flight 371 acknowledged the altimeter setting but did not relay the time information requested. At approximately 0945 Flight 371 was observed over the airport, too high however to effect a landing After this initial approach to the field, Flight 371 flew over the field and made a right turn for a circling approach to runway 27 As this circle was apparently completed, the aircraft was observed to roll out of its right turn and into a left turn and proceed in level flight, on a southerly direction, disappearing into snow showers and clouds. One observer believed that at the time the aircraft commenced this left turn to the southerly heading it was approximately one-fourth of a mile from the end of runway 27 and at an altitude of approximately 400 feet above the ground. A short while after Flight 371 was seen to disappear into the snow showers and clouds on a southerly heading a loud explosive-type noise was heard at approximately 0947 After all attempts to contact Flight 371 had failed, search and rescue at Olmstead Air Force Base, Middletown, Pennsylvania, was advised of a possible crash. At approximately 1120 the wreckage of Flight 371 was sighted on Bald Eagle Mountain at an elevation of 1,150 m s l. on a 172-degree magnetic heading from and about one and one-thirdmiles south of the approach end of runway 27. The crew of 3, one additional crew member, and 21 of the 22 revenue passengers were killed. The aircraft was destroyed. ", "probable_cause": "The Board determines that the probable cause of this accident was the captain failure to execute a timely abandoned approach. The probable accidental caging of the fluxgate compass, which would have resulted in an erroneous heading indication, is considered to be a likely contributing factor."}