{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-20c-norwich", "date": "Dec 12, 1973 at 1538 LT", "type": "Dassault Falcon 20", "operator": "Fred%20Olsen", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Norwich - Göteborg", "msn": "62", "yom": 1967, "flight_number": null, "city": "Norwich", "zone": "Norfolk", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5939, "captain_hours_type": 1902, "copilot_hours": 5814, "copilot_hours_type": 864, "aircraft_hours": 4779, "circumstances": "The Dassault Falcon 20C jet aircraft was on charter to fly passengers from Norwich, U.K. to Gothenburg, Sweden, and during the morning it made an uneventful positioning flight from Oslo, Norway, to Norwich where it landed at 12:28 hrs. The six passengers boarded the aircraft at about 15:20 hrs and the aircraft received clearance from Norwich Tower to taxi out for take-off on runway 28. While taxying the crew received an airways clearance and the aircraft was lined up on the runway without delay. The co-pilot, a qualified commander on this type of aircraft, was in the left hand pilot's seat, and the aircraft commander in the right hand seat. No bird flocks were seen by either of the pilots whilst taxying to the active runway. The aircraft took-off at 15:37 hrs piloted from the left hand seat. On becoming airborne, at a position a little over halfway down the runway, the crew saw a flock of birds ahead flying just above the ground. The pilot increased slightly the aircraft's climb attitude and the flock passed underneath. A few seconds later a second flock was seen at a higher level and directly in the aircraft's flight path. The pilot lowered the aircraft nose and the flock passed overhead. On re-establishing the climb and at a height of between 100 and 200 feet a third flock was seen, again directly ahead. This flock extended from ground level to well above the aircraft and there was no possible way for the pilot to avoid it; almost immediately the crew heard the sound of multiple bird strikes on the aircraft, the commander described the noise as 'like a machine gun'. The pilot maintained the aircraft in the climb attitude and the commander, who was checking the aircraft's instruments, noticed the RPM on both engines running down very fast, he also observed the engine pressure ratio (EPR), and exhaust gas temperature (EGT) instrument readings dropping. The pilot heard a bang from the engines, followed by the sound of the engines running down in a rough and abnormal manner. He quickly asked if both engines had failed. This was confirmed by the commander who tried to move the thrust levers without any response from the engines. By this time the aircraft was at a height of approximately 300 feet with the landing gear still down, the crew not having had time to select it up because of their preoccupation with avoiding the bird flocks. The speed, which had been about 150 knots prior to the bird strikes, had dropped to 135 knots. The control column was eased forward to maintain speed and the aircraft began to lose height. The pilot saw a field ahead and slightly left of the aircraft which he considered the best forced landing area. On receiving confirmation of his decision from the commander, the pilot made a turn to the left and lined up the aircraft for an approach to the selected field. Visibility was not good because of approaching darkness but the crew were able to see some trees at the approach end of the field. These were avoided and a positive touch down made; the stall warning sounded just before the aircraft hit the ground. Battery and fuel switches were turned off either just before or after ground impact and an attempt was made to close the thrust levers, but these would not move. All three landing gear legs were torn off shortly after ground impact and the aircraft finally came to rest on the belly of the fuselage. The commander, although partially blinded by blood from cuts on his head, made his way to the main cabin door, which he opened, and all the occupants were evacuated.", "probable_cause": "The accident was caused by failure of both engines because of mechanical damage due to bird ingestion. The following factors were reported:\r\n- Prior to takeoff no concentration of birds was seen on the airport by the aircraft crew or by ATC personnel in the tower,\r\n- A large concentration of seagulls was either on the active runway or was arriving over the airport at the time of takeoff, \r\n- The aircraft suffered multiple bird strikes immediately after takeoff and both engines failed due to bird ingestion, \r\n- The crew made a successful forced landing in a field near the end of the runway and are to be commanded for the high degree of professional airmanship displayed, \r\n- During the forced landing the aircraft was substantially damaged but the passengers did not suffer any appreciable injuries; the three crew members however suffered varying degree of injury. "}