{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-palwaukee", "date": "Jun 25, 2013 at 2030 LT", "type": "Beechcraft 200 Super King Air", "operator": "Tennair", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "City", "schedule": "Springfield - Palwaukee", "msn": "BB-751", "yom": 1981, "flight_number": null, "city": "Chicago-Executive (Palwaukee)", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7125, "captain_hours_type": 572, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6709, "circumstances": "Before departure, the pilot performed fuel calculations and determined that he had enough fuel to fly to the intended destination. While enroute the pilot flew around thunderstorms. On arrival at his destination, the pilot executed the instrument landing system approach for runway 16. While on short final the right engine experienced a total loss of power. The pilot switched the fuel flow from the right tank to the left tank. The left engine then experienced a total loss of power and the pilot made an emergency landing on a road. The airplane received substantial damage to the wings and fuselage when it struck a tree. A postaccident examination revealed only a few gallons of unusable fuel in the left fuel tank. The right fuel tank was breached during the accident sequence but no fuel smell was noticed. The pilot performed another fuel calculation after the accident and determined that there were actually 170 gallons of fuel onboard, not 230 gallons like he originally figured. He reported no preaccident mechanical malfunctions that would have precluded normal operation and determined that he exhausted his entire fuel supply.", "probable_cause": "The pilot's improper fuel planning and management, which resulted in a loss of engine power due to fuel exhaustion."}