{"url": "https://www.baaa-acro.com/crash/crash-airbus-a340-313x-toronto", "date": "Aug 2, 2005 at 1602 LT", "type": "Airbus A340-300", "operator": "Air-France-31", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris - Toronto", "msn": "289", "yom": 1999, "flight_number": "AF358", "city": "Toronto-Lester Bowles Pearson", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 12, "crew_fatalities": 0, "pax_on_board": 297, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15411, "captain_hours_type": 1788, "copilot_hours": 4834, "copilot_hours_type": 2502, "aircraft_hours": 28426, "circumstances": "The Air France Airbus A340-313 aircraft (registration F-GLZQ, serial number 0289) departed Paris, France, at 1153 Coordinated Universal Time (UTC) as Air France Flight 358 on a scheduled flight to Toronto, Ontario, with 297 passengers and 12 crew members on board. Before departure, the flight crew members obtained their arrival weather forecast, which included the possibility of thunderstorms. While approaching Toronto, the flight crew members were advised of weather-related delays. On final approach, they were advised that the crew of an aircraft landing ahead of them had reported poor braking action, and Air France Flight 358’s aircraft weather radar was displaying heavy precipitation encroaching on the runway from the northwest. At about 200 feet above the runway threshold, while on the instrument landing system approach to Runway 24L with autopilot and autothrust disconnected, the aircraft deviated above the glideslope and the groundspeed began to increase. The aircraft crossed the runway threshold about 40 feet above the glideslope. During the flare, the aircraft travelled through an area of heavy rain, and visual contact with the runway environment was significantly reduced. There were numerous lightning strikes occurring, particularly at the far end of the runway. The aircraft touched down about 3800 feet down the runway, reverse thrust was selected about 12.8 seconds after landing, and full reverse was selected 16.4 seconds after touchdown. The aircraft was not able to stop on the 9000-foot runway and departed the far end at a ground speed of about 80 knots. The aircraft stopped in a ravine at 2002 UTC (1602 eastern daylight time) and caught fire. All passengers and crew members were able to evacuate the aircraft before the fire reached the escape routes. A total of 2 crew members and 10 passengers were seriously injured during the crash and the ensuing\r\nevacuation.\n", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The crew conducted an approach and landing in the midst of a severe and rapidly changing thunderstorm. There were no procedures within Air France related to distance required from thunderstorms during approaches and landing, nor were these required by regulations.\r\n2. After the autopilot and autothrust systems were disengaged, the pilot flying (PF) increased the thrust in reaction to a decrease in the airspeed and a perception that the aircraft was sinking. The power increase contributed to an increase in aircraft energy and the aircraft deviated above the glide path.\r\n3. At about 300 feet above ground level (agl), the surface wind began to shift from a headwind component to a 10-knot tailwind component, increasing the aircraft’s groundspeed and effectively changing the flight path. The aircraft crossed the runway threshold about 40 feet above the normal threshold crossing height.\r\n4. Approaching the threshold, the aircraft entered an intense downpour, and the forward visibility became severely reduced.\r\n5. When the aircraft was near the threshold, the crew members became committed to the landing and believed their go-around option no longer existed.\r\n6. The touchdown was long because the aircraft floated due to its excess speed over the threshold and because the intense rain and lightning made visual contact with the runway very difficult.\r\n7. The aircraft touched down about 3800 feet from the threshold of Runway 24L, which left about 5100 feet of runway available to stop. The aircraft overran the end of Runway 24L at about 80 knots and was destroyed by fire when it entered the ravine. \r\n8. Selection of the thrust reversers was delayed as was the subsequent application of full reverse thrust.\r\n9. The pilot not flying (PNF) did not make the standard callouts concerning the spoilers and thrust reversers during the landing roll. This further contributed to the delay in the PF selecting the thrust reversers.\r\n10. Because the runway was contaminated by water, the strength of the crosswind at touchdown exceeded the landing limits of the aircraft.\r\n11. There were no landing distances indicated on the operational flight plan for a contaminated runway condition at the Toronto/Lester B. Pearson International Airport (CYYZ).\r\n12. Despite aviation routine weather reports (METARs) calling for thunderstorms at CYYZ at the expected time of landing, the crew did not calculate the landing distance required for Runway 24L. Consequently, they were not aware of the margin of error available for the landing runway nor that it was eliminated once the tailwind was experienced.\r\n13. Although the area up to 150 m beyond the end of Runway 24L was compliant with Aerodrome Standards and Recommended Practices (TP 312E), the topography of the terrain beyond this point, along the extended runway centreline, contributed to aircraft damage and to the injuries to crew and passengers.\r\n14. The downpour diluted the firefighting foam agent and reduced its efficiency in dousing the fuel-fed fire, which eventually destroyed most of the aircraft.\r\nFindings as to Risk :\r\n1. In the absence of clear guidelines with respect to the conduct of approaches into convective weather, there is a greater likelihood that crews will continue to conduct approaches into such conditions, increasing the risk of an approach and landing accident.\r\n2. A policy where only the captain can make the decision to conduct a missed approach can increase the likelihood that an unsafe condition will not be recognized early and, therefore, increase the time it might otherwise take to initiate a missed approach.\r\n3. Although it could not be determined whether the use of the rain repellent system would have improved the forward visibility in the downpour, the crew did not have adequate information about the capabilities and operation of the rain repellent system and did not consider using it.\r\n4. The information available to flight crews on initial approach in convective weather does not optimally assist them in developing a clear idea of the weather that may be encountered later in the approach.\r\n5. During approaches in convective weather, crews may falsely rely on air traffic control (ATC) to provide them with suggestions and directions as to whether to land or not. \r\n6. Some pilots have the impression that ATC will close the airport if weather conditions make landings unsafe; ATC has no such mandate.\r\n7. Wind information from ground-based measuring systems (anemometers) is critical to the safe landing of aircraft. Redundancy of the system should prevent a single-point failure from causing a total loss of relevant wind information.\r\n8. The emergency power for both the public address (PA) and EVAC alert systems are located in the avionics bay. A less vulnerable system and/or location would reduce the risk of these systems failing during a survivable crash.\r\n9. Brace commands were not given by the cabin crew during this unexpected emergency condition. Although it could not be determined if some of the passengers were injured as a result, research shows that the risk of injury is reduced if passengers brace properly.\r\n10. Safety information cards given to passengers travelling in the flight decks of Air France Airbus A340-313 aircraft do not include illustrations depicting emergency exit windows, descent ropes or the evacuation panel in the flight deck doors.\r\n11. There are no clear visual cues to indicate that some dual-lane slides actually have two lanes. As a result, these slides were used mostly as single-lane slides. This likely slowed the evacuation, but this fact was not seen as a contributing factor to the injuries suffered by the passengers.\r\n12. Although all passengers managed to evacuate, the evacuation was impeded because nearly 50 per cent of the passengers retrieved carry-on baggage.\r\nOther Findings:\r\n1. There is no indication that the captain’s medical condition or fatigue played a role in this occurrence.\r\n2. The crew did not request long aerodrome forecast (TAF) information while en route. This did not affect the outcome of this occurrence because the CYYZ forecast did not change appreciably from information the flight crew members received before departure, and they received updated METARs for CYYZ and Niagara Falls International Airport (KIAG).\r\n3. The possibility of a diversion required the flight crew to check the weather for various potential alternates and to complete fuel calculations. Although these activities consumed considerable time and energy, there is no indication that they were unusual for this type of operation or that they overtaxed the flight crew.\r\n4. The decision to continue with the approach was consistent with normal industry practice, in that the crew could continue with the intent to land while maintaining the option to discontinue the approach if they assessed that the conditions were becoming unsafe.\r\n5. There is no indication that more sophisticated ATC weather radar information, had it been available and communicated to the crew, would have altered their decision to continue to land.\r\n6. It could not be determined why door L2 opened before the aircraft came to a stop. \r\n7. There is no indication that the aircraft was struck by lightning.\r\n8. There is no information to indicate that the aircraft encountered windshear during its approach and landing.\r\n9. The flight crew seats are certified to a lower standard than the cabin seats, which may have been a factor in the injuries incurred by the captain."}