{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6b2-h4-turbo-porter-ferreira-do-alentejo-1-killed", "date": "Jun 19, 2016 at 1750 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "Grupo-Seven-Air", "flight_phase": "Flight", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Figueira dos Cavaleiros - Figueira dos Cavaleiros", "msn": "634", "yom": 1967, "flight_number": null, "city": "Ferreira do Alentejo", "zone": "Baixo Alentejo", "country": "Portugal", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1400, "captain_hours_type": 900, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6556, "circumstances": "On the afternoon of the 19th of June 2016 a Pilatus PC-6 aircraft, German registration DFSCB, took off from the airfield of Figueira dos Cavaleiros (LPFC) for its 17th launch of skydivers that day. On this flight there were 8 persons on board: 1 pilot, 5 skydivers and 2 passengers that were jumping in tandem with two of the skydivers. The meteorology featured a day with clear sky, the wind blew from 040° with 10 kt and the air temperature was around 32° C. The Pilatus took off for a local skydiving training flight and started a climb to an altitude of 14.500 ft. During the initial climb at a rate of 1.000 feet per minute, when crossing 7.000 feet above mean sea level, according to some of the skydivers in the group, a sound similar to the cracking/ripping of a metal structure was heard, and simultaneously the aircraft pitched up to a high nose-up attitude while yawing to the right, causing a severe flight instability. Suddenly, the entire rear fuselage structure disintegrated. According to the reports, some occupants were pushed against the structure of the aircraft before they were thrown outside. During the following seconds the skydivers who did not suffer serious injuries, managed to jump out of the plane and triggered their parachutes. Two of them were seriously injured before leaving the aircraft, their emergency parachutes being automatically deployed by the barometric opening mechanism. As a result, the disintegration of the remaining aircraft parts continued until the impact with the ground. Fragments of the aircraft parts were found over a length of approximately 1.500 meters and a width of about 500 meters and were widely dispersed, with an alignment with the direction of flight from west to east. The pilot was thrown out of the remains of the cockpit and hit the ground at about 400 meters from the impact site of the cabin. He did not trigger his parachute and it was not, nor is it a procedure to be equipped with an emergency parachute with an automatic barometric opening mechanism.", "probable_cause": "The investigation considers that, after the fracture of the HT-trim attachment accessory, the horizontal stabilizer was loose, uncontrolled and vibrated, causing the fracture of the left side of the horizontal stabilizer. \r\nContributing factors:\r\n- Failure on the inspection method by part 145 organization to the critical parts identified on SB 53-001 R1.\r\n- The weakness of regulator (ANAC) oversight to the aircraft operator."}