{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-60-duke-erie-2-killed", "date": "Dec 28, 1989 at 1201 LT", "type": "Beechcraft 60 Duke", "operator": "Automation Devices", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "No", "site": "City", "schedule": "Erie - Erie", "msn": "P-59", "yom": 1969, "flight_number": null, "city": "Erie", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3100, "captain_hours_type": 2100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot departed on a local VFR flight at 1117. At 1154 he contacted Erie tower for landing. He then advised the tower at 1159 that he had feathered the right engine. One minute later he reported that the left engine was '...kicking out.' The aircraft stalled into a house 6 miles from the airport, and just short of the shoreline of Lake Erie. No fuel was found in the right wing. 7 gallons were drained from the left wing; no fuel was found in the left engine. Right fuel quantity c/b secured in out position by wire tie; several burned components found on back of right fuel quantity gage pc board. Most recent record of fuel purchase which could be found was for May 25, 1989. A pocket diary was found in the wreckage which contained entries of flight times and fuel quantity notations. The accident occurred at 155 Euclide Avenue, Erie, about six miles east of runway 24 threshold. Both occupants were killed.\r\nPilot: \r\nFloyd E. Smith.\r\nPassenger:\r\nElwood Graham.", "probable_cause": "The pilot's failure to assure that the aircraft had an adequate supply of fuel on board for the intended flight. Contributing factors to the accident were an inoperative right fuel quantity gage which resulted in inaccurate fuel consumption calculations, and an inadvertent stall as the pilot attempted to reach a lake shore for an emergency landing."}