{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-100-fish-egg-inlet-3-killed", "date": "Sep 17, 1994 at 1148 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Pacific%20Coastal%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Fish Egg Inlet - Pruth Bay", "msn": "36", "yom": 1967, "flight_number": null, "city": "Fish Egg Inlet", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 11725, "captain_hours_type": 4000, "copilot_hours": 2500, "copilot_hours_type": 150, "aircraft_hours": null, "circumstances": "The captain, first officer, and two passengers departed from the Fish Egg Inlet logging camp, located 56 nautical miles (nm) north of Port Hardy, British Columbia, for a 16 nm visual flight rules (VFR) flight to Pruth Bay. This was the second leg of a flight which had originated at Port Hardy. The first officer, who occupied the left pilot seat and was handling the controls, taxied the aircraft a short distance away from the dock and took off. The captain occupied the right pilot seat. As the aircraft climbed through 100 feet, and just as the flaps were retracting, the aircraft pitched up violently and stalled. The pilots were unable to regain control of the aircraft, and it crashed into the water about 100 feet from the shore and sank immediately. The captain, who sustained serious injuries from the crash, escaped from the wreckage and swam to shore. The first officer and the two passengers remained in the aircraft and drowned. When the aircraft failed to arrive at Pruth Bay, personnel from Pacific Coastal Airlines (the company) notified the Rescue Coordination Centre and started their own search. A search pilot spotted debris in the water near the logging camp at about 1430 Pacific daylight saving time (PDT) that day. He landed to investigate, found the captain on the shore nearby, and transported him to the Port Hardy hospital. The accident occurred during daylight hours at approximately 1148 PDT, at latitude 51°36'N and longitude 127°41'W. There were no witnesses, other than the aircraft captain, to this accident.", "probable_cause": "The down elevator control cable failed at station 376 due to corrosion, and, as a result, the pilot lost control of the aircraft. The corrosion was not detected by the maintenance personnel during  the aircraft's last cable inspection. "}