{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-22c-los-angeles-38-killed", "date": "Jan 18, 1969 at 1821 LT", "type": "Boeing 727-100", "operator": "United-Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Los Angeles – Denver – Milwaukee", "msn": "19891/631", "yom": 1968, "flight_number": "UA266", "city": "Los Angeles", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 32, "pax_fatalities": 32, "other_fatalities": 0, "total_fatalities": 38, "captain_hours": 13665, "captain_hours_type": 1908, "copilot_hours": 6642, "copilot_hours_type": 1842, "aircraft_hours": 1036, "circumstances": "Boeing 727-22C N7434U operated Flight 266 from Los Angeles to Denver, CO and Milwaukee, WI. The aircraft had been operating since January 15, 1969, with the No. 3 generator inoperative. This was allowed because according to the Minimum Equipment List, the aircraft is airworthy with only two generators operable provided certain procedures are followed and electrical loads are monitored during flight. Flight 266 was scheduled to depart the gate at 17:55, but was delayed until 18:07 because of the inclement weather and loading problems. The flight commenced its takeoff roll on runway 24 at approximately 18:17. At 18:18:30 the sound of an engine fire warning bell was heard in the cockpit. The crew reported a no. 1 engine fire warning and stated that they wanted to return to the airport. Shortly after shutdown of the No. 1 engine, electrical power from the remaining generator (No. 2) was lost. Following loss of all generator power, the standby electrical system either was not activated or failed to function. Electrical power at a voltage level of approximately 50 volts was restored approximately a minute and a half after loss of the No. 2 generator. The duration of this power restoration was just 9 to 15 seconds. The Boeing descended and struck the sea 11.3 miles west of the airport. The ocean depth at this point is approximately 950 feet.", "probable_cause": "The loss of attitude orientation during a night, instrument departure in which all attitude instruments were disabled by loss of electrical power. The Board has been unable to determine (a) why all generator power was lost or (b) why the standby electrical power system either was not activated or failed to function."}