{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hp57-halifax-ii-blackden-edge-5-killed", "date": "Oct 5, 1943", "type": "Handley Page H.P.57 Halifax II", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Bombing", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Snaith - Snaith", "msn": null, "yom": null, "flight_number": null, "city": "Edale", "zone": "Derbyshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew, stationed at Snaith in Yorkshire were taking part in a raid against the German city of Frankfurt. The outward leg proceeded normally until shortly after they had released their bomb load over the target area. The aircraft was illuminated by a searchlight and engaged by flak and a night fighter sustaining hits to the port inner engine setting it alight and the No.2 fuel tank. The pilot took evasive action by corkscrewing the aircraft from 19,000 feet to 9,000 feet successfully evading further contact. As well as the fuel loss from the damage to one of the tanks, the loss of the port inner engine meant that some functions were also lost. Most could be carried out entirely manually but the engines generator provided power to the aircraft's batteries that powered the mid-upper turret, beam approach radio equipment and the R1154 / T1155 radio. These would work only as long as the charge remained in the batteries. The aircraft passed its turning points as far as Reading, shortly after the radio failed as the batteries had been drained. The weather at this point had deteriorated with low cloud and rain, effectively removing any chance of seeing landmarks such as rivers which would aid in locating Snaith, or another airfield. Eventually the pilot began to descend through the cloud to be able to find landmarks but while still in cloud, and virtually out of fuel, the aircraft flew into the ground on Blackden Edge. The aircraft broke up over a fairly wide area, most of the crew who died were killed in the crash but the Sergeant Lane survived the crash but was severely injured and died before help, summoned by Sgt Mack, arrived the following day. \r\nCrew (51st Squadron):\r\nSgt Ernest Hatfield Fenning, pilot, †\r\nW/O Jean Gilbert Felix Fortin, navigator, †\r\nSgt Eric George Lane, flight engineer, †\r\nSgt Victor Garland, bomb aimer, \r\nSgt Frank Allan Squibbs, wireless operator, †\r\nSgt Boris Karl Short, air gunner, †\r\nSgt James B. Mack, air gunner.\r\nSource: \r\nhttp://www.peakdistrictaircrashes.co.uk/pages/peakdistrict/peakdistricthr727.htm", "probable_cause": "Shot down by the German Flak and a German nigh fighter as well. "}