{"url": "https://www.baaa-acro.com/crash/crash-cessna-510-citation-mustang-daytona-beach", "date": "Feb 20, 2020 at 1245 LT", "type": "Cessna 510 Citation Mustang", "operator": "Ejets", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Daytona Beach - Daytona Beach", "msn": "510-0039", "yom": 2007, "flight_number": null, "city": "Daytona Beach-Intl", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2533, "captain_hours_type": 90, "copilot_hours": 7500, "copilot_hours_type": null, "aircraft_hours": 2380, "circumstances": "The pilot was receiving a checkride from a designated pilot examiner for his single-pilot type rating in a turbine airplane. After a series of maneuvers, emergencies, and landings, the examiner asked the pilot to complete a no-flap landing. The pilot reported that he performed the Before Landing checklist with no flaps and believed that he had put the gear down. During touchdown, the pilot felt a \"thump\" and thought a tire had blown; however, he saw that the landing gear handle was in the \"up\" position, and he noted that the landing gear warning horn did not sound because he had performed a no-flaps landing. The examiner confirmed that the landing gear handle was in the \"up\" position. The pilot reported that there were no preaccident mechanical malfunctions or failures with the airplane that would have precluded normal operation. A Federal Aviation Administration inspector who examined the airplane reported that the landing gear handle was in the \"up\" position and that the fuselage had sustained substantial damage. The landing gear was lowered and locked into place without issue after the airplane was lifted from the runway.", "probable_cause": "The pilot's failure to lower the landing gear before landing. Contributing to the accident was the examiner's failure to check that the landing gear was extended."}