{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-near-cairo-52-killed", "date": "Feb 20, 1956 at 0345 LT", "type": "Douglas DC-6", "operator": "TAI-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Desert", "schedule": "Saigon – Calcutta – Karachi – Bahrain – Cairo – Paris", "msn": "43835", "yom": 1953, "flight_number": null, "city": "Cairo", "zone": "Cairo", "country": "Egypt", "region": "Africa", "crew_on_board": 9, "crew_fatalities": 3, "pax_on_board": 55, "pax_fatalities": 49, "other_fatalities": 0, "total_fatalities": 52, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a scheduled flight from Saigon to Paris, France and had left Karachi for Cairo on 19 February at 1715 hours Greenwich Mean Time with 9 crew and 55 passengers aboard. The flight was routine until 0230 hours (20 February) when the aircraft reported to Cairo Air Traffic Control that it had passed Suez (60 miles east of Cairo) at 0224 at a flight level of 8 500 feet, flying VFR and was descending. At 0240 it reported the Cairo aerodrome in sight and being 15 miles out, was granted an authorization for a VFR approach and at the same time was given the QFE and QNH, 29.42 and 29.73 respectively. Contact was established with Cairo approach and the aircraft requested and received landing instructions oh 118.5 megacycles and was asked to call down wind. This message was acknowledged and was the last heard from the flight. Several attempts to contact the aircraft on all available frequencies were made but were unsuccessful. At 0450 hours the wreckage was sighted 18 miles southeast of the aerodrome. Only 6 crew members and 6 passengers survived. ", "probable_cause": "The accident was due to the failure of the pilot-in-command to monitor the co-pilot during a direct approach procedure and the reliance of the latter on his instruments exclusively to fix his position relative to the runway at an altitude below the minimum safe altitude. The factor of crew member fatigue can- not be ruled out"}