{"url": "https://www.baaa-acro.com/crash/crash-north-american-b-25d-mitchell-biak-8-killed", "date": "Aug 14, 1945", "type": "North American B-25 Mitchell", "operator": "Royal-Australian-Air-Force-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Mountains", "schedule": "Balikpapan – Biak – Pitu", "msn": null, "yom": null, "flight_number": null, "city": "Biak", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Thew aircraft failed to return from flight to Biak. There was no communication from the aircraft and it was not located despite a 3 day intensive search. As Dean Norman notes \"After the successful landings at Balikpapan, Borneo by the Allied forces Sepinggang airfield was soon ready to take Allied aircraft and was also to become the new home to 2nd Squadron. 2 Squadron's move from Hughes airstrip began on this day when a flight of six Mitchell's, led by F/Lt Neil Sharpe, departed for Sepinggang airfield and were to fly via Biak and Pitu. During the approach to the New Guinea coast on the first leg the formation encountered low cloud and F/Lt Sharpe descended to 3,000 feet. He also noted that F/Lt White turn away, to the right before disappearing behind cloud. F/Lt Sharpe then dropped to 1,000 feet and radioed the formation that he was going to fly below the cloud and upon reaching the coast would orbit and wait for the remaining aircraft. Arriving over the coast F/Lt Sharpe realized that two aircraft, which had broken formation were no longer with them. Arriving at Mokmer, Biak one of the missing aircraft soon landed but A47-37 was not seen again. Despite a search for the aircraft and crew it was many years later that the wreckage would be located in Dutch New Guinea (PNG). The war ended the very next day\".\r\nCrew (2nd Squadron):\r\nF/Lt Edward M. White,\r\nF/O A. K. Morrell,\r\nF/Sgt B. M. O'Brien,\r\nF/Sgt R. A. MacGregor,\r\nCpl W. J. C. Maxwell,\r\nLAC I. S. Coleman,\r\nLAC B. A. Marshall,\r\nLAC V. A. Morgan.\r\nSource: http://www.adf-gallery.com.au/", "probable_cause": null}