{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dash-8-100-seattle", "date": "Apr 16, 1988 at 1832 LT", "type": "De Havilland DHC-8-100 (Dash-8)", "operator": "Horizon%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Seattle - Spokane", "msn": "061", "yom": 1986, "flight_number": "QX2658", "city": "Seattle-Tacoma (SeaTac)", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 37, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9328, "captain_hours_type": 981, "copilot_hours": 3849, "copilot_hours_type": 642, "aircraft_hours": 3106, "circumstances": "Shortly after takeoff from Seattle-Tacoma Intl Airport, the crew noted a right engine power loss and decided to return for a precautionary landing. After lowering the landing gear, a massive fire was discovered in the right engine nacelle. After landing, directional control and all braking were lost. The aircraft departed the left side of the runway 16L after the left power lever was moved to flight idle. The f/o advised tower that the aircraft was out of control. The aircraft rolled onto the ramp area where it struck a runway designator sign, ground equipment, and jetways B7 and B9. The aircraft was subsequently destroyed by fire. Investigation revealed that during overhaul the high pressure fuel filter cover was improperly installed on the engine and the improper installation was not discovered drg company installation of the engine on the aircraft. This led to a massive fuel leak and the nacelle fire. The fire/explosion caused the loss of the engine panels, reducing the effectiveness of the fire suppression system and allowing other systems to be damaged.", "probable_cause": "Improper installation of the high-pressure fuel filter cover that allowed a massive fuel leak and subsequent fire to occur in the right engine nacelle. The improper installation probably occurred at the engine manufacturer; however, the failure of airline maintenance personnel to detect and correct the improper installation contributed to the accident. Also contributing to the accident was the loss of the right engine centre access panels from a fuel explosion that negated the fire suppression system and allowed hydraulic line burn-through that in turn caused a total loss of airplane control on the ground."}