{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-chieftain-san-diego-3-killed", "date": "Jun 20, 1997 at 1231 LT", "type": "Piper PA-31-310 Navajo", "operator": "San-Lo%20Aerial%20Surveys-1", "flight_phase": "Takeoff (climb)", "flight_type": "Aerial photography", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "San Diego - San Diego", "msn": "31-140", "yom": 1968, "flight_number": null, "city": "San Diego-Brown Field", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 10041, "captain_hours_type": 1586, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8473, "circumstances": "The aircraft concluded an aerial survey and landed at Brown Field to clear U.S. Customs. On restart, as the left engine began running, a witness noticed two short, yellow flame bursts exit the exhaust. During taxi, the witness heard a popping sound coming from the aircraft. As power was applied to cross runway 26L, the sound went away. The aircraft stopped for a few seconds prior to pulling onto the runway; the witness did not observe or hear a run-up. Witnesses reported hearing a series of popping sounds similar to automatic gunfire and observed the aircraft between 600 and 1,000 feet above the ground with wings level and the landing gear up. The aircraft was observed to make an abrupt, 45-degree banked, left turn as the nose dipped down. Witnesses reported the nose of the aircraft then raised up toward the horizon. This was followed by the aircraft turning to the left and becoming inverted in an estimated 30-degree nose low attitude. With the nose still low, the aircraft continued around to an upright position and appeared to be in a shallow right bank. Witnesses then lost sight of the aircraft due to buildings and terrain. A May 20, 1997, work order indicated the left manifold pressure fluctuated in flight. Both wastegates were lubricated and a test flight revealed the left engine manifold pressure lagged behind the right engine manifold pressure. On June 18, 1997, the left engine differential pressure controller was noted to have been removed and replaced. This was the corrective action for a discrepancy write up that the left engine manifold pressure fluctuated up and down 2 inHg and the rpm varied by 100 in cruise. A test flight that afternoon by the accident pilot indicated the discrepancy still occurred at cruise power settings, but the engine operated normally at high and low power settings. Post accident functional checks were performed on various components. No discrepancies were noted for the left governor. The left engine differential pressure controller was damaged and results varied on each test. The left density controller was too damaged to test. The right engine density and differential pressure controllers tested satisfactory. The left and right fuel pumps operated within specifications. Both fuel servos were damaged. One injection nozzle on the left engine was partially plugged; all others flow tested within specifications. ", "probable_cause": "The loss of power in the left engine for undetermined reasons and the pilot's subsequent failure to maintain minimum single-engine control airspeed. A contributing factor was the pilot's decision to fly with known deficiencies in the equipment. "}