{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-parks-4-killed", "date": "Nov 8, 2002 at 1020 LT", "type": "Cessna 208B Grand Caravan", "operator": "Brown County Financial Services", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Las Vegas - Midland", "msn": "208B-0971", "yom": 2002, "flight_number": null, "city": "Parks", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1880, "captain_hours_type": 77, "copilot_hours": 638, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed Las Vegas, Nevada, approximately 0919, on an IFR flight plan to Midland, Texas. The pilot climbed to an initial cruising altitude of 13,000 feet. At 1005, the pilot contacted Albuquerque ARTCC (ZAB) and reported that he was level at 13,000 feet. At 1009, the pilot requested to climb to 15,000 and the ZAB controller approved the request. At 1013:55, the pilot contacted Albuquerque Flight Watch and reported that he was approximately 23 miles west of Flagstaff, Arizona at 15,000 feet, and that about 20 miles west of his position, at 13,000 feet, he encountered \"light mixed icing.\" The pilot requested any PIREP's. Flight Watch reported that a PIREP for \"a trace of rime icing at 12,000,\" was reported by an airplane climbing westbound out of Albuquerque. The pilot acknowledged and asked for the weather across New Mexico. Flight Watch advised the pilot to stand by while he gathered the reports. At 1015:15, the pilot contacted ZAB. He reported, \"getting...mixed...right...now,\" and requested to climb to 17,000 feet. At 1015:57 the controller cleared the airplane to 17,000 feet. At 1016:35, the FW specialist repeated the report of trace icing near Albuquerque. The pilot did not reply. ZAB radar indicated the airplane climbed to 15,200 feet then entered a rapid descent. At 1017:08, a broken transmission was received. No further communications were received from the airplane. Radar contact was lost with the airplane at 1017:20. An examination of the airplane wreckage showed no anomalies. ", "probable_cause": "The pilot's improper in flight planning/decision making, his flight into known icing conditions, and his failure to maintain adequate airspeed which resulted in the inadvertent stall/spin and impact with terrain. Factors contributing to the accident were the pilot's improper pre-flight planning/preparation, the icing conditions, and the inadvertent stall/spin."}