{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-near-luvungi", "date": "May 22, 1964", "type": "De Havilland DHC-3 Otter", "operator": "Royal-Norwegian-Air-Force-31", "flight_phase": "Flight", "flight_type": "Military", "survivors": "Yes", "site": "Plain, Valley", "schedule": null, "msn": "20", "yom": 1953, "flight_number": null, "city": "Luvungi", "zone": "Sud-Kivu", "country": "Democratic Republic of Congo", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4389, "circumstances": "On 22nd May '64 the Scandinavian personnel at the Lemera mission station were to be evacuated by an army convoy of trucks coming from Bukavu. The Otter was tasked with overseeing the operation from above. 303 took off, piloted by Gunnar Elg, with Gosta Kersmark as flight engineer in the right seat and four passengers (one radio operator and three observers) in the cabin. They followed the road southwards at an altitude of 1,200 feet, which they believed to be a safe height. They overflew Luvungi airstrip, and five kilometres further on were taking a look at a parked lorry when one of its occupants took a shot at them with an automatic weapon. The bullet struck the Otter with a loud bang and seemingly severed an oil line, as the oil pressure fell to zero. The engineer throttled back but the RPM remained the same, indicating that the oil pressure system connected to the propeller adjustment had been affected. As the Otter had a hydromatic propeller, he could neither reduce the RPM nor stop the oil leak. They headed down following the road, which was straight but narrow. The pilot decided he would try and land on the road. After some two minutes, the engine failed, accompanied by violent vibrations. They were then 30 feet over the road. Take-off flap had been selected during the descent, but just before landing the pilot pumped the flaps to the landing position. The Otter touched down on the road at a speed of 70 knots and rolled about 150 feet until the starboard wing was torn away on striking a tree. The aircraft left the road and lost the landing gear going over a ditch, before coming to rest. The engine was knocked off and thrown thirty feet forward. 303 was a complete wreck, but its occupants miraculously escaped with only a few cuts and bruises. The six crew congregated on the road and then set off at a brisk pace towards the convoy. The group was over-flown by a Piper Apache aircraft, whose pilot waved and notified Kamembe Tower of the mishap. At times, the six hid in the undergrowth when rebel troops were encountered. Eventually they met up with the convoy and were taken to safety, after a most frightening ordeal. At the time of the crash, the Otter had 4,389 hours on the airframe. On 25th May '64 United Nations C-47 serial 215 took off from Bukavu and flew over the downed Otter, which was judged to be beyond economical repair. A salvage attempt was not made due to the presence of hostile forces in the area. The Board of Inquiry into the incident recommended that the Otter be written off the UN inventory and the remains handed over to the Congolese government.\r\nSource: http://www.dhc3otter.com/20.htm", "probable_cause": "Shot down by enemy fire. "}