{"url": "https://www.baaa-acro.com/crash/crash-cessna-207a-skywagon-cook-inlet-1-killed", "date": "Jan 9, 2007 at 1035 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Air-Supply-Alaska", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Kenai - Kokhanok", "msn": "207-0748", "yom": 1981, "flight_number": null, "city": "Cook Inlet", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5291, "captain_hours_type": 512, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13774, "circumstances": "The commercial certificated pilot prepared for a VFR cross-country nonscheduled cargo flight under Title 14, CFR Part 135, by preflighting the wheel-equipped airplane and starting the engine. The airplane had been parked on the airport ramp overnight, with an electric engine heater and an engine cover on. A portion of the flight was over ocean waters to a remote village. After engine start, the pilot contacted the company owner and reported that the engine oil pressure appeared to be low, but within the operating range. The owner and the pilot discussed the possible reasons, such as cold ambient temperatures, which was about -20 degrees F. The pilot then departed, and reported to his company that the engine pressure was good. About 10 minutes later, he declared an emergency and stated he was ditching in the water, about 18 miles west of the departure airport. Retrieved track data from the pilot's GPS showed the airplane's maximum altitude was 1,439 feet msl, while crossing the ocean in an area that was about 22 miles wide. A review of the manufacturer's maximum glide distance chart revealed that from an altitude of about 1,500 feet, the airplane could glide about 2.1 nautical miles. The airplane was located about two hours after the accident, floating nose down next to a segment of pan ice, about 8.8 miles from the initial accident location. The pilot was not recovered with the airplane, and subsequent searches did not locate him. Following recovery of the airplane, examination of the engine revealed a 8 X 5 inch hole in the top of the case, adjacent to the number 2 cylinder. The number 2 connecting rod was broken from its crankshaft journal, and broken from the bottom of the piston. The number 1 connecting rod bearing was missing from its normal position on the crankshaft journal and the rod had evidence of high heat. Evidence of oil starvation and high heat signatures to several crankshaft and connecting rod bearings was found throughout the engine, along with a large amount of fragmented bearing material. The pilot was not wearing any personal flotation equipment, and the expected survival time in the 29 degree F ocean water was about 30 minutes. The company's operations manual does not contain a written policy requiring pilot's to maintain sufficient altitude to reach shore when crossing ocean waters.", "probable_cause": "The total loss of engine power during cruise flight due to the disintegration of engine bearings and the fracture of a connecting rod, which resulted in a ditching into ice covered ocean water. Factors contributing to the survivability of the accident were the pilot's improper decision to fly over frigid water without sufficient altitude to reach a suitable landing area, the lack of written policy and procedures by the operator requiring sufficient altitude to reach shore when crossing ocean waters, temperature extremes consisting of sub-zero air and below freezing water temperatures, and the lack of personal flotation/survival equipment."}