{"url": "https://www.baaa-acro.com/crash/crash-airspeed-as57-ambassador-2-munich-23-killed", "date": "Feb 6, 1958 at 1603 LT", "type": "Airspeed AS.57 Ambassador", "operator": "BEA", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Belgrade – Munich – Manchester", "msn": "5217", "yom": 1951, "flight_number": "CY609", "city": "Munich-Riem", "zone": "Bavaria", "country": "Germany", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 2, "pax_on_board": 38, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": 7337, "captain_hours_type": 1722, "copilot_hours": 8463, "copilot_hours_type": 3143, "aircraft_hours": null, "circumstances": "The aircraft had carried out a special flight on 3 February 1958, from England to Belgrade, making an intermediate landing at Munich-Riem Airport for refuelling purposes. On 6 February it flew back from Belgrade, bound for Manchester. As planned, it again made an intermediate landing at Munich to refuel, landing there at 1417LT. The aircraft made three attempts at take-off, two were abandoned, and the accident occurred during the third attempt. The copilot abandoned the first take-off because the boost pressure readings of both engines showed upward variations, rising 2 or 3 inches above the usual reading of 57.5 inches. The second attempt to take-off followed immediately after the aircraft had taxied back to the beginning of the runway. The engine run-up was not repeated. The captain abandoned the second take-off because the boost pressure reading (this time on the port engine only) again rose beyond the normal maximum value to 60 inches. In each case the take-off was abandoned approximately half way down the runway. After the second attempt the aircraft continued rolling as far as the end of the runway and from there proceeded to the terminal building. The passengers disembarked, and the BEA station engineer went aboard. He then pointed out to the two pilots that the variations in boost pressure were connected with the elevation of Munich Airport. After a short discussion, the pilots decided to make a third (attempt at) take-off, and the passengers were told to board the aircraft again. Before the fresh (attempt to) take- off, a further engine run-up was carried out. After take-off had begun, the boost pressure reading of the port engine again fluctuated somewhat, but this ceased after the captain had throttled back slightly for a short time. After he had opened up the throttle fully again, no further fluctuation were observed. The aircraft never became airborne in the course of the third attempt at take-off. It traveled on over the whole length of the runway and the adjoining grass-covered stopway (250 m). At the end of the stopway it crashed through a wooden fence which marked the aerodrome boundary, cleared a secondary road and struck a house standing on the other side of the road. The left wing was torn off outboard of the engine mounting. Parts of the tail unit were also torn off here. The house caught fire. The aircraft then crashed into a wooden hut standing on a concrete base about 100 m further on, striking it with the right side of the rear section of the fuselage. The fuselage was torn away on a level with the trailing edge of the wing. The hut and the part of the fuselage which was torn away caught fire. The remainder of the aircraft wreckage slid on for a further 70 m. Of the 44 occupants (6 crew and 38 passengers) on board, 21 were killed instantly. The others received injuries of a more or less serious nature. Two died later in hospital as a result of their injuries. The house which was struck by the aircraft was badly damaged by fire. The hut was destroyed by fire. Among those killed were eight players and the trainer. The president of the club and ten other players survived the accident. ", "probable_cause": "During the stop of almost two hours at Munich, a rough layer of ice formed on the upper surface of the wings as a result of snowfall. This layer of ice considerably impaired the aerodynamic efficiency of the aircraft, had a detrimental effect on the acceleration of the aircraft during the take-off process and increased the required unstick-speed. Thus, under the conditions obtaining at the time of take-off, the aircraft was not able to attain this speed within the rolling distance available. It is not out of the question that, in the final phase of the take-off process, further causes may also have had an effect on the accident. British tests on the effect of slush on the takeoff process of an aircraft led the Luftfahrt-Bundesamt to decide to re-open the investigation in November 1964. In August 1966 the Commission arrived at the view that in the runway conditions obtaining at Munich-Riem at the time of the accident, the aircraft G-ALZU without ice on the wing upper surfaces could have attained the required unstick-speed and would have been bound to have done so. The failure to unstick, and hence the accident, are thus to be attributed to a series of inter-related causal factors viz.:\r\n- Decrease in the lift coefficient resulting from ice on the wing upper surfaces and a consequent increase in the minimum unstick speed,\r\n- Increase in drag caused by ice accretion, particularly at the higher angle of incidence during the unstick process,\r\n- Reduction by slush and spray of the margin of performance of the aircraft and effect of the slush on the trim.\r\nThe differing assessments of the situation by the two pilots during the final phase of the take-off to be inferred from Captain Thain's statements resulted in their acting in opposition which probably increased the severity of the accident."}