{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-281-near-shizukuishi-162-killed", "date": "Jul 30, 1971 at 1402 LT", "type": "Boeing 727-200", "operator": "All%20Nippon%20Airways-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Sapporo - Tokyo", "msn": "20436/788", "yom": 1971, "flight_number": "NH058", "city": "Shizukuishi", "zone": "Tōhoku", "country": "Japan", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 155, "pax_fatalities": 155, "other_fatalities": 0, "total_fatalities": 162, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 865, "circumstances": "The Boeing 727 departed Sapporo-Chitose Airport on a regular schedule flight to Tokyo-Haneda, carrying a crew of 7 and 155 passengers. While cruising at 28,000 feet, the airplane collided with a Japan Air-Self Defence Force North American F-86F Sabre registered 92-7932 and carrying a crew of two. Following the collision, both aircraft went out of control, dove into the ground and crashed in a mountainous area located south of Shizukuishi. While both military pilots were able to eject and were uninjured, all 162 occupants on board the 727 were killed.", "probable_cause": "It was determined that the military pilot under training failed to see and avoid other traffic while conducting a training mission. Relatively inexperienced, the trainee pilot had a total of 25 flying hours and delayed a corrective manoeuvre as ordered by his instructor. This caused the right wing of the Sabre to struck the horizontal stabilizer of the B727. \r\nThe following factors were identified:\r\n- The instructor continued the training flight without noticing that he had left the training airspace and entered the jet route J11L.\r\n- It is estimated that the All Nippon Airways pilots saw the training aircraft at least 7 seconds before the collision, but the avoidance operation was not performed until just before the collision. This is probably because the ANA pilot did not anticipate the collision.\r\n- For the instructor, the trainee's instruction to avoid a collision was shortly given to the trainee immediately before he saw the ANA aircraft, and he could not avoid the trainee's collision. This is probably because the instructor was unable to see the ANA aircraft.\r\n- About two seconds before the collision, the trainee visually recognized the ANA aircraft slightly to the right of the accident aircraft, and immediately performed an avoidance operation, but was unable to avoid the collision. It is considered that this is because the trainee had little experience in this manoeuvre and was mainly devoted to maintaining the relative position with the instructor aircraft, and it was delayed in observing the ANA aircraft."}