{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3a-freeport-34-killed", "date": "Sep 12, 1980 at 2058 LT", "type": "Douglas DC-3", "operator": "Florida%20Commuter%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "West Palm Beach - Freeport", "msn": "4861", "yom": 1942, "flight_number": null, "city": "Freeport", "zone": "West Grand Bahama", "country": "Bahamas", "region": "Central America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 30, "pax_fatalities": 30, "other_fatalities": 0, "total_fatalities": 34, "captain_hours": 6600, "captain_hours_type": 1700, "copilot_hours": 860, "copilot_hours_type": 150, "aircraft_hours": 6700, "circumstances": "N75KW initiated takeoff from West Palm Beach at 19:40. The crew rejected the takeoff, reported that they had no airspeed indication and taxied back to the ramp. It appeared that both pitot tubes were covered or partially covered with a mud dauber's nest. The airspeed indicator then tested ok and the flight took off from runway 09L at 20:35. The crew were cleared to climb to 5,000 feet, to intercept Bahama Route 63V (BR 63V), and to proceed on course. At 20:49:23 Miami center cleared N75KW for the approach to Freeport and to cross the Halbi intersection at 4,000 feet. Around 20:57 Freeport approach control cleared the flight to descend to 1,400 feet for a VOR approach to land on runway 24 at Freeport, which was acknowledged. This was the last radio contact with the flight. The DC-3 descended into the sea in low ceilings, low visibility with moderate turbulence and thunderstorm activity.", "probable_cause": "Unable to determine the probable cause of this accident from the available evidence. Although the Board has been unable to determine the probable cause with any degree of precision, the following factors may have contributed:\r\n1) Flight into known thunderstorm activities and turbulence;\r\n2) Pre-existing discrepancies in the pitot/static system of the aircraft and their effect on the reliability of the flight instruments;\r\n3) Lack of operational control exercised by the airline's management."}