{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-chandigarh", "date": "Mar 27, 2014 at 1139 LT", "type": "Beechcraft 200 Super King Air", "operator": "Government%20of%20Haryana", "flight_phase": "Takeoff (climb)", "flight_type": "Government", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chandigarh – New Delhi", "msn": "BB-1906", "yom": 2005, "flight_number": null, "city": "Chandigarh", "zone": "Chandigarh", "country": "India", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9888, "captain_hours_type": 2165, "copilot_hours": 2147, "copilot_hours_type": 1383, "aircraft_hours": 2010, "circumstances": "On 25.03.2014, the operator received the travel programme for 27.3.2014, of Hon'ble Governor of Haryana from Chandigarh to Delhi. On 26.3.2014, the operations department took the flight clearances and filed the passenger manifest with the ATC and other concerned agencies. The flight plan was filed by a CPL holder, who is working as flight dispatcher with the Government of Haryana. The departure on 27.3.2014 was fixed at 1130 hrs. The cockpit crew reported at 1045 hrs for the flight. Pre flight medical examination including the breath analyzer test was carried out at 1100 hrs. The breath analyzer test for both the cockpit crew members was negative. Pre flight briefing among the crew members was carried out by using the documents prepared by the flight dispatcher. The aircraft was taxied under its own power from Haryana Government Hangar to bay no. D-2 in front of ATC building. No abnormality was observed or reported on the aircraft during this taxiing. The engines were shut down for passenger embarkation. As per the passenger manifest, in addition to the pilot and co-pilot there were 8 passengers. The baggage on board was approx. 50 lbs. There was 2100 lbs. of fuel on board. After boarding of the passengers, the aircraft engines were started at 1130 hrs. The aircraft was cleared for departure abeam „D‟ link. The aircraft was taxied out via taxiway „D‟. After ATC departure clearance the aircraft was lined up for take-off. On clearance from ATC the take off roll was initiated and all the parameters were found normal. As per the pilot just before getting airborne some stiffness was found in rudder control as is felt in yaw damper engagement. The aircraft then pulled slightly to the left which as per the Commander was controllable. As per the pilot, the rotation was initiated at 98 knots. As per the DATCO the aircraft had lifted up to 10-15 feet AGL. The Commander has stated that after lift-off, immediately the left rudder got locked in forward position resulting in the aircraft yawing and rolling to left. The pilots tried to control it with right bank but the aircraft could not be controlled. Within 3-4 seconds of getting airborne the aircraft impacted the ground in left bank attitude. The initial impact was on pucca (tar road) and the wing has taken the first impact loads with lower surface metallic surface rubbing and screeching on ground. After the aircraft came to final halt, the co-pilot opened the door and evacuation was carried out. There was no injury to any of the occupants. The engine conditions lever could not be brought back as these were stuck. The throttle and pitch levers were retarded. The fuel shut off valves were closed. Battery and avionics were put off. Friction lock nuts were found loose. As per the Commander, after ensuring safety of passengers he had gone to cockpit to confirm that all switches were „off‟. At that time he has loosened the friction lock nuts to bring back the condition lever and throttle lever. However even after loosening the nut it was not possible to bring back these levers. Fire fighting vehicles were activated by pressing crash bell and primary alarm. Hand held RT set was used to announce the crash. RCFF vehicles proceeded to the site via runway and reported all the 10 personnel are safe and out of the disabled aircraft. Water and complementary agents (foam and dry chemical powder) were used. After fire was extinguished, the Fire Fighting vehicles reported back at crash bay except one CFT which was held at crash site under instruction of COO. The aircraft was substantially damaged. There was no fire barring burning of small patch of grass due coming in contact with the hot surfaces and oil. There was no injury to any of the occupants. The accident occurred in day light conditions.", "probable_cause": "The accident occurred due to stalling of left wing of the aircraft at a very low height. \r\nThe contributory factors were:\r\n- Failure on the part of the crew to effectively put off the yaw damp so as to release the rudder stiffness as per the emergency checklist.\r\n- Checklist not being carried out by the crew members.\r\n- Not putting off the Rudder Boost.\r\n- Speeds call outs not made by co-pilot.\r\n- Not abandoning the take-off at lower speed (before V1).\r\n- Failure of CRM in the cockpit in case of emergency.\r\n- Early rotation and haste to take-off."}