{"url": "https://www.baaa-acro.com/crash/crash-boeing-377-stratocruiser-redwood-city-3-killed", "date": "Sep 12, 1951 at 1146 LT", "type": "Boeing 377 Stratocruiser", "operator": "United-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "San Francisco – Oakland – San Francisco", "msn": "15970", "yom": 1949, "flight_number": "UA7030", "city": "Redwood City", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 17384, "captain_hours_type": 572, "copilot_hours": 16390, "copilot_hours_type": 346, "aircraft_hours": 1971, "circumstances": "The flight departed San Francisco at 1042, operating as \"United Trainer 7030.\" Flight Manager Frederick S. Angstadt was captain and was being given his semi-annual instrument check by Assistant Flight Manager Hugh C. Worthington, who served as copilot. Flight Engineer Charles K. Brogden was the third crew member. In addition to the foregoing instrument check, consideration had been given to investigating the feasibility of using the Oakland, California, Municipal Airport for certain phases of crew training in this type aircraft for a new class of pilots and flight engineers which was to convene that afternoon. Captains Angstadt and Worthington were to supervise this training. United Air Lines' officials stated that Captains Angstadt and Worthington intended to make this determination during the flight. Captain Angstadt was given the 0928 sequence weather reports for the local area prior to completing a clearance form at the UAL dispatcher's office. Pertinent weather was as follows: stratus clouds in the Bay area with tops at approximately 1,600 feet; San Francisco and Oakland - 800 foot ceiling, overcast, visibility three miles, haze and smoke; ceiling and visibility at Fresno and Sacramento unlimited. The forecast for the Bay area indicated scattered clouds by 1100 PST. Clearance was issued for local flight under Visual Flight Rules (VFR), confined to a 100-mile radius from San Francisco and under 10,000 feet. The load was properly distributed with respect to permissible center of gravity limits. Gross weight of the aircraft at takeoff was 114,886 pounds with 4,700 gallons of fuel, well under the maximum permissible gross takeoff weight. After reporting on top of the broken scattered clouds to the San Francisco tower at 1046, the flight proceeded to Oakland. The Oakland tower approved a simulated Instrument Landing System approach; this and a missed approach procedure were performed. The flight again reported on top at 1136. Another simulated ILS approach was requested of the Oakland tower but the flight was advised that there would be a delay due to other traffic. In view of this, the pilot decided to return to San Francisco. The flight changed frequency from the Oakland tower to San Francisco Approach Control at 1137. At 1139, the flight was cleared for an ILS approach to the San Francisco Airport, but did not acknowledge the clearance on the 119.1 megacycle Approach Control frequency. Following two attempts to contact the flight, the controller heard the aircraft make an unreadable call on 121.9 megacycles, and instructed the flight to listen on 119.1. This transmission was followed by further instruction for the flight to hold VFR, and stand by. The frequency change was apparently accomplished by the flight and the pilot again requested permission to make a simulated ILS approach. The request was granted, with instructions to report upon leaving the ILS outer marker inbound. This message and one other were not acknowledged by the flight. No emergency call was received from the aircraft. The crash was reported to the U. S. Coast Guard Air Station at 1046 by the manager of a nearby airport.", "probable_cause": "The Board determines that the probable cause of this accident was an inadvertent stall at a low altitude from which recovery was not effected. The following findings were pointed out:\r\n- The aircraft, with No. 4 propeller feathered, stalled and abruptly dived from an altitude of approximately 300 feet and was demolished upon impact in San Francisco Bay, \r\n- Engines Nos. 1, 2, and 3 were developing power at the time of impact,\r\n- The No. 4 propeller was feathered; however, there was no evidence found of structural failure or malfunctioning of this engine or its propeller,\r\n- The landing gear was extended and wing flaps were down 10 degrees at time of impact,\r\n- About 75 per cent of the aircraft was recovered; no evidence of fire fuel or electrical system malfunction, or structural failure in flight,\r\n- The cause of the stall was not definitely determined."}