{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-mouffy-6-killed", "date": "Nov 19, 2013 at 1116 LT", "type": "Socata TBM-700", "operator": "Aircraft%20Guaranty%20Corp%20Trustee", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Annecy - Toussus-le-Noble", "msn": "239", "yom": 2002, "flight_number": null, "city": "Mouffy", "zone": "Yonne", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 1430, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed Annecy-Meythet Airport at 1033LT on a flight to Toussus-le-Noble, carrying five passengers and one pilot. The flying time was approximately one hour under IFR mode. At 1111LT, while cruising at FL180 near Auxerre, heading to EBOMA, the pilot informed ATC he was ready for the descent. He was cleared to descend to FL120 when the aircraft started to drift to the left of the airway. Two minutes later, ATC informed the pilot about the deviation and the pilot acknowledged and initiated a turn to the right when control was lost. The airplane entered a dive and reached an excessive vertical speed until it crashed in an open field. The airplane disintegrated on impact and all six occupants were killed. ", "probable_cause": "Investigation did not reveal any technical element that could have contributed to the accident. However, considering the fact that the aircraft was totally destroyed upon impact, it was not possible to carry out all the examinations generally carried out on a wreck. It is possible the aircraft was flying in moderate icing conditions. Investigation could not determine if the deicing systems were activated. However, analysis of the flight path shows that the cruising speed was stable until the descent, which tends to indicate an absence of icing of the aircraft in normal cruise. A rapid and heavy icing of the aircraft during the descent making the aircraft to be difficult to control seems unlikely given the icing conditions predicted by Météo France. Investigations were unable to determine the reasons for the loss of control. Maybe it occurred during an unusual situation or any failure. Whatever the reasons, the lack of experience of the pilot on TBM-700, especially in the absence of visual references, may increase his workload beyond his capabilities, not allowing him to regain control of the aircraft. Once the loss of control occurred, given the weather conditions, it is very likely that the pilot did not recover any visual references until the collision with the ground."}