{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60p-aerostar-ted-smith-600p-columbus-1-killed", "date": "Jul 18, 2002 at 0345 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Grand%20Aire_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cleveland - Columbus", "msn": "60-0608-7961195", "yom": 1979, "flight_number": null, "city": "Columbus-Municipal (Bakalar)", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2378, "captain_hours_type": 51, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6288, "circumstances": "The airplane was destroyed by impact forces and fire after it impacted the intersection of runway 23 and 32 while attempting a missed-approach. The pilot's crew day started at 1300 and the 14 hour duty limit was 0300 the following morning. The second leg of the flight was delayed 1 hour and 36 minutes due to a freight delay. The operator reported the pilot exceeded his 14 hour crew day by 45 minutes as a result of the freight delay. The flight was cleared for the runway 23 ILS instrument approach. A witness, who was monitoring the Unicom radio frequency, reported that he heard clicking sounds on the Unicom frequency (to bring up the runway light intensity), but the pilot did not make any radio transmissions. The witness reported the ground fog was very thick. Two witnesses reported they heard the airplane's engines. They then heard the engines go to \"full power,\" and then they heard the airplane impact the ground. They saw an initial flash, but could not see the airplane on fire from 2,500 feet away. FAR 135.213 requires that, \"Weather observations made and furnished to pilots to conduct IFR operations at an airport must be made at the airport where those IFR operations are conducted.\" The destination did not have authorized weather reporting, and the operator's Operating Specifications did not list an alternate weather reporting source. At 0253, the observed weather 20 miles to the north, indicated the following: winds 190 at 4 knots, 1/4 statute mile visibility, fog, indefinite ceilings 100 feet, temperature 22 degrees C, dew point 22 degrees C, altimeter 30.00. From the initial point of impact (POI), the wreckage path continued for about 210 feet on a heading of about 180 degrees. The outboard section of the left wing outboard of the nacelle was found on runway 32, about 85 feet from the POI. Separated, unburned, portions of the left aileron and left flap were also found on the runway. The remaining pieces of the left wing were located with the main wreckage. The right wing was located with the main wreckage and the entire span of the right wing from the wing root to the wingtip exhibited continuity. The inspection of the airplane revealed no preexisting anomalies.", "probable_cause": "The pilot's failure to maintain control of the airplane during a missed approach. Additional factors included the operator's inadequate oversight, the pilot's improper in-flight decision, conditions conducive to pilot fatigue, fog, and night."}