{"url": "https://www.baaa-acro.com/crash/crash-rockwell-1121-jet-commander-van-nuys", "date": "Jun 11, 1985 at 0731 LT", "type": "Rockwell 1121 Jet Commander", "operator": "Midwest Jet Sales", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tucson – Van Nuys", "msn": "1121-044", "yom": 1966, "flight_number": null, "city": "Van Nuys", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5000, "captain_hours_type": 90, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot, executing an ILS approach, observed a primary hydraulic pressure drop and declared his intent to land without the use of flaps, speed brakes, reversers or nose wheel steering. The aircraft ran off the end of the runway during landing, traveled approximately 1,300 feet and came to rest on a golf course after striking two vehicles and a chain link fence. Post accident investigation revealed 0.8 quarts of hydraulic fluid (skydrol) in the reservoir. Reservoir capacity is 1.28 u.s. gallon. The pilot stated he pumped the brakes on approach to build pressure in the emergency brake system. The pilot announced he had no braked after touchdown. The Jet Commander 1121 operator's manual cautions against this practice. A functional check of the thrust reversers by on-scene investigators produced two complete cycles of operation. Two persons located in a ground vehicle were injured during the overrun landing.", "probable_cause": "Occurrence #1: overrun\r\nPhase of operation: landing - roll\r\nFindings\r\n1. (f) hydraulic system, reservoir - low level\r\n2. (f) brakes (normal) - not possible - other maintenance personnel\r\n3. (c) brakes (emergency) - improper use of - pilot in command\r\n4. (c) improper use of procedure - pilot in command\r\n5. (c) reversers - not used - pilot in command\r\n6. (f) aircraft preflight - not performed - pilot in command"}