{"url": "https://www.baaa-acro.com/crash/crash-learjet-25b-fort-lauderdale", "date": "Feb 20, 2004 at 2157 LT", "type": "Learjet 25", "operator": "Skylink Jets", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Juan – Fort Lauderdale", "msn": "25-159", "yom": 1974, "flight_number": null, "city": "Fort Lauderdale-Executive", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4104, "circumstances": "The captain and first officer were conducting a CFR Part 135 on-demand charter flight, returning two passengers to the accident airplane's base airport. The multi-destination flight originated from the accident airport, about 16 hours before the accident. On the final leg of the flight, the flight encountered stronger than anticipated headwinds, and the first officer voiced his concern several times about the airplane's remaining fuel. As the flight approached the destination airport, the captain became concerned about having to fly an extended downwind leg, and told the ATCT specialist the flight was low on fuel. The ATCT specialist then cleared the accident airplane for a priority landing. According to cockpit voice recorder (CVR) data, while the crew was attempting to lower the airplane's wing flaps in preparation for landing, they discovered that the flaps would not extend beyond 8 degrees. After the landing gear was lowered, the captain told the first officer, in part: \"The gear doors are stuck down.... no hydraulics.\" The captain told the first officer: \"Okay, so we're gonna do, this is gonna be a ref and twenty...All right, probably not going to have any brakes...\" According to a ATCT specialist in the control tower, the airplane touched down about midway on the 6001-foot long, dry runway. It continued to the end of the runway, entered the overrun area, struck a chain link fence, crossed a road, and struck a building. During a postaccident interview, the captain reported that during the landing roll the first officer was unable to deploy the airplane's emergency drag chute. He said that neither he nor the first officer attempted to activate the nitrogen-charged emergency brake system. The accident airplane was not equipped with thrust reversers. A postaccident examination of the accident airplane's hydraulic pressure relief valve and hydraulic pressure regulator assembly revealed numerous indentations and small gouges on the exterior portions of both components, consistent with being repeatedly struck with a tool. When the hydraulic pressure relief valve was tested and disassembled, it was discovered that the valve piston was stuck open. The emergency drag chute release handle has two safety latches that must be depressed simultaneously before the parachute will activate. An inspection of the emergency drag chute system and release handle disclosed no pre accident mechanical anomalies. ", "probable_cause": "The pilot in command's misjudged distance/speed while landing, and the flightcrew's failure to follow prescribed emergency procedures, which resulted in a runway overrun and subsequent collision with a building. Factors associated with the accident are the flightcrew's inadequate in-flight planning/decision making, which resulted in a low fuel condition; an open hydraulic relief valve, and inadequate maintenance by company maintenance personnel. Additional factors were an inoperative (normal) brake system, an unactivated emergency drag chute, the flightcrew's failure to engage the emergency brake system, and pressure placed on the flightcrew due to conditions/events."}