{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-500b-near-armstrong", "date": "Nov 30, 2007 at 0917 LT", "type": "Rockwell Aero Commander 500", "operator": "Hicks%20%26%20Lawrence_0", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Dryden – Geraldton", "msn": "500-1093-56", "yom": 1961, "flight_number": null, "city": "Armstrong", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed from Dryden, Ontario, en route to Geraldton, Ontario. The flight was conducted under visual flight rules at 5500 feet above sea level with ambient temperatures aloft of -33°C. Approximately 40 minutes into the flight, the crew observed an abnormal right engine fuel flow indication. While troubleshooting the right engine, the engine rpm and fuel flow began to decrease and the crew diverted toward Armstrong, Ontario. A short time later, the left engine rpm and fuel flow began to decrease and the crew could no longer maintain level flight. At 0917 central standard time, the crew made a forced landing 20 nautical miles southwest of Armstrong, into a marshy wooded area. The captain sustained serious injuries and the co-pilot and passenger sustained minor injuries. The aircraft was substantially damaged. The crew and passenger were stabilized and transported to Thunder Bay, Ontario, for medical assistance. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. Suspended water in the fuel system precipitated out of solution and froze in the fuel distributor valve. This blocked the fuel supply to the fuel nozzles and led to the loss of engine power.\r\n2. The aircraft was being operated without a fuel additive icing inhibiter. Use of such an additive would have inhibited ice formation in the aircraft’s fuel system and would likely have prevented the fuel system blockage.\r\nFindings as to Risk:\r\n1. The fuel distributor valve on the Aero Commander 500B is exposed directly to the cooling blast of the outside air, which under extremely cold conditions, can lead to the freezing of super-cooled water droplets present in the fuel stream.\r\n2. The operator did not have procedures to describe how fuel additive icing inhibiter should be used during winter operations. "}