{"url": "https://www.baaa-acro.com/crash/crash-atr72-600-semarang", "date": "Dec 25, 2016 at 1824 LT", "type": "ATR72-600", "operator": "Wings%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bandung – Semarang", "msn": "1234", "yom": 2015, "flight_number": "IW1896", "city": "Semarang-Ahmad Yani", "zone": "Central Java", "country": "Indonesia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 68, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4065, "captain_hours_type": 3805, "copilot_hours": 3300, "copilot_hours_type": 3200, "aircraft_hours": 3485, "circumstances": "On 25 December 2016, an ATR 72-600 aircraft registered PK-WGW was being operated by PT. Wings Abadi Airlines (Wings Air) as a scheduled passenger flight from Husein Sastranegara International Airport (WICC), Bandung to Ahmad Yani International Airport (WAHS), Semarang with flight number WON 1896. On board the aircraft were two pilots, two flight attendants and 68 passengers. There was no report or record of aircraft system malfunction prior to the departure. The aircraft departed from Bandung at 1734 LT (1034 UTC). The Pilot in Command (PIC) acted as Pilot Flying (PF) and the Second in Command (SIC) acted as Pilot Monitoring (PM). The flight from departure until commenced for landing approach was uneventful. At 1112 UTC, at night condition, the air traffic controller of Semarang Approach unit (approach controller) informed to all traffic that the rain was falling over the airport and the pilot confirmed whether the rain was heavy and was replied that it was slight rain. At 1115 UTC, the flight held over waypoint KENDA for separation with another aircraft and maintained altitude of 4,000 feet. Two minutes later, the flight was approved to descend to altitude of 3,000 feet. At 1118 UTC, the approach controller issued clearance for RNAV approach to runway 13 and advised the pilot to report when leaving waypoint KENDA. One minute later, the pilot reported leaving waypoint KENDA and the approach controller instructed to continue approach and to contact to the air traffic controller of Semarang Tower unit (tower controller). At 1120 UTC, the pilot advised to the tower controller that the aircraft was on final and the runway was in sight. The tower controller instructed to continue the landing approach and advised that the surface wind direction was 190° with velocity of 15 knots, altimeter setting 1,008 mbs and the runway was wet. At 1121 UTC, the tower controller had visual contact to the aircraft and issued landing clearance, the pilot read back the clearance and requested to reduce the approach light intensity. The tower controller reduced the light intensity and confirmed whether the intensity was appropriate then the pilot affirmed. At 1124 UTC, the aircraft touched down and bounced. After the third bounce, the pilot attempted to go around and the aircraft touched the runway. The tower controller noticed that the red light on the right wing was lower than the green light on the left wing. The aircraft moved to the right from the runway centerline and stopped near taxiway D. The tower controller realized that the aircraft was not in normal condition and pressed the crass bell then informed the Airport Rescue and Fire Fighting (ARFF) personnel by phone that there was aircraft accident near the taxiway D. At 1126 UTC, the pilot advised the tower controller that the aircraft stopped on the runway and requested assistance. The tower controller acknowledged the message and advised the pilot to wait for the assistance. While waiting the assistance, the pilot kept the engines run to provide lighting in the cabin. At 1129 UTC, the tower controller advised the pilot to shut down the engines since the ARFF personnel had arrived near the aircraft to assist the evacuation. Passenger evacuation completed at approximately 10 minutes after the aircraft stopped.", "probable_cause": "Contributing Factors:\r\n- The visual illusion of aircraft higher than the real altitude resulted in late flare out which made the aircraft bounced.\r\n- The unrecovered bounce resulted in abnormal landing attitude with vertical acceleration up to 6 g and collapsed the right main landing gear."}