{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-208a-jones-beach", "date": "Jan 5, 1947 at 2208 LT", "type": "Douglas DC-3", "operator": "American-Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "New York-La Guardia – Baltimore – Washington DC – Nashville", "msn": "2104", "yom": 1939, "flight_number": "AA203", "city": "Jones Beach", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 13, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6715, "captain_hours_type": 5580, "copilot_hours": 3850, "copilot_hours_type": 1500, "aircraft_hours": 25547, "circumstances": "At 2107, the American Airlines’ radio station at New York received a message from the flight on very high frequency, indicating that it had no range reception or operative direction finding facilities. Because it had become apparent that precipitation static was so severe that it would not be possible to use the Philadelphia radio range for an approach to the Municipal Airport, the flight advised that it was continuing northeastward until visual contact with the ground was established. During this transmission, Flight 203 reported its position as in the vicinity of Lake-Hurst, New Jersey. When asked by the New York station of American Airlines at 2115 if he were “contact” in the South Jersey area, the pilot of Flight 203 replied that he had not been “contact” since leaving Washington. At 2128, Flight 203 declared an emergency, reporting that it had 70 gallons of gas aboard, with little or no D/F or radio range reception, and requested a report on the “neatest weather that is 1,000 feet or better.” While maintaining a northeasterly heading, the flight descended to an altitude of 200 feet. However, inasmuch as instrument conditions were still being encountered at that altitude, the pilot climbed again to an altitude of 1,500 feet. By the time the American Airlines’ New York station was able to provide the flight with weather reports in the area northeast of La Guardia Airport, the pilot had decided to effect an emergency landing without further delay. At this time there was but 30 minutes gas supply remaining on board. The pilot turned to a heading of 110 degrees toward the Atlantic Ocean in order to permit a descent to be made over open water. At 2156, after having maintained an east-southeasterly heading for 15 minutes, the flight advised the American Airlines’ station at New York that it intended to drop a flare. Upon dropping the flare and following it to the surface, the pilot found that the flight was over water. The pilot turned, therefore, to a heading of 300 degrees and, with the aircraft landing lights shining on the surface, continued westbound until sighting a shore line. He immediately maneuvered the aircraft to align it with the beach, which was oriented approximately 60 degrees to the left of his flight path, and completed an emergency landing at 2208 with his wheels retracted. Being unaware of his location, the pilot requested that bearings be taken in order to identify the position of the aircraft. At 2245, American Airlines was advised by telephone that Flight 203 had been located on the beach approximately one mile east of the Coast Guard Station at Jones Beach, New York.", "probable_cause": "On the basis of the above findings, the Board determines that the probable cause of this accident was the inability of the pilot to land at a prepared landing area due to the loss of radio navigational reference resulting from severe static interference. A contributing factor was the saturation of navigational facilities in the New York-Washington area due to the existence of a large number of emergencies which prevented an early landing. A further contributing factor was the failure of the company and the United States Weather Bureau to forecast adequately the high level conditions affecting this area due to insufficient number of radiosonde stations in the northeastern states."}