{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a60-duke-minidoka", "date": "Aug 13, 2009 at 1541 LT", "type": "Beechcraft 60 Duke", "operator": "Nestor Aviation & Aerobatics", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Pocatello – Boise", "msn": "P-132", "yom": 1970, "flight_number": null, "city": "Minidoka", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2000, "captain_hours_type": 800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3120, "circumstances": "The pilot reported that he planned to fly a round trip cross-country flight. Prior to takeoff, he ascertained the quantity of fuel on board based upon the airplane's fuel totalizer gauge indication, which indicated 89 gallons. The flight to the destination was uneventful, and upon landing, 20 gallons of fuel was purchased. Thereafter, the pilot departed for the return flight back to his originating airport. According to the pilot, on takeoff the fuel tank gauges indicated the tanks were between 1/3 and 1/4 full. While cruising, the pilot contacted an air traffic control facility and notified them that he had lost power in one engine. About 5 minutes later, the pilot broadcasted that both engines were without power. Unable to reach the nearest airport, the pilot landed on soft, uneven terrain. During rollout, the airplane nosed over and was substantially damaged. The calculated post accident fuel burn-off for the round trip flight was about 106 gallons. During the post accident inspection, an FAA inspector reported finding an estimated 2 gallons of fuel in one tank. The other tank was dry. No fuel was observed in the main fuel lines to the engines, and no mechanical malfunctions were reported by the pilot.", "probable_cause": "A loss of engine power due to fuel exhaustion as a result of the pilot's inadequate fuel planning."}