{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-104a-irkutsk-24-killed", "date": "Feb 9, 1976 at 0805 LT", "type": "Tupolev TU-104", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Irkutsk – Novosibirsk – Sverdlovsk – Leningrad", "msn": "6 66 002 01", "yom": 1956, "flight_number": "SU3739", "city": "Irkutsk-Intl", "zone": "Irkutsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 10, "crew_fatalities": 9, "pax_on_board": 104, "pax_fatalities": 15, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 22069, "circumstances": "At liftoff, the right wing dropped and the airplane rolled to the right to an angle of 70°, causing the right wing to struck the snow covered ground 129 metres to the right of the runway. Out of control, the airplane crossed a taxiway, passed behind an air Koryo TU-154 that just landed (some debris struck the TU-154) and came to rest in flames, broken in three, 232 metres further. The wreckage was found 180 metres southeast of the runway end. 78 people, among them a stewardess, were injured, 12 people were unhurt. 24 occupants were killed, 15 passengers and nine crew members. ", "probable_cause": "The loss of control after rotation was caused by the combination of an asymmetrical fueling and pilot errors. It was determined that there was a difference of 1,500 kg of fuel between both wing tanks; 1,500 kg more in the right wing tank than the left wing tank, causing an excessive weight in the right wing. An excessive angle of attack after rotation above the allowable values and the lack of reaction from the pilot-in-command who failed to correct the situation for a period of eight seconds, caused the aircraft to reach an excessive right roll angle of 70° and to crash."}