{"url": "https://www.baaa-acro.com/crash/crash-embraer-erj-190ar-quito", "date": "Sep 16, 2011 at 1911 LT", "type": "Embraer ERJ-190", "operator": "TAME", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Loja - Quito", "msn": "190-00027", "yom": 2006, "flight_number": "EQ148", "city": "Quito-Mariscal Sucre (City)", "zone": "Pichincha", "country": "Ecuador", "region": "South America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 97, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6160, "captain_hours_type": 1879, "copilot_hours": 4891, "copilot_hours_type": 2807, "aircraft_hours": 8752, "circumstances": "Following an uneventful flight from Loja, the crew started the descent to Quito-Mariscal Sucre Airport runway 35 by night and poor weather conditions. After touchdown on wet runway 35, the aircraft encountered difficulties to decelerate properly. Unable to stop within the remaining distance, the airplane overran, went down an embankment, collided with a brick wall and came to rest. There was no fire. All 103 occupants were rescued, among them four passengers were slightly injured. The aircraft named 'Ciudad de Cuenca' was damaged beyond repair.", "probable_cause": "The Board of Inquiry estimated that the probable cause of this accident was the crew's decision to continue the approach and landing without carrying out the procedures (ABNORMAL AND EMERGENCY PROCEDURES) established by Embraer in the Quick Reference Handbook when a malfunction occurred with the slat/flap system, resulting in a wrong approach configuration.\r\nThe following findings were identified:\r\n- The slats were inoperative during the approach and the crew performed five trouble shooting without success, \r\n- Despite this situation, the crew decided to continue the approach, failed to follow the approach checklist and failed to input the reference speed and distance for landing according to circumstances, \r\n- The aircraft landed too far down the runway, about 880 metres past the runway 35 threshold, \r\n- The braking action was low because the runway surface was wet, \r\n- In normal conditions, with flaps down in second position and slats out, the landing reference speed was 119 knots with a landing distance of 880 metres, \r\n- Because the slats were inoperative, the landing reference speed should be 149 knots and a landing distance of 1,940 metres was needed, \r\n- The aircraft passed over the runway threshold at a height of 50 feet and at an excessive speed of 163,8 knots, \r\n- Spoilers were activated 9 seconds after touchdown, 950 metres after the runway threshold,\r\n- Reverse thrust systems were activated 1,280 metres after the runway threshold,\r\n- The crew started to use brakes 2,300 metres after the runway threshold (runway 35 is 3,125 metres long), with the antiskid system activated, \r\n- Due to an excessive approach speed (15 knots above Vref), a too long flare and a too late application of the brake systems, the aircraft could not be stopped within the remaining distance, \r\n- The slats malfunction was the consequence of the failure of several actuators which did not support negative temperatures met during the last flight, \r\n- Since last July 19, the slats failed 53 times on this aircraft, six times during the approach and 47 times in flight,\r\n- The crew failed to initiate a go-around procedure. "}