{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-600-near-port-keats-1-killed", "date": "Sep 2, 2000 at 2125 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Sandgar", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Plain, Valley", "schedule": "Port Keats – Darwin", "msn": "60-0567-7961185", "yom": 1979, "flight_number": null, "city": "Port Keats", "zone": "Northern Territory", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 15000, "captain_hours_type": 122, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot had submitted a flight plan nominating a charter category, single pilot, Instrument Flight Rules flight, from Darwin to Port Keats and return. The Piper Aerostar 600A aircraft, with 6 Passengers on board, departed Darwin at 2014 Central Standard Time and arrived at Port Keats at 2106 hours after an uneventful flight. The passengers disembarked at Port Keats and the pilot prepared to return to Darwin alone. At 2119 hours the pilot reported taxying for runway 34 to Brisbane Flight Service. That was the last radio contact with the aircraft. Witnesses noted nothing unusual as the aircraft taxied and then took off from runway 34. As a departure report was not received, a distress phase was declared and subsequently a search was instigated. The following morning a number of major structural components of the aircraft, including the outer left wing, were located at a position 24 km north-east of Port Keats aerodrome and close to the aircraft's flight planned track. The main portion of wreckage was found four days later, destroyed by ground impact. The impact crater was located a considerable distance from the previously located structural components and indicated that an inflight breakup had occurred. The accident was not survivable.", "probable_cause": "Shortly after departure from Port Keats aerodrome, the pilot lost control of the aircraft for reasons unknown. Aerodynamic loading of the left wing in excess of the ultimate load limit occurred, resulting in an inflight breakup of the airframe. The investigation was unable to determine the circumstances that led to the loss of control and subsequent inflight break-up of the aircraft."}