{"url": "https://www.baaa-acro.com/crash/crash-hawker-siddeley-hs121-trident-2e-hong-kong-7-killed", "date": "Aug 31, 1988 at 0919 LT", "type": "Hawker Siddeley HS.121 Trident", "operator": "CAAC-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Guangzhou - Hong Kong", "msn": "2159", "yom": 1973, "flight_number": "CA301", "city": "Hong Kong-Kai Tak", "zone": "Hong Kong", "country": "China", "region": "Asia", "crew_on_board": 11, "crew_fatalities": 6, "pax_on_board": 78, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14332, "circumstances": "A Hawker Siddeley HS-121 Trident 2E passenger jet, registered B-2218, was damaged beyond repair in a landing accident at Kowloon Bay, Hong Kong. There were 78 passengers and seven crew members crew members on board. The airplane operated on CAAC flight 301 from Guangzhou-Baiyun Airport (CAN) to Hong Kong-Kai Tak International Airport (HKG). As the aircraft neared runway 31 the right outboard trailing edge wing flap struck the innermost approach light and the right main landing gear tyres hit the facing edge of the runway promontory. The right main gear was torn from the wing. The aircraft became airborne again and next contacted the ground 600 metres down the runway. It then veered off the runway to the right, yawed to the right and slid diagonally sideways across the grassed runway strip. The nosewheel and left main gear collapsed, and the aircraft continued until it crossed the parallel taxiway and slid sideways over the edge of the promontory into Kowloon Bay. The aircraft came to rest in the water with the rear extremity of the fuselage supported on a ledge of stone blocks that jutted out from the promontory. Part of the forward fuselage, including the flight compartment, was partially detached from the remainder of the fuselage and hung down at a steep angle into the water from control cables and secondary structure. A fire started in the centre engine intake duct. Weather at the time of the accident was poor including rain and fog with 450 m visibility. Seven occupants, six crew members and one passengers, were killed. ", "probable_cause": "There was insufficient evidence to determine the cause of the accident. It appears probable that, having converted to visual references at some point prior to Decision Height, the commander elected to continue the approach despite the fact that heavy rain had caused a sudden marked deterioration in the visual references in the final stages. There was no conclusive evidence that the aircraft encountered significant windshear on the approach, but given the meteorological conditions that existed at the time it cannot be ruled out, and therefore windshear may have been a contributory factor in destabilising the approach."}