{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-209b-magong-225-killed", "date": "May 25, 2002 at 1529 LT", "type": "Boeing 747-200", "operator": "China-Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Taipei - Hong Kong", "msn": "21843", "yom": 1979, "flight_number": "CI1611", "city": "Magong", "zone": "Penghu County (澎湖縣)", "country": "Taiwan", "region": "Asia", "crew_on_board": 19, "crew_fatalities": 19, "pax_on_board": 206, "pax_fatalities": 206, "other_fatalities": 0, "total_fatalities": 225, "captain_hours": 10148, "captain_hours_type": 4732, "copilot_hours": 10173, "copilot_hours_type": 5831, "aircraft_hours": 64810, "circumstances": "On May 25, 2002, China Airlines (CAL) CI611, a Boeing 747-200, Republic of China (ROC) registration B-18255, was a regularly scheduled flight from Chiang Kai Shek International Airport (CKS), Taoyuan, Taiwan, ROC to Chek Lap Kok International Airport, Hong Kong. Flight CI611 was operating in accordance with ROC Civil Aviation Administration (CAA) regulations. The captain (Crew Member-1, CM-1) reported for duty at 1305 , at the CAL CKS Airport Dispatch Office and was briefed by the duty dispatcher for about 20 minutes, including Notices to Airmen (NOTAM) regarding the TPE Flight Information Region (FIR). The first officer (Crew Member-2, CM-2) and flight engineer (Crew Member-3, CM-3) reported for duty at CAL Reporting Center, Taipei, and arrived at CKS Airport about 1330. The aircraft was prepared for departure with two pilots, one flight engineer, 16 cabin crew members, and 206 passengers aboard. The crew of CI611 requested taxi clearance at 1457:06. At 1507:10, the flight was cleared for takeoff on Runway 06 at CKS. The takeoff and initial climb were normal. The flight contacted Taipei Approach at 1508:53, and at 1510:34, Taipei Approach instructed CI611 to fly direct to CHALI. At 1512:12, CM-3 contacted China Airlines Operations with the time off-blocks, time airborne, and estimated time of arrival at Chek Lap Kok airport. At 1516:24, the Taipei Area Control Center controller instructed CI611 to continue its climb to flight level 350, and to maintain that altitude while flying from CHALI direct to KADLO4. The acknowledgment of this transmission, at 1516:31, was the last radio transmission received from the aircraft. Radar contact with CI611 was lost by Taipei Area Control at 1528:03. An immediate search and rescue operation was initiated. At 1800, floating wreckage was sighted on the sea in the area 23 nautical miles northeast of Makung, Penghu Islands. The aircraft was totally destroyed and all 225 occupants were killed. ", "probable_cause": "Findings related to probable causes:\r\n1. Based on the recordings of CVR and FDR, radar data, the dado panel open-close positions, the wreckage distribution, and the wreckage examinations, the in-flight breakup of CI611, as it approached its cruising altitude, was highly likely due to the structural failure in the aft lower lobe section of the fuselage.\r\n2. In February 7 1980, the accident aircraft suffered a tail strike occurrence in Hong Kong. The aircraft was ferried back to Taiwan on the same day un-pressurized and a temporary repair was conducted the day after. A permanent repair was conducted on May 23 through 26, 1980.\r\n3. The permanent repair of the tail strike was not accomplished in accordance with the Boeing SRM, in that the area of damaged skin in Section 46 was not removed (trimmed) and the repair doubler did not extend sufficiently beyond the entire damaged area to restore the structural strength.\r\n4. Evidence of fatigue damage was found in the lower aft fuselage centered about STA 2100, between stringers S-48L and S-49L, under the repair doubler near its edge and outside the outer row of securing rivets. Multiple Site Damage (MSD), including a 15.1-inch through thickness main fatigue crack and some small fatigue cracks were confirmed. The 15.1-inch crack and most of the MSD cracks initiated from the scratching damage associated with the 1980 tail strike incident.\r\n5. Residual strength analysis indicated that the main fatigue crack in combination with the Multiple Site Damage (MSD) were of sufficient magnitude and distribution to facilitate the local linking of the fatigue cracks so as to produce a continuous crack within a two-bay region (40 inches). Analysis further indicated that during the application of normal operational loads the residual strength of the fuselage would be compromised with a continuous crack of 58 inches or longer length. Although the ASC could not determine the length of cracking prior to the accident flight, the ASC believes that the extent of hoop-wise fretting marks found on the doubler, and the regularly spaced marks and deformed cladding found on the fracture surface suggest that a continuous crack of at least 71 inches in length, a crack length considered long enough to cause structural separation of the fuselage, was present before the in-flight breakup of the aircraft.\r\n6. Maintenance inspection of B-18255 did not detect the ineffective 1980 structural repair and the fatigue cracks that were developing under the repair doubler. However, the time that the fatigue cracks propagated through the skin thickness could not be determined."}