{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-95-charlotte-amalie-37-killed", "date": "Apr 27, 1976 at 1510 LT", "type": "Boeing 727-100", "operator": "American-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Providence - New York - Charlotte Amalie", "msn": "19837/499", "yom": 1967, "flight_number": "AA625", "city": "Charlotte Amalie-Cyril E. King (ex Harry S. Truman)", "zone": "All US Virgin Islands", "country": "US Virgin Islands", "region": "Central America", "crew_on_board": 7, "crew_fatalities": 2, "pax_on_board": 81, "pax_fatalities": 35, "other_fatalities": 0, "total_fatalities": 37, "captain_hours": 22225, "captain_hours_type": 10000, "copilot_hours": 8000, "copilot_hours_type": 2500, "aircraft_hours": 21926, "circumstances": "American Airlines Flight 625 was a scheduled flight from Providence Airport (PVD) to St.Thomas (STT) on the U.S Virgin Islands with an intermediate stop in New York (JFK). The Boeing 727 departed New York at 12:00 AST. On approach to St. Thomas, at 15:04, the flight crew cancelled their IFR flight plan and proceeded VFR. The captain elected to use the runway 09 ILS for vertical guidance. The glide slope was intercepted at 1500 feet msl (flaps 15° and at a 160 KIAS airspeed). The flaps were lowered to 25 and later to 30 degrees. The company prescribed 40 degrees was never selected. The speed was still 10 KIAS above Vref when the aircraft passed the threshold at an estimated altitude of 30-40 feet. At 1000 feet down the runway, while initiating the flare, turbulence caused the right wing to drop. The wings were leveled and the aircraft floated a while until touchdown 2200-2300 feet down the runway. The captain decided that the aircraft couldn't be stopped on the remaining runway. He immediately initiated a go-around. Because of the absence of any sensation either of power being applied or of aircraft acceleration, the throttles were closed again. The aircraft, in a 11 degree nose up attitude, ran off the runway and struck a localizer antenna. The right wingtip clipped a hillside just south of the antenna and the aircraft continued, hit an embankment, became airborne and contacted the ground on the opposite side of the perimeter road. The aircraft continued and came to rest 83 feet past the perimeter road, bursting into flames.", "probable_cause": "The captain's actions and his judgment in initiating a go-around maneuver with insufficient runway remaining after a long touchdown. The long touchdown is attributed to a deviation from prescribed landing techniques and an encounter with an adverse wind condition, common at the airport. The non-availability of information about the aircraft's go-around performance capabilities may have been a factor in the captain's abortive attempt to go-around a long landing."}