{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-277a-memphis-24-killed", "date": "Feb 10, 1944 at 2336 LT", "type": "Douglas DC-3", "operator": "American-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Los Angeles – Dallas – Little Rock – Memphis – New York", "msn": "2166", "yom": 1939, "flight_number": "AA002", "city": "Memphis", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 21, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": 13050, "captain_hours_type": 7374, "copilot_hours": 1911, "copilot_hours_type": 812, "aircraft_hours": 12446, "circumstances": "American Airlines Trip 2, on a regular transcontinental schedule from Los Angeles to New York City, while en route from Little Rock to Memphis, crashed in the Mississippi River 18 miles southwest of Memphis Airport about 2336LT. The 21 passengers and three crew members were fatally injured and the airplane was totally destroyed. The flight was observed to be at a normal altitude approximately 30 miles west of the scene of the crash. At a point 2 1/2 miles west of the scene, the plane was observed flying very low. How long it had been flying low between these two points could not be ascertained as there were no known witnesses to this portion of the flight. It approached and struck the river in an angle of descent of about 20 degree with the right wing slightly low. Impact with the water, submersion and the extremely difficult salvage operation caused an unusual degree of damage to the plane. Only 75% of the wreckage is estimated to have been recovered. These conditions materially limited the efforts of the Boards investigators.", "probable_cause": "Although a considerable period of time was devoted to the investigation in order to gather all possible evidence, the Board is unable to determine the probable cause of this accident."}