{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-32-cincinnati-23-killed", "date": "Jun 2, 1983 at 1920 LT", "type": "Douglas DC-9", "operator": "Air%20Canada.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dallas – Toronto – Montreal", "msn": "47196", "yom": 1968, "flight_number": "AC797", "city": "Cincinnati-Northern Kentucky", "zone": "Kentucky", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 41, "pax_fatalities": 23, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": 13000, "captain_hours_type": 4939, "copilot_hours": 5650, "copilot_hours_type": 2499, "aircraft_hours": 36825, "circumstances": "The aircraft departed Dallas on a regularly scheduled international passenger flight to Montreal, Quebec, Canada, with an en route stop at Toronto, Ontario, Canada. The flight left Dallas with 5 crew members and 41 passengers on board. About 1903, eastern daylight time, while en route at flight level 330 (about 33,000 feet m.s.l.), the cabin crew discovered smoke in the left aft lavatory. After attempting to extinguish the hidden fire and then contacting air traffic control (ATC) and declaring an emergency, the crew made an emergency descent and ATC vectored Flight 797 to the Greater Cincinnati International Airport, Covington, Kentucky. At 1920:09, eastern daylight time, Flight 797 landed on runway 27L at the Greater Cincinnati International Airport. As the pilot stopped the airplane, the airport fire department, which had been alerted by the tower to the fire on board the incoming plane, was in place and began firefighting operations. Also, as soon as the airplane stopped, the flight attendants and passengers opened the left and right forward doors, the left forward overwing exit, and the right forward and aft overwing exits. About 60 to 90 seconds after the exits were opened, a flash fire engulfed the airplane interior. While 18 passengers and 3 flight attendants exited through the forward doors and slides and the three open overwing exits to evacuate the airplane, the captain and first officer exited through their respective cockpit sliding windows. However, 23 passengers were not able to get out of the plane and died in the fire. The airplane was destroyed.", "probable_cause": "The National Transportation Safety Board determines that the probable causes of the accident were a fire of undetermined origin, an underestimate of fire severity, and misleading fire progress information provided to the captain. The time taken to evaluate the nature of the fire and to decide to initiate an emergency descent contributed to the severity of the accident."}