{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-10-fort-lauderdale", "date": "Oct 28, 2016 at 1751 LT", "type": "Douglas DC-10", "operator": "FedEx", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Memphis - Fort Lauderdale", "msn": "46608", "yom": 1972, "flight_number": "FX910", "city": "Fort Lauderdale-Hollywood", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10000, "captain_hours_type": 1443, "copilot_hours": 6300, "copilot_hours_type": 1244, "aircraft_hours": 84589, "circumstances": "On October 28, 2016, about 1751 eastern daylight time, FedEx Express (FedEx) flight 910, a McDonnell Douglas MD-10-10F, N370FE, experienced a left main landing gear (MLG) collapse after landing on runway 10L at Fort Lauderdale–Hollywood International Airport (KFLL), Fort Lauderdale, Florida, and the left wing subsequently caught fire. The airplane came to rest off the left side of the runway. The two flight crew members evacuated the airplane. The captain reported a minor cut and abrasions from the evacuation, and the first officer was not injured. The airplane sustained substantial damage. The cargo flight was operating on an instrument flight plan under the provisions of Title 14 Code of Federal Regulation (CFR) Part 121 and originated at Memphis International Airport (KMEM), Memphis, Tennessee. The first officer was the pilot flying, and the captain was the pilot monitoring. Both flight crew members stated in post accident interviews that the departure from MEM and the en route portion of the flight were normal. About 1745, air traffic control (ATC) cleared the flight for final approach to the instrument landing system (ILS) approach to runway 10L at KFLL. Recorder data indicate that the first officer set the flaps at 35º about 1746 when the airplane was 3,000 ft above ground level (agl). The first officer disconnected the autopilot about 1749 when the airplane was 1,000 ft agl. Both flight crew members reported that the approach was stable at 500 ft agl. At 200 ft agl, the first officer began making airspeed corrections to compensate for the crosswind. About 1750, the first officer disconnected the autothrottles, as briefed, when the airplane was at 100 ft agl. At 50 ft agl, the first officer initiated the flare. The left MLG touched down about 1750:31 in the touchdown zone and left of the runway centerline. The first officer deployed the spoilers at 1750:34, and the nose gear touched down 3 seconds later. The thrust reversers were  deployed at 1750:40. According to cockpit voice recorder (CVR) data, the captain instructed the first officer to begin braking about 1750:39 (the airplane was not equipped with autobrakes). FDR data indicate an increase in brake pedal position angle and increase in longitudinal deceleration (indicating braking) about 1750:41. In post accident interviews, the flight crew members reported hearing a \"bang\" as the first officer applied the brakes, and the airplane yawed to the left. About this time, the CVR recorded the sound of multiple thuds, consistent with the sound of a gear collapse. About 1750:48, the captain stated, \"I have the airplane,\" and the first officer replied, \"you got the airplane.\" The captain applied full right rudder without effect while the first officer continued braking. About 1750:53, the captain instructed the first officer to call and inform the tower about the emergency. An airport video of the landing showed that the No. 1 engine was initially supporting the airplane after the left MLG collapse when a fire began near the left-wing tip. The airplane eventually stopped off the left side of runway 10L, about 30º to 40º off the runway heading. About 1751, the flight crew began executing the evacuation checklist. The pilots reported that, as they were about to evacuate, they heard an explosion. The airport video showed a fireball erupted at the No. 1 engine. The captain attempted to discharge a fire bottle in the No. 1 engine, but it didn't discharge. They evacuated the airplane through the right cockpit window.", "probable_cause": "The failure of the left main landing gear (MLG) due to fatigue cracking that initiated at a corrosion pit. The pit formed in the absence of a required protective cadmium coating the cause of which could not be determined from available evidence. Contributing to the failure of the left MLG was the operator's overhaul limit, which exceeded that recommended by the airplane manufacturer without sufficient data and analysis to ensure crack detection before it progressed to failure."}