{"url": "https://www.baaa-acro.com/crash/ground-collision-lockheed-c-141a-starlifter-da-nang-5-killed", "date": "Mar 23, 1967", "type": "Lockheed C-141 Starlifter", "operator": "United%20States%20Air%20Force", "flight_phase": "Taxiing", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "6144", "yom": 1965, "flight_number": null, "city": "Đà Nẵng", "zone": "Đà Nẵng City District", "country": "Vietnam", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1012, "circumstances": "Some of the bases in South Vietnam were among the world's busiest airfields during the height of the war in Southeast Asia. The number of aircraft movements at bases like Đà Nẵng and Saigon-Tan Son Nhat Airport equalled or exceeded those at major US and European airports. With the huge amount of activity involved it is inevitable that accidents should sometimes occur on the ground. The worst such accident happened in the early hours of 23 March and involved a Marine Corps A-6, which was taking off from Đà Nẵng on a strike mission, and a MAC C-141 Starlifter. The air traffic controller had cleared the Intruder to take off but also unwittingly cleared the C-141 to cross the runway. The Intruder pilot saw the Starlifter at the last moment and tried to veer off the runway to avoid it but the Intruder's port wing sliced through the Starlifter's nose. The Intruder sumersalted onto its back and continued down the runway. The pilot and navigator miraculously escaped death and crawled through their smashed canopy. The aircraft was carrying 16x500lbs bombs and six rocket packs, some of which later exploded in the fire. The C-141 immediately burst into flames igniting its cargo of 72 acetylene gas cylinders, which resulted in a tremendous explosion. All the Starlifter crew died except the loadmaster who managed to escape from one of the aft doors before the aircraft exploded. The identity of the crewmen who survived remains unknown. \r\nCrew:\r\nCpt Harold Leland Hale,\r\nCpt Leroy Edward Leonard,\r\nCpt Max Paul Starkel,\r\nS/Sgt Alanson Garland Bynum,\r\nS/Sgt Alfred Funck.\r\nSource: Chris Hobson", "probable_cause": "ATC error."}