{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-borodyanka-5-killed", "date": "Jun 10, 2012 at 1040 LT", "type": "Let L-410", "operator": "Ukrainska Shkola Pilotov", "flight_phase": "Landing (descent or approach)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Borodyanka - Borodyanka", "msn": "81 07 21", "yom": 1981, "flight_number": null, "city": "Borodyanka", "zone": "Kiev oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 20, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Owned by Skaidens (Skydance), the twin engine aircraft was engaged on local skydiving mission and operated on behalf of the Ukrainska Shkola Pilotov (Ukrainian Pilots' School). On board were 20 skydivers and two pilots. After take off from Borodyanka Aerodrome, the crew realized that weather conditions deteriorated and that a thunderstorm was approaching the airfield. The crew decided to cancel the mission and to return to the airport. On final approach, the aircraft encountered downdrafts and microburst. It lost height and crashed in a field some 900 meters short of runway threshold. Five skydivers were killed while 17 other occupants were injured, some seriously.", "probable_cause": "According to the findings of the commission of inquiry, the most likely cause of the crash was the impact of the aircraft in a low-altitude wind due to strong downward air flow (micro-burst) during the landing of the aircraft in thunderstorms due to coincidence of the following negative factors.\r\n- Failure of the crew to perform a go around or divert to the alternate aerodrome;\r\n- A rapid increase in the speed of movement of the thunderstorm in the direction of the Borodyanka airfield area;\r\n- Lack of training on the simulator in the conditions of wind shear, lack of experience in the crew on approach to landing in the conditions of wind shear, in particular micro-burst;\r\n- Insufficient aeronautical equipment (lack of meteorological radar on the plane and airfield);\r\n- Lack of information for the crew about the forecasted and actual meteorological conditions at the landing aerodrome, warnings about the forecasted / available wind shift at Borodyanka aerodrome;\r\n- The crew was not sufficiently informed about the flight conditions due to insufficient lighting of the cockpit and failure of the instrumentation of the aircraft due to a power failure during approach in thunderstorm conditions;\r\n- Lack of sufficient experience of the crew to perform activities and landings in conditions when the landing weight exceeded the maximum allowable, due to the presence of skydivers on board the aircraft;\r\n- Motivation of the crew to perform the landing approach on the first attempt, due to insufficient information about the storm at the aerodrome. The information on wind increase and its direction (provided to the pilot) was perceived by the crew as possible conditions for landing because their parameters did not exceed the limits allowed by the AOM of the aircraft;\r\n- Overloading of the aircraft, motivation of the decision of the captain to perform landing at the aerodrome of departure (Borodyanka) due to the presence of unregistered passengers on board, due to improper organization of boarding of skydivers at the aerodrome Borodyanka;\r\n- Insufficient organization of flights at Borodyanka airfield in terms of meteorological support;\r\n- Insufficient (weak) regulatory, regulatory, legislative framework for parachuting."}