{"url": "https://www.baaa-acro.com/crash/crash-partenavia-p68b-wagga-wagga-2-killed", "date": "Jul 20, 1998 at 1739 LT", "type": "Partenavia P.68", "operator": "Fitzroy Aviation Queensland", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Corowa – Albury – Wagga Wagga", "msn": "186", "yom": 1979, "flight_number": null, "city": "Wagga Wagga", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1014, "captain_hours_type": 217, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft operator had been contracted to provide a regular service transporting bank documents, medical pathology samples and items of general freight between Wagga Wagga, Albury and Corowa. On the day of the accident a passenger was accompanying the pilot for the day's flying. The pilot commenced the flight from Corowa to Albury under the Visual Flight Rules, flying approximately 500 ft above ground level. At Albury he obtained the latest aerodrome weather report for Wagga Wagga, which indicated that there was scattered cloud at 300 ft above ground level, broken cloud at 600 ft above ground level, visibility restricted to 2,000 m in light rain and a sea-level barometric pressure (QNH) of 1008 hPa. At 1715 Eastern Standard Time (EST) the aircraft departed Albury for Wagga Wagga under the Instrument Flight Rules. The pilot contacted the Melbourne en-route controller at 1728 and reported that he was maintaining 5,000 ft. Although the aircraft was operating outside controlled airspace, the en-route controller did have a radar surveillance capability and was providing the pilot with a flight information service. However, no return was recorded from the aircraft's transponder and at 1732 the pilot reported that he was transferring to the Wagga Wagga Mandatory Broadcast Zone frequency. This was the pilot's last contact with the controller. Although air traffic services do not monitor or record the Wagga Wagga Mandatory Broadcast Zone frequency, transmissions made on this frequency are recorded by AVDATA for the purpose of calculating aircraft landing charges. This information was reviewed following the accident. The pilot broadcast his position inbound to the aerodrome on the mandatory broadcast zone frequency and indicated that he was conducting a Global Positioning System (GPS) arrival. He established communication with the pilot of another inbound aircraft and at 9 NM from the aerodrome, broadcast his position as he descended through 2,900 ft. Approximately 1 minute and 20 seconds later, the pilot advised that he was passing 2,000 ft but immediately corrected this to state that he was maintaining 2,000 ft. He also stated that it was \"getting pretty gloomy\" and that according to the latest weather report he should be visual at the procedure's minimum descent altitude. The aircraft would have been approximately 6 NM from the aerodrome at this time. This was the last transmission heard from the pilot. The resident of a house to the south of Gregadoo Hill sighted the aircraft a short time before the accident. He was standing outside his house and stated that the aircraft was visible as it passed directly overhead at what appeared to be an unusually low height. The aircraft then disappeared into cloud that was obscuring Gregadoo Hill, approximately 350 m from where he was standing. Moments later he heard the sound of an impact followed almost immediately by a red flash of light. The noise from the engines appeared to be normal up until the sound of the impact. The aircraft had collided with steeply rising terrain on the southern face of Gregadoo Hill, approximately 40 ft below the crest. The hill is 4 NM from the aerodrome and is marked on instrument approach charts as a spot height elevation of 1,281 ft. The estimated time of the accident was 1739. The pilot and passenger sustained fatal injuries.", "probable_cause": "The pilot had received an accurate appreciation of the weather conditions in the vicinity of Wagga Wagga prior to departing Albury. At that stage it would have been apparent that low cloud and poor visibility were likely to affect the aircraft's arrival. Under such conditions it would not have been possible to land from the GPS arrival procedure. As the reported cloud base and visibility were both below the minimum criteria, it is difficult to rationalise the pilot's transmission that, according to the latest weather report, he would be visual at the minimum descent altitude. This statement suggests that the pilot had already made the decision to continue his descent below the minimum altitude for the procedure and to attempt to establish visual reference for landing. Based on the report of broken low cloud in the vicinity of the aerodrome, the pilot would have needed to descend to 1,324 ft above mean sea level to establish the aircraft clear of cloud. This is within 50 ft of the last altitude recorded on the GPS receiver. Due to the difference between the actual and forecast QNH, the left altimeter would over-read by approximately 150 ft. At the time of the occurrence an otherwise correctly functioning instrument would have indicated an altitude of approximately 1,400 ft. The pilot had probably set the right altimeter to the local QNH prior to departing Albury. As this setting also corresponded to the actual QNH at Wagga Wagga, that instrument would have provided the more accurate indication of the aircraft's operating altitude. However, because of its location on the co-pilot's instrument panel, it is unlikely that the pilot would have included that altimeter in his basic instrument scan. It was not possible to assess the extent to which illicit drugs may have influenced the pilot's performance during the flight and affected his ability to safely operate the aircraft.\r\nThe following factors were identified:\r\n- The pilot was operating the aircraft in instrument meteorological conditions below the approved minimum descent altitude.\r\n- Low cloud was covering Gregadoo Hill at the time of the accident."}