{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-28-sarif-umra", "date": "Jul 6, 2009 at 0950 LT", "type": "PZL-Mielec AN-28", "operator": "Eldinder-Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Al Fashir - Sarif-Umra", "msn": "1AJ006-02", "yom": 1988, "flight_number": null, "city": "Sarif-Umra", "zone": "North Darfur (شمال دارفور)", "country": "Sudan", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10144, "captain_hours_type": 1269, "copilot_hours": 5500, "copilot_hours_type": 950, "aircraft_hours": 2180, "circumstances": "The flight progress strip at Al Fashir aerodrome control tower illustrate that on the 6th of July 2009 – ST-TYB, AN-28 departed Al Fashir at time 0601 UTC, estimated time to arrive destination Sarif-Umra was 0650 UTC, persons on board were two (crew only), intended flight level was 085 (VFR) re-cleared later FL105, fuel endurance was 3,5 hours, load on board as indicated on the cargo manifest was 1511 k.gm (food stuff) destined for the UNAMID forces. Aircraft center of gravity was organized. Calculated actual take off weight was 6335 k.gm and the actual landing weight was 6035 k.gm as reported by the pilot. The aircraft proceeded normally to destination at FL 105, when it reached  the airfield, the pilot stated that, they started descend gradually at a speed  of 250 km/h willing to check the strip serviceability and to specify the  direction of landing from the located wind sock.  They detected that, the strip was clear, dry and the wind was favorable to the direction of 23 (strip 23/05). As the crew established a speed of 210 km/h at an altitude of 60 meters on final approach, they saw a dust devil storm on their right crossing the air strip, to avoid this phenomena, they decided to go around for another approach. Eye witnesses confirmed the occurrence of the storm at the time the aircraft commenced the final approach. The crew reported that, they started a right turn and applied full power to gain height, but they felt that there was no response from the engines and the aircraft was influenced by a wind shear and began to sink. The crew managed to control the aircraft, but in few minutes its altitude decreased rapidly. At time 0650 UTC the aircraft impacted with the ground and rolled, there after struck a small rock and bounced, finally the aircraft impacted the ground by the left main gear and nose, and stopped at a distance of 1,850 meters from the beginning of strip 05 coordinates N 13 29.527 ـــــــ E 023 16.794. Crews (2) were safe and the aircraft sustained substantial damage. ", "probable_cause": "The unexpected weather phenomena at destination, and environmental conditions, wind shear and CB down drafts caused the accident."}