{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-454-meridian", "date": "Nov 10, 1946 at 1717 LT", "type": "Douglas DC-3", "operator": "Delta-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Worth – Dallas – Shreveport – Monroe – Jackson – Meridian – Birmingham – Atlanta", "msn": "4993", "yom": 1942, "flight_number": "DL010", "city": "Meridian", "zone": "Mississippi", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 19, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3725, "captain_hours_type": 3100, "copilot_hours": 3207, "copilot_hours_type": 301, "aircraft_hours": 8819, "circumstances": "The aircraft left Jackson at 1630LT bound for Meridian and the crew obtained the permission to continue at an altitude of 3,000 feet in IFR mode. The approach to Meridian was started in the following weather conditions: ceiling 800 feet, overcast, visibility 3 miles, thunder storm, light rain showers, surface wind northeast 10, thunder storms overhead moving east-northeast, frequent vivid lightning all quadrants. The aircraft was seen to make contact with the runway within the first 1,000 feet, however. it continued rolling down the entire length of the runway with little apparent deceleration. Its forward motion continued beyond the end of the runway and up the western slope of a ditch adjoining the highway adjacent to the airport. on striking this ditch, the aircraft left the ground and bounced over the highway, coming to rest with its nose extended partially over a railroad right-of-way. All 22 occupants escaped unhurt while the aircraft was damaged beyond repair. ", "probable_cause": "The Board determines that the probable cause of this accident was the poor judgement of the pilot in landing on a wet runway under conditions of varying winds without ascertaining visually the direction of the wind. A contributory factor was the error of the company radio communicator in transmitting the wind direction."}