{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-hilton-head-6-killed", "date": "Apr 26, 1975 at 2055 LT", "type": "Beechcraft 100 King Air", "operator": "Stribling-Puckett", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Savannah - Hilton Head - Jackson", "msn": "B-92", "yom": 1972, "flight_number": null, "city": "Hilton Head", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 15657, "captain_hours_type": 549, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was ferried from Savannah, Georgia, to Hilton Head Island, South Carolina, for a corporate flight to Jackson, Mississippi. The aircraft was owned and operated by Stribling-Puckett, Inc. The flight to Hilton Head Island was completed without incident. The pilot of N700SP loaded the passenger baggage; a witness to the loading indicated that the pilot loaded the baggage carefully in the baggage compartment in the aft end of the cabin. At 21:45, the eight passengers boarded the aircraft with one passenger seated in the copilot's seat. The engines were started and the aircraft was taxied to runway 3 for takeoff. The aircraft was taxied onto the 300-foot overrun on the south end of the runway, turned 180° on the runway, and made a \"running\" takeoff. Two pilots, one inside the terminal and another outside, stated that they did not believe the engines were developing full power during the takeoff. However, there were no unusual sounds, and the engines were operating \"smoothly.\" Both of these pilots believed that the takeoff run was excessively long. The aircraft used about 3,900 feet of pavement to takeoff including most of the 300-foot overrun where the takeoff began. After takeoff, the aircraft was leveled off and was flown straight and level for about 1,200 feet. There it struck the top of a tree which was 40 to 50 feet above the ground. After impact with the trees, the aircraft continued 1,200 to 1,300 feet and struck several other trees before it came to rest right side up. Fire erupted some distance behind the aircraft, but progressed toward the aircraft slowly. The slow progression of the fire allowed the three survivors time to escape through a hole in the left front side of the fuselage. Roger W. Stribling, Jr., Vice President of the Stribling-Puckett, Inc, was killed in the crash. Company President Ben Puckett suffered a broken back in the accident.\r\nThose killed were:\r\nRoger Stribling Jr.,\r\nMax Williams, \r\nHenry Clements, \r\nClark Boyce Sr.,\r\nEddie Stanton,\r\nGordon Ellison. ", "probable_cause": "The failure of the pilot to maintain a positive rate of climb after a takeoff toward an unlighted area in night, visual meteorological conditions. The failure to maintain a positive rate of climb resulted in a collision with trees in the departure path. An overweight condition of the aircraft may have contributed to the pilot's actions. Investigation showed that the aircraft would have been 436 lbs over the maximum gross takeoff weight, with the center of gravity near the aft limit."}