{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-charlo-8-killed", "date": "Oct 20, 1996 at 1213 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Telford%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Port-Menier - Gaspé - Bangor", "msn": "31-7952246", "yom": 1979, "flight_number": null, "city": "Charlo", "zone": "New Brunswick", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 3600, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6041, "circumstances": "The aircraft, a Piper PA-31-350 Navajo Chieftain (hereafter referred to as a Chieftain), took off at 1113 Atlantic daylight saving time on a charter flight from Port-Menier, Quebec, to Bangor, Maine, with one pilot and seven passengers on board. As the aircraft was approaching Charlo, New Brunswick, the pilot reported to Moncton Air Traffic Control Centre that his aircraft had a rough-running engine, and that he would be making an emergency landing at Charlo airport. While the pilot was apparently manoeuvring to land the aircraft, it crashed three miles west of the runway, in the community of Eel River Crossing. All eight occupants of the aircraft received fatal injuries.", "probable_cause": "There was a loss of power from the right engine, and the pilot did not conserve altitude or configure the aircraft for maximum performance following the loss of power. Control of the aircraft was lost, probably as the pilot was attempting to intercept the ILS for runway 13 during a low-level turn. Contributing factors were the overweight condition of the aircraft and the lack of in-flight emergency procedures training received by the pilot."}