{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-21-islander-coolangatta", "date": "Apr 7, 1996 at 2138 LT", "type": "Britten-Norman Islander", "operator": "Island Air Gold Coast", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tangalooma – Coolangatta", "msn": "415", "yom": 1974, "flight_number": null, "city": "Coolangatta", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 881, "captain_hours_type": 177, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was the third in a stream of five company aircraft departing the Tangalooma Resort airstrip at two-minute intervals on a clear moonlit evening. Following a routine departure at 2105 EST, the aircraft was climbed to 3,000 ft for the flight back to Coolangatta. Early in the cruise phase of the flight, the pilot found that the fourth aircraft was catching up to his and he elected to descend to 2,000 ft to ensure continued separation. At 2127 EST, the pilot reported to Coolangatta Approach Control that the aircraft had severe problems, but did not inform the controller of the nature of his emergency. However, the controller activated the airport emergency procedures when he observed on his radar display that the aircraft was losing altitude. The pilot had his second VHF radio transceiver tuned to his company frequency, and was answering transmissions received from other company pilots on this frequency while transmitting on the Coolangatta Approach frequency. The pilot later said that after the aircraft passed the seaway at Southport, the right engine surged, which resulted in the aircraft yawing. After he switch the electric fuel pump to \"on\", the symptoms disappeared. About a minute later he switched the pump off, then on again. He said that when the engine began surging again, he shut the engine down, feathering the propeller. Left engine power was increased and the aircraft maintained 1,500 ft in level flight. He switched the left engine's fuel supply to the right main tank, believing that this action would ensure supply from both main fuel tanks. The pilot said that after the aircraft passed Burleigh Heads, many things appeared to go wrong at once. The left engine began to splutter and did not respond to the throttle. He recalled attempting to restart the right engine. This proved to be unsuccessful. As the descent continued he planned to land on a beach. The pilot selected a stretch of beach for a forced landing. During late final approach, aided by bright moonlight, he noticed that any overrun would take the aircraft into a crowded car park. He changed his aim point to the stretch of beach south of the Currumbin Lifesavers Clubhouse. Following the flare for landing, the right wing struck a low rocky outcrop and the aircraft crashed into the surf. The entire wing assembly separated from the fuselage, which came to rest on its left side. Some of the nine passengers, and the pilot, escaped from the semi-submerged fuselage while bystanders rescued others.", "probable_cause": "The following findings were reported:\r\n1. The pilot shut down an engine following surging but did not feather the propeller.\r\n2. The aircraft was not flown at (or near) its best single-engine performance speed after the right engine was shut down."}