{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-near-narrabri", "date": "Jun 12, 2014 at 1630 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Jardine%20LLoyd%20Thompson", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Dubbo – Sunshine Coast", "msn": "46-8408022", "yom": 1984, "flight_number": null, "city": "Narrabri", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 12 June 2014, at about 1530 Eastern Standard Time (EST), a Piper PA-46 aircraft, registered VH-TSV, departed Dubbo, New South Wales for a private flight to the Sunshine Coast, Queensland with a pilot and one passenger on board. The planned route was to track via Moree and Toowoomba at 13,500 ft above mean sea level (AMSL). The pilot had operated the aircraft from Sunshine Coast to Lightning Ridge, Brewarrina and Dubbo earlier that day and reported that all engine indications were normal on those flights. About 1 hour after departing Dubbo, when about 26 NM south of Narrabri, at about 13,500 ft AMSL, the pilot observed the engine manifold pressure gauge indicating 25 inches Hg, when the throttle position selected would normally have produced about 28 inches Hg. The pilot selected the alternate air1 which did not result in any increase in power. He then elected to descend to 10,000 ft, and at that power setting when normally the engine would have produced about 29 inches Hg, the gauge still indicated only about 25 inches Hg. He turned the aircraft towards Narrabri in an attempt to fly clear of the Pilliga State Forest. The pilot assessed that the aircraft had a partial engine failure and performed troubleshooting checks. As the aircraft descended through about 8,000 ft, he observed the oil pressure gauge indicating decreasing pressure. When passing about 6,500 ft, the oil pressure gauge indicated zero and the pilot heard two loud bangs and observed the cowling lift momentarily from above the engine. The passenger observed a puff of smoke emanating from the engine and momentarily a small amount of smoke in the cockpit. The pilot established the aircraft in a glide at about 90 kt, secured the engine and completed the emergency checklist. He broadcast a ‘Mayday’ 2 call on Brisbane Centre radio frequency advising of an engine failure and forced landing. The pilot looked for a clear area below in which to conduct a forced landing and also requested the passenger to assist in identifying any cleared areas suitable to land. Both only identified heavily treed areas. The pilot extended the landing gear and selected 10º of flap and, when at about 1,000 ft, the pilot shut the fuel off, deployed the emergency beacon then switched off the electrical system. As the aircraft entered the tree tops, he flared to stall3 the aircraft. On impact, the pilot was seriously injured and lost consciousness. The passenger reported the wings impacted with trees and the aircraft slid about 10 m before coming to rest. The passenger checked for any evidence of fuel leak or fire and administered basic first aid to the pilot. The aircraft sustained substantial damage.", "probable_cause": null}