{"url": "https://www.baaa-acro.com/crash/ground-accident-beechcraft-99a-airliner-milwaukee", "date": "Jan 24, 2007 at 2000 LT", "type": "Beechcraft 99 Airliner", "operator": "Freight%20Runners%20Express", "flight_phase": "Taxiing", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stevens Point – Milwaukee", "msn": "U-133", "yom": 1969, "flight_number": "FRG1509", "city": "Milwaukee-General Billy Mitchell", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13400, "captain_hours_type": 2400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 35447, "circumstances": "A Beech 99 and a Cessna 402 were substantially damaged in a ground collision that occurred during night taxi operations at General Mitchell International Airport (MKE), Milwaukee, Wisconsin. Both pilots followed each of the controller's instructions to proceed to the same cargo ramp using intersecting taxiways after having landed. Neither controller had advised either pilot that other aircraft would be approaching the same taxiway intersection. Neither pilot reported seeing the other airplane approaching the taxiway intersection. The Cessna 402 landed on runway 25R and was instructed to taxi to the cargo ramp via Golf, Bravo, and Alpha taxiways. The Beech 99 landed on runway 25L. The taxi instructions given to the Beech 99 pilot were to turn right at taxiway A2 (high-speed taxiway), monitor ground on frequency 121.8, and taxi to the cargo ramp. The local controller reported he scanned taxiway A, the runway, and saw the Beech 99 clear of the runway. As the Beech 99 prepared to turn off taxiway A2 onto taxiway A, the Cessna 402 approached the taxiway A and taxiway A2 intersection. The Beech 99's right propeller impacted the Cessna 402's left wing tip fuel tank. The impact of the two airplanes resulted in a fire. Both of the pilots involved in the ground collision evacuated their respective airplanes. The FAA Order 7110.65, \"Air Traffic Control,\" states that the absence of holding instructions authorizes an aircraft to cross all taxiways and runways that intersect the taxi route. FAA Order 7110.65, \"Air Traffic Control,\" states that it is the procedure for controllers to instruct aircraft where to turn off the runway after landing and advise the aircraft to hold short of a runway or taxiway if required for traffic. Neither aircraft was issued hold short instructions. The Airport Surface Detection Equipment Model X (ASDEX), provided images of each airplane's movement leading up to the time of the ground collision. The ASDE-X replay showed the Beech 99 taxiing at 20 knots on taxiway A2 approaching the taxiway A intersection. The Cessna 402 was shown taxiing at 20 knots just short of the taxiway A and taxiway A2 intersection. Both pilots reported that they did not see the other airplane approaching the same intersection while taxiing. Title 14 Code of Federal Regulations Part 91 states that vigilance shall be maintained by each person operating an aircraft so as to \"see and avoid\" other aircraft.", "probable_cause": "The failure of both pilots to adequately scan for and avoid other aircraft traffic during taxi operations, and the failure of Air Traffic Control to issue a traffic advisory to both of the pilots. A contributing factor to the accident was the night time light conditions.\n"}