{"url": "https://www.baaa-acro.com/crash/crash-fokker-50-tawau-34-killed", "date": "Sep 15, 1995 at 1222 LT", "type": "Fokker 50", "operator": "Malaysia%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kota Kinabalu - Tawau", "msn": "20174", "yom": 1990, "flight_number": "MH2133", "city": "Tawau", "zone": "Sabah", "country": "Malaysia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 49, "pax_fatalities": 32, "other_fatalities": 0, "total_fatalities": 34, "captain_hours": 4892, "captain_hours_type": 427, "copilot_hours": 1162, "copilot_hours_type": 962, "aircraft_hours": 10848, "circumstances": "Flight MH2133 A Fokker 27 mark 050 bearing registration 9M-MGH was a scheduled domestic flight from Kota Kinabalu to Tawau, Sabah. The departure from Kota Kinabalu was delayed by approximately 30 minutes due to late arrival of the aircraft operated by a different set of flight crew from Labuan. The flight took off from Kota Kinabalu at 0419 hrs on an Instrument Flight Rules (IFR) flight plan via Airway W 423 direct to Tawau Very Omni Range (VOR) at flight level (FL) 170 with 53 persons on board. The departure out of Kota Kinabalu was uneventful and the weather en-route was insignificant. At 0442 hrs the flight established radio contact with Tawau Tower “MH 2133 we are maintaining FL 170, TMA 40, VTW 0505, presently at 94 DME VTW”. The controller then passed the weather for Tawau which was, “surface wind calm, visibility more than 10 km, rain north to north east, scattered 1600 feet and scattered 2700 feet, broken at 14000 feet, Temperature 30 degree C and QNH 1009 mb, Runway 17”. At 0443 hrs another aircraft call sign TSE 809 (a Cessna 206) flying along the same route as MH2133 but at 9500ft established radio contact with Tawau Tower, TSE 809 then reported that the flight was 65 DME from Tawau VOR. This was immediately followed by Tawau Tower asking MH2133 to report position from Tawau VOR which MH 2133 replied “57 DME and requested descent”. The controller then cleared MH 2133 to descend to 10500 feet. At this point in time there was also another aircraft MH2135 (a Boeing 737) heading towards Tawau cruising at FL 230 and cleared by the TOWER to descent to FL 180. MH 2135 was also notified by the TOWER of the Expected Approach Time (EAT) of 0530 hrs. At 0457 hrs TSE 809 reported that the flight was 44 DME from Tawau VOR. On hearing this transmission, MH 2133 requested a lower descend clearance, as it was 30 DME from Tawau VOR. It must be noted that at this juncture, MH 2133 was ahead of TSE 809 but at a higher altitude. The controller then asked TSE 809 whether there was any objection for MH2133 to descent through its level and become number One (1). Despite the fact that TSE 809 had no objection for MH 2133 to become number One (1), MH 2133 was asked by the controller to still maintain 10500 feet. At 0458:23 hrs, MH 2133 asked “MH 2133 confirm maintain 10500 feet?”. TOWER then replied “Affirm maintain 10500 number 2 in traffic”. At 0458:36 hrs MH 2133 again asked “MH 2133, 26 DME confirm we are still number 2?” TOWER then replied- “Station calling…. say again - MH 2133 then repeated “2133 Maam, and are 25 DME maintain 10500, confirm we are number 2?”. TOWER – responded “That’s affirm 2133, Expected Approach Time 0520 hrs”. At 0459:05 hrs MH2133 asked TSE 809 to check position and whether there would be any objection for the aircraft to descend through its level. TSE 809 replied that they had no objection and MH 2133 was subsequently cleared to descend to 7000 feet. The descent into Tawau by MH 2133 from the cruising altitude of 10500 feet was initiated at about 21 DME. The flight crew discussed the descent technique they were going to use and were aware of all their action. At 0501:15 hrs, as the flight reported leaving 9000 feet and passing 16 DME, the flight crew advised the controller that they had the airfield visual. MH2133 was then cleared for visual approach runway 17. At 0502:48 hrs, MH 2133 reported passing 3500 feet. The aircraft was then configured for landing where landing gears were selected down and flaps set at 25 degrees. The aircraft speed was still fast and since it was also high on the approach, the commander assured the co-pilot “Runway is long so no problem Eh”. On passing 2000 feet and on short final, the co\u0002pilot reminded the commander “speed, speed check, speed check Ah”. The rate of descent was in excess of 3000 feet per minute and its pitch angle was around minus 13 degrees. The excessive rate of descent triggered the aircraft Ground Proximity Warning System (GPWS) sink rate and pull up warnings. The commander ignored these warnings and insisted that he should continue with approach for a landing. The aircraft first touched down on the runway at 0505 hrs. Its first tyre marks (nose wheel) on the runway was at approximately 3400 ft from the threshold. It then bounced and at 4500 ft point, its left main wheel made a light contact with the runway surface. It subsequently bounced up again and its main wheels made a firm contact at 4800 ft point, thus leaving only 800 ft of runway remaining. The aircraft continued onto the grass verge, momentarily left the ground and hopped over the runway perimeter fence. It subsequently crashed at 571 feet from the end of the runway at almost right angle to the runway. There were a number of explosions followed by a fire. The aircraft was totally destroyed.", "probable_cause": "The most probable cause of the accident was due to the commander’s insistence to continue with an approach despite the fact that the runway available after touchdown was not sufficient enough for the aircraft to stop. The perception regarding economic consideration which put pressure on him to save fuel and adhere to schedules was a contributing factor."}