{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-141a-lm-starlifter-sondrestromfjord-23-killed", "date": "Aug 28, 1976 at 1145 LT", "type": "Lockheed C-141 Starlifter", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Thule - Söndreströmfjord", "msn": "300-6257", "yom": 1967, "flight_number": null, "city": "Sondreströmfjord (Kangerlussuaq)", "zone": "Qeqqata Kommunia", "country": "Greenland", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 7, "pax_on_board": 19, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15228, "circumstances": "The aircraft departed Thule Air Base on Greenland for a two-hour flight to Sonderstromfjord Air Base. From Sonderstromfjord it was to return to Thule and continue back home to McGuire AFB. The flight carried enough fuel for the flight to McGuire. Following a PAR approach the airplane landed slightly long on the 9235 feet long runway 11. The aircraft rolled for 1,500 to 2,000 feet with no thrust reverse or spoiler deployment. A go around was commenced. The plane then rotated abruptly and lifted off the runway with a pitch attitude as high as 45°. The aircraft stalled. The left wing struck the ground and burst into flames. The aircraft became airborne again with portions of the left wing missing. It flew for 650 feet before striking the ground with the right wing, causing it to catch fire. It then bounced once more and disintegrated 500 feet from runway centerline.\r\nSource: C-141 Lifetime Mishap Summary / Lt. Col. Paul M. Hansen", "probable_cause": "Investigation revealed that the crew were very inexperienced (a captain with less than 100 hours in command). The were probably affected by an optical illusion. The first 3,000 feet of runway 11 has an upslope of 1.51%; it rises 59 feet from the threshold. At touchdown, the last two-thirds of the runway disappears, giving the impression of a very short runway."}