{"url": "https://www.baaa-acro.com/crash/crash-vickers-748d-viscount-benghazi-36-killed", "date": "Aug 9, 1958 at 0115 LT", "type": "Vickers Viscount", "operator": "Central%20African%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Salisbury – Léopoldville – Entebbe – Khartoum – Wadi Halfa – Benghazi – Rome – London", "msn": "102", "yom": 1956, "flight_number": null, "city": "Benghazi-Benina", "zone": "Benghazi (بنغازي)", "country": "Libya", "region": "Africa", "crew_on_board": 7, "crew_fatalities": 4, "pax_on_board": 47, "pax_fatalities": 32, "other_fatalities": 0, "total_fatalities": 36, "captain_hours": 9158, "captain_hours_type": 920, "copilot_hours": 3204, "copilot_hours_type": 961, "aircraft_hours": null, "circumstances": "The flight is a scheduled service from Salisbury, Rhodesia, to London and is known as the Zambezi service. This service is operated by three crews, one crew operating from Salisbury to Entebbe, the second from Entebbe to Benina and the third from Benina to London. On 8 August this service departed from Salisbury at 0713LT and a stop was made at Ndola for traffic purposes. At Entebbe, a relief crew took over the aircraft for the sector to Benina. Stops were made at Khartoum and Wadi Halfa for refuelling and the aircraft left Wadi Halfa at 2120LT for Benina. The flight was completely uneventful and slightly ahead of schedule up to the time of the accident. At 0112 hours the aircraft was cleared into Benina control zone. At the request of the pilot, at 0114 hours, permission was given by Benina Approach Control to make a direct approach on to runway 330° Right, using the locator and the responder beacons. Between 20 and 30 seconds after this clearance had been acknowledged by the pilot the aircraft struck high ground 5,5 miles to the southeast of the aerodrome. Fire broke out on impact. Of the 7 crew and 47 passengers aboard the aircraft, 4 crew and 32 passengers were killed.", "probable_cause": "The cause of the accident was that when making an approach to runway 330° Right and whilst flying in cloud, the pilot descended below the correct height thus permitting the aircraft to strike high ground. The reason why the pilot descended so low, 5,5 miles from the aerodrome, cannot be established, but the most probable cause is that he misinterpreted the reading of his altimeter. The possibility that his efficiency had been reduced by fatigue and a slight indisposition cannot be excluded."}