{"url": "https://www.baaa-acro.com/crash/crash-cessna-414a-chancellor-laupahoehoe-3-killed", "date": "Jan 31, 2004 at 0140 LT", "type": "Cessna 414 Chancellor", "operator": "Hawaii%20Air%20Ambulance", "flight_phase": "Flight", "flight_type": "Ambulance", "survivors": "No", "site": "Mountains", "schedule": "Honolulu – Hilo", "msn": "414A-0118", "yom": 1978, "flight_number": null, "city": "Laupahoehoe", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 8230, "captain_hours_type": 1037, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11899, "circumstances": "The airplane collided with trees and mountainous terrain at the 3,600-foot-level of Mauna Kea Volcano during an en route cruise descent toward the destination airport that was 21 miles east of the accident site. The flight departed Honolulu VFR at 0032 to pickup a patient in Hilo, on the Island of Hawaii. The inter island cruising altitude was 9,500 feet and the flight was obtaining VFR flight advisories. At 0113, just before the flight crossed the northwestern coast of Hawaii, the controller provided the pilot with the current Hilo weather, which was reporting a visibility of 1 3/4 miles in heavy rain and mist with ceiling 1,700 feet broken, 2,300 overcast. Recorded radar data showed that the flight crossed the coast of Hawaii at 0122, descending through 7,400 feet tracking southeast bound toward the northern slopes of Mauna Kea and Hilo beyond. The last recorded position of the aircraft was about 26 miles northwest of the accident site at a mode C reported altitude of 6,400 feet. At 0130, the controller informed the pilot that radar contact was lost and also said that at the airplane's altitude, radar coverage would not be available inbound to Hilo. The controller terminated radar services. A witness who lived in the immediate area of the accident site reported that around 0130 he heard a low flying airplane coming from the north. He  alked outside his residence and observed an airplane fly over about 500 feet above ground level (agl) traveling in the direction of the accident site about 3 miles east. The witness said that light rain was falling and he could see a half moon, which he thought provided fair illumination. The area forecast in effect at the time of the flight's departure called for broken to overcast layers from 1,000 to 2,000 feet, with merging layers to 30,000 feet and isolated cumulonimbus clouds with tops to 40,000 feet. It also indicated that the visibility could temporarily go below 3 statute miles. The debris path extended about 500 feet along a magnetic bearing of 100 degrees with debris scattered both on the ground and in tree branches. Investigators found no anomalies with the airplane or engines that would have precluded normal operation. Pilots for the operator typically departed under VFR, even in night conditions or with expectations of encountering adverse weather, to preclude ground holding delays. The pilots would then pick up their instrument flight rules (IFR) clearance en route. The forecast and actual weather conditions at Hilo were below the minimums specified in the company Operations Manual for VFR operations.", "probable_cause": "The pilot's disregard for an in-flight weather advisory, his likely encounter with marginal VFR or IMC weather conditions, his decision to continue flight into those conditions, and failure to maintain an adequate terrain clearance altitude resulting in an in-flight collision with trees and mountainous terrain. A contributing factor was the pilot's failure to adhere to the VFR weather minimum procedures in the company's Operations Manual."}