{"url": "https://www.baaa-acro.com/crash/crash-sikorsky-s-43-fort-de-france-4-killed", "date": "Aug 3, 1945 at 1011 LT", "type": "Sikorsky S-43", "operator": "Pan%20Am.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Port of Spain – Fort-de-France", "msn": "4306", "yom": 1936, "flight_number": "PA216", "city": "Fort-de-France", "zone": "Martinique", "country": "Martinique", "region": "Central America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 4298, "captain_hours_type": 698, "copilot_hours": 1670, "copilot_hours_type": 90, "aircraft_hours": 12955, "circumstances": "Flight 216 continued at 6,000 feet until radio bearings indicated its position to be opposite the Fort de France radio beacon at which point it turned to the west, away from the island, preparatory to making a let-down. About 10 miles west of Martinique the plane entered an area clear of clouds and descent was started in wide spiral over the open sea. The co-pilot then established radio communications with the company's base station and at 0955 was advised that landing conditions at Fort do France were: wind ESE 20 knots, visibility 2 miles, ceiling 2,000 feet, barometer 1012.2, sea moderate with ground swells. Landing minimums for Pan American at Fort-de-France, approved by the Civil Aeronautics Administration, are: ceiling 1,000 feet, visibility 2 miles. During the let-down to Fort do France the pilot observed that the clouds extended upwards from 800 feet and that very heavy rain underneath the overcast made it impossible to determine accurately the condition of the water surface. Captain Shaw stated that during the let-down the left engine cut out momentarily and then resumed normal operation with indication of the proper manifold pressure. Instead of encountering the weather conditions reported at 0955, the pilot found that low ceiling and heavy rain squalls prevailed with visibility reduced to about 1/2 mile. Proceeding to Fort-de-France under the overcast, Captain Shaw circled the company station at an altitude of 500 feet and rioted that the wind-sock indicated a southwest surface wind instead of the previously reported east-southeast wind. Remarking to the co-pilot that he was afraid they would \"lose\" the left engine and, being apprehensive of single-engine performance of the Sikorsky S-43, the pilot elected to risk a landing under his emergency authority. At this moment the company radio advised that the weather was closing in rapidly and a landing should be made as soon as possible. Heading into the southwest wind an approach with full flaps was made toward a portion of Fort-de-France harbor seldom used for landing. Captain Shaw stated that during the latter part of his approach intense rain precluded forward vision through the windshield and only by opening a side window in the cockpit was he able to see the surface of the water just before the plane landed on the crest of a 4 to 6-foot swell. On contact with the water and alarmed by the size of the surface swells, the pilot attempted to take off, using full throttles, but he stated that the left engine failed to respond. The bow submerged and the plane yawed to the right, shearing off the left wing float and permitting that wing to submerge. As the left wing went down the aircraft rolled over on its back, rapidly filling with water. Quick action on the part of the crew resulted in the saving of all but four of the ten passengers, several of whom had to be taken from the plane through the submerged hatch. Survivors were picked up by the company service launch and a private fishing boat. The crash occurred at about 1011 and the plane sank within 10 minutes.", "probable_cause": "On the basis of the foregoing the Board determines that the probable cause of this accident was the attempt by the pilot to land the aircraft in conditions of water surface not suitable for landing of a flying boat."}