{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-31-pensacola", "date": "Dec 28, 1987 at 2339 LT", "type": "Douglas DC-9", "operator": "Eastern-Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Richmond – Atlanta – Pensacola", "msn": "47184/274", "yom": 1968, "flight_number": "EA573", "city": "Pensacola", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 103, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13246, "captain_hours_type": 4397, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 55645, "circumstances": "Eastern flight 573 contacted approach control at 2323 cst, was advised to expect an ILS runway 16 approach and was vectored around weather. At 2330, the controller advised the ILS glide slope (g/s) had gone into 'alarm' but the loc appeared normal. At 2333, the wind shifted to 310° at 7 knots. Since the bc approach to runway 34 was notamed as inop, the crew continued to runway 16, using 50° of flaps. At 2334, they told the controller, 'if you don't get the g/s up, we'll do a... loc approach.' They reported receiving the g/s, but were advised the g/s was still in alarm. The aircraft broke out of clouds in rain at 900 feet; light turbulence was encountered on final approach. At about 1 mile out, the f/o noted the aircraft was high and advised the captain. The captain pushed the nose over and reduced power, increasing speed and rate of descent. Requested altitude callouts were not made. F/O advised captain to flare, but flare was inadequate. The aircraft touched down hard and the fuselage failed between stations 813 and 756. Aircraft was stopped with the tail resting on the runway. Four passengers received minor injuries during evacuation. Weather study showed a moderate to strong (vip level 2 to 3) weather echo over the approach end of runway 16.", "probable_cause": "The captain's failure to maintain a proper descent rate on final approach or to execute a missed approach, which caused the airplane to contact the runway with a sink rate exceeding the airplane's design limitations. Contributing to the cause of the accident was the failure of the captain and first officer to make required altitude callouts and to properly monitor the flight instruments during the approach."}