{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6-dallas-28-killed", "date": "Nov 29, 1949 at 0549 LT", "type": "Douglas DC-6", "operator": "American-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Washington DC – Dallas – Mexico City", "msn": "42895", "yom": 1947, "flight_number": "AA157", "city": "Dallas-Love Field", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 2, "pax_on_board": 41, "pax_fatalities": 26, "other_fatalities": 0, "total_fatalities": 28, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5260, "circumstances": "Flight 157 originated at LaGuardia Field, New York, for Mexico City, Mexico, with stops scheduled at Washington, D C., and Dallas, Tex. Departure from LaGuardia was at 2147, November 28 Between LaGuardia and Washington the flight was reported to be uneventful with all of the aircraft's components functioning normally. At Washington, a flight plan was filed with, and approved by, Airway Route Traffic Control It specified Instrument Flight Rules to Dallas, with Wichita Falls, Tex, as the alternate, a cruising altitude of 18,000 feet, and a flight time of 5 hours and 4 minutes The gross height of the aircraft at takeoff was 82,298 pounds, which was 3,577 pounds less than the maximum allowable gross weight of 85,875 pounds, and the disposable load was distributed so that the center of gravity was within prescribed limits. At 0206 the flight requested and received permission to change its flight plan to Visual Flight Rules A posit-,on report was made over Nashville at 16,000 feet at 0254 and a descent was started to 6,000 feet When approaching Nashville, 1 No 1 engine had started backfiring at intervals of about 20 seconds Various corrective measures, including the application of alcohol and carburetor heat, and the richening of fuel mixture, were applied but were not successful and the backfiring continued. The captain and the flight engineer discussed the malfunctioning following which No 1 engine was feathered at a point about 25 miles southwest of Nashville at approximately 0300, however, the feathering was not reported to the company until 0429, where the flight was in the vicinity of Altheimer, Ark, a routine position reporting point about 125 miles beyond Memphis At that time, the crew advised a change of aircraft on arrival at Dallas. When 15 miles northeast of Dallas, at 0536, the flight was given permission to enter the traffic pattern at Love Field, Dallas, with a right-hand turn and instructed to land on Runway 36 The altimeter setting of 29 83 inches and the weather, which included unlimited ceiling, a visibility of 15 miles and a north-northeast wind of 5 mph, were given the flight The captain and the flight engineer conferred regarding returning No 1 engine to service and decided against doing so. The crew then went through the pre-landing cheek The landing lights were turned or and the Plans were lowered to the 20 degree position. The flight turned -flight to final approach when approximately over the Range Station which is 2 2 miles south of the approach end of Runway 36 At this time its altitude was estimated to be 1200 feet AFL 2 by the captain and 800 feet AFL by the first officer At a distance of about 1 1/2 miles from the approach end of the runway, the landing gear was extended. Shortly thereafter the flaps were extended fully, the turn to final placed be aircraft to the left of the runway Accordingly an \"S\" turn was made to correct the misalignment During this \"S\" turn the aircraft skidded to Its left, the air speed dropped abruptly and the aircraft settled rapidly. At this point the captain increased power to engines Nos. 2, 3 and 4 in an attempt to maintain control. Control tower operators watching the approach estimated that the aircraft cleared by 75 to 100 feet obstruction lights mounted on 30-foot poles on a power line located 800 feet south of the approach end of the runway. The aircraft continued in a generally northwest direction, across the airport on a heading about 40 degrees to the left of Runway 36, in a tail low attitude. Its air speed continued to fall, its attitude became increasingly nose-high. and a stall developed just prior to striking a hangar and other buildings on the northwest side of the airport. Both pilots and 26 passengers were killed. ", "probable_cause": "It was determined that the accident was caused by a faulty execution of an engine-out approach on part of the crew. \r\nThe following findings were noted:\r\n- The captain failed to align the aircraft with the runway centerline after the final turn,\r\n- After realizing the misalignment, the captain attempted to correct it with a risky \"S\"-turn at low altitude. There is little room for error if a problem arises during this maneuver because as the angle of the bank increases, so does the probability of stalling the airplane,\r\n- The crew made no attempt to balance the airplane’s fuel load after the No. 1 engine failed. The DC-6 is equipped with four main fuel tanks that serve individual engines, while a network of valves allow fuel to be transferred from one engine’s tank to feed other engines. The crew did not cross feed fuel from the tank serving the failed engine to balance the plane's weight as recommended in the flight operations manual. Flight 157 had flown for almost three hours with the No. 1 engine out, and the CAB concluded that the No. 1 main fuel tank was holding about 1,400 lbs (635 kg) more gasoline than the other three main tanks when the plane arrived at Love Field. The investigators primarily attributed the left wing’s sharp drop to the excessive weight of the fuel at its outboard end,\r\n- The captain applied excessive rudder during the “S”-turn, causing a condition known in aviation terminology as a skid. This maneuver would have caused the plane’s airspeed to drop, and according to the CAB findings, it caused the fuel in the No. 4 main tank to slosh away from the fuel outlet, lowering the engine’s fuel pressure,\r\n- The captain’s application of full throttle to both right-hand engines caused to airplane to turn further to the left due to the relative lack of thrust from the single functioning left-hand engine. This exacerbated his loss of directional control,\r\n- The first officer disobeyed the captain’s order to raise the wing flaps, and did not tell the captain,\r\n- The first officer misinterpreted the No. 4 engine’s fuel pressure drop as a sign of incipient engine failure and feathered the prop. However, the CAB partially exonerated Lewis for this act, concluding that the craft was so close to the ground at that point that his mistake probably had little influence on the final outcome,\r\n- Excessive elevator input by the captain caused the aircraft to stall.\r\nThe CAB concluded that the accident could have been avoided if the crew had held the plane straight and level when the misalignment was first noticed, then raised the flaps, climbed to a safe altitude, circled the airport, and attempted another landing. The CAB concluded that there were no factors present that would compel the crew to land immediately despite the sloppy approach, such as rapidly deteriorating weather or a shortage of fuel."}