{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-500tp-meridian-omaha-1-killed", "date": "Dec 10, 2015 at 1153 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Airsea Charters", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Omaha - Trinidad", "msn": "46-97166", "yom": 2003, "flight_number": null, "city": "Omaha-Eppley", "zone": "Nebraska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4840, "captain_hours_type": 280, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1047, "circumstances": "The private pilot was conducting a personal cross-country flight. Shortly after takeoff, the pilot told the air traffic controller that he needed to return to the airport due to an attitude heading reference system (AHRS) \"miscommunication.\" Air traffic control radar data indicated that, at that time, the airplane was about 1.75 miles north of the airport on a southeasterly course about 2,000 ft. mean sea level. About 20 seconds after the pilot requested to return to the airport, the airplane began to descend. The airplane subsequently entered a right turn, which appeared to continue until the final radar data point. The airplane struck power lines about 3/4 of a mile from the airport while maneuvering within the traffic pattern. The power lines were about 75 ft. above ground level. A postaccident examination of the airframe and engine revealed no preimpact mechanical malfunctions or failures that would have precluded normal operation. Although the pilot reported a flight instrumentation issue to air traffic control, the investigation was unable to confirm whether such an anomaly occurred based on component testing and available information. Examination of the standby airspeed indicator revealed that the link arm had separated from the pin on the rocking shaft assembly; however, it likely separated during the accident sequence. No other anomalies were observed. Functional testing indicated that the standby airspeed indicator was likely functional and providing accurate airspeed information to the pilot throughout the flight. Finally, examination of the left and right annunciator panel bulb filaments associated with the left fuel pump advisory revealed that they were stretched, indicating that the left fuel pump advisory indication annunciated at the time of the accident; however, this likely occurred during the accident sequence as a result of an automatic attempt to activate the left fuel pump due to the loss of fuel pressure immediately after the left wing separated. Toxicology testing of the pilot detected low levels of three different sedating antihistamines; however, antemortem levels could not be determined nor could the underlying reason(s) for the pilot's use of these medications. As a result, it could not be determined whether pilot impairment occurred due to the use of the medications or the underlying condition(s) themselves. Although the pilot reported a flight instrumentation issue, this problem would not have affected his ability to control the airplane. Further, the pilot should have been able to see the power lines given the day/visual weather conditions. It is possible that the pilot become distracted by the noncritical anomaly, which resulted in his failure to maintain clearance from the power lines. ", "probable_cause": "The pilot's failure to maintain clearance from power lines while returning to the airport after becoming distracted by a noncritical flight instrumentation anomaly indication."}