{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2b-27-islander-ainsdale", "date": "Aug 21, 1987 at 0530 LT", "type": "Britten-Norman Islander", "operator": "Air%20Furness", "flight_phase": "Flight", "flight_type": "Postal (mail)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Manchester – Douglas", "msn": "2181", "yom": 1983, "flight_number": null, "city": "Ainsdale", "zone": "Merseyside", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11792, "captain_hours_type": 17, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Britten-Norman BN-2B-27 Islander sustained substantial damage in a forced landing on a Merseyside beach. The airplane was to carry mail on an early morning service from Manchester Airport (MAN) to Ronaldsway Airport, Isle of Man. The commander arrived at the aircraft at about 03:45 hrs in the morning. As it was dark, the internal checks were done in normal cockpit lighting and, having completed the usual preflight administration, he was ready to start engines at about 04:50 hrs. The aircraft took off at 05:09 hrs, on a Special Visual Flight Rules Clearance, turned right onto a northwesterly heading, and climbed to an initial cruising altitude of 1000 feet. Just prior to crossing the coast, as conditions were conducive to the formation of carburettor icing, the commander selected HOT air on both engines for 30 seconds. At this stage the aircraft was cruising at an altitude of 2000 feet at between 120 and 130 knots with both engines set at 24 inches manifold pressure and 2300 revolutions per minute. When the aircraft was about 2 nautical miles out to sea, the port engine appeared to surge and then stopped. Shortly afterwards, the starboard engine did the same thing. At 05:28 hrs the commander informed Liverpool Approach that he had a problem and was going to attempt a forced landing at Woodvale Airfield. Having turned back towards the shore, the commander selected the TIP/MAIN switch to TIP and reduced the indicated airspeed to about 65 kt in the descent. The aircraft did not reach Woodvale and a forced landing was carried out on the beach. It was while the commander was making the aircraft safe that he noticed that the main fuel cock selectors were positioned such that both engines had been feeding from the right fuel tank. Both fuel cocks were then selected to OFF and, when the shutdown had been completed, the commander vacated the aircraft uninjured. The aircraft had landed on flat sand, but had struck a soft patch; this had resulted in the collapse of the nose and right main undercarriage, and damage to the nose and the wing centre section. Recovery attempts by local services had severely damaged the tailplane and had probably caused the sideway failure of the left undercarriage. The aircraft was totally submerged during the subsequent high tide.  Examination of the aircraft, before it was recovered from the beach, showed no evidence of any pre-impact failure in the engine or flying controls. The fuel state was approximately 289 litres with the right main tank empty.", "probable_cause": "Double engine failure caused by a fuel exhaustion as the fuel selector was positioned on an empty tank. 289 liters of fuel remained in other tanks at the time of the accident. "}