{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-144d-kladkovo-2-killed", "date": "May 23, 1978 at 1855 LT", "type": "Tupolev TU-144", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Test", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Ramenskoye - Ramenskoye", "msn": "10 06 2", "yom": 1978, "flight_number": null, "city": "Kladkovo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9, "circumstances": "Built by the Voronezh Aircraft Factory, the airplane came out of the plant last April 27. Test flights were conducted on April 27, May 12, 16 and 18. On May 23, the crew completed a fifth test flight from 1111LT and 1307LT without any incidents. At 1730LT, the crew departed Ramenskoye Airport near Moscow to proceed to a series of various tests on engines, generators, to evaluate the airtightness of the cabin as well as the stability and the controllability of the aircraft at an altitude of 12,000 meters. When all these checks were completed, the crew reduced his altitude to 3,000 meters then carried out the test of the auxiliary power unit (APU). For the next two minutes, engines n°3 and 4 were shut down in accordance with the test program. About a minute after the shutdown of the engine n°4, a burning smell was felt in the cabin and smoke spread through the air conditioning system, followed by a black and thick smoke. The captain decided to return to his departure point but quickly realized that this would be impossible. He reduced his altitude and attempted an emergency landing in a pasture. At a speed of 380 km/h, at an estimated height of four to six meters, the airplane struck and cut between 70 and 100 trees before falling to the ground. It then slid for about 620 meters before coming to rest in flames, some 46 kilometers southeast of Ramenskoye runway 30 threshold. Six crew members were rescued while two engineers were killed.", "probable_cause": "According to the investigating committee, a fuel line broke up 27 minutes before engine start. This allowed eight tons of fuel to leak into several compartments of the right wing and a fire erupted when the auxiliary power unit was triggered. All various analysis carried out by investigators did not make it possible to determine precisely the causes of the fuel leakage by the fact that all the incriminated components were totally destroyed by a post crash fire. However, experts believe that it is likely that the leak would be the result of the failure of a fuel system hose connected to the engine n°1."}