{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-ottawa", "date": "Jan 19, 2016 at 1250 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "No Boundaries Aviation", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Olathe - Olathe", "msn": "46-22193", "yom": 1995, "flight_number": null, "city": "Ottawa", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2985, "captain_hours_type": 290, "copilot_hours": 2500, "copilot_hours_type": 800, "aircraft_hours": 3100, "circumstances": "According to the flight instructor, he and the pilot rated student receiving instruction were operating under instrument flight rules in instrument meteorological conditions. He reported that throughout the flight the airplane accumulated light rime ice. He recalled that after holding at a Very High Frequency Omni-Directional Range (VOR), they completed a VOR approach, executed the missed approach procedure, set the power to climb at the airspeed of 130 knots indicated airspeed and began to climb to 5000 feet. He reported that as they climbed they encountered freezing rain, the airspeed began to deteriorate and the degree of ice accumulation increased from light to moderate. He reported that all of the airplane's de-ice systems were functioning yet he was not able to maintain altitude. He determined that landing at the destination airport was not an option and executed a forced landing in an open field. He affirmed that during the landing the airplane bounced several times before coming to a stop. The airplane sustained substantial damage to the firewall, forward pressure bulkhead and puncture holes in the airplane skin. The pilot reported that there were no mechanical failures or anomalies prior to or during the flight that would have prevented normal flight operation.", "probable_cause": "The flight crews encounter with un-forecasted freezing rain resulting in an uncontrolled descent, forced landing, and substantial damage to the airplane's firewall, and forward pressure bulkhead."}