{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1245-hayden-2-killed", "date": "Jan 11, 2009 at 0942 LT", "type": "Pilatus PC-12", "operator": "Rooney Consulting & Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Hayden - Chino", "msn": "604", "yom": 2004, "flight_number": null, "city": "Hayden-Yampa Valley", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 867, "captain_hours_type": 82, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 558, "circumstances": "The pilot had filed an instrument flight rules flight plan with a planned departure time of 0700 in order to arrive at his intended destination in time for a planned engagement. He and his passenger arrived at the airport approximately 0800 and requested that the airplane be fueled. The airplane was pulled from its heated hangar into heavy snowfall and fueled at 0917. As the airplane sat outside in the heavy snowfall, a measurable amount of wet slushy snow accumulated on the airplane. The Fixed Base Operator manager suggested to the pilot that the airplane be deiced, but he declined. The airplane was then pulled out to the taxiway in an effort to prevent it from becoming stuck in the snow. At 0939, approximately 22 minutes after the airplane was pulled out if its hangar, the pilot departed with a visibility of 3/4 of a mile in snow and with a 4-knot direct tailwind. The pilot then made a right turn and announced that he was heading to his first waypoint. The airplane continued into an ever tightening right turn until it impacted the ground while in an inverted position about one mile north-northwest of the runway. An examination of the airplane’s wreckage revealed no anomalies with either the engine or airframe that would have contributed to the loss of control. The airplane’s Pilot Operating Handbook and Airplane Flight Manual contained the following limitation: \"The aircraft must be clear of all deposits of snow, ice and frost adhering to the lifting surfaces immediately prior to takeoff.\"", "probable_cause": "The pilot's loss of control due to snow/ice contamination on the airplane's lifting surfaces as a result of his decision not to deice the airplane before departure."}