{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-chankonde", "date": "Dec 13, 1999 at 1538 LT", "type": "Cessna 402", "operator": "Twin Wings", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Zanzibar – Chankonde – Dar es-Salaam", "msn": "402C-0213", "yom": 1979, "flight_number": null, "city": "Chankonde", "zone": "Mbeya Region", "country": "Tanzania", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2667, "captain_hours_type": 227, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 13 December 1999 at 1029 5H-GTO took off from Zanzibar airport for a direct VFR flight to Chankonde. The endurance was six hours and the pilot was the only occupant. The aircraft was destined to pick a party of five hunters at Chankonde hunting airstrip for a flight to Dar es Salaam. The forward leg of the flight was uneventful and the pilot reported to Dar Control at 1153 hours that he has Chankonde in site and was estimating to land at 1215 hours. The aircraft did in fact land at 1216 hours. The pilot reported that shortly before he landed at Chankonde he circled around the airstrip and noticed that there were some pools of water on the runway. Five passengers boarded the aircraft at Chankonde for a flight to Dar es Salaam. The pilot said that all the heavy baggage and two members of the hunting party left by road for Dar es Salaam. The remaining five who boarded the aircraft carried only hand luggage. In the preparation for take-off the pilot taxied to the threshold of runway 07, made the \"first selection\" of flaps and applied full power on brakes. He testified that he did not lean the mixtures since he saw no requirement for this. The initial phase of the take-off rolI appeared' normal to the pilot. When the aircraft 'had' covered about 600 metres and was accelerating through 65/70 kt it went through a muddy ditch causing the pilot to feeI deceleration. It immediately became apparent that he was not going to achieve the take off speed and clear the trees in the foreground. The pilot subsequently decided to abort the take-off. When the engines were throttled back and brakes were applied the aircraft continued to rolI on wet and slippery sandy surface till it overran the end of runway 07 and collided with trees located about 60 metres beyond the end of the runway. As the aircraft impacted the trees in the accident sequence, both wing sections outboard of the engines separated and caught fire. The aircraft came to rest about 56 metres forward of the detached wing sections. The grass beneath the aircraft and the right engine were also on fire. The pilot was unable to open the cockpit door because it was blocked by a tree. He subsequently rushed behind and opened the main door. As he did so, one passenger, \"who was tall and muscular\" pushed the pilot causing him to falI by the doorway on the ground where grass surface was on fire. All the five passengers stepped on the pilot and escaped. The pilot managed to rise an his own, returned to the cabin and picked the fire extinguisher. He subsequently fought the fire under the fuselage, the tail and the right engine. He was also joined by a vehicle which had 20 litres of water and this was used to put out the fire on the left hand side of the fuselage. The passenger who was in the copilot seat sustained a cut on his eyebrow and another passenger suffered minor burns on his fingers. The pilot whom the passengers used as a stepping stone and a fire blanket sustained first degree burns to his face and both arms. Both wings and parts of the tail plane were torn off the fuselage by impact with the trees. They were also partly destroyed by fire. The fuselage suffered relatively less \"damage and the cabin remained intact. However, much of the interior equipment was destroyed by unknown persons a few days after the accident when the wreckage was left unguarded. The weather at the time of the accident was reported to be sunny with no wind. The ground was wet from rains which had been falling in the area. Chankonde Airstrip, elevation 3,386 feet, has one runway 07/25 which is 1,000 metres long and 30 metres wide. The surface is sand with some patches of scattered grass. There are tall trees starting 60 metres beyond the end of runway 07.", "probable_cause": null}