{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90gtx-king-air-lanseria-3-killed", "date": "Feb 3, 2014 at 0654 LT", "type": "Beechcraft 90 King Air", "operator": "CLT", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Johannesburg – Lanseria", "msn": "LJ-2011", "yom": 2011, "flight_number": null, "city": "Lanseria", "zone": "Gauteng", "country": "South Africa", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1936, "captain_hours_type": 101, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 500, "circumstances": "The pilot and two passengers were planning to fly from Rand Airport to Lanseria International Airport (FALA) in the early hours of the morning with the intention to clear customs. It was still dark and the weather forecast thunderstorms with rain for most areas of Gauteng. Rand Tower requested clearance from FAOR approach before departure. The aircraft took off from Runway 29 following the clearance given and proceeded in a westerly direction. At 6500 feet above mean sea level (AMSL), Rand handed the aircraft over to Approach for further clearances. Reported visibility at FALA was 600m and the cloud base was 600 feet AGL. The pilot then requested a VHF Omnidirectional range (VOR) Z approach for Runway 07. He started the approach at 8000 feet and  approximately 14nm from LIV. At 12nm and established on Radial 245 Approach handed him over to FALA. Once in contact with FALA the pilot was advised of the heading to turn to at missed approach point (MAP). At MAP the pilot did not have the runway in sight and advised tower that they were going around. They turned left 360° and climbed to 8000 feet as instructed by FALA.  FALA handed them back to Approach for repositioning for Radial 245. Approach advised the aircraft that visibility at Wonderboom was better but the pilot said if not successful they would route to Polokwane. At 12nm the aircraft was handed over to FALA. During the descent, the pilot started repeating messages more than twice. Close to MAP the pilot indicated that he had the field in sight. FALA gave them landing clearance. Soon after, the pilot said he did not have it in sight. When FALA instructed him to go around and route Polokwane, the pilot came back on frequency indicating that the aircraft was in distress. After that, the tower heard a loud bang accompanied by black smoke from behind a hangar.", "probable_cause": "The accident was the consequence of a stall in adverse weather conditions after the pilot suffered a spatial disorientation during a missed approach procedure. "}