{"url": "https://www.baaa-acro.com/crash/crash-antonov-12b-camp-dwyer-7-killed", "date": "May 18, 2016 at 1407 LT", "type": "Antonov AN-12", "operator": "Silk%20Way%20Airlines2", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Camp Dwyer – Mary – Baku", "msn": "3 3 412 09", "yom": 1963, "flight_number": null, "city": "Camp Dwyer AFB", "zone": "Helmand", "country": "Afghanistan", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 7, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 22628, "captain_hours_type": 3953, "copilot_hours": 4625, "copilot_hours_type": 836, "aircraft_hours": 19828, "circumstances": "On May 18, 2016 the crew of An-12B 4K-AZ25 aircraft operated by Silk Way Airlines including the Captain, First Officer, navigator, flight mechanic, flight radio operator and loadmaster was planned to fly via route Baku (Azerbaijan) - Bagram (Afghanistan) - Dwyer (Afghanistan) - Mary (Turkmenistan) - Baku. There were also two maintenance mechanics and an engineer on board the a/c. The preliminary training of the crew \twas conducted on \t29.12.2015 by the Chief Navigator of Silk Way Airlines. The pre-flight briefing was conducted on \t18.05.2016 by a captain-instructor and a navigator-instructor. The following has been determined so far. According to the information available at the moment the flight to Dwyer aerodrome was conducted in an acceptable way. At 09:11:27 the crew started up the engines at Dwyer aerodrome, Engine #2 was the last to be started up at 09:47:37. Before the takeoff the Captain distributed the duties within the crew, nominating the FO as the PF, and himself as PM. After the engine startup the crew initiated taxiing to perform takeoff with heading 229°. The concrete RWY of Dwyer aerodrome is measured 2439 m by 37 m. The a/c TOW and CG were within the AFM limitations. In the course of the takeoff, at 09:57:56 the flight mechanic reported an increase in MGT of Engine #3 above the acceptable level: \"Engine #3, look, engine temperature over six hundred, over seven hundred\", which was confirmed by the FO: \"Yes, it's getting temperature\" while the Captain asked to be more attentive. According to the crew reports the takeoff was performed with Flaps 15. As the checklist was being read, the Captain ordered to lock the propellers. After the Captain's order to lock the propellers a slight increase in torque-measuring device values was recorded on Engine #1 and #4, and in 17 seconds also Engine #2, which indirectly implies that propellers #1, #2 and #4 were at stops. There is no evidence that propeller of Engine #3 was locked. At 09:59:42 the crew initiated the takeoff. Before the takeoff the ATC advised the crew on the wind direction and speed on the RWY: 280° 14 knots (7 m/sec) gusting 26 knots (13 m/sec). Thus it was quartering headwind and the headwind component might have been 5 to 9 m/sec. While performing takeoff the crew first increased thrust on Engines #1 and #4 and then on Engine #2 after 10 seconds. The thrust of the three engines was about 50 kg/sq.cm as per torque indicator (lower than takeoff mode). The third engine was still operating in the ground idle mode, though the CVR did not record any crew callouts concerning Engine #3 operation parameters. Based on the CCTV system of Dwyer aerodrome the takeoff roll was initiated almost from the RWY threshold and was conducted to the left of the RWY centerline. No significant deviations from the takeoff course during the takeoff roll were recorded. During the takeoff roll the rudder was deflected left close to extreme. Probably the pilots were also applying differential control on Engine #2 to decrease the right torque moment. At 10:00:14 at approximately 120 km/h IAS the \"Engine #3 negative thrust\" signal was started to be recorded and was recorded on up to the end of the record. At that time the a/c was about 430 m away from the start of the takeoff roll. At 10:00:42 Engines #1 and #4 thrust was increased up to 63 kg/sq.cm as per torque indicator (consistent with takeoff mode for the actual flight conditions). At that time the IAS was about 150 km/h Engine #2 thrust was increased up to the same value only 23 seconds later at about 200 km/h IAS. At that time the a/c was about 840 m away from the RWY end. Engine #3 was still operating in ground idle mode. Approximately 260 m before the RWY end at a speed of 220 km/h IAS (maximum speed reached) the FDR recorded the start of nose up input on the control column. The a/c did not lift off After rolling all along the RWY the a/c overran the RWY onto the ground at a speed of 220 km/h While moving on the ground the aircraft sustained significant damage, which led to post-crash fire that destroyed most of the aircraft structures. Out of the nine persons on board seven were killed and two were seriously injured and taken to hospital.\n", "probable_cause": null}