{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61p-aerostar-ted-smith-601p-donegal-springs", "date": "Aug 19, 2017 at 1642 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Kurt Heitmeier", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Donegal Springs - Donegal Springs", "msn": "61-0405-142", "yom": 1977, "flight_number": null, "city": "Donegal Springs", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 400, "captain_hours_type": 1, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3957, "circumstances": "The commercial pilot stated that, during the takeoff roll, the airplane swerved to the right, and he corrected to the left and aborted the takeoff; however, the airplane departed the left side of the runway and collided with an embankment. At the time of the accident, a quartering tailwind was present. The pilot had no previous experience in the accident airplane make and model or in any other multiengine airplane equipped with engines capable of producing 300 horsepower. During a postaccident conversation with a mechanic, the pilot stated that the airplane \"got away from him\" during the attempted takeoff. Because a postaccident examination of the airplane did not reveal any evidence of a preimpact mechanical malfunction or failure of the airplane's flight controls or nosewheel steering system that would have precluded normal operation and the pilot did not have any previous experience operating this make and model of airplane, it is likely that the pilot lost directional control during takeoff with a quartering tailwind.", "probable_cause": "The pilot's failure to maintain directional control during takeoff with a quartering tailwind. Contributing to the accident was the pilot's lack of experience in the accident airplane make and model."}