{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-upland-1-killed", "date": "Dec 15, 2003 at 1723 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Steven N. Kaplan", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Camarillo – Upland", "msn": "421C-1113", "yom": 1981, "flight_number": null, "city": "Upland", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 600, "captain_hours_type": 175, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3257, "circumstances": "The airplane impacted a residence during a missed approach. After completing the en route portion of the instrument flight, a controller cleared the pilot to proceed direct to the initial approach fix for the global positioning satellite (GPS) approach to the airport. After being cleared for the approach, the airplane continued on a course to the east and at altitudes consistent with flying the GPS published approach procedure. Radar data indicated that at the missed approach point at the minimum descent altitude of 2,000 feet msl, the airplane made a turn to the left, changing course in a northerly direction toward rapidly rising mountainous terrain. The published missed approach specified a climbing right turn to 4,000 feet, and noted that circling north of the airport was not allowed. Remaining in a slight left turn, the airplane climbed to 3,300 feet msl over the duration of 1 minute 9 seconds. The controller advised the pilot that he was flying off course toward mountainous terrain and instructed him to make an immediate left turn heading in a southbound direction. The airplane descended to 3,200 feet msl and made a left turn in a southerly direction. The airplane continued to descend to 2,100 feet msl and the pilot read back the instructions that the controller gave him. The airplane then climbed to 3,300 feet, with an indicated ground speed of 35 knots, and began a sharp left turn. It then descended to impact with a house. At no time during the approach did the pilot indicate that he was experiencing difficulty navigating or request assistance. An examination of the airplane revealed no evidence a mechanical malfunction or failures prior to impact; however, both the cockpit and instrument panel sustained severe thermal damage, precluding any detailed examinations.", "probable_cause": "The pilot became lost/disoriented during the approach, failed to maintain course alignment with the missed approach procedure, and subsequently lost control of the airplane."}