{"url": "https://www.baaa-acro.com/crash/crash-cessna-411-east-hampton-1-killed", "date": "Oct 23, 2005 at 1345 LT", "type": "Cessna 411", "operator": "William F. Holdgate", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Jefferson - Nantucket", "msn": "411-0045", "yom": 1965, "flight_number": null, "city": "East Hampton", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 452, "captain_hours_type": 0, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2808, "circumstances": "The pilot purchased the multiengine airplane about 18 months prior to the accident, and was conducting his first flight in the airplane, as he flew it from Georgia to Massachusetts. While en route, the airplane experienced a failure of the left engine. The airplane began maneuvering near an airport, as its groundspeed decreased from 173 miles per hour (mph) to 90 mph, 13 mph below the minimum single engine control speed. A witness reported that the airplane appeared to be attempting to land, when it banked to the left, and descended to the ground. The airplane impacted on a road, about 3 miles east-southeast of the airport. A 3-inch, by 2.5- inch hole was observed on the top of the left engine crankcase, and streaks of oil were present on the left gear door, left flap, and the left side of the fuselage. The number two connecting rod was fractured and heat distressed. The number 2 piston assembly was seized in the cylinder barrel. The airplane had been operated about 30 hours, during the 6 years prior to the accident, and it had not been flown since its most recent annual inspection, which was performed about 16 months prior to the accident. In addition, both engines were being operated beyond the manufacturer's recommended time between overhaul limits. The pilot did not possess a multiengine airplane rating. He attended an airplane type specific training course about 20 months prior to the accident. At that time, he reported 452 hours of total flight experience, with 0 hours of multiengine flight experience.", "probable_cause": "The pilot's failure to maintain airspeed, while maneuvering with the left engine inoperative. Contributing to the accident were the failure of the left engine, and the pilot's lack of multiengine certification."}