{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-g150-key-west", "date": "Oct 31, 2011 at 1942 LT", "type": "Gulfstream G150", "operator": "Jimmie-Johnson", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stuart - Key West", "msn": "241", "yom": 2007, "flight_number": null, "city": "Key West-Intl", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11000, "captain_hours_type": 290, "copilot_hours": 13800, "copilot_hours_type": 75, "aircraft_hours": 1190, "circumstances": "The airplane was approaching the destination airport in night visual meteorological conditions. After losing sight of the runway once and going around, they continued the approach, even though the pilot in command (PIC) stated that he thought they were going to land long. The PIC stated that the main landing gear touched down near the 1,000-foot marker of the 4,801-foot-long runway, about the landing reference speed (Vref) of 120 knots. The PIC stated that he then applied the brakes but thought they were not working; he had not yet activated the thrust reversers. He alerted the second in command (SIC), who also depressed the brake pedals with no apparent results. The PIC suggested a go-around, but the SIC responded that it was too late. The airplane subsequently traveled off the end of the runway, struck a gravel berm, and came to rest about 816 feet beyond the end of the runway. During the impact, one of the passenger seats dislodged from its seat track and was found on the cabin floor, with the passenger still in it. Review of cockpit voice recorder, video, and performance data revealed that the main landing gear touched down at Vref and about 1,650 feet beyond the approach end of the runway. The nosegear then touched down 2.4 seconds later and about 2,120 feet beyond the approach end of the runway, with about 2,680 feet of runway remaining. Digital electronic engine control data revealed that about 8 seconds after weight-on-wheels, the power levers were advanced from the idle position to the takeoff position. The power levers were then returned to the idle position 6 seconds later. The power levers were moved to the reverse thrust position 8 seconds after that and remained in that position for the duration of the accident sequence; both thrust reversers deployed when commanded. Examination and testing of the airplane systems did not reveal any evidence of preimpact mechanical malfunctions with the wheels brakes or any other systems. Although armed, the airbrakes did not deploy upon touchdown; the data available was inconclusive to determine what position the throttles were in at touchdown and why the airbrakes did not deploy. It is likely that the pilots did not detect the wheel braking because its effect was less than expected with the airplane at full power and with the airbrakes stowed. Landing distance data revealed that the airplane required about 2,551 feet to stop at its given weight in the given weather conditions. With a runway distance of 2,680 feet remaining, the airplane could have stopped or gone around uneventfully with appropriate use of all deceleration devices. The landing procedure stated to activate the thrust reversers after nosewheel touchdown and then apply the brakes, as necessary; however, the PIC only applied the brakes. Further, no callouts were made to verify ground spoiler or reverse thrust deployment. The PIC then stated that he was going to go around, but the SIC said it was too late, so the thrust levers were brought back to idle and the reversers were deployed. The PIC's delayed decision to stop or go around resulted in about a 22-second delay in thrust reverser activation, which resulted in the runway overrun. Additionally, the procedure for a (perceived) failed brake system would have been to activate the emergency brake, which neither pilot did. Examination of the seats revealed that a forward-facing seat was installed in the aft-facing position and an aft-facing seat was installed in the forward-facing position. Additionally, the ejected seat's shear plungers were found in the raised position. Had the seat been installed correctly, the plungers would have been in the lowered position, in the seat track. The improper installation most likely resulted in the passenger’s seat separating from the seat track and exacerbating his injuries.", "probable_cause": "The pilot in command's failure to follow the normal landing procedures (placing engines into reverse thrust first and then brake), his delayed decision to continue the landing or go-around, and the flight crew's failure to follow emergency procedures once a perceived loss of brakes occurred. Contributing to the seriousness of the passenger's injury was the improper securing of the passenger seat by maintenance personnel.\n"}