{"url": "https://www.baaa-acro.com/crash/crash-cessna-t303-crusader-near-nottingham", "date": "Jul 16, 1998 at 1833 LT", "type": "Cessna 303 Crusader", "operator": "G-BSPF Crusader Group", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sheffield – Nottingham", "msn": "303-00100", "yom": 1982, "flight_number": null, "city": "Nottingham-Tollerton", "zone": "Nottinghamshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 290, "captain_hours_type": 68, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was en route from Sheffield City Airport to Nottingham where it was based. The pilot joined the traffic zone at Burton Joyce, an unofficial but well used Visual Reporting Point, at a height of about 1,000 feet. The weather was fine with good visibility and the pilot took the opportunity to view the house of the aircraft's co-owner located in the vicinity of Burton Joyce. While orbiting the house, the pilot felt a moderate 'bumping' sensation which he attributed to thermal activity rather than pre-stall buffet. The left wing suddenly dropped and the aircraft rolled through the vertical. The pilot applied corrective rudder and moved the control column forward which rolled the aircraft erect but he was unable to arrest the rate of descent because the engines did not appear to be developing full power. He therefore elected to carry out a forced landing with the landing gear retracted. On approaching the field, the aircraft struck a telegraph pole, yawed to the left and landed with a very high rate of descent before coming to a halt after a short ground slide. The pilot was unable to evacuate the aircraft because of his injuries but was rescued by local people who were quickly on the scene. There was no fire. The pilot stated that at the time the aircraft departed from normal flight, he was flying at about 100 kt with 60° of bank. The basic stalling speed of the aircraft in the configuration at the time was about 70 kt. Application of the correction for load factor in the turn would have given a stalling speed of 100 kt. The majority of eye witnesses stated that the aircraft was very low at the point at which it departed from normal flight, probably in the region of 300 feet above ground level. ", "probable_cause": null}