{"url": "https://www.baaa-acro.com/crash/crash-cessna-650-citation-iii-atlantic-city", "date": "Oct 27, 2007 at 1110 LT", "type": "Cessna 650 Citation III", "operator": "Empire Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Farmingdale – Atlantic City", "msn": "650-0097", "yom": 1985, "flight_number": null, "city": "Atlantic City", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9472, "captain_hours_type": 199, "copilot_hours": 2535, "copilot_hours_type": 120, "aircraft_hours": 7052, "circumstances": "The first officer was flying the Area Navigation, Global Positioning System, approach to runway 22. During the approach, the airplane was initially fast as the first officer had increased engine power to compensate for wind conditions. Descending below the minimum descent altitude (MDA), the first officer momentarily deployed the speed brakes, but stowed them about 200 feet above ground level (agl), and reduced the engine power to flight idle. The airplane became low and slow, and developed an excessive sink rate. The airplane subsequently landed hard on runway 22, which drove the right main landing gear into the right wing, resulting in substantial damage to the right wing spar. The first officer reported intermittent airspeed fluctuations between his airspeed indicator and the captain's airspeed indicator; however, a subsequent check of the pitot-static system did not reveal any anomalies that would have precluded normal operation of the airspeed indicators. About the time of the accident, the recorded wind was from 190 degrees at 11 knots, gusting to 24 knots; and the captain believed that the airplane had encountered windshear near the MDA, with the flaps fully extended. Review of air traffic control data revealed that no windshear advisories were contained in the automated terminal information system broadcasts. Although the local controller provided windshear advisories to prior landing aircraft, he did not provide one to the accident aircraft. Review of the airplane flight manual (AFM) revealed that deploying the speed brakes below 500 feet agl, with the flaps in any position other than the retracted position, was prohibited.", "probable_cause": "The first officer's failure to maintain airspeed during approach, and the captain's inadequate remedial action. Contributing to the accident was the first officer's failure to comply with procedures, windshear, and the lack of windshear warning from air traffic control."}