{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-194b-near-muara-kuang", "date": "Feb 27, 1942", "type": "Douglas DC-3", "operator": "KNILM", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": null, "msn": "1981", "yom": 1937, "flight_number": null, "city": "Muara Kuang", "zone": "South Sumatra", "country": "Indonesia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Between February 27th and March 1st of 1942,(possibly after being attacked by a Japanese fighter) PK-AFZ, has carried out a successful emergency landing in the jungle near the village of Muara Kuang, on the west side of the river Ogan, some 75 kilometers South of Palembang. With 1 engine running, wireless - operator P. Pronk has searched for radio contact with Java and possibly also with Palembang. It is unclear whether there has actually been communication. In the course of the 1st of March 1942, the crew, left their plane and set off on foot in eastern direction to the river Ogan, taking with them a “large amount of gold” belonging to the cargo of the airplane. Not far north of Muara Kuang, on the road towards Seri Kembang, the crew has addressed a local (Sori Bin D.). The crew has asked him to make purchases for them in a toko in nearby  Muara Kuang.  After doing so the local has joined the crew as a guide. The crew continued their way north following the river Ogan towards Palembang. The next day, while the crew was staying in a shelter near the village of Soeka Tjinta, the local guide went off towards the north to arrange more supplies. In the afternoon he arrived back at the shelter with supplies and a car. Together they followed their way north towards the village of Lubuk Keliat. Some 4 kilometers south of the village they were housed in a Pondok (shelter). On request of the crew the guide went off again to arrange a boat (proa) with rowers in order to make a possible escape following the rivers Ogan and the Kali Mesuji towards the Java Sea in the east. Earlier that day a plan was already forged to rob the crew. In the early evening of March 2nd, 1942, the crew was brought under false pretenses to the other side (east side) of the river by a local criminal named “Loengsin” and another villager named Amir. Probably Amir has arisen as their new guide. In the jungle opposite of kilometer marker 93 and in the vicinity of some gardens, the crew is housed in the Pondok of (guide)Amir. Amir and Loengsin then returned back to the west side of the river. In the early evening ,at the house of Madjid Bin L. which was in the vicinity of Kilometer marker 93, a number of villagers gathered, amongst them Amir, who invited the group to “see” the Europeans on the other side of the river. That evening there have been several people visiting the crew in their Pondok. I think the crew must have felt more and more vulnerable during that night. Although they were armed, they were now clearly in the minority and already 1 of their revolvers had been stolen. Probably with this knowledge the crew abandoned the plan to get away via the Kali Mesuji. They have probably made a trade-off and opted to surrender to the Japanese in Palembang. However, this has never happened. Exhausted and distracted by the regular visits that night, they were awaiting their departure with guide and rowers. One of the crew members, probably Nieuwdorp, was holding guard, armed with a revolver. He has called out to some figures approaching the Pondok in the dark. The remaining crew members stayed quiet. Around 04:00 o'clock in the early morning of March 3, 1942 it has come to a (fire) battle. During this fight in and around the Pondok,  captain C. Blaak, engineer M. Veenendaal (or 2nd Pilot W. Nieuwdorp) and the so-called guide Amir were killed. 2nd pilot W. Nieuwdorp (or engineer M. Veenendaal) and wireless-operator P. Pronk were injured but managed to escape. Nieuwdorp (or Veenendaal) has jumped in the river Ogan and drowned , Pronk managed to hide in the surrounding jungle. Later that morning Pronk managed to find protection at the house of the Pasirah (local authority) of the village of Lubuk Keliat. Later that day Pronk and some bags with the belongings of the killed crew members were transported (joined by a group of locals ) to the town of Tandjung  Radja to be handed over to the local (dutch) authority. Instead Pronk was handed over to a Japanese patrol that had just entered the town. The wounded and exhausted Pronk was forced to lie down in the sun on the burning hot asphalt all afternoon. In the evening the Japanese took him to a house where they were staying and summoned the local Government doctor, Chinese  Dr. Ghan Tjoe Ham, to treat the wounded Pronk at the house. Dr. Ghan treated Pronk on the following two mornings. During these treatments Pronk told him what had happened where they landed and that they were robbed because of the large amount of gold they were carrying. On the third morning (6th of March 1942) the Japanese no longer allowed any treatment, their attitude towards the doctor became hostile. Later that morning they took pronk to the local cemetery and had him dig a shallow grave. Pronk was then forced to kneel down in front of the grave and was then beheaded by a single strike of a Japanese sword. Pronk  was left covered by a thin layer of sand, while the Japanese patrol left Tandjung Radja. The remains of Pronk were recovered after the war, the remains of Blaak, Veenendaal and Nieuwdorp were never found, although pointed out by locals during the investigation, their graves remain unknown. All the local perpetrators but local criminal “Loengsin” were arrested and interrogated after the war. Several witnesses have been heard and their statements noted. Nevertheless for unknown reasons nobody has ever been prosecuted for the crimes committed. Most of the files and documents on this case have vanished, amongst them a written report and letter from deceased (in captivity) Controleur Poggemeier of Tandjung Radja containing the full statement of P. Pronk. This important report and some other papers have been handed over by Dr. Ghan Tjoe Ham to a Dutch Navy officer (Tageman) in Lahat in September 1945. “Officially”no trace of PK-AFZ and its cargo were ever found.\r\nCrew:\r\nC. Blaak, pilot,\r\nH. W. Nieuwdorp, copilot,\r\nMarinus Veenendaal, flight engineer, \r\nP. Pronk, radio operator.\n\r\nSource and texts: Geert Veenendaal, grandson of Marinus Veenendaal. ", "probable_cause": "Due to lack of evidences, the exact cause of the accident could not be determined. "}