{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54q-skymaster-near-indio-2-killed", "date": "Dec 1, 1980 at 1343 LT", "type": "Douglas C-54 Skymaster", "operator": "Waig Aircraft", "flight_phase": "Flight", "flight_type": "Cinematography", "survivors": "No", "site": "Plain, Valley", "schedule": "Hemet - Tucson", "msn": "10750", "yom": 1945, "flight_number": null, "city": "Indio", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Airtankers \"T1\" (N96449, msn 10750) and \"T2\" (N406WA, msn 35955) both Douglas DC-4's, departed the Hemet-Ryan Field, CA (HMT) about 13:22. Both airtankers had been recently released by the Forest Service from southern California fire assignments and were headed for their home base in Tucson, Arizona. While enroute, the crew of T1 engaged in taking in-flight photographs of T2 at an altitude of approximately 9,500 feet. T1 was flying in formation with T2 at his four to five o'clock position. The pilot of T1 stated over the radio that they were going to cross over to the other side of T2 to take more photographs. T2 gave permission and said that he would hold steady. The repositioning path T1 flew was a 45 degree overtaking angle from the four to five o'clock position toward the 10 to 11 o'clock position of T2. The vertical separation between the two airtankers was insufficient and a mid-air collision occurred. The vertical fin of T1 struck the right wing flap of T2. T1's fin and rudder were sheared off by that impact. The retardant tanks of T2 compressed the top aft end of the fuselage of T1. The number two propeller of T2 severed the fuselage of T1 approximately 10 feet in front of its horizontal stabilizer. T1's tail section was separated from the rest of the airtanker at that time, rendering it out of control. The pilot of T2 radioed Palm Springs Approach Control at 13:50, declared an emergency, and apprised them of the collision. T2 landed safely at the Palm Springs Airport at 13:56. After T1 experienced the tail separation, they lost altitude rapidly. T1 dropped debris for about a mile and a half until it cut through two power lines and then struck the earth nose first. There was a post-mishap fire. The captain and copilot were fatally injured. The tail section of T1 was found approximately two and a half miles from the main wreckage site. T2's damage consisted of damage to the right wing flap, scrapes and punctures to the retardant tank, damage to the right wheel compartment, badly \"chewed up\" propeller blades on the number two engine, a hole in the left wing, a dented left horizontal stabilizer on the tail, and various other damage.\r\nSource: ASN", "probable_cause": null}