{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-chibougamau-2-killed", "date": "Oct 25, 2007 at 0859 LT", "type": "Beechcraft 100 King Air", "operator": "Air%20Creebec", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Val d’Or – Chibougamau", "msn": "B-178", "yom": 1973, "flight_number": "CRQ501", "city": "Chibougamau", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1800, "captain_hours_type": 122, "copilot_hours": 1022, "copilot_hours_type": 71, "aircraft_hours": null, "circumstances": "The Beechcraft A100 (registration C-FNIF, serial number B-178), operated by Air Creebec Inc. on flight CRQ 501, was on a flight following instrument flight rules between Val-d’Or, Quebec, and Chibougamau/Chapais, Quebec, with two pilots on board. The aircraft flew a non-precision approach on Runway 05 of the Chibougamau/Chapais Airport, followed by a go-around. On the second approach, the aircraft descended below the cloud cover to the left of the runway centreline. A right turn was made to direct the aircraft towards the runway, followed by a steep left turn to line up with the runway centreline. Following this last turn, the aircraft struck the runway at about 500 feet from the threshold. A fire broke out when the impact occurred and the aircraft continued for almost 400 feet before stopping about 50 feet north of the runway. The first responders tried to control the fire using portable fire extinguishers but were not successful. The Chibougamau and Chapais fire departments arrived on the scene at about 0926 eastern daylight time, which was about 26 minutes after the crash. The aircraft was destroyed by the fire. The two pilots suffered fatal injuries.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The aircraft was configured late for the approach, resulting in an unstable approach condition.\r\n2. The pilot flying carried out a steep turn at a low altitude, thereby increasing the load factor. Consequently, the aircraft stalled at an altitude that was too low to allow the pilot to carry out a stall recovery procedure. \r\nFindings as to Risk:\r\n1. The time spent programming the global positioning system reduced the time available to manage the flight. Consequently, the crew did not make the required radio communications on the mandatory frequency, did not activate the aircraft radio control of aerodrome lighting (ARCAL), did not make the verbal calls specified in the standard operating procedures (SOPs), and configured the aircraft for the approach and landing too late.\r\n2. During the second approach, the aircraft did a race-track pattern and descended below the safe obstacle clearance altitude, thereby increasing the risk of a controlled flight into terrain. The crew’s limited instrument flight rules (IFR) experience could have contributed to poor interpretation of the IFR procedures.\r\n3. Non-compliance with communications procedures in a mandatory frequency area created a situation in which the pilots of both aircraft had poor knowledge of their respective positions, thereby increasing the risk of collision.\r\n4. The pilot-in-command monitored approach (PICMA) procedure requires calls by the pilot not flying when the aircraft deviates from pre-established acceptable tolerances. However, no call is required to warn the pilot flying of an approaching steep bank. \r\n5. The transfer of controls was not carried out as required by the PICMA procedure described in the SOPs. The transfer of controls at the co-pilot’s request could have taken the pilot-in-command by surprise, leaving little time to choose the best option.\r\n6. Despite their limited amount of IFR experience in a multiple crew working environment, the two pilots were paired. Nothing prohibited this. Although the crew had received crew resource management (CRM) training, it still had little multiple crew experience and consequently little experience in applying the basic principles of CRM.\r\nOther Findings:\r\n1. The emergency locator transmitter (ELT) had activated after the impact but due to circuit board damage its transmission power was severely limited. This situation could have had serious consequences had there been any survivors.\r\n2. The Chibougamau/Chapais airport does not have an aircraft rescue and firefighting service. Because the fire station is 23 kilometres from the airport, the firefighters arrived at the scene 26 minutes after the accident.\r\n3. Although this accident does not meet the criteria of a controlled flight into terrain (CFIT), it nonetheless remains that a stabilized constant descent angle (SCDA) non-precision approach (NPA) would have provided an added defence tool to supplement the SOPs. \r\n4. After the late call within the mandatory frequency (MF) area, the specialist at the Québec flight information centre asked the crew about its familiarity with the MF area while the aircraft was in a critical phase of the first approach, which was approaching the minimum descent altitude (MDA). This situation could have distracted the flight crew while they completed important tasks.\r\n5. The standard checklist used by the flight crew made no reference to the enhanced ground proximity warning system (EGPWS). Therefore, the crew was not prompted to check it to ensure that it was properly activated before departure. "}