{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-giv-le-castellet-3-killed", "date": "Jul 13, 2012 at 1518 LT", "type": "Gulfstream GIV", "operator": "Universal%20Jet%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Nice - Le Castellet", "msn": "1005", "yom": 1987, "flight_number": "UJT823", "city": "Le Castellet", "zone": "Var", "country": "France", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 22129, "captain_hours_type": 690, "copilot_hours": 1350, "copilot_hours_type": 556, "aircraft_hours": 12210, "circumstances": "The crew, consisting of a Captain and a co-pilot, took off at around 6 h 00 for a flight between Athens and Istanbul Sabiha Gokcen (Turkey). A cabin aid was also on board the aeroplane. The crew then made the journey between Istanbul and Nice (06) with three passengers. After dropping them off in Nice, the aeroplane took off at 12 h 56 for a flight to Le Castellet aerodrome in order to park the airplane for several days, the parking area at Nice being full. The Captain, in the left seat, was Pilot Monitoring (PM). The copilot, in the right seat, was Pilot Flying (PF). Flights were operated according to US regulation 14 CFR Part 135 (special rules applicable for the operation of flights on demand). The flight leg was short and the cruise, carried out at FL160, lasted about 5 minutes. At the destination, the crew was cleared to perform a visual approach to runway 13. The autopilot and the auto-throttle were disengaged, the gear was down and the flaps in the landing position. The GND SPOILER UNARM message, indicating nonarming of the ground spoilers, was displayed on the EICAS and the associated single chime aural warning was triggered. This message remained displayed on the EICAS until the end of the flight since the crew forgot to arm the ground spoilers during the approach. At a height of 25 ft, while the aircraft was flying over the runway threshold slightly below the theoretical descent path, a SINK RATE warning was triggered. The PF corrected the flight path and the touchdown of the main landing gear took place 15 metres after the touchdown zone - that’s to say 365 metres from the threshold - and slightly left of the centre line of runway 13(3). The ground spoilers, not armed, did not automatically deploy. The crew braked and actuated the deployment of the thrust reversers, which did not deploy completely(4). The hydraulic pressure available at brake level slightly increased. The deceleration of the aeroplane was slow. Four seconds after touchdown, a MASTER WARNING was triggered. A second MASTER WARNING(5) was generated five seconds later. The nose landing gear touched down for the first time 785 metres beyond the threshold before the aeroplane’s pitch attitude increased again, causing a loss of contact of the nose gear with the ground. The aircraft crossed the runway centre line to the right, the crew correcting this by a slight input on the rudder pedals to the left. They applied a strong nose-down input and the nose gear touched down on the runway a second time, 1,050 metres beyond the threshold. The speed brakes were then manually actuated by the crew with an input on the speed brake control, which then deployed the panels. Maximum thrust from the thrust reversers was reached one second later(6). The aircraft at this time was 655  metres from the runway end and its path began to curve to the left. In response to this deviation, the crew made a sharp input on the right rudder pedal, to the stop, and an input on the right brake, but failed to correct the trajectory. The aeroplane, skidding to the right(7), ran off the runway to the left 385 metres from the runway end at a ground speed of approximately 95 knots. It struck a runway edge light, the PAPI of runway 31, a metal fence then trees and caught fire instantly. An aerodrome firefighter responded quickly onsite but did not succeed in bringing the fire under control. The occupants were unable to evacuate the aircraft.", "probable_cause": "Forgetting to arm the ground spoilers delayed the deployment of the thrust reversers despite their selection. Several MASTER WARNING alarms were triggered and the deceleration was low. The crew then responded by applying a strong nose-down input in order to make sure that the aeroplane stayed in contact with the ground, resulting in unusually high load for a brief moment on the nose gear. After that, the nose gear wheels deviated to the left as a result of a left input on the tiller or a failure in the steering system. It was not possible to establish a formal link between the high load on the nose gear and this possible failure. The crew was then unable to avoid the runway excursion at high speed and the collision with trees. The aerodrome fire-fighter, alone at the time of the intervention, was unable to bring the fire under control after the impact. Although located outside of the runway safety\r\narea on either side of the runway centre line, as provided for by the regulations, the presence of rocks and trees near the runway contributed to the consequences of the accident.\r\nThe accident was caused by the combination of the following factors:\r\n- The ground spoilers were not armed during the approach,\r\n- A lack of a complete check of the items with the ‘‘before landing’’ checklist, and more generally the UJT crews’ failure to systematically perform the checklists as a challenge and response to ensure the safety of the flight,\r\n- Procedures and ergonomics of the aeroplane that were not conducive to monitoring the extension of the ground spoilers during the landing,\r\n- A possible left input on the tiller or a failure of the nose gear steering system having caused its orientation to the left to values greater than those that can be commanded using the rudder pedals, without generating any warning,\r\n- A lack of crew training in the ‘‘Uncommanded Nose Wheel Steering’’ procedure, provided to face uncommanded orientations of the nose gear,\r\n- An introduction of this new procedure that was not subject to a clear assessment by Gulfstream or the FAA,\r\n- Failures in updating the documentation of the manufacturer and the operator,\r\n- Monitoring by the FAA that failed to detect both the absence of any updates of this documentation and the operating procedure for carrying out checklists by the operator."}