{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-long-beach-5-killed", "date": "Mar 16, 2011 at 1029 LT", "type": "Beechcraft 200 Super King Air", "operator": "Carde Equipment Sales", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Long Beach - Salt Lake City", "msn": "BB-849", "yom": 1981, "flight_number": null, "city": "Long Beach", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 2080, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Witnesses reported that the airplane’s takeoff ground roll appeared to be normal. Shortly after the airplane lifted off, it stopped climbing and yawed to the left. Several witnesses heard abnormal sounds, which they attributed to propeller blade angle changes. The airplane’s flight path deteriorated to a left skid and its airspeed began to slow. The airplane’s left bank angle increased to between 45 and 90 degrees, and its nose dropped to a nearly vertical attitude. Just before impact, the airplane’s bank angle and pitch began to flatten out. The airplane had turned left about 100 degrees when it impacted the ground about 1,500 feet from the midpoint of the 10,000-foot runway. A fire then erupted, which consumed the fuselage. Review of a security camera video of the takeoff revealed that the airplane was near the midpoint of the runway, about 140 feet above the ground, and at a ground speed of about 130 knots when it began to yaw left. The left yaw coincided with the appearance, behind the airplane, of a dark grayish area that appeared to be smoke. A witness, who was an aviation mechanic with extensive experience working on airplanes of the same make and model as the accident airplane, reported hearing two loud “pops” about the time the smoke appeared, which he believed were generated by one of the engines intermittently relighting and extinguishing. Post accident examination of the airframe, the engines, and the propellers did not identify any anomalies that would have precluded normal operation. Both engines and propellers sustained nearly symmetrical damage, indicating that the two engines were operating at similar low- to mid-range power settings at impact. The airplane’s fuel system was comprised of two separate fuel systems (one for each engine) that consisted of multiple wing fuel tanks feeding into a nacelle tank and then to the engine. The left and right nacelle tanks were breached during the impact sequence and no fuel was found in either tank. Samples taken from the fuel truck, which supplied the airplane's fuel, tested negative for contamination. However, a fuels research engineer with the United States Air Force Fuels Engineering Research Laboratory stated that water contamination can result from condensation in the air cavity above a partially full fuel tank. Both diurnal temperature variations and the atmospheric pressure variations experienced with normal flight cycles can contribute to this type of condensation. He stated that the simplest preventive action is to drain the airplane’s fuel tank sumps before every flight. There were six fuel drains on each wing that the Pilot’s Operating Handbook (POH) for the airplane dictated should be drained before every flight. The investigation revealed that the pilot’s previous employer, where he had acquired most of his King Air 200 flight experience, did not have its pilots drain the fuel tank sumps before every flight. Instead, maintenance personnel drained the sumps at some unknown interval. No witnesses were identified who observed the pilot conduct the preflight inspection of the airplane before the accident flight, and it could not be determined whether the pilot had drained the airplane’s fuel tank sumps. He had been the only pilot of the airplane for its previous 40 flights. Because the airplane was not on a Part 135 certificate or a continuous maintenance program, it is unlikely that a mechanic was routinely draining the airplane's fuel sumps. The witness observations, video evidence, and the postaccident examination indicated that the left engine experienced a  momentary power interruption during the takeoff initial climb, which was consistent with a power interruption resulting from water contamination of the left engine's fuel supply. It is likely that, during the takeoff rotation and initial climb, water present in the bottom of the left nacelle tank was drawn into the left engine. When the water flowed through the engine's fuel nozzles into the burner can, it momentarily extinguished the engine’s fire. The engine then stopped producing power, and its propeller changed pitch, resulting in the propeller noises heard by witnesses. Subsequently, a mixture of water and fuel reached the nozzles and the engine intermittently relighted and extinguished, which produced the grayish smoke observed in the video and the “pop” noises heard by the mechanic witness. Finally, uncontaminated fuel flow was reestablished, and the engine resumed normal operation. About 5 months before the accident, the pilot successfully completed a 14 Code of Federal Regulations Part 135 pilot-in-command check flight in a King Air 90. However, no documentation was found indicating that he had ever received training in a full-motion King Air simulator. Although simulator training was not required, if the pilot had received this type of training, it is likely that he would have been better prepared to maintain directional control in response to the left yaw from asymmetrical power. Given that the airplane’s airspeed was more than 40 knots above the minimum control speed of 86 knots when the left yaw began, the pilot should have been able to maintain directional control during the momentary power interruption. Although the airplane’s estimated weight at the time of the accident was about 650 pounds over the maximum allowable gross takeoff weight of 12,500 pounds, the investigation determined that the additional weight would not have precluded the pilot from maintaining directional control of the airplane.", "probable_cause": "The pilot’s failure to maintain directional control of the airplane during a momentary interruption of power from the left engine during the initial takeoff climb. Contributing to the accident was the power interruption due to water contamination of the fuel, which was likely not drained from the fuel tanks by the pilot during preflight inspection as required in the POH.\n"}