{"url": "https://www.baaa-acro.com/crash/crash-cessna-414a-chancellor-ii-bournemouth", "date": "May 15, 1984 at 1427 LT", "type": "Cessna 414 Chancellor", "operator": "Flight-Refuelling", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bournemouth - Bournemouth", "msn": "414A-0220", "yom": 1979, "flight_number": null, "city": "Bournemouth-Hurn", "zone": "Dorset", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14800, "captain_hours_type": 1600, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After the second overshoot, the aircraft entered the circuit, and was cleared for a touch-and-go landing on Runway 17. The final approach was described as 'steep' and was flown with full (45°) flap. After a short ground run, the pilot under training opened the throttles, and. at about 80 knots, rotated the aircraft with the flaps still at the full (45 degree) setting. Shortly after becoming airborne, there was a loss of power, accompanied by vibration or buffeting; the aircraft yawed and rolled to the right, and the airspeed started to decay. The pilot under training then retracted the flaps to 30°, and, at this point, the instructor took control, closed the throttles, and landed the aircraft on the grass on a heading of about 200° magnetic. The aircraft than ran across the south western taxiway, through the airfield perimeter fence, across a public road, at which point the undercarriage collapsed, before finally coming to rest in an adjacent field. Both fuel tanks were ruptured by the impact with the fence posts, but there was no fire. The crew, who were uninjured, shut off the fuel cocks, switched off the electrics, and vacated the aircraft through the main entry door. The emergency services responded to this incident very quickly, and had arrived at the crash scene by the time the crew vacated the aircraft.", "probable_cause": "A safe climb out could not be achieved following the complete loss of power from one engine just when the aircraft became airborne at a speed of about 80 knots with full flap extended. The commander was therefore left with no alternative but to land whilst it was still possible to control the aircraft. "}