{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a90-king-air-alice-4-killed", "date": "Aug 12, 1997 at 1153 LT", "type": "Beechcraft 90 King Air", "operator": "South Texas Aircraft", "flight_phase": "Takeoff (climb)", "flight_type": "Demonstration", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Alice - Alice", "msn": "LJ-242", "yom": 1967, "flight_number": null, "city": "Alice", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 17710, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7250, "circumstances": "The flight was part of a pre-buy inspection of the airplane. Witnesses reported the airplane did not climb more than 200 feet above ground level (agl) after takeoff. The airplane entered a shallow left turn and completed about 210 degrees of heading change before it impacted a flat field near the approach end of runway 26. Witnesses reported that the landing gear were retracted and that the engines sounded like they running at high power, but the airplane did not accelerate or climb normally. The airspeed was slow and 'mushy.' The engines' gas generator sections exhibited strong rotational scoring. The engines' power sections exhibited light rotational signatures. The left and right propellers exhibited minimal leading edge damage. Both propellers exhibited high blade angles. The secondary low pitch stops (SLPS) had been installed on the aircraft four days prior to the accident. A ground check, but no flight check, had been conducted. The SLPS sensors were found in the full aft position on the mounting bracket, not in the normal mid-range position. The SLPS control box installed on the aircraft was an updated box and was incompatible with the existing wiring. ", "probable_cause": "Loss of control due to the pilot's improper in-flight decision. A factor was the improper installation of the secondary low pitch stop system by the mechanic. "}