{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-131-east-moriches-230-killed", "date": "Jul 17, 1996 at 2031 LT", "type": "Boeing 747-100", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "New York – Paris", "msn": "20083", "yom": 1971, "flight_number": "TW800", "city": "East Moriches", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 18, "crew_fatalities": 18, "pax_on_board": 212, "pax_fatalities": 212, "other_fatalities": 0, "total_fatalities": 230, "captain_hours": 18800, "captain_hours_type": 5490, "copilot_hours": 17000, "copilot_hours_type": 4700, "aircraft_hours": 93303, "circumstances": "On July 17, 1996, about 2031 eastern daylight time, Trans World Airlines, Inc. (TWA) flight 800, a Boeing 747-131, N93119, crashed in the Atlantic Ocean near East Moriches, New York. TWA flight 800 was operating under the provisions of 14 Code of Federal Regulations Part 121 as a scheduled international passenger flight from John F. Kennedy International Airport (JFK), New York, New York, to Charles De Gaulle International Airport, Paris, France. The flight departed JFK about 2019, with 2 pilots, 2 flight engineers, 14 flight attendants, and 212 passengers on board. All 230 people on board were killed, and the airplane was destroyed. Visual meteorological conditions prevailed for the flight, which operated on an instrument flight rules flight plan. The investigation revealed that the crash occurred as the result of a fuel/air explosion in the airplane's center wing fuel tank (CWT) and the subsequent in-flight breakup of the airplane. The investigation further revealed that the ignition energy for the CWT explosion most likely entered the CWT through the fuel quantity indication system wiring; neither the ignition energy release mechanism nor the location of the ignition inside the CWT could be determined from the available evidence. There was no evidence of a missile or bomb detonation.", "probable_cause": "An explosion of the center wing fuel tank (CWT), resulting from ignition of the flammable fuel/air mixture in the tank. The source of ignition energy for the explosion could not be determined with certainty, but, of the sources evaluated by the investigation, the most likely was a short circuit outside of the CWT that allowed excessive voltage to enter it through electrical wiring associated with the fuel quantity indication system. Contributing factors to the accident were the design and certification concept that fuel tank explosions could be prevented solely by precluding all ignition sources and the design and certification of the Boeing 747 with heat sources located beneath the CWT with no means to reduce the heat transferred into the CWT or to render the fuel vapor in the tank non flammable. "}