{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-10-dc-skymaster-sanya-10-killed", "date": "Jul 23, 1954 at 0845 LT", "type": "Douglas C-54 Skymaster", "operator": "Cathay-Pacific-21", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Bangkok – Hong Kong", "msn": "10310", "yom": 1944, "flight_number": null, "city": "Sanya (Hainan Island)", "zone": "Hainan", "country": "China", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 14, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15279, "circumstances": "While cruising over the China Sea on a flight from Bangkok to Hong Kong, the aircraft was attacked and shot down by two Chinese Air Force Lavochkin La-7. Both engines number one and four caught fire. While the radio operator declared an emergency to ATC based at Hong Kong-Kai Tak Airport, the pilot decided to reduce his altitude in an attempt to make an emergency landing. While descending to an altitude of 2,000 feet, the right aileron was sheared off. The captain elected to ditch the aircraft that eventually crashed into the sea off the city of Sanya, on the south coast of Hainan Island. Two USAF Douglas AD-4 Skyraider were dispatched to locate the crash site but both were also attacked by the Chinese fighters. Later, a USN Albatross was eventually able to land in the area where eight people, two crew members and six passengers, were rescued. Ten other occupants were killed and the aircraft sank and was lost.", "probable_cause": "Shot down by Chinese fighters. The reason of the occurrence remained unclear but later, Cathay Pacific received an apology and compensation from the People's Liberation Army Air Force. Apparently, the fighters pilots mistook the Cathay aircraft for a Nationalist Chinese military airplane. "}