{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-mollet-lake-3-killed", "date": "Oct 8, 2001 at 1730 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Air%20Saint-Maurice", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Iyachisakus Lake - Mollet Lake", "msn": "810", "yom": 1955, "flight_number": null, "city": "Mollet Lake", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 900, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13140, "circumstances": "The float-equipped Beaver de Havilland DHC-2 Mk 1, registration C-GPUO, serial number 810, took off at 1710 eastern daylight time from Iyachisakus Lake, Quebec, with the pilot and six passengers on board, for a visual flight rules flight to an outfitter on Mollet Lake, 26 nautical miles (nm) to the east. At about 1730, a witness at the outfitter heard the seaplane flying on an easterly heading to the south of the lake. About 20 minutes later, noting that the aircraft had not arrived at the dock, the manager of the outfitter sent a boat to look for C-GPUO. The Beaver was found 1 nm east of the outfitter. It was lying partly submerged in Mollet Lake near the north shore, with the nose in the water and leaning backward. Four injured occupants who were clinging to the fuselage were rescued. The pilot and two of the passengers were fatally injured.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The seaplane stalled at an altitude that did not allow the pilot time to recover from the stall.\r\n2. The stall occurred in circumstances conducive to illusions created by drift.\r\nFindings as to Risks:\r\n1. The aircraft was not equipped with a stall warning device, which could have alerted the pilot to the onset of a stall.\r\n2. The chances of surviving the impact would have been improved if the front seat occupants had been wearing their shoulder harnesses as prescribed by aviation regulations.\r\n3. Life jackets were available, but the occupants who evacuated the aircraft do not seem to have had time to find, retrieve, and don them.\r\n4. The emergency locator transmitter was not capable of emitting a distress signal because a short circuit occurred when the antenna came into contact with the water."}