{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6b2-h2-turbo-porter-laon-9-killed", "date": "Nov 1, 1997 at 1140 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "Centre Ecole Régional Parachutisme de Picardie", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Laon - Laon", "msn": "620", "yom": 1966, "flight_number": null, "city": "Laon-Chambry", "zone": "Aisne", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 1192, "captain_hours_type": 24, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 20315, "circumstances": "The single engine aircraft was engaged in a local skydiving flight on behalf of the CERP of Picardie. After takeoff from runway 35, while climbing to a height of about 1,000 feet, the aircraft rolled to the right, entered an uncontrolled descent and crashed in a swampy area located about 1,500 metres east of the airfield. The aircraft was totally destroyed and all nine occupants were killed. ", "probable_cause": "The accident was the result of a loss of pitch control of the aircraft following the appearance of extreme forces on the elevator control caused by placing the stabilizer in the full nose down position depth. The actions of the pilot on the flight controls led to this situation of aerodynamic locking of the elevator stabilizer control, presumably interpreted as a mechanical blockage of the system. This phenomenon, specific to airplanes equipped with such a stabilizer system depth and linked to the importance of the forces involved, was it not known to the pilot. The training on PC-6/B2-H4 that the pilot had followed as well as his weak experience on PC-6/B2-H2, associated with the ergonomics of the manual flaps and stabilizer, are contributing factors."}