{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-near-coleman-3-killed", "date": "Feb 20, 2020 at 0600 LT", "type": "Beechcraft 200 Super King Air", "operator": "TLC Air", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Abilene – Harlingen", "msn": "BB-1067", "yom": 1982, "flight_number": null, "city": "Coleman", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 5300, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot and two passengers departed on an instrument flight rules cross-country flight in night instrument meteorological conditions (IMC). The pilot was instructed by air traffic control to climb to 12,000 ft, and then cleared to climb to FL230. The pilot reported to the controller that the airplane encountered freezing drizzle and light rime icing during the climb from 6,500 ft to 8,000 ft mean sea level (msl). As the airplane climbed through 11,600 ft msl, the pilot reported that they had an issue with faulty deicing equipment and needed to return to the airport. The controller instructed the pilot to descend and cleared the airplane back to the airport. When asked by the controller if there was an emergency, the pilot stated that they “blew a breaker,” and were unable to reset it. As the controller descended the airplane toward the airport, the pilot reported that they were having issues with faulty instruments. At this time, the airplane was at an altitude of about 4,700 ft. The controller instructed the pilot to maintain 5,000 ft, and the pilot responded that he was “pulling up.” There was no further communication with the pilot. Review of the airplane’s radar track showed the airplane’s departure from the airport and the subsequent turn and southeast track toward its destination. The track appeared as a straight line before a descending, right turn was observed. The turn radius decreased before the flight track ended. The airplane impacted terrain in a right-wing-low attitude. The wreckage was scattered and highly fragmented along a path that continued for about 570 ft. Examination of the wreckage noted various pieces of the flight control surfaces and cables in the wreckage path. Control continuity could not be established due the fragmentation of the wreckage; however, no preimpact anomalies were found. Examination of the left and right engines found rotational signatures and did not identify any pre-impact anomalies. A review of maintenance records noted two discrepancies with the propeller deice and surface deice circuit breakers, which were addressed by maintenance personnel. Impact damage and fragmentation prevented determination of which circuit breaker(s) the pilot was having issues with or an examination of any deicing systems on the airplane. The radio transmissions and transponder returns reflected in the radar data indicate that the airplane’s electrical system was operational before the accident. It is likely that the pilot’s communications with the controller and attempted troubleshooting of the circuit breakers introduced distractions from his primary task of monitoring the flight instruments while in IMC. Such interruptions would make him vulnerable to misleading vestibular cues that could adversely affect his ability to effectively interpret the instruments and maintain control of the airplane. The pilot’s report of “faulty instruments” during a decreasing radius turn and his initial distraction with the circuit breakers and radio communications is consistent with the effects of spatial disorientation.", "probable_cause": "The pilot’s loss of airplane control due to spatial disorientation. Contributing to the accident was the pilot’s distraction with a “popped” circuit breaker and communications with air traffic control."}