{"url": "https://www.baaa-acro.com/crash/crash-bae-3101-jetstream-31-skien", "date": "Nov 30, 2001 at 1828 LT", "type": "BAe Jetstream 31", "operator": "European%20Executive%20Express", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bergen - Skien", "msn": "636", "yom": 1984, "flight_number": "EXC204", "city": "Skien", "zone": "Vestfold og Telemark", "country": "Norway", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 11, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6590, "captain_hours_type": 600, "copilot_hours": 1700, "copilot_hours_type": 390, "aircraft_hours": 14074, "circumstances": "The aircraft was on its way to Skien with a crew of two and 11 passengers. During the flight, ice was observed on the aircraft’s wings, but the ice was considered to be too thin to be removed. During descent towards runway 19 at Geiteryggen the aircraft’s ground proximity warning system (GPWS) sounded a total of three times. The aircraft was then in clouds and the crew did not have visual contact with the ground. The warnings, combined with somewhat poorly functioning crew coordination, resulted in the crew forgetting to actuate the system for removing ice from the wings. The subsequent landing at 1828 hrs was unusually hard, and several of the passengers thought that the aircraft fell the last few metres onto the runway. The hard landing caused permanent deformation of the left wing so that the left-hand landing gear was knocked out of position, and the left propeller grounded on the runway. The crew lost directional control and the aircraft skewed to the left and ran off the runway. The aircraft then hit a gravel bank 371 metres from the touchdown point. The collision with the gravel bank was so hard that the crew and several of the passengers were injured and the aircraft was a total loss. It was dark, light rain and 4 °C at Geiteryggen when the accident occurred. The wind was stated to be 120° 10 kt. The investigation shows that it is probable that ice on the wings was the initiating factor for the accident. The AIBN has not formed an opinion on whether the ice resulted in the high sink rate after the first officer reduced the power output of the engines, or whether the aircraft stalled before it hit the runway. Investigation has to a large extend focused on the crew composition and training. A systematic investigation of the organisation has also taken place. In the opinion of the AIBN, the company has principally based its operations on minimum standards, and this has resulted in a number of weaknesses in organisation, procedures and quality assurance. These conditions have indirectly led to the company operating the route Skien – Bergen with a crew that, at times, did not maintain the standard that is expected for scheduled passenger flights. The investigation has also revealed that procedures for de-icing of the aircraft wings could be improved. ", "probable_cause": "Significant investigation results:\r\na) The decision was made to wait to remove the ice from the wings because, according to the SOP, it should only be removed if it had been “typically half an inch on the leading edge”. This postponement was a contributory factor in the ice being forgotten.\r\nb) At times, the relationship between the flight crew members was very tense during the approach to Skien. This led to a breakdown in crew coordination. \r\nc) Among the consequences of the warnings from the GPWS was a very high workload for the crew. In combination with the defective crew coordination, this contributed to the ice on the wings being forgotten.\r\nd) It is probable that the aircraft hit the runway with great force because the wings were contaminated with ice. The AIBN is not forming a final opinion on whether the wings stalled, whether the aircraft developed a high sink rate due to ice accretion or whether the hard landing was due to a combination of the two explanatory models.\r\ne) The company could only provide documentary evidence to show that the Commander had attended an absolute minimum of training after being employed within the company. Parts of the mandatory training had taken place by means of self-study without any form of formal verification of achievement of results.\r\nf) The company’s operation was largely based on minimum solutions. This reduced the safety margins within company operations.\r\ng) The company’s quality system contributed little to ensuring ‘Safe Operational Practices’ in the company.\r\nh) Authority inspection of the company was deficient."}