{"url": "https://www.baaa-acro.com/crash/crash-bae-3102-jetstream-31-doncaster", "date": "Aug 15, 2014 at 1936 LT", "type": "BAe Jetstream 31", "operator": "LinksAir", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Belfast – Doncaster", "msn": "785", "yom": 1987, "flight_number": "LNQ207", "city": "Doncaster-Sheffield-Robin Hood", "zone": "South Yorkshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8740, "captain_hours_type": 3263, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "G-GAVA took off from Belfast City Airport at 1745 hrs operating a scheduled air service to Doncaster Sheffield Airport with one passenger and a crew of two pilots on board. The commander was the Pilot Flying (PF) and the co-pilot was the Pilot Monitoring (PM). The departure, cruise and approach to Doncaster Sheffield were uneventful. The 1820 hrs ATIS for the airport stated that the wind was from 260° at 5 kt, varying between 220° and 280°. Visibility was greater than 10 km, there were few clouds at 3,000 ft aal, the temperature was 17°C and the QNH was 1,019 hPa. Although Runway 02 was the active runway, the crew requested radar vectors for a visual final approach to Runway 20, a request which was approved by ATC. The load sheet recorded that the aircraft’s mass at landing was expected to be 5,059 kg which required a target threshold indicated airspeed (IAS) of 101 kt. The aircraft touched down at 1836 hrs with an IAS of 102 kt and a peak normal acceleration of 1.3 g, and the commander moved the power levers aft to ground idle and then to reverse. As the aircraft decelerated, the commander moved the power levers forward to ground idle and asked the co-pilot to move the RPM levers to taxi. At an IAS of 65 kt, eight seconds after touchdown, the left wing dropped suddenly, the aircraft began to yaw to the left and the commander was unable to maintain directional control with either the rudder or the nosewheel steering tiller. The aircraft ran off the left side of the runway and stopped on the grass having turned through approximately 90°. The left landing gear had collapsed and the aircraft had come to a halt resting on its baggage pannier, right landing gear and left wing. The commander pulled both feather levers, to ensure that both engines were shut down, and switched the Electrics Master switch to emergency off. The co-pilot transmitted “tower……[callsign]” and the controller replied “[callsign] copied, emergency services on their way”. The commander instructed the co-pilot to evacuate the aircraft. The co-pilot moved into the main cabin where he found that the passenger appeared to be uninjured. He considered evacuating the aircraft through the emergency exit on the right side but judged that the main exit on the left side at the rear of the cabin would be the best option. The left side cabin door released normally but would not open completely because the sill of the doorway was at ground level (Figure 1) but, all occupants were able to evacuate the aircraft. The Aerodrome Controller in the ATC tower activated the Crash Alarm at 1836 hrs while the aircraft was still on the paved surface of the runway. Two Rescue and Fire Fighting Service vehicles arrived on scene at 1838 hrs by which time the occupants were clear of the aircraft.", "probable_cause": "The aircraft’s left main landing gear failed as a result of stress corrosion cracking in the forward pintle housing, at the top of the left landing gear cylinder. The landing gear material is known to be susceptible to stress corrosion cracking. The investigation determined that a design solution implemented by the aircraft manufacturer following the 2012 accident, which was intended to prevent stress corrosion cracking, had not met its original design intent."}