{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-chub-cay", "date": "Jan 5, 2022 at 0832 LT", "type": "Cessna 402", "operator": "Airway Air Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Miami - Chub Cay", "msn": "402B-1333", "yom": 1978, "flight_number": null, "city": "Chub Cay", "zone": "Berry Islands", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3000, "captain_hours_type": 350, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed the Opa Locka Executive Airport (KOPF), Opa Locka, Florida, USA at 7:52 AM EST (1252 UTC) with 2 persons on board enroute to the Chub Cay Int’l Airport. The aircraft was operated by Airway Air Charter INC (Venture Air Solutions INC), a Part 135 certificate holder under Title 14 US Code of Federal Regulations (CFR), Investigations revealed that the pilot in command arrived at the Opa Locka Airport at approximately 6:30 AM EST and conducted a pre-flight check of the aircraft, subsequently adding 66.5 gallons of 100LL avgas fuel to the main fuel tanks of the aircraft. No fuel was added to the auxiliary tanks. After completion of all pre-flight checks, and gaining clearance from Air Traffic Control, the aircraft departed at approximately 7:52 AM EST. Investigations revealed that the flight was uneventful, until descending into Chub Cay, at about 2,500 feet, when the left engine began to “sputter”. At this point the pilot executed the engine failure checklist, but shortly thereafter, the right engine began to “sputter” also. The pilot then contacted Miami air traffic center and advised of loss of power to both engines, which resulted in the aircraft crashing into waters.  The United States Coast Guard along with the Royal Bahamas Defense Force (RBDF) and Police Force (RBPF) were alerted. Joint aerial and marine assets were dispatched and additional assistance was provided by local mariners and pilots flying in the area to conduct search and rescue. Both occupants were located and rescued. They were later airlifted to the United States to receive further medical attention for minor injuries. Image from Google Earth of accident site and distance from Chub Cay Airport The location where the aircraft crashed was identified at coordinates 25° 24.884’ N and 077° 58.030’ W, approximately 4.48 NM west of the Chub Cay International Airport (MYBC), Berry Islands, Bahamas.", "probable_cause": "The AAIA has determined the probable cause of this accident to be dual system component failure – powerplant. A contributing factor was a loss of engine power as a result of mismanagement of available fuel. "}