{"url": "https://www.baaa-acro.com/crash/crash-cessna-501-citation-isp-trier-4-killed", "date": "Jan 12, 2014 at 1152 LT", "type": "Cessna 501 Citation I", "operator": "Theo Steil", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Shoreham - Trier", "msn": "501-0231", "yom": 1981, "flight_number": null, "city": "Trier-Föhren", "zone": "Rhineland-Palatinate", "country": "Germany", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 4800, "captain_hours_type": 32, "copilot_hours": 1350, "copilot_hours_type": 550, "aircraft_hours": 4282, "circumstances": "On Friday, 10 January 2014, the airplane had flown from Trier to Shoreham, where it landed at 1456 UTC. Two pilots and two passengers were on board the aircraft. Over the weekend, the passengers wanted to participate in a hunt. On the afternoon of 11 January 2014 the PIC told the service provider, tasked by the aircraft owner with the flight planning, to prepone the scheduled return flight on Sunday, 12 January 2014, from 1400 UTC to 1015 UTC. In the ATC flight plan Trier-Föhren Airfield was the destination aerodrome and Luxembourg Airport the alternate aerodrome. According to the flight plan the change of flight rules from IFR to VFR was to occur at reporting point PITES. The handling agent at Shoreham Airport stated that the PIC and the co-pilot had arrived on Sunday at 0850 UTC. The airport made the recordings of a video camera for apron surveillance available to the BFU. These recordings show that the airplane was refuelled in the presence of the pilots. The two passengers arrived at 0936 UTC and about 11 minutes later the aircraft taxied from the apron. At 1000 UTC, the airplane took off from runway 20. At 1138:25 hrs, the co-pilot established contact with Langen Radar. At that time the airplane was in Flight Level (FL) 170. At 1142:51 hrs, after the airplane had descended to FL140, the controller issued the descent clearance to FL70. Approximately one minute later the controller said: \"… proceed direct destination again and descend altitude five thousand feet … Spangdahlem QNH one zero two five.\" The pilot in command acknowledged the clearance. At 1145:23 hrs the PIC said: \"… standing by for cancelling IFR.\" The controller answered: \"... roger, IFR is cancelled at one zero two five, your position is one five miles northwest of your destination airfield, squawk VFR, approved to leave.\" According to radar data, the airplane was approximately in FL90 and continued to fly with a southern heading. At 1147:26 hrs, about 5 NM east of the omnidirectional radio beacon Nattenheim (VOR NTM), the altitude was 4,900 ft AMSL. According to the radar data at 1148:10 hrs the airplane had reached 3,500 ft AMSL. The flight path continued east until 1149 hrs when, in the area of the city of Wittlich in an altitude of 3,500 ft AMSL, the airplane turned right. The ground speed was approximately 180 kt. In the course of the right turn until 1150:30 hrs, the altitude decreased further to about 2,800 ft AMSL and the ground speed to about 160 kt. At 1151:10 hrs the aircraft turned left maintaining altitude until it had reached a southern heading. From 1151:30 hrs on it continued to descend. At the time the airplane was approximately 6.7 NM from the runway threshold and about 0.5 NM north of the extended runway centre line. Approximately 15 seconds later it reached the extended runway centre line of runway 22 while it turned right into the final approach direction. It was in about 2,300 ft AMSL and approximately 5.7 NM from the runway. From 1152:20 hrs on, at approximately 4.6 NM from the threshold, the aircraft began to leave the extended runway centre line to the south. At that time, altitude was approximately 1,600 ft AMSL and ground speed about 160 kt. The last radar target was recorded at 1152:40 hrs with an altitude indication of approximately 1,300 ft AMSL and a ground speed of about 140 kt. The attention of several witnesses, located about 600 m north-east and south-east, respectively, of the accident site in the valley of the river Salm, was drawn to the airplane by engine noise. They congruently stated that the aircraft had come from the direction of the town Esch and flown in low altitude, below the fog or cloud cover, toward the south-west. One of the witnesses estimated the altitude was 15 to 20 m above the trees bordering the river Salm, approximately the same height as the open wire located in the area. According to congruent witnesses’ statements, the engine thrust was increased and the airplane pulled up shortly before reaching a wooded escarpment rising by about 60 m, banked left and disappeared in the fog. Immediately afterwards fire had become visible and impact noises had been heard. The airplane impacted the ground in an inverted position. The occupants suffered fatal injuries and the aircraft was destroyed. The Flugleiter (A person required by German regulation at uncontrolled aerodromes to provide aerodrome information service to pilots) at Trier-Fohren Airfield stated, that on the morning of the accident day, at about 1010 hrs, he had received a phone call from the PIC. During the call the arrival of the airplane had been announced for 1230 hrs. The Flugleiter had informed the PIC about the severe fog prevailing at the airfield. He had also told him that, if at all, he expected visibility would increase after 1330 or 1400 hrs. After the phone conversation the Flugleiter assumed, that the airplane would fly to another airport. According to statements by the PIC’s wife, she had talked with her husband on the landline and then witnessed the PIC’s phone conversation on his mobile phone with the passenger, where he was asked to prepone the return flight to late morning. An unexpected appointment of the passengers was named as reason for the wish. During a phone conversation prior to departure her husband had explained that he had talked with Trier Airfield and learned that fog was prevailing there and one would fly either to Hahn or Luxembourg. The son of the passengers stated at the police that on the morning of the day of the accident his father had called him. He had told him that the airplane would probably land at Frankfurt-Hahn Airport. He stated that for his parents there was no deadline pressure. He said, that for him it is “völlig unvorstellbar (entirely inconceivable)” that his father would pressure the pilot to fly to Trier. In the past deviation to another airport had often been the case. It had never been a problem. ", "probable_cause": "The accident was due to the following:\r\n- The Pilot in Command (PIC) decided to conduct the VFR approach even though he was aware of the prevailing instrument weather conditions at the airport,\r\n- It is likely that a wrong vertical profile was flown due to an erroneous selection on the navigation system,\r\n- Due to an insufficient situational awareness of the pilots the descent was not aborted in time.\r\nThe following factors contributed to the accident:\r\n- Insufficient Crew Resource Management (CRM)."}