{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t1-cheyenne-tyler-2-killed", "date": "Jul 13, 2017 at 0810 LT", "type": "Piper PA-31 Cheyenne", "operator": "T-210 Holdings", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tyler - Midland", "msn": "31T-8104030", "yom": 1981, "flight_number": null, "city": "Tyler-Pounds", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 17590, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5685, "circumstances": "The airline transport rated pilot and passenger departed on a cross-country business flight in a twin-engine, turbo-propeller-equipped airplane in day, visual meteorological conditions. Shortly after takeoff, the airplane banked left, descended, and impacted terrain about 1/2 mile from the end of the runway. There was not a post-crash fire and fuel was present on site. A postaccident airframe examination did not reveal any anomalies that would have precluded normal operation. Examination of the left engine found signatures consistent with the engine producing power at impact. Examination of the right engine revealed rotational scoring on the compressor turbine disc/blades, and rotational scoring on the upstream side of the power vane and baffle, which indicated that the compressor section was rotating at impact; however, the lack of rotational scoring on the power turbine disc assembly, indicated the engine was not producing power at impact. Testing of the right engine's fuel control unit, fuel pump, propeller governor, and overspeed governor did not reveal any abnormities that would have accounted for the loss of power. The reason for the loss of right engine power could not be determined based on the available information.", "probable_cause": "The loss of engine power and the subsequent pilot's loss of control for reasons that could not be determined because post-accident engine examination revealed no anomalies."}