{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-382g-32c-hercules-lokichoggio", "date": "Jun 10, 2005 at 1459 LT", "type": "Lockheed C-130 Hercules", "operator": "Transafrik2", "flight_phase": "Landing (descent or approach)", "flight_type": "Humanitarian", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "El Obeid – Lokichoggio", "msn": "4472", "yom": 1972, "flight_number": null, "city": "Lokichoggio", "zone": "Rift Valley", "country": "Kenya", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 19800, "captain_hours_type": 15000, "copilot_hours": 14225, "copilot_hours_type": null, "aircraft_hours": 51888, "circumstances": "A HS-748 suffered landing gear problems, causing the airplane to end up on its belly, blocking Lokichoggio's single 1800-metre runway 09/27. Three other light aircraft, a Dornier 228, an Antonov 28 and a Cessna 208, landed safely at the airfield on runway 27 after the HS-748 accident. Two Antonov 12 aircraft inbound to Lokichoggio from Torit, Southern Sudan, diverted to Juba upon getting information of the runway obstruction. Transafrik Hercules S9-BAS, flying for the United Nations World Food Programme, contacted Lokichoggio Tower at 14:30 hours. The aircraft was returning from a food air drop at Motot, Southern Sudan. The pilot was advised to divert to Eldoret International Airport but he opted to land at Lokichoggio. The Tower cleared the Hercules to land on runway 27 at the pilot’s discretion. The aircraft made a very heavy landing short of the runway and the top centre fuselage broke. The aircraft came to a stop about one kilometre from the touchdown point. Shortly before coming to a halt, the aircraft impacted the HS 748 with its right wing tip. The captain, the first officer, the flight engineer and the two loadmasters evacuated themselves safely. A repair crew started to work on S9-BAS on site at Lokichoggio in May 2006. The fuselage was repaired but the contractor left before repairs were completed. The airplane was seen in November 2008 parked at Lokichoggio without landing gear, engines and vertical stabilizer.", "probable_cause": "The probable cause of the Hercules accident was the captain’s improper decision to land on the blocked runway at Lokichoggio Airport."}