{"url": "https://www.baaa-acro.com/crash/crash-consolidated-b-24d-110-co-liberator-near-charley-river-4-killed", "date": "Dec 21, 1943", "type": "Consolidated B-24 Liberator", "operator": "USAAF", "flight_phase": "Flight", "flight_type": "Test", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Fort Wainwright - Fort Wainwright", "msn": "1987", "yom": null, "flight_number": null, "city": "Charley River", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Involved in a test flight (propeller test following maintenance), the aircraft was carrying a crew of five. In the morning, the crew left Ladd AAF located in Fort Wainwright, east of Fairbanks. At around 1100LT, the crew overflew Big Delta and maintained an altitude of 23,000 feet. While cruising in clouds, the number one engine failed. Shortly later, the pilot lost control of the aircraft that entered a spin. During the descent, the captain ordered the crew to abandon the aircraft but only two occupants managed to bail out. Out of control, the aircraft dove into the ground and eventually crashed in a huge explosion near the Charley River. By an outside temperature of -51° C, one of both crew that bailed out landed in a thick layer of snow and tried to find his colleague but without success. For six days, SAR operations cleaned out a large area but did not found any trace of the aircraft nor the five occupants. In extreme cold and appalling conditions, the First Lieutenant Leon Crane made 84 days before returning to civilization and eventually be transferred to his base. All rest of the crew did not survive the accident. \r\nCrew:\r\n2nd Lt Harold E. Hoskin, †\r\nM/Sgt Richard L. Pompeo, †\r\n1st Lt James B. Sibert, †\r\n1st Lt Leon Crane, \r\nS/Sgt Ralph S. Wenz. †", "probable_cause": "According to officials, the loss of control was caused by the failure of a Pitot tube while the elevators jammed during the descent, making it impossible to continue the flight in safe conditions. "}