{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-alliance", "date": "Feb 8, 2007 at 0225 LT", "type": "Cessna 208B Grand Caravan", "operator": "Suburban%20Air%20Freight", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Omaha - Alliance", "msn": "208-0368", "yom": 1993, "flight_number": "SUB022", "city": "Alliance", "zone": "Nebraska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3232, "captain_hours_type": 226, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7248, "circumstances": "The pilot was dispatched on a nonscheduled cargo flight to an airport other than his usual destination because it had a precision instrument approach, while his usual destination airport did not. The pilot elected to fly to his usual airport, and attempted a non precision instrument approach. The airport had both a VOR and an NDB approach. The NDB approach was noted as being out of service, although there was still a radio signal coming from the navigation aid. The pilot was cleared for the VOR approach, although instrumentation inside the cockpit was found set for the NDB approach, and radar track data disclosed that the flight path was consistent with the NDB approach path, not the VOR's. The airport's reported weather was 1.25 miles visibility, with a 200-foot overcast in mist. The airport's minimum NDB approach altitude is 652 feet above touchdown height. The airplane did not reach the runway, and collided with a pole and a building. Inspection of the airplane disclosed no evidence of any preimpact mechanical malfunctions.\n", "probable_cause": "The pilot's descent below minimum descent altitude while on a non precision approach. A contributing factor was a low ceiling."}