{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-560-ketchum-2-killed", "date": "Sep 8, 1995 at 1310 LT", "type": "Rockwell Aero Commander 560", "operator": "Elmer C. Rigby", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Elko - Hailey", "msn": "560-0219", "yom": 1955, "flight_number": null, "city": "Ketchum", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3400, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was VFR inbound to the Hailey airport when the pilot contacted the tower at 1247 and reported 10 miles south. During the next 7 minutes the pilot and controller communicated back and forth and the pilot never visually acquired the airport. A number of witnesses located north of the airport observed the aircraft flying northbound along the highway into upsloping, mountainous terrain at an estimated altitude of 400 feet above ground, and with the landing gear extended and the engines developing power. The aircraft was described as low and slow and was observed to dip its wings during a left turn and then descend steeply to the ground. The aircraft impacted terrain in a steep nose down attitude. There was no evidence of flight control or powerplant malfunctions. High density altitude conditions existed at the accident site. Toxicological examination revealed a finding of 0.068 ug/ml and 0.183 ug/ml of Chlorpheniramine (an over-the-counter antihistamine) in kidney and heart tissue respectively. ", "probable_cause": "The pilot-in-command's failure to maintain adequate airspeed during a turn resulting in a stall/spin. Factors contributing to the accident were the pilot-in-command's becoming geographically disoriented as well as his improper in-flight decision, and mountainous terrain. "}