{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-alma-1-killed", "date": "Mar 15, 2002 at 0200 LT", "type": "Cessna 208B Grand Caravan", "operator": "Priority%20Air%20Charter_0", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Minneapolis - Detroit", "msn": "208B-0049", "yom": 1987, "flight_number": null, "city": "Alma", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3800, "captain_hours_type": 1500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9942, "circumstances": "The pilot departed with the airplane contaminated with ice, into known severe icing conditions, and was unable to maintain altitude, subsequently impacting trees and terrain. Witnesses reported the accident airplane arrived at the departure airport contaminated with ice. Several witnesses stated they asked the pilot if he needed the airplane deiced prior to his next departure and the pilot stated he did not need any deice service. Several witnesses said they noticed the pilot chipping-off ice from the airplane prior to his departure. While en route the pilot reported the airplane had encountered icing conditions and he was unable to maintain altitude. Several thick pieces of ice were recovered around the accident site and one of the recovered ice pieces had a semicircular shaped edge that was consistent with a leading edge of an airfoil. No pre-impact anomalies were found with the leading edge de-ice boots that were installed on both wings, vertical and horizontal stabilizers, and wing struts. Federal Aviation Regulations state that all ice contamination shall be removed prior to flight. The Cessna 208B Pilot Operating Handbook indicates that continued flight into known icing conditions must be avoided.", "probable_cause": "The pilot not removing the ice contamination from the airplane prior to departure and the pilot intentionally flying into known severe icing conditions, resulting in the aircraft not being able to maintain altitude/clearance from the terrain. Factors to the accident included the icing conditions and the trees encountered during the forced landing."}