{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-20c-saint-louis", "date": "Apr 8, 2003 at 1850 LT", "type": "Dassault Falcon 20", "operator": "Grand%20Aire_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Del Rio – Saint Louis", "msn": "100", "yom": 1967, "flight_number": "GAE179", "city": "Saint Louis-Lambert", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3221, "captain_hours_type": 1270, "copilot_hours": 5758, "copilot_hours_type": 1532, "aircraft_hours": 15899, "circumstances": "The twin engine turbofan powered airplane was ditched into a river after a complete loss of power from both engines. The airplane was on a second approach to land on runway 30R after having been instructed by air traffic control (ATC) to climb during the final approach segment of the first approach due to inadequate separation from another airplane. Subsequent to the first approach, the airplane was issued vectors for the second approach by ATC. Communications transcripts show that the flight crew asked ATC how far they would be vectored during the second approach, but the flight crew did not inform ATC of their low fuel state until the airplane was already on a \"base turn...to join final.\" The airplane subsequently lost power from both engines. During interviews, both pilots stated that there were no problems with the airplane. The second-in-command (SIC) stated that the airplane \"ran out of fuel\" and that the fuel quantity indicators read 0 and 100 pounds when each respective engine stopped producing power. The SIC also stated that after being instructed to climb to 5,000 feet after their first approach, he questioned the pilot-in-command about landing at another airport located about 14 nautical miles west-southwest of the destination airport. The SIC said that the PIC elected to continue with the second approach to the original destination. Research indicated that the flight crew did not obtain a weather briefing prior to the accident flight. Additionally, the Terminal Aerodrome Forecast that was valid at the time the aircraft's flight plan was filed showed a forecast ceiling consisting of overcast clouds at 1,500 feet above ground level at the aircraft's arrival time at the destination. 14 CFR Part 91.169 requires that an alternate airport be listed in the flight plan when forecast ceilings are less than 2,000 feet. No alternate was listed in the flight plan for the accident flight. Additionally, 14 CFR Part 91.167 requires that aircraft operated in instrument meteorological conditions maintain fuel reserves that allow flight to the intended destination and then continued flight to the listed alternate, and an additional 45 minutes at normal cruise speed. In 1993, the FAA/industry advisory committee developed advisory material for fuel planning and management for 14 CFR Part 121 and 135 air carrier flight operations, but the material was never published. ", "probable_cause": "The pilot in command's improper in-flight decision not to divert to an alternate destination resulting in the exhaustion of the airplane's fuel supply, and his failure to relay his low fuel state to air traffic control in a timely manner."}