{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47-taizz-4-killed", "date": "Mar 19, 1969 at 0730 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Yemen%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Ta'izz - Ta'izz", "msn": null, "yom": null, "flight_number": null, "city": "Ta'izz", "zone": "Ta'izz (تعز)", "country": "Yemen", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 6000, "captain_hours_type": 5000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While the aircraft was being taxied into the hangar on 9 March 1969 for a Check III inspection the port elevator was damaged by contact with a set of passenger stairs. It was decided therefore to change the elevator during the inspection. The aircraft was test flown by the pilot-in-command after the inspection at 0600 hours on 18 March 1969. During the flight it was discovered that the elevator trim was ineffective. Subsequent examination revealed that the elevator trim tabs had been rigged in opposition, one up and one down. The aircraft was therefore returned to the hangar for rectification. A further test flight was scheduled at 0600 hours on the following day, i.e. 19 March. After completing the ground run and preflight check the aircraft was again returned to the hangar for further work on the elevator trim mechanism. One of the engineers reported that the elevator trim was \"very stiff\". The work was carried out by the pilot-in-command and an engineer, who were observed to carry out a functional check of trim operation after the work was completed. At 0730 hours the aircraft was lined up on the runway for take-off. The take-off and climb out were observed by two experienced witnesses and appeared to be quite normal. After a period of about two minutes and at an estimated height of 700 ft the aircraft made a turn to port through approximately 1600 at an estimated 300 bank angle. The aircraft was then seen to recover from the turn and immediately enter a dive which became progressively steeper until the aircraft struck the ground and burst into flames. All four crew members were killed. ", "probable_cause": "The accident was attributed to the incorrect assembly of the elevator trim tab mechanism. The resulting tab reversal induced an involuntary steep dive into the ground before there was time for recognition."}