{"url": "https://www.baaa-acro.com/crash/crash-lockheed-sp-2h-neptune-fresno", "date": "Jun 15, 2014 at 2044 LT", "type": "Lockheed P-2 Neptune", "operator": "Minden%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Fire fighting", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Porterville - Porterville", "msn": "726-7247", "yom": 1958, "flight_number": "Tanker 48", "city": "Fresno", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14410, "captain_hours_type": 2010, "copilot_hours": 5100, "copilot_hours_type": 2650, "aircraft_hours": 10484, "circumstances": "The captain reported that, while returning to the departure airport following an uneventful aerial drop, he noticed that the hydraulic pressure gauge indicated 0. The first officer subsequently verified that the sight gauge for the main hydraulic fluid reservoir was empty. The flight crew began performing the emergency gear extension checklist and verified that the nosewheel landing gear was extended. The captain stated that the first officer then installed the pin in the nosewheel landing gear as part of the emergency checklist. As the flight crewmembers diverted to a nearby airport because it had a longer runway and emergency resources, they briefed the no-flap landing. The first officer extended the main landing gear using the emergency gear release, which resulted in three down-and-locked landing gear indications. Subsequently, the airplane landed normally; however, during the landing roll, the nosewheel landing gear collapsed, and the airplane then came to rest nose low. Postaccident examination of the airplane revealed that the nosewheel landing gear pin was disengaged from the nosewheel jury strut, and the pin was not located. The disengagement of the pin allowed the nosewheel landing gear to collapse on landing. It could not be determined when or how the pin became disengaged from the jury strut. Installation of the pin would have required the first officer to maneuver in a small area and install the pin while the nose landing gear door was open and the gear extended. Further, the pin had a red flag attached to it. When inserted during flight, the flag encounters a high amount of airflow that causes it to vibrate; this could have resulted in the pin becoming disengaged after it was installed. Evidence of a hydraulic fluid leak was observed around the right engine cowling drain. The right engine hydraulic pump case was found cracked, and the backup ring was partially extruded, which is consistent with hydraulic system overpressurization. The reason for the overpressurization of the hydraulic system could not be determined during postaccident examination.", "probable_cause": "The collapse of the nosewheel landing gear due to the disengagement of the nosewheel landing gear pin. Contributing to the accident was the failure of the main hydraulic system due to overpressurization for reasons that could not be determined during postaccident examination of the airplane. "}