{"url": "https://www.baaa-acro.com/crash/crash-learjet-25c-ribeirao-preto-2-killed", "date": "Jun 4, 1996 at 1320 LT", "type": "Learjet 25", "operator": "Aeroexecutivos Taxi Aéreo", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "São Paulo – Uberaba – Ribeirão Preto", "msn": "25-165", "yom": 1974, "flight_number": null, "city": "Ribeirão Preto", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 1, "total_fatalities": 2, "captain_hours": 3500, "captain_hours_type": 250, "copilot_hours": 2000, "copilot_hours_type": 420, "aircraft_hours": null, "circumstances": "The crew departed São Paulo on a training flight to Ribeirão Preto with an intermediate stop in Uberaba. On approach to Ribeirão Preto-Leite Lopes Airport, the instructor decided to reduce power on the left engine to simulate a failure and to complete a touch-and-go manoeuvre. After touchdown, the left engine power lever remained in the idle position so the captain took over control and attempted to take off as he judged it impossible to stop on the remaining runway. The aircraft took off but landed back about 92 metres past the runway end. Out of control, it collided with a truck and a tree and came to rest, bursting into flames. A man in the truck as well as one pilot were killed while three other pilots were injured. The aircraft was destroyed. ", "probable_cause": "The following findings were reported: \r\n- There are indications of the presence of psychological variables that may have influenced the instructor's decision to perform the touch-and-go manoeuvre.\r\n- There was inadequate supervision, at the technical and operational level, by the aircraft operating company, due to the lack of training, inadequate instruction and absence of flight simulator training.\r\n- There was an error made by the pilots due to the inadequate use of the crew resources in the cockpit intended for the operation of the aircraft, due to an ineffective fulfillment of the tasks assigned to each of the crew and the non-observance of the operational rules.\r\n- Even though the crew was qualified for the type of flight, there was inadequate planning regarding the absence of a takeoff and landing briefing.\r\n- There was an error made by the copilot, when the delay in reducing the power levers, as soon as the locking of the left engine lever was established during the dash on the ground, with an inadequate assessment of the situation in this regard.\r\n- There was the participation of the training process received, due to quantitative and qualitative deficiency, which did not attribute to pilots the full technical conditions to be developed in the activity, regarding the lack of simulator training, lack of a company training program that included CRM and local flights, among others.\r\n- There are indications that the difficulties reported by the pilots in relation to the throttle were caused by the rupture of fibers in the cable that transfers its control to the FCU. This cable slides inside a corrugated cover and can be jammed if any fiber in the cable breaks."}