{"url": "https://www.baaa-acro.com/crash/crash-airbus-a321-231-near-hasna-224-killed", "date": "Oct 31, 2015 at 0613 LT", "type": "Airbus A321", "operator": "Metrojet1.png", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Desert", "schedule": "Sharm el-Sheikh - Saint Petersburg", "msn": "663", "yom": 1997, "flight_number": "KGL9268", "city": "Hasna", "zone": "North Sinai", "country": "Egypt", "region": "Africa", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 217, "pax_fatalities": 217, "other_fatalities": 0, "total_fatalities": 224, "captain_hours": 12000, "captain_hours_type": 3800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 55772, "circumstances": "The aircraft departed Sharm el-Sheikh at 0549LT bound for Saint Petersburg-Pulkovo Airport and was cleared to climb to FL350. On board were 217 passengers and a crew of seven. Some 23 minutes after takeoff, the aircraft entered a steep descent and reached a descent rate of 6,000 feet per minute with a simultaneous reduction of speed before all radar and radio contact were lost at 0613LT. The aircraft crashed in a desert area located about 50 km southeast of Hasna, in the Sinai. None of the 224 occupants survived the accident. It appears the aircraft crashed in a slightly flat attitude and was destroyed by impact forces and a post crash fire (the central part of the fuselage and wings). Based on the debris scattered on a zone of 16 km2, it is now understood that the engines and the tail have been found few hundred metres from the main wreckage. It is believed the aircraft partially disintegrated in the air but probably during the last phase of the descent and not at high altitude. ", "probable_cause": "On November 17, 2015, Alexander Bortnikov, Chief of the Russian Secret Services, confirmed to Vladimir Putin that the crash was caused by the detonation of a small 'home made' bomb equivalent to one kilo of TNT that was placed on board the airplane in a beverage can. This was confirmed by the Egyptian Presidency on 24 February 2016. "}