{"url": "https://www.baaa-acro.com/crash/crash-raytheon-390-premier-i-johannesburg", "date": "Nov 22, 2017 at 1623 LT", "type": "Raytheon 390 Premier I", "operator": "Multimanaged Investments", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cape Town - Johannesburg", "msn": "RB-214", "yom": 2007, "flight_number": null, "city": "Johannesburg-Rand", "zone": "Gauteng", "country": "South Africa", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3048, "captain_hours_type": 649, "copilot_hours": 4718, "copilot_hours_type": 305, "aircraft_hours": 963, "circumstances": "On 22 November 2017, the pilot-in-command (PIC) accompanied by the first officer (FO) took off from the Cape Town International Airport (FACT) on a private flight to the Rand Airport (FAGM). The flight was conducted under instrument flight rules (IFR) by day and the approach was conducted under visual flight rules (VFR). The PIC was the pilot flying (PF) and was seated on the left seat and the FO was occupying the right seat. The air traffic controller (ATC) on duty at FAGM tower stated that the FO reported in-bound for a fullstop landing at FAGM. The last wind direction data for Runway 29 was transmitted to the FO as 230°/11 knots (kts) and Query Nautical Height (QNH): 1021. The FO acknowledged the transmission and the crew elected to land on Runway 11. The PIC stated that the approach for landing was stable and that the touchdown was near the first taxiway exit point. According to the FO, the aircraft floated for a while before touchdown. This was confirmed during the investigation. During the landing rollout, the PIC applied the brakes and the brakes responded for a short while, however, the aircraft continued to roll without slowing down. At approximately 300 metres (m) beyond the intersection of Runway 35 and Runway 11, the PIC requested the FO to apply emergency brakes. The FO applied the emergency brakes gradually and the aircraft continued to roll before the brakes locked and the tyres burst. The aircraft skidded on the main wheels and continued for approximately 180m until it overshot the runway. The undercarriage went over a ditch of approximately 200 millimetres in depth at the end of the runway into the soft ground and the aircraft came to a stop approximately 10m from the threshold facing slightly left off the extended centre line Runway 11. The aircraft was substantially damaged during the impact sequence and none of the occupants sustained injuries. The crash alarm was activated by the tower and the fire services responded to the scene. ", "probable_cause": "The investigation revealed that the aircraft was unstable on approach (hot and high), resulting in deep landing, probably near the second exit point, leading to a runway excursion. Contributing factors were attributed to the lift dumps not being deployed and the incorrect application of the emergency brakes.\n"}