{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227at-merlin-ivc-beaver-island-2-killed", "date": "Feb 8, 2001 at 1920 LT", "type": "Swearingen SA227AT Merlin IVC", "operator": "Northern Illinois Flight Center", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago – Beaver Island", "msn": "AT-469", "yom": 1982, "flight_number": null, "city": "Beaver Island", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6500, "captain_hours_type": 250, "copilot_hours": 800, "copilot_hours_type": null, "aircraft_hours": 7207, "circumstances": "The airplane was on an on-demand air-taxi flight operating under 14 CFR Part 135 and was destroyed when it impacted trees and terrain while circling to land during a non-precision instrument approach at night. The airplane came to rest 1.74 nautical miles and 226 degrees magnetic from the intended airport. A weather briefing was obtained and instrument meteorological conditions were present along the route of flight at the time of the briefing. Weather conditions for the two reporting stations closest to the destination were obtained by the airplane prior to executing the approach. The weather reports listed ceilings and visibilities as 400 to 500 feet overcast and 5 to 7 statute miles. The airport elevation is 669 feet and the minimum descent altitude for the approach was listed as 1,240 feet. There was no weather reporting station at the destination airport at the time of the accident. According to the operators General Operations Manual, the pilot was responsible for the dispatch of the airplane including flight planning, and confirming departure, en-route, arrival and terminal operations compliance. The manual also states, \"For airports without weather reporting, the area forecast and reports from airports in the vicinity must indicate that the weather conditions will be VFR [visual flight rules] at the ETA so as to allow the aircraft to terminate the IFR operations and land under VFR. (Note: a visual approach is not approved without weather reporting).\" For 14 CFR Part 135 instrument flight operations conducted at an airport, federal regulations require weather observations at that airport. Furthermore, the regulations state that, for 14 CFR Part 135 operations, an instrument approach cannot be initiated unless approved weather information is available at the airport where the instrument approach is located, and the weather information indicates that the weather conditions are at or above the authorized minimums for the approach procedure. The commercial pilot held a type rating for the accident airplane. The right seat occupant was a commercial pilot employed by the operator and did not hold an appropriate type rating for the accident airplane. The pitch trim selector switch was found set to the co-pilot side. The regulations state that 14 CFR Part 135 operators cannot use the services of any person as an airman unless that person is appropriately qualified for the operation for which the person is to be used. The circling approach was made over primarily unlit land and water. An FAA publication states that during night operations, \"Distance may be deceptive at night due to limited lighting conditions. A lack of intervening  Page 2 of 17 CHI01FA083 references on the ground and the inability of the pilot to compare the size and location of different ground objects cause this. This also applies to the estimation of altitude and speed. Consequently, more dependence must be placed on flight instruments, particularly the altimeter and the airspeed indicator.\" No anomalies were found with respect to the airframe, engines, or systems that could be associated with a pre-impact condition.", "probable_cause": "The flightcrew not maintaining altitude/clearance during the circling instrument approach. Factors were the pilot in command initiating the flight without proper weather reporting facilities at the destination, the flightcrew not flying to an alternate destination, the flightcrew not following company and FAA procedures/directives, the lack of certification of the second pilot, the operator not following company and FAA procedures/directives, and the dark night and the low ceiling."}