{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-yambio", "date": "May 2, 2012 at 1055 LT", "type": "Cessna 208B Grand Caravan", "operator": "Airworks-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Humanitarian", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Juba - Yambio", "msn": "208B-0322", "yom": 1992, "flight_number": null, "city": "Yambio", "zone": "Western Equatoria (غرب الاستوائية)", "country": "South Sudan", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "It was reported that the aircraft had taken-off from Juba for Yambio, Sothern Sudan with two crew members and nine passengers onboard. The flight was uneventful up to and until after touchdown, twenty metres after the threshold of runway 03, when it was noted that the aircraft steadily veered to the left. Efforts by the captain to prompt the pilot flying and intercession by taking control of the aircraft and initiating the necessary corrective measures by applying full right rudder yielded no positive results. The aircraft left wheel entered the trench at high speed, causing the aircraft to flip over and crash 200metrs from threshold of runway 03 and came rest in an inverted position. All persons exited safely on their own, except two passengers who were assisted by the captain to disembark. The captain used the portable fire extinguisher to put off the fire that flickered in the engine compartment. The flying pilot sustained injuries on his right foot, while the other passengers were reported to have hard minor injuries. The prevailing weather at the time of occurrence was reported as CAVOK (clear sky, and visibility better than 10Km) with calm North Easterly winds (030/05).", "probable_cause": null}