{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-1-dk-montevideo-10-killed", "date": "Oct 9, 1962 at 1514 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "PLUNA%20Uruguay.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Montevideo - Montevideo", "msn": "12113", "yom": 1943, "flight_number": null, "city": "Montevideo-Carrasco", "zone": "Montevideo City District", "country": "Uruguay", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 6380, "captain_hours_type": 5781, "copilot_hours": 1714, "copilot_hours_type": null, "aircraft_hours": 5000, "circumstances": "The aircraft was undergoing the final flight test required for issuance of its Certificate of Airworthiness. It was to be a visual, local flight lasting about 1 hr 30 min. The takeoff run began at 15:14 hours, 200 m from the threshold of runway 23. This meant that 1900 m of the runway remained for the takeoff. The aircraft rose to a height which could not be determined but could not have been less than 5 m or more than 15 m. About 30 seconds after the commencement of the manoeuvre its right wing grazed the surface of the runway several times. During the later contacts the landing gear bounced off the ground with such force that the right tire burst and the landing gear leg broke causing the axle and propeller to hit the ground while the right engine was turning at almost full power. The aircraft again bounced into the air rolled over completely and finally came to rest upside down. Between the time the aircraft bounced into the air and the moment it finally came to rest, the pilot turned the power off completely. This was proved by an inspection of the condition and final positions of both propellers and the engine control switches, which were in the \"off\" position. Fire broke out for reasons that could not be precisely ascertained. The aircraft was totally destroyed and all 10 occupants were killed. ", "probable_cause": "The accident was attributed to a maintenance error, which was not noticed by the airline inspectors and the inspector from the Directorate General of Civil Aviation. This was followed by an omission on the part of the pilot."}