{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-120rt-brasilia-fortaleza-4-killed", "date": "Oct 21, 1998 at 0851 LT", "type": "Embraer EMB-120 Brasília", "operator": "Capital Taxi Aéreo", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Teresina - Fortaleza", "msn": "120-076", "yom": 1988, "flight_number": null, "city": "Fortaleza-Pinto Martins", "zone": "Ceará", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 1, "total_fatalities": 4, "captain_hours": 9100, "captain_hours_type": 1500, "copilot_hours": 5100, "copilot_hours_type": 1300, "aircraft_hours": null, "circumstances": "The twin engine aircraft was completing a cargo flight from Teresina to Fortaleza, carrying one passenger, two pilots and a load of 2,5 tons of medicines. On final approach to Fortaleza-Pinto Martins Airport, the aircraft was approaching at an excessive speed when flaps and landing gear were selected down. The aircraft became unstable and the captain who was the pilot-in-command continued the approach and the copilot did not intervene to correct the situation. On final, the thrust levers were positioned below the flight idle position, causing the aircraft to lose speed and to enter a right bank. It struck power cables and eventually crashed onto a house. The aircraft and the house were destroyed. The copilot was seriously injured while both other occupants and one people on the ground were killed. Seven other people on the ground were injured. Few hours later, the copilot died from his injuries. ", "probable_cause": "The following factors were identified:\r\n- In the individual aspect, there were signs of concern of the crew member with prolonged waiting caused by the local traffic in Fortaleza and by another traffic that was approaching the aerodrome and, because of this, accelerated the procedure of the final approach, descending at high speed and triggering the other operational failures that led to the accident; in the same way, there were signs of excessive self-confidence by the pilot.\r\n- The operator's delay in submitting the requested documentation for the aircraft reduced the credibility of the submitted material. The possibility that the secondary stop was deactivated, despite statements to the contrary by a mechanic, would have been caused by inadequate participation of maintenance personnel in the services performed and by non-compliance with the planned AD.\r\n- There are reports from several pilots about this commander's habits of performing unforeseen procedures, including some that avoided flying with him. It was not researched if the other crew members took this fact to the company's management. The company's response was not researched if it was aware of these operational deviations.\r\n- The pilot misused the resources available in the operation of the aircraft, due to ineffective management of the tasks related to the PF and PNF and the noncompliance with operational rules. \r\n- The PNF did not advise the PF during the approach. The PNF accepted the non-stabilized approach and did not react to reverse the situation.\r\n- The crew made the approach above the glide slope and at high speed; thought inappropriately that it could proceed in those conditions and that there would be ways to reduce the speed and make the landing.\r\n- The crew disobeyed the aircraft's operating rules by performing a destabilized approach outside the envelope recommended by the manufacturer and by placing the power levers below the flight idle position."}