{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-602p-super-700-aerostar-gabriola-island-3-killed", "date": "Dec 10, 2019 at 1805 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Cabo San Lucas – Chino – Bishop – Nanaimo", "msn": "60-8265-020", "yom": 1982, "flight_number": null, "city": "Gabriola Island", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 320, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5752, "circumstances": "On 09 December 2019, a private Piper Aerostar PA-60-602P aircraft (registration C-FQYW, serial number 60-8265020), departed Cabo San Lucas International Airport (MMSL), Baja California Sur, Mexico, with 3 people on board, for a 2-day trip to Nanaimo Airport (CYCD), British Columbia (BC). As planned the aircraft stopped for an overnight rest at Chino Airport (KCNO), California, U.S. At 1142, on 10 December 2019, the aircraft departed KCNO on a visual flight rules (VFR) flight plan to Bishop Airport (KBIH), California, U.S., for a planned fuel stop. The aircraft departed KBIH at approximately 1425 on an instrument flight rules (IFR) flight plan to CYCD. On 10 December 2019, night started at 1654. At 1741, the Vancouver area control centre air traffic controller advised the pilot that an aerodrome special meteorological report (SPECI) had been issued for CYCD at 1731. The SPECI reported visibility as 2 ½ statute miles (SM) in light drizzle and mist, with an overcast ceiling of 400 feet above ground level (AGL). The pilot informed the controller that he would be conducting an instrument landing system (ILS) approach for Runway 16. At 1749, when the aircraft was approximately 32 nautical miles (NM) south of CYCD, the pilot contacted the controller to inquire about the weather conditions at Victoria International Airport (CYYJ), BC. The controller informed the pilot that a SPECI was issued for CYYJ at 1709 and it reported the visibility as 5 SM in mist, a broken ceiling at 600 feet AGL, and an overcast layer at 1200 feet AGL. The controller provided the occurrence flight with pilot observations from another aircraft that had landed at CYCD approximately 15 minutes before. That crew had reported being able to see the Runway 16 approach lights at minimums, i.e., at 373 feet AGL. Between 1753 and 1802, the controller provided vectors to the pilot in order to intercept the ILS localizer. At 1803, the controller observed that the aircraft had not intercepted the localizer for Runway 16. The aircraft had continued to the southwest, past the localizer, at an altitude of 2100 feet above sea level (ASL) and a ground speed of 140 knots. The controller queried the pilot to confirm that he was still planning to intercept the ILS for Runway 16. The pilot confirmed that he would be intercepting the ILS as planned. The aircraft made a heading correction and momentarily lined up with the localizer before beginning a turn to the west. At 1804:03, the pilot requested vectors from the controller and informed him that he “just had a fail.” The controller responded with instructions to “turn left heading zero nine zero, tight left turn.” The pilot asked the controller to repeat the heading. The controller responded with instructions to “…turn right heading three six zero.” The pilot acknowledged the heading; however, the aircraft continued turning right beyond the assigned heading while climbing to 2500 feet ASL and slowing to a ground speed of 80 knots. The aircraft then began to descend, picking up speed as it was losing altitude. At 1804:33, the aircraft descended to 1800 feet ASL and reached a ground speed of 160 knots. At 1804:40, the pilot informed the air traffic controller that the aircraft had lost its attitude indicator.Footnote6 At the same time, the aircraft was climbing into a 2nd right turn. At 1804:44, the air traffic controller asked the pilot what he needed from him; the pilot replied he needed a heading. The controller provided the pilot with a heading of three six zero. At 1804:47, the aircraft reached an altitude of 2700 feet ASL and a ground speed of 60 knots. The aircraft continued its right turn and began to lose altitude. The controller instructed the pilot to gain altitude if he was able to; however, the pilot did not acknowledge the instruction. The last encoded radar return for the aircraft was at 1805:26, when the aircraft was at 300 feet ASL and travelling at a ground speed of 120 knotsControl of the aircraft was lost. The aircraft collided with a power pole and trees in a wooded park area on Gabriola Island, BC, and then impacted the ground. The aircraft broke into pieces and caught fire. The 3 occupants on board received fatal injuries. As a result of being damaged in the accident, the emergency locator transmitter (Artex ME406, serial number 188-00293) did not activate.", "probable_cause": "The occurrence aircraft was equipped with a BendixKing KI 825 electronic horizontal situation indicator (HSI) that was interfaced to the flight control system and GPS (global positioning system) Garmin GNS530W/430W. The HSI also supplies the autopilot system with heading information. The investigation determined that the HSI had failed briefly during operation on 22 November 2019 and a 2nd time, 3 days later, on 26 November 2019. The KI 825 HSI is electrically driven and therefore is either on and working, or off and dark with no display. The aircraft owner was in contact with an aircraft maintenance organization located at Boundary Bay Airport (CZBB), BC, and an appointment to bring the occurrence aircraft in for troubleshooting of the 2 brief HSI malfunctions had been made for 11 December 2019, i.e., the day after the accident. In total, 13 flights had been conducted after the 1st failure of the HSI. There were no journey log entries for defects with the HSI or evidence of maintenance completed. RegulationsFootnote9 require that defects that become apparent during flight operations be entered in the aircraft journey logbook, and advisory guidance in the regulatory standardsFootnote10 states that all equipment required for a particular flight or type of operation, such as the HSI in this case, be functioning correctly before flight. The HSI was destroyed in the accident and the investigation was unable to determine if it was operational on impact. Similarly, it could not be determined if the HSI was supplying the autopilot with heading information, or if the autopilot was engaged during the approach."}