{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-321c-elmendorf-afb-3-killed", "date": "Dec 26, 1968 at 0615 LT", "type": "Boeing 707", "operator": "Pan%20Am.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "San Francisco – Elmendorf – Tokyo – Đà Nẵng – Cam Ranh Bay", "msn": "18824/397", "yom": 1964, "flight_number": "PA799", "city": "Elmendorf-Richardson AFB (JBER)", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 15207, "captain_hours_type": 3969, "copilot_hours": 9813, "copilot_hours_type": 2813, "aircraft_hours": null, "circumstances": "The aircraft christened 'Clipper Racer' departed San Francisco on a cargo flight to Cam Ranh Bay, Vietnam with en route stops at Elmendorf AFB, Tokyo and Đà Nẵng. Because of below minima weather at Anchorage International Airport, the aircraft landed at Elmendorf AFB. Several delays were experienced before the flight taxied out at 06:02. Flight 799 was given a void time of 06:15 by Oceanic Control to avoid traffic conflict. If the crew failed to make that time, it would result in a 45 min delay. When the checklist item \"wing flaps\" was called, the 'follow me' truck arrived to guide them to runway 23. From then on the crew were busy steering the plane on the slippery taxiways and talking to Oceanic Control resp. The aircraft was cleared for takeoff at 06:14. The stick shaker sounded shortly after VR (154 kts). The aircraft rotated climbed slowly. The right wing contacted the snow covered ground 94 feet left of the extended centerline at a distance of 2760 feet from the runway. The aircraft rolled inverted and broke up.", "probable_cause": "An attempted takeoff with the flaps in a retracted position. This resulted from a combination of factors: \r\n- Inadequate cockpit checklist and procedures, \r\n- A warning system inadequacy associated with cold weather operations,\r\n- Ineffective control practices regarding manufacturer's Service Bulletins, \r\n- Stresses imposed upon the crew by their attempts to meet an air traffic control deadline."}