{"url": "https://www.baaa-acro.com/crash/crash-bae-125-600b-bromont", "date": "Feb 21, 2005 at 1818 LT", "type": "BAe 125", "operator": "Scott%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Montreal - Bromont", "msn": "256006", "yom": 1973, "flight_number": null, "city": "Bromont", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5000, "captain_hours_type": 550, "copilot_hours": 1700, "copilot_hours_type": 100, "aircraft_hours": null, "circumstances": "The aircraft, operated by Scott Aviation, with two crew members and four passengers on board, took off from Montréal, Quebec, at 1756 eastern standard time, for a night instrument flight rules flight to Bromont, Quebec. Upon approaching Bromont, the co-pilot activated the lighting system and contacted the approach UNICOM (private advisory service). The flight crew was advised that the runway edge lights were out of order. However, the approach lights and the visual approach slope indicator did turn on. The flight crew executed the approach, and the aircraft touched down at 1818 eastern standard time, 300 feet to the left of Runway 05L and 1800 feet beyond the threshold. It continued on its course for a distance of approximately 1800 feet before coming to a stop in a ditch. The crew tried to stop the engines, but the left engine did not stop. The co-pilot entered the cabin to direct the evacuation. One of the passengers tried to open the emergency exit door, but was unsuccessful. All of the aircraft’s occupants exited through the main entrance door. Both pilots and one passenger sustained serious injuries, and the three remaining passengers received minor injuries. The aircraft suffered major damage. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The flight crew attempted a night landing in the absence of runway edge lights. The aircraft touched down 300 feet to the left of Runway 05L and 1800 feet beyond the threshold.\r\n2. The runway was not closed for night use despite the absence of runway edge lights. Nothing required it to be closed.\r\n3. Poor flight planning, non-compliance with regulations and standard operating procedures (SOPs), and the lack of communications between the two pilots reveal a lack of airmanship on the part of the crew, which contributed to the accident.\r\nFindings as to Risk:\r\n1. Because they had not been given a safety briefing, the passengers were not familiar with the use of the main door or the emergency exit, which could have delayed the evacuation, with serious consequences.\r\n2. The armrest of the side seat had not been removed as required and was blocking access to the emergency exit, which could have delayed the evacuation, with serious consequences.\r\n3. Because they had not been given a safety briefing, the passengers seated in the side seats did not know that they should have worn shoulder straps and did not wear them, so they were not properly protected.\r\n4. The possibility of flying to an airport that does not meet the standards for night use gives pilots the opportunity to attempt to land there, which in itself increases the risk of an accident. \r\n5. The landing performance diagrams and the chart used to determine the landing distance did not enable the flight crew to ensure that the runway was long enough for a safe landing on a snow-covered surface. "}