{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-bimini-2-killed", "date": "Sep 19, 1999 at 1115 LT", "type": "Beechcraft 200 Super King Air", "operator": "Compania Aerospace de Venezuela", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Fort Lauderdale - Caracas", "msn": "BB-740", "yom": 1981, "flight_number": null, "city": "Bimini", "zone": "Bimini", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1841, "circumstances": "A Beechcraft 200 Super King Air, YV-385CP, crashed into the Atlantic Ocean about 9 miles southwest of Bimini, Bahamas, while on personal flight. Visual meteorological conditions prevailed in the area at the time, and an instrument flight rules flight plan was filed. The aircraft was destroyed, and the commercial-rated flight instructor and a pilot-rated passenger were both fatally injured. The flight originated from Fort Lauderdale International Airport, the same day, about 10:53. At 11:14, the pilot of YV-385CP told FAA ARTCC that he was experiencing an emergency, and he asked for immediate directions to Bimini. There were no further communications. According to radar information, at 11:13:33, the altitude was about 23,600 feet, and at 11:14:58 it had descended to 2,800 feet. Sound spectrum analysis of an FAA re-recording of communications between the pilot and ATC, indicated there were electronic signatures present, attributable to propeller noise, at cruise setting, for that type of aircraft. Records obtained from Venezuela indicated that earlier, YV-385CP had been involved in an accident, and had incurred extensive structural damage. The aircraft had been repaired in Venezuela, and was subsequently flown to the Unites States for additional repairs. Records obtained from the U.S. repair station indicated that the airplane incurred an extensive maintenance history, with needed repairs including damaged wiring, and leaks in the fuel system, as well as structural leaks, which had lead to several pressurization difficulties.", "probable_cause": "Due to lack of evidences, the exact cause of the accident could not be determined. "}