{"url": "https://www.baaa-acro.com/crash/crash-hawker-800xp-port-harcourt", "date": "Jun 8, 2015 at 1916 LT", "type": "Hawker 800XP", "operator": "Swat Technology", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Abuja – Port Harcourt", "msn": "258439", "yom": 1999, "flight_number": null, "city": "Port Harcourt", "zone": "Rivers", "country": "Nigeria", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4180, "captain_hours_type": 2752, "copilot_hours": 16744, "copilot_hours_type": 147, "aircraft_hours": 8447, "circumstances": "On 11th June, 2015, at about 18:25 h, an HS-125-800XP aircraft with nationality and registration marks N497AG, operated by SWAT Technology Limited departed Nnamdi Azikiwe International Airport, Abuja (DNAA) for Port Harcourt International Airport (DNPO) as a charter flight on an Instrument Flight Rule (IFR) flight plan. There were five persons on board inclusive of three flight crew and two passengers. The Captain was the Pilot Flying while the Co-pilot was the Pilot Monitoring. At 18:48 h, N497AG established contact with Lagos and Port Harcourt Air Traffic Control (ATC) units cruising at Flight Level (FL) 280. At 18:55 h, the aircraft was released by Lagos to continue with Port Harcourt. Port Harcourt cleared N497AG for descent to FL210. At 19:13 h, the crew reported field in sight at 6 nautical miles to touch down to the Tower Controller (TC). TC then cleared the aircraft to land with caution “runway surface wet”. The crew experienced light rain at about 1.3 nautical miles to touch down with runway lights ON for the ILS approach. At about 1,000 ft after the extension of landing gears, the PM remarked ‘Okay...I got a little rain on the windshield’ and the PF responded, ‘We don’t have wipers sir... (Laugh) Na wa o (Na wa o – local parlance, - pidgin, for expression of surprise). From the CVR, at Decision Height, the PM called out ‘minimums’ while the PF called back ‘landing’ as his intention. The PM reported that the runway edge lights were visible on the left side. On the right side, it was missing to a large extent and only appeared for about a quarter of the way from the runway 03 end. The PM observed that the aircraft was slightly to the left of the “centreline” and pointed out “right, right, more right.” The PM further stated that at 50 ft, the PF retarded power and turned to the left. At 40 ft, the PM cautioned the PF to ‘keep light in sight don’t go to the left’. At 20 ft, the PM again said, ‘keep on the right’. PF replied, ‘Are you sure that’s not the centre line?’. At 19:16 h, the aircraft touched down with left main wheel in the grass and the right main wheel on the runway but was steered back onto the runway. The PF stated, “...but just on touchdown the right-hand lights were out, and in a bid to line up with the lights we veered off the runway to the left”. The nose wheel landing gear collapsed, and the aircraft stopped on the runway. The engines were shut down and all persons on board disembarked without any injury. From the CVR recordings, the PF told the PM that he mistook the brightly illuminated left runway edge lights for the runway centreline and apologized for the error of judgement for which the PM responded ‘I told you’. The aircraft was towed out of the runway and parked at GAT Apron at 21:50 h. The accident occurred at night in light rain.", "probable_cause": "The accident was the consequence of a black hole effect disorientation causing low-level manoeuvre into grass verge. \r\nThe following contributing factors were identified:\r\n- Most of the runway 21 right edge lights were unserviceable at landing time.\r\n- Inadequate Crew Resource Management during approach."}