{"url": "https://www.baaa-acro.com/crash/crash-latham-47-barents-sea-6-killed", "date": "Jun 18, 1928 at 1845 LT", "type": "Latham 47", "operator": "Roald Amundsen", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Caudebec-en-Caux - Bergen - Tromsø - Longyearbyen", "msn": "47.02", "yom": 1928, "flight_number": null, "city": "Barents Sea", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Few days prior to the accident, the Italian Airship named 'Italia' and piloted by the Italian General Umberto Nobile crashed on the ice in Arctica with 15 people on board. The Norwegian Scientist Roald Amundsen obtained help from the French government to attempt a SAR mission. On 16 of June, the seaplane departed Caudebec-en-Caux, north of France, with a crew of four on board, bound to Bergen and Tromsø where Roald Amundsen boarded with his pilot Leif Dietrichson. The aircraft departed Tromsø at 1600LT. About three hours later, the crew sent his last message, confirming that all was OK on board. While cruising off the Norwegian coasts, half a way from Tromsø to Longyearbyen, in the Svalbard archipelago, the aircraft disappeared while the communication was cut. SAR mission was initiated but no trace of the aircraft nor the crew was found. On 13AUG1928, a lateral stabilization float was found and all SAR operations were officially abandoned by the Norwegian Authorities in September 1928. On 13OCT1928, a fuel tank was found on a beach in Norway while a second tank was found few days later. This would be the only part of the aircraft ever found. In 2003, a Norwegian commission announced the aircraft probably crashed off Bear Island, in the Barents Sea. \r\nCrew:\r\nRené Guilbaud, pilot,\r\nEmile Valette, radio, \r\nLieutenant de Vaisseau Albert Cavelier de Cuverville, \r\nGilbert Brazy, mechanic.\r\nPassengers:\r\nRoald Amundsen,\r\nLeif Dietrichson, pilot.", "probable_cause": null}