{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-11f-campinas", "date": "Oct 13, 2012 at 1852 LT", "type": "McDonnell Douglas MD-11", "operator": "Centurion-Air-Cargo-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Miami - Campinas", "msn": "48434/476", "yom": 1991, "flight_number": "CWC425", "city": "Campinas-Viracopos", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12900, "captain_hours_type": null, "copilot_hours": 5198, "copilot_hours_type": 1368, "aircraft_hours": null, "circumstances": "The airplane took off from Miami International Airport (KMIA), destined for Viracopos Airport (SBKP), with two pilots and a mechanic on board, on a non-regular cargo transport flight. The flight was uneventful up to the moment its landing in SBKP. On the approach for landing on runway 15, the crew performed the IFR ILS Z procedure. The weather conditions were VMC, with the wind coming from 140º at 19kt. When the aircraft was granted clearance to land, the wind strength was 20kt, gusting up to 29kt. The copilot was the Pilot Flying (PF), and the captain was the Pilot Monitoring (PM) at the moment of landing. When the aircraft touched down on the runway after the flare, the left main landing gear collapsed, causing the aircraft to skid on the runway for approximately 800 meters before stopping. There was substantial damage to the left main gear assembly, to the left wing, and left engine. The aircraft stopped within the runway limits. All three crew members were uninjured. ", "probable_cause": "It was determined that the “the landing gear failed due to overload in the cylinder structure”. The fracture started in the rear section of the cylinder in a connection hole which served as a tension concentration point, and ended in the front part of the cylinder with its breakage into two parts. Following a failure of the right main gear upon landing in Montevideo on 20 October 2009, the right main landing gear was replaced by VARIG Engineering & Maintenance (VEM), but the organization responsible for the research of damage, the specification of the services necessary for the restoration of airworthiness, and the provision of the services that enabled the restoration of the aircraft to an airworthy condition was not identified. The same aircraft parts were subjected to metallurgical analysis at the Boeing Long Beach Materials, Processing and Physics [MP&P] Laboratories, in Huntington Beach, California, USA; and the technical report issued by Boeing highlighted that in one of the points of origin of the failure, the analysis had identified characteristics similar to a pre-crack point, which would have begun earlier, probably due to overload. In the tasks that led to the restoration of the aircraft airworthiness after the accident in Uruguay in 2009 (Hard-Landing), and also in subsequent periodic inspections, the existence of pre-crack traces resulting from a previous overload condition may not have been identified, something that could have resulted in a point of stress concentration."}