{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-188cf-electra-salt-lake-city-3-killed", "date": "Nov 18, 1979 at 0456 LT", "type": "Lockheed L-188 Electra", "operator": "Transamerica%20Airlines", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Ogden-Hill - Nellis", "msn": "2016", "yom": 1960, "flight_number": "3N18", "city": "Salt Lake City", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 20000, "captain_hours_type": 3140, "copilot_hours": 3140, "copilot_hours_type": 2715, "aircraft_hours": 41764, "circumstances": "The four engine airplane departed Ogden-Hill AFB at 0445LT on a cargo flight to Nellis AFB on behalf of the USAF, carrying three crew members and 27,552 lbs of cargo. While climbing from 12,000 to 13,000 feet, the flight indicated to Salt Lake departure control that they had lost all electrical power, the flight requested no-gyro vectors to visual flight conditions and clearance for an immediate descent to a lower altitude. During the descent, the aircraft attained a high airspeed and high rate of descent and disintegrated in flight. The three crewmembers were killed and the aircraft was destroyed. The wreckage was dispersed along a path about 1 1/2 miles long on an abandoned airport located about 4 nmi south of the Salt Lake City International Airport. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was a progressive failure in the aircraft's electrical system leading to the disabling or erratic performance of some critical flight instruments and flight instrument lighting while the flight was operating in night instrument meteorological conditions. As a result of these conditions, the flightcrew could not resolve the instrumentation anomalies to determine proper aircraft attitude reference, and became disoriented and lost control of the aircraft. The crew's efforts to regain control of the aircraft imDOSed aerodynamic loads which exceeded design limits of the ahraft and caused it to break up in flight."}