{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-lake-monduran-3-killed", "date": "Dec 5, 1988 at 1200 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Bundaberg - Bundaberg", "msn": "1618", "yom": 1966, "flight_number": null, "city": "Lake Monduran", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft reported departing Bundaberg for Monduran Dam on a no SAR flight at 1135 hrs EST with three persons on board and an endurance of 270 minutes. The purpose of the flight was to complete the endorsement of the pilot under check and to assess the suitability of an area of water on the coast to where the passenger, who was the regular pilot of the aircraft, was to fly the aircraft the following day. The pilot in command had flown 27 hours in the previous three months, of which 9 were on type. The pilot under check had flown only one hour in the last three months. This flight had been in VH-BSL. At approximately 1200 hrs, the aircraft was observed in the Lake Monduran area. It flew two left hand circuits, landing into wind towards the dam wall each time. After the second takeoff, it turned left and was seen heading north from the lake. Nothing further was heard or seen of the aircraft. Following an extensive search, the wreckage was located six days later lying inverted in 15 metres of water approximately 2 km WNW of the dam wall in the area of the junction of the main east-west channel and a northsouth channel of the lake. Both floats had separated from the aircraft and the right float was severely torn for about half its length. There was substantial water impact damage to the windshield frame/cockpit roof area and to the upper leading edge surfaces of both wings.", "probable_cause": " No fault was found with the aircraft or its systems which might have contributed to the accident. It could not be determined who was manipulating the controls of the aircraft at the time of the accident. Evidence was obtained that it was the habit of the check pilot to have pilots undergoing endorsement or check to fly two circuits landing into wind and then to carry out crosswind landings. The check pilot and the pilot under check had previously operated at the dam and alighted on to both the east/west and the north/south channels. Having been observed to fly two into wind circuits and then head north and not be sighted again, it is possible that the aircraft then commenced crosswind operations onto the north/south arm of the lake, landing in a southerly direction with a crosswind from the left. Information from the Bureau of Meteorology indicated that the surface wind in the area at the time of the accident was 090` magnetic at 15 knots. This information was confirmed by witnesses at the dam wall who observed white caps on the surface of the dam. The north/south channel of the lake was bounded on its east side by steep hills rising to 70 metres above water level. The effect of this high ground was to partially blanket the north/south channel from the easterly wind. The position of the wreckage was in the area where the wind shadow effect would have ended and where the wind would have blown at full strength along the main east/west channel of the lake. The crosswind limitation for the aircraft as stated in the flight manual was 8.7 knots. Commenting in early 1988 on an enquiry regarding the raising of this limit, the aircraft manufacturer emphasised the 8.7 knot limit and advised that any test work to raise the limit should proceed cautiously starting at or below the current (8.7 knot) limit. If the aircraft was conducting crosswind operations in the north/south channel, and suddenly encountered a 15 knot crosswind on exiting the wind shadow area, the control difficulties confronting the pilot could have been significant. The aircraft wreckage was intact except for the floats which had been torn off by water impact forces. The right float was severely damaged while the left was intact. The forward tip of the right float had been severed by the propeller. The remaining forward section had then been forced upwards and outboard and had broken off. This weakened the float support structure, causing it to fail, and allowing the remaining section of the right float to strike the right side of the fuselage just aft of the cabin. Damage of this type an magnitude was most probably caused by the nose of the right float digging into the surface of the lake at relatively high speed. For this to occur, the aircraft was banked to the right at float impact - a possible consequence of encountering a strong crosswind from the left. There was no evidence that the aircraft had hit a submerged object. The factors associated with the development of this accident could not be determined. "}