{"url": "https://www.baaa-acro.com/crash/crash-vickers-74-vulcan-purley-4-killed", "date": "Jul 13, 1928", "type": "Vickers Vulcan", "operator": "Imperial%20Airways-3", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Croydon - Croydon", "msn": "9", "yom": 1925, "flight_number": null, "city": "Croydon", "zone": "Surrey", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "As the engine has been changed the day prior to the accident, the pilot was engaged in a test flight with an inspector of the Civil Aviation Authority. Due to the nature of the flight, four employees of Imperial Airways were authorized to take part of the flight. Shortly after takeoff, while climbing, the aircraft crashed into a market garden near Leigh Cottage on Woodcote Road, it was seen by residents flying low over the rooftops with the engine \"evidently in difficulties\". The accident occurred in a potato field located 3 miles south of the airport, in Purley. As the pilot was ejected on impact and was uninjured, he helped one of the passengers from the enclosed cabin free. Shortly later, the aircraft burst into flames and it was not possible to rescue the other passengers. The four passengers (two male and two females) were killed and later evidence was that at least one had died due to the impact and the others were unconscious before the fire.", "probable_cause": "The pilot Captain John Spafford gave his evidence to the inquest, he had been informed at 11:50 that the aircraft needed an engine test and he was to also take five passengers and some ballast. Spafford calculated that his weight would be under the full load and that on the ground the engine sounded normal. \"When I was about 700 feet I pushed the nose down to maintain height and noticed that the aircraft began to sink rapidly. I increased the throttle to little effect and then started to look for a safe landing place, but the area was full of high trees and houses. I increased the throttle and was able to hold height for a few minutes and then noticed the engine water temperature was over 100 degrees centigrade and I could see steam from the left hand engine cowling. The engine lost power again and I saw a chance to land in some allotments, I pushed the control down to 45 degrees and hit the ground at the same angle. I was trapped by my foot and released myself after about two minutes, as I freed myself the engine caught fire. I managed to get to the door of the cabin and only one of the passengers was conscious.\" Spafford agreed with the coroner that the presence of passengers were not required for an engine test. After further questioning of the pilot the jury returned a verdict of accidental death in all four case. The coroner added that the practice of allowing employees of the airline to go as passengers on test flight should stop. The engineering superintendent from Imperial Airways said that the airline would discontinue the practice."}