{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46-newark-56-killed", "date": "Dec 16, 1951 at 1509 LT", "type": "Curtiss C-46 Commando", "operator": "Miami Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Newark – Tampa", "msn": "22572", "yom": 1945, "flight_number": null, "city": "Elizabeth", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 52, "pax_fatalities": 52, "other_fatalities": 0, "total_fatalities": 56, "captain_hours": 8679, "captain_hours_type": 2600, "copilot_hours": 1224, "copilot_hours_type": 234, "aircraft_hours": 4138, "circumstances": "The aircraft arrived at Newark following a non-stop flight from Fort Smith, Arkansas, on December 15 at about 2330. During this flight of about five and one quarter hours, there was no reported malfunctioning of the aircraft or its powerplants with the exception of both cabin heaters which were inoperative. This was reported to the Babb Company, a CAA approved repair station at the Newark Airport, and instructions were issued to repair the heaters. Mechanics worked during the night and the following morning with the result that one of the cabin heaters was believed to be repaired. This, however, could not be positively determined without test flying the aircraft; this was not done. During the morning of December 16 the aircraft was serviced. The left engine required five gallons of oil and the right engine required 10 gallons to bring the respective tanks to a total of 34 gallons each. Fuel was added in the amount of 767 gallons, which filled the front and center tanks in each wing. The aircraft was loaded with 52 passengers including two infants in arms. The crew consisted of Captain Albert C. Lyons. Copilot John R. Mason, and Stewardess Doris Helm. A fourth company employee who was deadheading to Miami occupied the jump seat. The aircraft's center of gravity was located Within prescribed limits. Actual takeoff weight of the aircraft was about 117 pounds over the prescribed maximum of 48.000 pounds. A flight plan was made out and signed by both the captain and copilot. It specified VFR (Visual Flight Rules) direct flight at a cruising altitude of 4,000 feet to Tampa, Florida. After the aircraft was loaded both engines were run up. The right me was run up longer than the left engine, and a number of nearby persons saw smoke continuously coming from that engine. This spoke was variously described as being \"white,\" \"grey\" and \"light\" in color. The Newark Control Tower then gave the aircraft taxying instructions and advised the captain that he had a choice of Runway Nos. 24 or 28 for takeoff. The captain chose No. 28. The flight was then cleared for takeoff at 1502 and immediately started down the runway. The tower recorded that the aircraft left the ground at approximately 1503. Immediately after becoming airborne, the landing gear was seen to retract. At this point tower personnel for the first time observed a trail of White smoke from the right side of the aircraft and the tower supervisor, fearing a fire, pressed the airport crash alarm button. The tower then advised the flight as follows: \"1678M, you can land any my possible, any way you wish, cleared back to the field.\" This was not acknowledged. 'The takeoff run was normal but the subsequent climb was slow. The right engine emitted a continuous smoke trail as previously described. A captain employed by Miami Airline witnessed the takeoff. Believing that the source of the smoke was an overheated right brake, he immediately telephoned the control tower and asked that the flight he advised of his impression, suggesting that the landing gear not be raised and that it he extended if it had been raised. The tower complied, the flight acknowledged, and the landing gear was seen to extend. The tower then sent the following message: \"1678M the wind is west at 20, Runway 6, the airport is yours, you're cleared to land, Runway 6.\" There was no acknowledgement. The aircraft continued straight ahead in the direction of takeoff for a distance of approximately four miles, slowly gaining an altitude of approximately 800 to 1,000 feet. The smoke continued to increase in volume and shortly before the four-mile point was reached black smoke and actual flame were seen coming from the underside of the right nacelle as the landing gear was lowered. Shortly after the landing gear was extended, a large, \"ball of fire\" was seen coming from underneath the right nacelle. 3 The aircraft then started a gradual left turn banked at an estimated 10 degrees. This turn and subsequent flight continued for an additional distance of approximately 4 1/2 miles with altitude continuously being lost, until the aircraft was approximately 3 miles Southwest of Runway 28 of the Newark airport. During this period of the flame from the right nacelle appeared to go out for a period of a few seconds, and then start again. It was indicated that the speed of the aircraft throughout the entire flight had been somewhat slow and that during the latter portion of the flight the speed became progressively slower, and the right propeller was turning slowly. The aircraft at this time was over the City of Elizabeth, New Jersey, and was nearly 60 degree from alignment with and approximately two and one-fourth miles distant from Runway 6 of the Newark Airport. At this point and at an estimated altitude of about 200 feet the aircraft's then low left wing dropped about vertically downward with the right wing coming vertically upward and the aircraft fell with relatively little forward speed. Just before striking the ground the aircraft's left wing tip struck the gabled roof of a vacant house near its ridge. The aircraft continued ahead and down, struck a brick building used by the City of Elizabeth as a storage for water supply department materials, damaged this building and plunged a few feet ahead to the bank of the Elizabeth River, where it came to rest. The wreckage was in a generally inverted position and partially submerged in shallow water. A severe gasoline fire developed instantly, spreading to and damaging the storage building. Nearby fire fighting apparatus arrived quickly and about 17 minutes later, the fire was extinguished. All aboard were killed and one person on the ground was seriously injured.", "probable_cause": "The Board determines that the probable cause of this accident was a stall with the landing gear extended following a serious loss of power from the right engine. This loss of power was caused by the failure of the hold-down studs of the No. 10 cylinder, precipitating a fire in flight which became uncontrollable. The following findings were pointed out:\r\n- The aircraft was loaded above its maximum allowable takeoff weight,\r\n- An abnormal amount of smoke trailed from the right engine during runup, takeoff and climb,\r\n- The hold-down studs of No. 10 cylinder were sound metallurgically,\r\n- The failure from fatigue of No. 10 cylinder's hold-down studs, due to improper installation of their nuts, caused the cylinder to separate completely from the crankcase during or shortly after takeoff,\r\n- A fire started at the base of No. 10 cylinder, rapidly becoming uncontrollable,\r\n- The flight was cleared by the tower to return and land at Newark Airport using any runway,\r\n- The wheels were lowered upon advice from the ground, relayed by the tower, by a company employee, acting in his best considered judgment,\r\n- The right propeller was partially feathered in flight,\r\n- The right wing did not fail in flight,\r\n- While attempting to return to the Newark Airport, the aircraft stalled at an altitude of approximately 200 feet, fell sharply to its left, struck buildings, and crashed on the bank of the Elizabeth River,\r\n- The carrier's pilot training program on emergency procedures was informal, irregular, and therefore inadequate."}