{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-7-102-dash-7-ashburton-2-killed", "date": "Nov 28, 1998 at 0947 LT", "type": "De Havilland DHC-7 (Dash-7)", "operator": "DNK Aviation Services", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Saint Peter - Saint Peter", "msn": "84", "yom": 1982, "flight_number": null, "city": "Ashburton", "zone": "Devonshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 15000, "captain_hours_type": 4000, "copilot_hours": 17200, "copilot_hours_type": 1700, "aircraft_hours": null, "circumstances": "Prior to the flight the commander had filed a flight plan which indicated that after take off the aircraft would transit from Guernsey to the Berry Head VOR at FL 100. It was then planned to manoeuvre in the Plymouth area whilst conducting a performance related test flight. The  commander called for start clearance at 0902 hrs and, after a short taxi, the aircraft was cleared for take off at 0918 hrs. After take off Guernsey ATC handed the aircraft over to the London Air Traffic Control Centre (LATCC) at 0930 hrs. As the aircraft approached Berry Head at FL 100 the commander requested FL 60. The aircraft was cleared for this descent and then handed over to Exeter ATC at 0943 hrs. Exeter ATC confirmed the aircraft requirements for a block of airspace between FL 60 and FL 100 and offered a radar advisory service. The aircraft was then vectored onto a northerly heading to keep it clear of departures from Plymouth Airport. As the aircraft approached FL 60 the commander requested further descent to FL 50, which was approved. The air traffic controller at Exeter then noticed that the altitude readout from the aircraft radar transponder indicated FL 47. He called the aircraft to confirm the local sector safe level of 3,500 feet but received no reply; this call was timed at 0947 hrs. From FDR timings the crew would not have heard this call. At the same time the transponder information disappeared from the radar screen and the primary radar return was no longer visible. The controller made repeated calls to the aircraft but received no reply. He arranged for LATCC to inform the Distress and Diversion cell whilst he notified the local emergency services. A large number of eye witnesses saw the aircraft in its final descent before impacting the ground; twenty two of these witnesses were interviewed. All agreed that the sky was clear and bright with only a few of them describing small amounts of light cumulus clouds. No one saw any other aircraft in the area and all were certain that there was no smoke or fire issuing from the aircraft or its engines whilst it was in the air. Most witnesses described the aircraft in a spin or a spiral descent, generally to the left, although some described the motion as like a falling leaf. Four witnesses, who all had a clear view of the aircraft throughout, described the aircraft completing a two or three turn spin/spiral to the left. Those witnesses who were in a position to hear clearly the sound of the engines confirmed that the engines were making a loud noise as if at a high power setting. The impact with the ground was followed immediately by a post crash fire. Both pilots were killed. ", "probable_cause": "A sustained ground fire had largely destroyed the wreckage. However, it was established that the aircraft had been structurally complete. The No 1 propeller was feathered and the flaps were fully and symmetrically retracted. There was no evidence of any mechanical malfunction. The two pilots had flown together previously on many occasions. On this flight the commander occupied the right seat from and made all radio transmissions. It was his normal practise to direct the flight, set the required engine power and to record data. This then allowed the FO, who occupied the left seat, to concentrate on flying the aircraft. The commander initially asked ATC for a block of airspace from FL 60 to FL 100 and then requested a base of FL 50. This was entirely consistent with the intention to perform a 3-engine climb. It would be normal practice to configure the aircraft for the next test point during the descent to the planned base altitude, as had been done on the previous flight. On this occasion however, the flap was not selected to 25° but remained fully retracted. In accordance with the configuration  requirements for the 3-engine climb the No 1 the propeller was feathered and the engine was shut down. With the autopilot engaged and the 3 operating engines at a low power setting the aircraft levelled at FL 50 and the speed reduced. During this speed reduction the crew should have noted the trim wheel rotating as progressive nose up trim was being applied by the autopilot. It is possible that the non-handling pilot may have interpreted this as a manual trim input by the handling pilot. There would also have been clear aural and tactile warnings, via the stick shaker, that the aircraft was approaching the stall. Although both pilots were familiar with the test schedule the aircraft was not correctly configured for this particular test. Furthermore, the autopilot was retained down to the point of the stall and there appears to have been no adequate response to the stick shaker. If the crew were unaware of the flap configuration error then the stall warning may have surprised them but for a crew of their experience to fail to react correctly to the compelling intervention of the stick shaker is most unusual. However, the possibility of some distraction cannot be discounted. The available evidence therefore suggests that normal crew operation and co-ordination was lacking during this phase of flight. In the absence of a working CVR it is not possible to state why this occurred. The aircraft stalled with the autopilot still engaged. Power was increased on the three operating engines and two seconds later the autopilot was deselected. The application of asymmetric power ultimately caused the aircraft to roll rapidly to the left and this motion was countered by the application of right rudder and right spoiler. The elevator was then moved to the full nose up demand position. With the exception of decreasing application of right spoiler the controls remained in these positions until just prior to impact when the engine power was reduced. The flight control inputs and the changes to engine power suggest that both pilots were involved in the aircraft operation throughout the descent to the ground. The progressive and sustained rudder inputs together with the constant application of full aft control column also suggest that the same pilot retained authority over these flight controls. However, some of the crew actions were unusual. The non-handling pilot would have been ready to apply take-off power on the three operating engines in order to initiate the climb but the application of asymmetric power at the stall inevitably led to autorotation and was therefore inappropriate. The application of opposite rudder by the handling pilot was a normal pilot response but the application of full aft control column following the stall is inexplicable, irrespective of whether the pilot subsequently believed that he was in a spin or a spiral dive. Analysis of the manufacturer's flight test data during prolonged stalls provided no evidence of any elevator overbalance due to aerodynamic loads on the lower surface of the elevator. Moreover, in this instance, following the application of asymmetric power the aircraft adopted large bank angles that would have further reduced any aerodynamic load on the lower elevator surface. It is therefore considered most probable that the control column was placed in the fully aft position by the pilot. The nose-up elevator trim, applied by the autopilot before its disconnection, would have produced unexpected control forces when positioning the control column for recovery such that the normal release of back pressure would have been ineffective. However, this does not explain the subsequent application of full aft control column. It is possible that the rapid autorotation that followed the application of asymmetric power at the stall caused the handling pilot to become disorientated. The high longitudinal control forces that had been generated by the application of full nose up trim by the autopilot prior to the stall may then have exacerbated his difficulties."}