{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-340-35-midland", "date": "Mar 16, 1954 at 0838 LT", "type": "Convair CV-340", "operator": "Continental%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "El Paso – Midland – Kansas City", "msn": "44", "yom": 1953, "flight_number": "CO046", "city": "Midland", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11038, "captain_hours_type": 620, "copilot_hours": 2742, "copilot_hours_type": 659, "aircraft_hours": 3099, "circumstances": "At 0833 Trip 46 was cleared to Runway 10 for takeoff. At this time the aircraft carried 585 gallons of fuel and was loaded to a gross takeoff weight of 36,345 pounds which was 10,655 pounds less than the maximum allowable. The load was properly distributed so that the center of gravity of the aircraft was within the approved limits. A pre-takeoff check was conducted adjacent to Runway 10 at which time the propellers, engines and instruments gave normal Indications. A part of this check included moving the control column fore and aft and turning the wheel left and right in order to check the control system for freedom of movement and full travel. At 0838 the flight was cleared for takeoff which was made using normal takeoff power. Immediately after becoming airborne the crew noted a slight vibration which was attributed to an unbalanced condition of the spinning main landing gear wheels. Captain Persing applied brakes during the landing gear retraction to eliminate this vibration; however, it not only continued but rapidly increased in severity. The aircraft reached an altitude of approximately 75 feet, the highest attained, and was near the airport boundary when the vibration stopped with a sudden jolt and the aircraft assumed a nose-down attitude. The first officer immediately sensing the situation joined the captain and both exerted their entire strength applying back pressure to their respective control columns to keep the aircraft from plunging into the ground. The captain quickly reduced power; however, the nose-down pressure could not be completely overcome. The first officer used nose-up trim control in an effort to relieve the nose-down pressure; this action had no appreciable effect and during the last attempt the trim tab control wheel appeared to be stuck. The captain established a shallow left turn with the thought of returning to the airport and continued the turn about 45 degrees from the takeoff heading. As air speed decreased power was momentarily increased whereupon it became evident to the crew that using power sufficient to maintain flight resulted in an insurmountable nose-down pressure. The captain therefore decided to make a wheels-up landing straight ahead. Close to the ground the first officer closed the throttles and the captain pulled the electrical crash bar. Contact with the ground followed with the aircraft in a near-level attitude and at approximately 100 m.p.h. Although the passengers and crew received injuries of varying degrees, they were able to get out of the aircraft unassisted in an orderly manner. The evacuation was mainly through the rear service door (emergency exit) and was accomplished in about 30 seconds. There was no fire.", "probable_cause": "The Board determines that the probable cause of this accident was loss of control due to a failure of the right elevator trim tab push-pull rod caused by a reversed installation of the right elevator trim tab idler as a result of the carrier’s reliance on the Manufacturers Illustrated Parts Catalog as a maintenance reference. The following findings were reported:\r\n- Immediately following a normal takeoff the right elevator trim tab push-pull rod failed and the stub end became wedged, holding the trim tab in a full-up or aircraft nose-down position,\r\n- The trim tab position resulted in the crew being unable to control the aircraft and a wheels-up landing resulted,\r\n- The push-pull rod failed as a result of excessive stresses caused by interference resulting from a reversed idler installation,\r\n- The right elevator trim tab assembly as removed, reinstalled, inspected and functionally checked by company maintenance personnel 14:40 flight hours prior to the accident,\r\n- Correct positioning of the right idler component could not be determined from the Maintenance Manual figure, 7.4.101, which the carrier considered appropriate for the installation,\r\n- The Manufacturers Illustrated Parts Catalog was used in accordance with company policy as an installation reference to determine the idler position,\r\n- Under conventional interpretation of the appropriate exploded diagram of the Parts Catalog, the idler was installed in reverse,\r\n- The Illustrated Parts Catalog was not intended and should not have been used as a maintenance reference."}