{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-62af-anchorage-5-killed", "date": "Jan 13, 1977 at 0635 LT", "type": "Douglas DC-8", "operator": "Japan%20Airlines-3", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Moses Lake - Anchorage - Tokyo", "msn": "46148/553", "yom": 1971, "flight_number": "JL8054", "city": "Anchorage-Ted Stevens Intl", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 23252, "captain_hours_type": 4040, "copilot_hours": 1603, "copilot_hours_type": 1207, "aircraft_hours": 19744, "circumstances": "On January 13, 1977, a Japan Air Line (JAL) McDonnell-Douglas DC-8-62F, JA 8054, operated as an international charter cargo flight from Moses Lake, Washington, U.S.A., to Tokyo, Japan. An en route stop and crew change were scheduled at Anchorage, Alaska. The aircraft arrived at Anchorage at 0503. The incoming flightcrew reported that the only weather they encountered en route was a layer of fog on the final approach at 800 feet, and that they did not encounter any precipitation or icing. The aircraft was serviced and a walk-around inspection was performed by JAL maintenance personnel and contract mechanics. The two contract mechanics stated that there was ice on the inlet guide vanes, the engine cowlings, and the engine bullet noses, but no ice was reported on the airfoil surfaces. The JAL personnel stated that they did not see any ice on the aircraft. One contract mechanic advised the JAL representative that the engine anti-icing system should be used by the next crew to clear the ice in the engine inlets. No maintenance was performed on the aircraft. The outbound flightcrew was wakened about 0330, left the hotel by taxi about 0430, and arrived at the JAL dispatch office about 0 0500. The taxicab driver who brought the outbound crew to the airport stated that he became concerned by the captain's actions in the taxi and called his dispatcher to report his impressions. He stated that the captain's movements were uncoordinated; that his face was flushed and his eyes were glazed; that his conversation was garbled and incoherent; that his movements were jerky and unstable; and that he had trouble getting out of the cab and had to steady himself on the car door. About 0450 the taxi dispatcher called the operations agent for the contract maintenance company and reported that one of her drivers had taken an \"intoxicated\" JAL captain to the airport. The operations agent stated that \"...it seemed logical that JAL would detect anything unusual and act accordingly.\" He further stated that a 0620, he notified his line manager of the conversation with the taxi dispatcher and that \"I felt that if the captain was intoxicated JAL OPS...or his first officer would have stopped the flight immediately.\" The JAL dispatch personnel and the inbound JAL crew stated that they noted nothing unusual about the outbound crew. The dispatch briefing proceeded smoothly and no significant questions were asked by the outbound crew. The outbound crew consisted of an American captain and a Japanese first officer and flight engineer. They went to the aircraft about 0515 and boarded the aircraft with the two cattle handlers. The driver of the crew car, a friend of the captain, stated that \"...he was in good condition as far as way's I've seen him sometimes and I made that statement before I ever heard any rumors that he was supposedly drunk or had been partying or whatever.\" A review of the cockpit voice recorder (CVR) indicated that about 0603 the captain and first officer were checking the inputs to the inertial navigation system. They also checked the Automatic Terminal Information Service (ATIS) for local visibility, received their clearance, and began their prestart checklists about 0609. The weather on the ATIS report was in part: \"...sky partially obscured, visibility one-quarter mile, fog...\". The checklists were completed and the takeoff data reviewed. About 0615 the engines were started and the stickshaker (stall warning system) was tested. The after-start checklist was completed and the aircraft was cleared to taxi to runway 24L. During the taxi, the flight engineer requested and received permission from the captain to turn the engine anti-ice system on because of the ice on the inlet guide vanes. The flight controls and spoilers were checked while taxiing and the flaps were extended to 23°. The taxi checklist was completed and the takeoff data, the flap settings, and the trim settings were again reviewed. The captain, in response to the challenge \"anti-ice, de-ice, and rain removal,\" said, \"Ok, we will use engine anti-ice.\" The de-ice system was reported \"off'' by the flight engineer. The captain briefed the crew on the takeoff and abort procedures he would use. He commented that the runway was slippery and he didn't think they would abort. The captain taxied the aircraft southeast on the ramp, past the terminal toward runway 24L. He stopped on the ramp after being instructed to hold short of runway 24R. After several communications with the controller, the aircraft taxied onto runway 24R, and reported ''...ready for takeoff.\" The tower advised the captain that he was on runway 24R which the captain contradicted. The controller then issued taxi instructions to get the aircraft to runway 24L. The captain made a 180° turn on runway 24R before he finally taxied to the taxiway which leads to the approach end of runway 24L. The crew again reported that they were ready for takeoff at 0633:37. Takeoff was initiated and at 0634:32 the captain called \"maximum power\". At 0634:50 the captain announced, \"I have\" and at 0634:52, \"80\" (knots) was called by the copilot. At 0635:10, \"Vee one\" was called by the copilot and at 0635:16 rotation was called and acknowledged by the captain. At 0635:19.5 the captain called \"Ten degrees\" and at 0635:21.4 the first officer called V2. At 0635:26.2 a sound similar to aircraft buffet was recorded. This sound became more frequent and continued until the sounds of impact. At 0635:32 the first officer called \"Gear up\" and at 0635:33 the flight engineer said \"Too much speed (steep)\".' At 0635: 38 the engineer called \"stall\" simultaneously the stickshaker sounded and continued until 0635:39.3, when impact was recorded. A witness near the departure end of the runway saw the aircraft climb to an estimated altitude of about 100 feet above the ground, veer to the left, and then slide '... out of the air.\" The aircraft was totally destroyed upon impact and all five occupants were killed as well as the 56 cows. ", "probable_cause": "The probable cause of the accident was a stall that resulted from the pilot's control inputs aggravated by airframe icing while the pilot was under the influence of alcohol. Contributing to the cause of this accident was the failure of the other flightcrew members to prevent the captain from attempting the flight."}