{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-montezuma-1-killed", "date": "Jun 24, 1983 at 1140 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Norman L. Marxen", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Van Wert - Montezuma", "msn": "61-0276-106", "yom": 1976, "flight_number": null, "city": "Montezuma-Lakefield", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5500, "captain_hours_type": 1217, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1227, "circumstances": "When the pilot arrived at the destination airport, there was construction on the runway, about 2500 feet from the approach end. He contacted Unicom and was advised that the runway was closed, but was told he could land on the grass beside the runway. The pilot responded that the grass area was too rough. He stated, 'I think I can land on the runway available, there seems to be enough length there.' Subsequently, the aircraft was observed approaching runway 08 at an estimated 30 feet agl with the gear and flaps down. Reportedly, the power was increased, the nose assumed a climb attitude and the gear was retracted. The aircraft then rolled left, dove to the ground and crashed. An exam of the wreckage revealed no evidence of a preimpact part failure or malfunction. An evaluation of this make and model of aircraft revealed that when the cg approached the aft limit, and the flaps were extended, the aircraft had reduced yaw and roll controllability during power on stalls. The flaps were found full down. The pilot, sole on board, was killed. ", "probable_cause": "Occurrence #1: loss of control - in flight\r\nPhase of operation: go-around (VFR)\r\nFindings\r\n1. (f) planned approach - improper - pilot in command\r\n2. Go-around - initiated - pilot in command\r\n3. (f) raising of flaps - not performed - pilot in command\r\n4. (c) airspeed (VMC) - not maintained - pilot in command\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: go-around (VFR)"}