{"url": "https://www.baaa-acro.com/crash/crash-cessna-f406-caravan-ii-mwanza-2-killed", "date": "Apr 3, 2008 at 1624 LT", "type": "Cessna 406 Caravan", "operator": "Auric%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Mwanza - Mwanza", "msn": "406-0030", "yom": 1989, "flight_number": null, "city": "Mwanza", "zone": "Mwanza Region", "country": "Tanzania", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2900, "captain_hours_type": 600, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew consisting of one instructor and one pilot under supervision departed Mwanza for a local training flight with approaches and touch-and-go manoeuvres. Shortly after takeoff from runway 12, while climbing to an altitude of 800 feet, the twin engine aircraft rolled to the right then entered a right turn and an uncontrolled descent before crashing on the top of a small hill located 890 metres from the runway 30 threshold. The aircraft was totally destroyed and both pilots were killed, a British instructor and an Australian citizen pilot under training. ", "probable_cause": "The crew was supposed to conduct several touch-and-go maneuvers and the instructor wanted to simulate an engine failure. Shortly after takeoff from runway 12, the aircraft rolled to the right while the right engine was turning at low RPM, presumably as a result of the instructor's decision to reduce the engine power. Due to a poor reaction by the pilot under supervision and an insufficient altitude to regain control, the aircraft lost altitude and crashed. The crew was supposed to initiate a left turn during initial climb, according to ATC instructions, but due to the power reduction on the right engine, the aircraft banked right then turned right and entered an uncontrolled descent. A wind from 090 gusting at 18 knots remained a contributing factor as it contributed to the aircraft rolling to the right."}