{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-52d-75-do-stratofortress-near-burns-5-killed", "date": "Jun 23, 1959 at 1200 LT", "type": "Boeing B-52 Stratofortress", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Seattle - Seattle", "msn": "17274", "yom": 1956, "flight_number": null, "city": "Burns", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 11:05 a.m. on Tuesday, June 23, 1959, Tommy’s Tigator took off from Boeing Field for an experimental low-level flight test. Five employees of the Boeing Airplane Company were on board the B-52D: Lewis E. Moore, commander/pilot; Joseph Q. Keller, copilot; Gerald G. Green, navigator; Charles K. McDaniel and Neil Johnson, flight-test engineers. The aircraft had been making test runs over Eastern Washington, Oregon, and Idaho since April 10, 1959, and was loaded with special electronic equipment for measuring stresses on the airframe and flight surfaces. The bomber was scheduled to fly at lower than 500 feet above the ground on an elliptical course from The Dalles, Oregon, to Malheur Lake, Burns, and back to Walla Walla, Washington, at near maximum speed of 638 miles-per-hour. At 11:30 a.m., Tommy’s Tigator radioed that it was over The Dalles and preparing to descend for the low-level test flight. No further reports were heard from the pilot after it passed the checkpoint. Leslie Heinz, a lineman for the Harney County Rural Electric Cooperative, was an eyewitness to the accident. He was working with a crew on power lines in a remote area approximately 35 miles west of Burns and three miles from the crash site. At about 12:00 noon, he spotted the B-52 flying southeast approximately 300 feet above the desert floor when it suddenly crashed. The aircraft disintegrated on impact and all five crew members were killed:\r\nCrew:\r\nLewis E. Moore, pilot,\r\nJoseph Quentin Keller, copilot,\r\nGerald G. Green, navigator,\r\nNeil Johnson, flight engineer,\r\nCharles Kenneth McDaniel, flight engineer.\r\nSource: http://www.historylink.org/File/10063", "probable_cause": "The investigation by Air Force and Boeing experts concluded the accident was caused by the catastrophic failure of the horizontal stabilizer (tail plane), affecting the B-52’s longitudinal stability. The plane was not designed for the excessive turbulence of high-speed, low-level flight and began to disintegrate. Minus the horizontal stabilizer, the nose of the plane pitched sharply upward and it stalled, struck a knoll and exploded. At an altitude of 500 feet, there was virtually no chance for the crew to escape."}