{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh86a-express-geraldton-2-killed", "date": "Jun 24, 1945 at 1030 LT", "type": "De Havilland DH.86 Express", "operator": "MMA-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Perth – Geraldton – Carnarvon – Port Hedland", "msn": "2310", "yom": 0, "flight_number": null, "city": "Geraldton", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 10000, "captain_hours_type": 900, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "This was its inaugural MMA service, from Perth to Geraldton and Carnarvon. After refueling at Geraldton, the takeoff appeared normal but the aircraft did not climb and turned back for a landing. It flew low over RAAF hangars at about 300 feet then made a steep turn to port, followed by a wide low circuit back to the runway with port wing low. When just inside the aerodrome boundary, it dropped heavily on the starboard main undercarriage, bounced, contacted the ground with the tail wheel and bounced again. Striking the ground for the third time, this time on the port main wheel, as it bounced higher, engine power was applied but the aircraft swung to the left, banking steeply until the left wings were torn off by ground contact. The aircraft cartwheeled and hit the ground nose-first. The fuselage broke up, spilling out most of the 11 occupants. Captain Branch and one passenger were killed, the other 9 occupants seriously injured.\r\nCrew:\r\nH. J. Branch, pilot,\r\nDon W. Rumney, copilot.\r\nSource: \r\nhttp://www.goodall.com.au/australian-aviation/dh86/dh86.html", "probable_cause": "The DCA accident investigation report placed the blame squarely on Captain Branch: “The accident was caused by an indifferent landing which had worsened until the aircraft became completely out of control.” However the investigation panel was criticized for not including, or failing to take evidence from, any DCA officer involved in previous Australian DH.86 accidents. Their report acknowledged that the type was prone to swung during takeoff or landing and that such swings were usually difficult to control, and listed 9 accidents to Australian DH.86s involving such swings. But the report did not address the extreme port wing drop soon after airborne or the reason for returning, or the very wide circuit so close to the ground. It seemed that events prior to touchdown were deemed irrelevant."}