{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-near-whanganui-1-killed", "date": "Jul 7, 1964 at 1012 LT", "type": "Fletcher FU-24", "operator": "Wanganui%20Aero%20Work", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Whanganui - Whanganui", "msn": "53", "yom": 1957, "flight_number": null, "city": "Wanganui", "zone": "Manawatu-Wanganui (Horizons Regional Council)", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was the holder of a Commercial Pilot Licence and had recently completed an agricultural flying training course at Wanganui. On the 6th of July, 1964 he was doing further practice flying to increase his experience in the FU24 before commencing agricultural flying work. He was briefed by the chief pilot to load the hopper of ZK-BOA with about 8 hundredweight (896 pounds /407 kg) of sand and to proceed to an approved low-flying practice area and familiarise himself with the feel of the aircraft at the threshold of a stall, but not to incur a full stall. This exercise was to be carried at a height of between 1,000 and 1,500 feet. The plane was seen by a number of eyewitnesses in the Mosstown area, about five miles from the airport, to be flying both low and slow. One witness, a 150-hour pilot, said he was perturbed by the height, speed, and type of flying being undertaken. He estimated the height to be between 150 and 200 feet while making low speed runs and turns, and at times the nose of the Fletcher would pitch down followed by an increase in engine noise. Impact with the ground was not observed by anyone, but one person who had seen the plane flying at between 100 and 200 feet heard the thud of the crash two or three minutes later. ", "probable_cause": "Evidence at the crash site showed the the plane had hit the ground in a steep diving turn to the left, leading to the conclusion that a stall had occurred in a turn and that the impact happened while it was gaining momentum in an uncontrolled left-hand spiral. Normally an FU24 would fly itself out of such a situation given sufficient height. ZK-BOA was totally wrecked in the crash, but fire did not occur. This was not a survivable accident. There was no evidence of structural or engine failure prior to the impact. The flying weather was CAVU and calm. The crash investigator concluded that the plane had stalled at about 200 feet AGL, and that the port wing dropped steeply and the aircraft struck the ground before control could be regained. It was also concluded that the pilots relative inexperience, both in total flying and in the FU24, was a major factor in this accident. "}