{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-pias-9-killed", "date": "Mar 6, 2013 at 0741 LT", "type": "Beechcraft 200 Super King Air", "operator": "Aero%20Transporte", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Lima - Pias", "msn": "BB-1682", "yom": 1999, "flight_number": null, "city": "Pias", "zone": "La Libertad", "country": "Peru", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 4509, "captain_hours_type": 312, "copilot_hours": 994, "copilot_hours_type": 425, "aircraft_hours": 3859, "circumstances": "The twin engine aircraft departed Lima-Jorge Chávez Airport at 0625LT on a charter flight to Pias, carrying two pilots and seven employees of the Peruvian company MARSA (Minera Aurífera Retamas) en route to Pias gold mine. On approach to Pias Airport, the crew encountered limited visibility due to foggy conditions. Heading 320° on approach, the crew descended too low when the aircraft collided with power cables, stalled and crashed on the slope of a mountain located 4,5 km from the airport, bursting into flames. The aircraft was destroyed by impact forces and a post crash fire and all 9 occupants were killed. ", "probable_cause": "Loss of control following the collision with high power cables after the crew lost visual references during an approach completed in poor weather conditions. The following contributing factors were identified:\r\n- Inadequate meteorological information provided by the Pias Airport flight coordinator that did not reflect the actual weather condition in the area, \r\n- Lack of a procedure card to carry out the descent, approach, landing and takeoff at Pias Airport, considering the visual and operational meteorological limitations in the area,\r\n- The copilot training was limited and did not allow the crew to develop skills for an effective CRM in normal and emergency procedures."}