{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-30-dk-la-grande-4-2-killed", "date": "Feb 28, 1989 at 0633 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Trans%20Fair", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "La Grande-4 - Lake Bienville", "msn": "13845/25290", "yom": 1944, "flight_number": null, "city": "La Grande-4", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A DC-3C, registration C-FBZN, owned by Transfair was destroyed in an accident shortly after take off from the La Grande-LG-4 airstrip, QC. Both crew members were fatally injured. The system used for de-icing the wings on the ground was available at the airport, but it was not used. A broom was used to remove snow and ice from the wings. The airplane departed with some ice still present on the wings. The airplane took off at 06:35 for a visual flight rules (VFR) charter flight to Lac Bienville, QC. The aircraft, with two crew members, was transporting drums of kerosene (Jet B) for a Hydro-Quebec contractor. An eye witness said that the takeoff from runway 10 was normal and that the pilot initiated a left turn at low altitude immediately after the landing gear was retracted. But shortly after takeoff the crankshaft of the left engine failed between the two banks of cylinders. The rear section of the engine continued to operate because it was still connected to its key accessories, including the magnetos; however, its power could not be transmitted to the propeller. The tachometer, which was also mounted on the rear section of the engine, was still providing an engine rpm reading. The failure of the crankshaft caused the front part of the engine to misfire, and the pistons were no longer synchronized with the ignition timing of the magnetos. This seriously disrupted engine operation and caused a rapid decay of rpm in the front section of the engine, which drives the propeller governor. The propeller governor regulates propeller rpm by adjusting the blade pitch angle, thus maintaining the selected rpm despite variations in engine power. When the propeller governor detected a decrease in engine power, it adjusted the blades to a lower pitch angle to reduce the torque required to maintain rpm. The additional drag generated by the left propeller operating at a low pitch angle was further aggravated by the requirement for more power to windmill the propeller, as it was affected by the resistance created by the erratic functioning of the cylinder bank with which it was engaged. The crew may not have recognized the engine failure and was not able to feather the left propeller in time. A left hand turn was initiated in an attempt to return for a landing. While the pilot was trying to maintain the aircraft in flight, its critical angle of attack was probably exceeded, and the aircraft stalled in the turn.", "probable_cause": "There was ice on the wings of the aircraft on take-off. Following the failure of the left engine after take-off, and while the pilot may have been attempting to return to land, the aircraft stalled in the turn and crashed."}