{"url": "https://www.baaa-acro.com/crash/crash-fairchild-hiller-fh-227b-saint-louis-38-killed", "date": "Jul 23, 1973 at 1743 LT", "type": "Fairchild-Hiller FH-227", "operator": "Ozark%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "City", "schedule": "Nashville – Clarksville – Paducah – Cape Girardeau – Marion – Saint Louis", "msn": "513", "yom": 1966, "flight_number": "OZ809", "city": "Saint Louis-Lambert", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 41, "pax_fatalities": 37, "other_fatalities": 0, "total_fatalities": 38, "captain_hours": 9170, "captain_hours_type": 4382, "copilot_hours": 3921, "copilot_hours_type": 989, "aircraft_hours": 14300, "circumstances": "Ozark Air Lines Flight 809, an FH-227B, was a regular flight between Nashville Metropolitan Airport, TN (BNA) and St. Louis (STL), with intermediate stops at Clarksville, TN (CKV), Paducah, KY (PAH), Cape Girardeau Airport, MO (CGI) and Marion-Williamson County Airport, IL (MWA) with an instrument flight rules (IFR) flight plan. The flight departed Marion at 17:05. The flight proceeded via the V-335 airway toward St. Louis without difficulty. At 17:26, the Kansas City Air Route Traffic Control Center (KCC) controller requested that Flight 809 make a 360 degree turn to the right. He advised that there would be about a 5-minute delay and that the right turn would keep the flight clear of the weather. At 17:28, the KCC controller cleared the flight to proceed to the St. Louis VOR and to contact St. Louis Approach Control. One minute later the first officer transmitted, \"Approach, this is Ozark eight oh nine, seven thousand, with Quebec.\" Weather information 'Quebec' indicated: Estimated ceiling-4,000 feet broken, visibility-5 miles, haze and smoke, wind-120° at 8 knots , temperature-92 degrees, altimeter-30.06, ILS runway 12R approaches in use, landing and departing runways 12. The approach controller responded: \"Ozark eight oh nine, Roger, maintain seven thousand and, ... continue toward the VOR, be vectors runway three zero left ILS.\" Between 17:32 and 17:39, the approach controller gave Flight 809 radar vectors through an area of thunderstorm cells that lay south and southeast of the St. Louis Airport. At 17:40, the controller cleared the flight for an ILS approach to runway 30L and cleared the flight crew to contact the St. Louis Control Tower. The Tower controller cleared the flight to land. At 17:42:31, the local controller said, \"Ozark eight oh nine, it looks like a heavy rain shower moving right across the approach end of the runway now.\" The first officer replied, \"Roger, we see it.\" After passing the Outer Marker, the aircraft began to descend below the glide slope until it struck the ground. First, the aircraft struck tree tops about 55 feet above the ground then crashed on a hillside located less than two miles from runway 30L threshold, in the district of Normandy. Two crew members and four passengers survived while all 38 other occupants were killed. ", "probable_cause": "The aircraft's encounter with a downdraft following the captain's decision to initiate and continue an instrument approach into a thunderstorm. The captain's decision probably was influenced by the lack of a timely issuance of a severe weather warning by the National Weather Service, and the improper assessment of the weather conditions in the terminal area by the flight crew and the flight dispatcher."}