{"url": "https://www.baaa-acro.com/crash/crash-learjet-45-mexico-city-16-killed", "date": "Nov 4, 2008 at 1846 LT", "type": "Learjet 45", "operator": "Mexican Government", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "No", "site": "City", "schedule": "San Luis Potosí – Mexico City", "msn": "45-028", "yom": 1999, "flight_number": null, "city": "Mexico City", "zone": "Federal District of Mexico City", "country": "Mexico", "region": "Central America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 7, "total_fatalities": 16, "captain_hours": 4000, "captain_hours_type": 180, "copilot_hours": 11809, "copilot_hours_type": 57, "aircraft_hours": 2486, "circumstances": "Following an uneventful flight from San Luis Potosí, the crew was cleared to the MATEO VOR and for an ILS/DME approach to runway 05R at Mexico-Benito Juarez Intl Airport, then was instructed by ATC to increase their speed to 220 knots. The Learjet was trailing a Boeing 767-300 (Mexicana Flight 1692 from Buenos Aires), which was instructed to decrease speed to 160 knots to maintain separation with a preceding Airbus A318. At 18:41 a further instruction was given to slow down to an indicated airspeed of 150 knots. At 18:42 the Boeing 767 crossed MATEO VOR at a ground speed of 224 knots. The Learjet was following at 8 nautical miles (NM) at a ground speed of 272 knots. At 18:44 the controller instructed Mexicana Flight 1692 to slow down to the minimum approach speed. At that time, the Learjet 45 was crossing the MATEO VOR with a ground speed of 262 knots, approximately 5.7 NM behind. The controller then instructed the Learjet crew to reduce their airspeed to 180 knots. This was acknowledged but it took 16 seconds for the crew to take action. Separation between the Boeing 767 and Learjet had decreased to 3.8 NM and the Learjet entered the wake turbulence of the 767. Control was lost and the aircraft entered an uncontrolled descent, crashing on the Monte Pelvoux and Ferrocarril de Cuernavaca Avenues. The aircraft disintegrated on impact and all 9 occupants were killed as well as 7 people on the ground. Some buildings were damaged, about 20 cars were destroyed and 40 people on the ground were injured, some seriously. Among the passengers were:\r\nJuan Camilo Mouriño Terrazo, Interior Minister, \r\nJosé Luis Santiago Vasconcelos, General Attorney,\r\nMiguel Monterrubio Cubas, Director for Social Communication.", "probable_cause": "Loss of control at low altitude and subsequent impact of the aircraft with the ground after it encountered wake turbulence caused by a preceding aircraft.\r\nThe following contributing factors were identified: \r\n- Lack of adequate crew training on Learjet 45,\r\n- Delay of the crew to reduce the approach speed,\r\n- Lack of Air Traffic Control to correct the excessive approach speed of the aircraft,\r\n- Fatigue accumulated by ATC,\r\n- Grant of flight capacity, administrative problems and probable corruption,\r\n- Insufficient monitoring of the aircraft operator to provide maintenance and operation."}