{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-provincetown", "date": "Sep 9, 2021 at 1600 LT", "type": "Cessna 402", "operator": "Cape%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Boston – Provincetown", "msn": "402C-0265", "yom": 1979, "flight_number": "9K2072", "city": "Provincetown", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On September 9, 2021, about 1527 eastern daylight time, a Cessna 402, N88833, was substantially damaged when it was involved in an accident near Provincetown, Massachusetts. The pilot and the six passengers were seriously injured. The airplane was operated under the provisions of Title 14 Code of Federal Regulations Part 135 as a scheduled passenger flight. The flight was being operated by Cape Air (flight 2072) and was on an instrument flight rules flight plan from Boston-Logan International Airport (BOS), Boston, Massachusetts to Provincetown Municipal Airport (PVC), Provincetown, Massachusetts. The flight departed BOS about 1504. The pilot was cleared by air traffic control for the ILS RWY 7 instrument approach procedure into PVC. Another Cape Air pilot was holding short of runway 25, waiting for the accident airplane to land. He said the captain of accident airplane contacted him over the airport’s common traffic advisory frequency to ask if the airport lights were on. The pilot holding short responded that the lights were on, that the visibility had improved, and that the rain was subsiding. The pilot holding short first saw the accident airplane after it had landed and was about halfway down the 3,502-ft-long runway. As the airplane got closer to his position, he could tell that it was traveling “a little faster than it should be.” The pilot could not estimate the airplane’s speed, but it was traveling faster than he would have expected, and he knew it would not have room to stop on the remaining runway. The airplane then took off and entered a slow climb. The pilot holding short said the attitude of the airplane appeared normal, but it was climbing slower than he thought it should. The airplane cleared the localizer antennas at the far end of the runway, then the perimeter fence, before it struck trees. The airplane disappeared into the trees, and he then saw a ball of flames. A preliminary review of airport surveillance video revealed it was raining heavily at the time the accident airplane landed. As the airplane touched down on the runway, a splash of water was observed. During the landing rollout, as the airplane passed the airport’s windsock, the windsock’s movement was consistent with the airplane landing with a tailwind. The airplane then began to climb as it neared the end of the runway. The airplane entered a shallow climb and collided with trees. The airplane disappeared into the trees and shortly after a large fireball was observed. Examination of the accident site revealed that the airplane came to rest upright approximately 200 ft from its initial contact with the trees. A postimpact fire consumed portions of the left and right wings. All major components of the airplane were accounted for at the accident site. The airplane was retained for further examination. The pilot held an airline transport pilot certificate with a rating for airplane multiengine land. He also held a commercial pilot certificate with a rating for airplane single engine land. In addition, the pilot held a flight instructor certificate with ratings for single and multiengine airplanes, and instrument airplane. His most-recent Federal Aviation Administration firstclass medical certificate was issued on April 2, 2021. The pilot reported a total of 17,617 flight hours, of which, 10,000 hours were in the Cessna 402. The weather conditions reported at PVC at 1537 included wind from 210 degrees at 10 knots, visibility 3 miles in heavy rain and mist, few clouds at 200 ft, an overcast ceiling at 500 ft, temperature 21 degrees C, dewpoint 21 degrees C, and a barometric altimeter setting of 29.79 inches of mercury.", "probable_cause": null}