{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-62m-mendeleyevo-90-killed", "date": "Jul 6, 1982 at 0035 LT", "type": "Ilyushin II-62", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Moscow - Dakar - Freetown", "msn": "4037536", "yom": 1974, "flight_number": "SU411", "city": "Mendeleyevo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 82, "pax_fatalities": 82, "other_fatalities": 0, "total_fatalities": 90, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4818, "circumstances": "The four engine airplane departed Moscow-Sheremetyevo Airport on a regular schedule service to Freetown with an intermediate stop in Dakar. After takeoff from runway 24R at Sheremetyevo Airport, while in initial climb, the crew raised the landing gear. Eight seconds later, the fire alarm for engine n°1 sounded. The crew shut down the engine in accordance with the Flight Manual and used the three stages of fire suppression systems. Thirty seconds later, the fire alarm coupled to the engine n°2 sounded as well. The same procedure was adopted for the second engine and the crew declared an emergency. At a speed of 320 km/h and a height of 160 meters with the undercarriage retracted and the flaps down at 30°, the pilot-in-command initiated a right turn. Unfortunately, he was unable to maintain a safe altitude and the airplane lost speed and height while in a high angle of attack. From a height of 75 meters, the airplane stalled, banked left to 70° then nosed down 20° and crashed in a wooded area located in Mendeleyevo, about 11,4 km northwest of the airport. The aircraft disintegrated on impact and all 90 occupants were killed. ", "probable_cause": "It was determined that both fire alarms on engines n°1 and 2 were false. Hot air from a ruptured pipe of the air conditioning system had blown on the temperature sensors."}