{"url": "https://www.baaa-acro.com/crash/crash-antonov-24b-amderma-40-killed", "date": "Sep 3, 1979 at 0101 LT", "type": "Antonov AN-24", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Arkhangelsk - Amderma", "msn": "77303602", "yom": 1967, "flight_number": "SU513", "city": "Amderma", "zone": "Nenets Autonomous Okrug", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 5, "pax_on_board": 37, "pax_fatalities": 35, "other_fatalities": 0, "total_fatalities": 40, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 19917, "circumstances": "The approach to Amderma Airport was initiated by night when the airplane descended below the glide. At a speed of 206 km/h, the airplane struck the ground 1,850 meters short of runway threshold and crashed in flames on a small hill located 140 meters to the left of the extended centerline. Two passengers and a crew member were seriously injured while all 40 other occupants were killed. ", "probable_cause": "The accident was the consequence of a series of violations on part of the flying crew who failed to follow the published procedures regarding the approach completed by night, which resulted in a premature descent, causing the aircraft to continue the approach below the glide until impact with the ground. The following contributing factors were reported:\r\n- The real altitude of the aircraft was less than the one reported by the navigator,\r\n- The pilot-in-command decided to continue the approach once the aircraft passed below the glide, \r\n- The pilot-in-command failed to initiate a go-around maneuver, \r\n- Poor crew coordination, \r\n- The navigator in charge of the approach was under training and his instructor failed to assist during the approach maneuver, \r\n- The total weight of the aircraft was 816 kilos above the MTOW at takeoff from Arkhangelsk. "}