{"url": "https://www.baaa-acro.com/crash/crash-cessna-t303-crusader-lagrangeville-2-killed", "date": "Aug 17, 2019 at 1613 LT", "type": "Cessna 303 Crusader", "operator": "Pegasus Aviation - USA", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "City", "schedule": "Sky Acres - Farmingdale", "msn": "303-00286", "yom": 1984, "flight_number": null, "city": "Lagrangeville", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 1, "total_fatalities": 2, "captain_hours": 1586, "captain_hours_type": 358, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2932, "circumstances": "After flying one flight leg earlier in the day, the pilot flew to an intermediate stop on the way to his home base to purchase fuel. A surveillance video recording from the fueling airport showed the airplane land and taxi to the self-serve fuel pump where the engines were shut down for about 10 minutes while the airplane was fueled. The pilot then had difficulty starting both engines over several minutes. After the engines were running, the airplane taxied to the runway and did not appear to stop for an engine run-up. The pilot performed a rolling takeoff, and the airplane lifted off after a roll of about 2,100 ft, slightly more than half the available runway length. A passenger reported that after liftoff, at an altitude of about 50 to 100 ft above ground level (agl), both engines lost partial power and began “stuttering,” which continued for the remainder of the flight. He further reported that the engines did not stop, but they were “not producing full RPM.” The airplane drifted left of centerline, which a witness described as a left yawing motion. The pilot corrected the drift and flew the runway heading over the grass on the left side of the runway; however, the airplane would not climb. After crossing the end of the runway, the pilot pitched the airplane up to avoid obstacles. Automatic dependent surveillance-broadcast data indicated that the airplane climbed from about 20 to 120 ft agl in a gradual left turn. During this time the groundspeed decreased from about 80 knots to about 69 knots. The altitude then decreased to about 50 ft agl, the groundspeed decreased to about 66 knots, and the left turn decreased in radius until the recorded data ended about 100 ft west of the accident site. The airplane descended and\r\nimpacted a house. Witness descriptions of the airplane yawing to the left while over the runway and again during its final left turn suggest that the loss of engine power may not have been symmetric (that is, one engine may have suffered more of a loss than the other).", "probable_cause": "A partial loss of engine power in both engines during initial climb for reasons that could not be determined based on the available information. "}