{"url": "https://www.baaa-acro.com/crash/crash-boeing-757-223-near-buga-159-killed", "date": "Dec 20, 1995 at 2138 LT", "type": "Boeing 757-200", "operator": "American-Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Miami - Cali", "msn": "24609", "yom": 1991, "flight_number": "AA965", "city": "Buga", "zone": "Valle del Cauca", "country": "Colombia", "region": "South America", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 155, "pax_fatalities": 151, "other_fatalities": 0, "total_fatalities": 159, "captain_hours": 13000, "captain_hours_type": 2260, "copilot_hours": 5800, "copilot_hours_type": 2286, "aircraft_hours": 13782, "circumstances": "At about 18:34 EST, American Airlines Flight 965 took off from Miami for a flight to Cali. At 21:34, while descending to FL200, the crew contacted Cali Approach. The aircraft was 63 nm out of Cali VOR (which is 8nm South of the airport) at the time. Cali cleared the flight for a direct Cali VOR approach and report at Tulua VOR. Followed one minute later by a clearance for a straight in VOR DME approach to runway 19 (the Rozo 1 arrival). The crew then tried to select the Rozo NDB (Non Directional Beacon) on the Flight Management Computer (FMC). Because their Jeppesen approach plates showed 'R' as the code for Rozo, the crew selected this option. But 'R' in the FMC database meant Romeo. Romeo is a navaid 150nm from Rozo, but has the same frequency. The aircraft had just passed Tulua VOR when it started a turn to the left (towards Romeo). This turn caused some confusion in the cockpit since Rozo 1 was to be a straight in approach. 87 Seconds after commencing the turn, the crew activated Heading Select (HDG SEL), which disengaged LNAV and started a right turn. The left turn brought the B757 over mountainous terrain, so a Ground Proximity (GPWS) warning sounded. With increased engine power and nose-up the crew tried to climb. The spoilers were still activated however. The stick shaker then activated and the aircraft crashed into a mountain at about 8900 feet (Cali field elevation being 3153 feet).", "probable_cause": "The accident was the consequence of the combination of the following factors:\r\n1. The flightcrew's failure to adequately plan and execute the approach to runway 19 at SKCL and their inadequate use of automation.\r\n2. Failure of the flightcrew to discontinue the approach into Cali, despite numerous cues alerting them of the inadvisability of continuing the approach.\r\n3. The lack of situational awareness of the flightcrew regarding vertical navigation, proximity to terrain, and the relative location of critical radio aids.\r\n4. Failure of the flightcrew to revert to basic radio navigation at the time when the FMS-assisted navigation became confusing and demanded an excessive workload in a critical phase of the flight."}