{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-29mr-85-bw-superfortress-fairfield-afb-19-killed", "date": "Aug 5, 1950 at 2200 LT", "type": "Boeing B-29 Superfortress", "operator": "United%20States%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "12454", "yom": 1944, "flight_number": null, "city": "Fairfield", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 20, "crew_fatalities": 12, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 7, "total_fatalities": 19, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The heavy bomber aircraft was engaged in a flight to Korea, carrying twenty crew members and a load of high explosive devices. Five minutes after takeoff from runway 21L, while climbing, the crew encountered technical problems with the engines number two and three on which the propeller was over speeding. The pilot in command tried to return to the airfield but the aircraft crashed, burned, and exploded five minutes after takeoff, causing fatal injuries to 12 crewmen. Eight other crew members were injured. Extensive damage to private and government property and injuries to both civilian and military personnel were caused by a subsequent explosion of the bomb on the aircraft. The pilot, Cpt Eugene Q. Steffes, was at the controls, with Brigadier General Robert F. Travis acting as second pilot. At 2200LT, the aircraft was cleared for takeoff from runway 21L (8,000 feet long). The wind was 17 knots from the southwest. A full power check (2,800 ROM and 48 inches) was made and the brakes were released for takeoff. Just prior to liftoff, the number two engine propeller malfunctioned, and the aircraft commander ordered the number two propeller be feathered. After liftoff, the pilot actuated the gear switch to the up position, and the gear did not retract. Due to the increased drag (feathered number two engine and the lowered gear), the rising terrain ahead and to the left, and the inability of the aircraft to climb, the aircraft commander elected to make a 180-degree turn to the right back toward the base. Upon completion of the turn, the left wing became difficult to hold up. The aircraft commander allowed the aircraft to slide to the left to avoid a trailer court. A crash landing was imminent as the altitude of the aircraft was only a few feet above the ground. The aircraft struck the ground with the left wing down at approximately 120 mph. All ten people in the rear compartment were fatally injured. General Travis and one passenger in the forward compartment received fatal injuries, all other crew members were rescued. About twenty minutes after the crash occurred, the high explosives in the bomb casing ignited. The blast, felt and heard over 30 miles away, caused severe damage to the nearby trailer park on base. In addition to those killed or injured in the initial crash, as a result in large part to the explosion that occurred shortly after the crash, 180 military, civilian and dependents were killed or injured. (Seven people were killed, 49 were admitted to the hospital and 124 others received superficial injuries). \r\nFollowing this catastrophe, the Fairfield-Saisun AFB was rechristened to the honor of the General Travis. \r\nCrew:\r\nGen Robert Falligant Travis, †\r\nCpt Eugene Q. Steffes,\r\nCpt Jack R. Cox,\r\n1st Lt Carter W. Johnson,\r\n1st Lt Matthew A. Midura,\r\n1st Lt William G. Braz,\r\nT/Sgt Donald W. Moore,\r\nPfc Jack Lloyd Gould, †\r\nPfc Roy Sellars, †\r\n1st Lt Robert G. Brotherton,\r\nS/Sgt Lloyd Francis Knapp, †\r\nS/Sgt Joseph Maconi, †\r\n1st Lt Charles E. Voyce,\r\nS/Sgt Joseph Prachinack, †\r\n1st Lt James Arthur Stubblebine, †\r\nSgt Richard D. Vanderpool, †\r\nPfc Leonard Andrew Reeve, †\r\nM/Sgt James Land Mclelland, †\r\nPfc Merrit Donald Judd, †\r\nCpl John L. Tucker. †", "probable_cause": "Investigations revealed that some technical anomalies occurred on the electrical system shortly before takeoff and that the crew failed to follow properly the pre-flight checklist. It was determined that the propellers on engines number two and three have been reinstalled against the manufacturer published standard procedures. Five days prior to the accident, some technicians at the airbase proceeded to a maintenance on these two propellers where the switches have been modified. For unknown reason, these two propellers were not correctly adjusted on the engine axis, causing them to overspeed. After any modification, all Curtiss Electric engine type must be checked during a test flight, which was apparently not performed by the present case. Investigations also revealed that the number of crew members on board was too high and that the total weight of the aircraft was above the admissible MTOW. The aircraft was not equipped with sufficient seatbelts at the time of the accident and only few crew members were properly attached, which contributed to the high number of casualties. Thus, it was recommended that a maximum of 16 crew members would be allowed on board this type of aircraft for all future operations."}