{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-500tp-malibu-meridian-glory-3-killed", "date": "Jan 12, 2013 at 0854 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Celtic%20Bank", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Paris – Austin", "msn": "46-97110", "yom": 2001, "flight_number": null, "city": "Glory", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2365, "captain_hours_type": 127, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1614, "circumstances": "The instrument-rated pilot obtained a weather briefing prior to departure that contained surface observations along the route of flight, as well as significant meteorological (SIGMET) and airman's meteorological (AIRMET) information. The briefing also included convective weather advisories, a convective outlook, the area forecast, pilot reports, radar summary, and winds aloft information. The area forecast included overcast ceilings at 1,500 feet mean sea level (msl) with cloud tops at 6,000 feet msl, visibility between 3 and 5 miles, light rain and mist, and isolated thunderstorms with cumulonimbus tops to 35,000 feet msl. After the pilot departed, he established contact with air traffic control; the airplane was initially observed on radar heading toward the destination airport. An analysis of radar from the day of the accident indicated that isolated thunderstorms existed and that, almost 4 minutes after departing, the airplane encountered an area of developing rain showers and vertical updrafts. The airplane began a descending right turn followed by a brief climb, then another descent; its ground speed slowed from 202 knots to 110 knots before the data ended. At that time, the airplane was at 4,500 feet msl. A witness said he heard the airplane but was unable to see it due to the low cloud layer. A few moments later, he saw the airplane exit the cloud layer in a spin before it impacted the ground. A postaccident examination revealed no mechanical deficiencies that would have precluded normal operation of the airplane and engine. ", "probable_cause": "The pilot's encounter with convective weather, which resulted in a loss of airplane control."}