{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-copenhagen", "date": "Apr 13, 1963 at 0404 LT", "type": "Douglas DC-6", "operator": "Sterling-Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Las Palmas – Barcelona – Copenhagen", "msn": "43750", "yom": 1952, "flight_number": null, "city": "Copenhagen-Kastrup", "zone": "Hovedstaden", "country": "Denmark", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9617, "captain_hours_type": 768, "copilot_hours": 1770, "copilot_hours_type": 171, "aircraft_hours": 33819, "circumstances": "On 12 April 1963, at 1521 hours GMT, Sterling Airways' DC-6B, OY-EAP, took off from Las Palmas Airport in the Canary Islands on a three-engine ferry flight bound for Copenhagen. After an intermediate refuelling stop at Barcelona, the aircraft departed again at 2224 GMT for Copenhagen. It contacted Copenhagen ATC when passing Michelsdorf on 13 April, at 0238 GMT. It was then at FL110 which was maintained until the aircraft, when over ROBBY NDD, was cleared to descend to FL45. At 0253 GMT, when passing PRESTO NDB at FL60, the aircraft reported that Copenhagen Airport was in sight, whereafter the flight mas performed with visual contact to this airport's runway 04. When passing marker beacon CODAN on the north coast of Stevns, the aircraft descended to 3,500-4,000 feet, the speed being normal, i. e. 170 kt. About 1 - 1/2 minutes later flaps were set to 20°, whereafter the speed in the course of the next few minutes was slowly reduced to 145 kt at which rate the undercarriage was extended and the flap angle was increased to 300. The altitude was then approximately 1 500 ft and the approach towards the clearly visible runway was continued in a shallow glide. The approach was rather low, for which reason the engine power had to be increased several times in order to reach the runway. On short final - probably immediately before passing the first approach lights - the pilot-in-command ordered full flaps. The speed was then 110-130 kt and the height still rather low. Shortly after the flaps were fully extended the aircraft showed a tendency to bank which the pilot-in-command tried to counteract by applying aileron control. When the aircraft was 100-200 m from the runway threshold, the pilot-in-command realizing that he no longer had sufficient control to make as the landing decided to abandon the landing. He ordered \"pulling-up, full power, gear up, flaps twenty\". The speed was then around 100 kt. The flight engineer immediately pushed the propeller pitch selector lever forward to full RPM position and thereafter advanced the throttles, at the same time moving the landing gear lever to the \"up\" position. When power was applied the aircraft immediately made a violent bank and an uncontrollable right-hand turn. About 10 seconds later the starboard wing tip hit the ground about 200 m beyond the threshold of runway 04 and 80 m to the right of the centre line. This caused the disintegration of the outer portion of the starboard wing whereupon the aircraft crashed. The aircraft came to a stop 220 m further on with its nose pointing roughly to 240°. The accident occurred at 0304 GMT, i. e. one hour before sunrise. The aircraft was destroyed by impact forces and a post crash fire. All three crew members were injured. ", "probable_cause": "During the approach to runway 04 with the starboard outer engine inoperative, the speed of the aircraft decreased to a value critical for safe manoeuvring. Because of this the pilot-in-command attempted an overshoot. In the course thereof he lost control of the aircraft which, in a heavy bank, went into an uncontrolled right-hand turn, its starboard wing hit the ground, and the aircraft crashed. That the aircraft got into the above-mentioned critical situation must,to an essential degree, be attributed to the fact that the pilot-in-command selected full flaps at a time when the altitude and speed of the aircraft in relation to the distance from the runway threshold did not justify such disposition."}