{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-76td-leninakan-15-killed", "date": "Oct 20, 1989 at 0232 LT", "type": "Ilyushin II-76", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Ulyanovsk - Leninakan", "msn": "00234 40153", "yom": 1982, "flight_number": null, "city": "Leninakan", "zone": "Shirak", "country": "Armenia", "region": "Asia", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2053, "circumstances": "The four engine aircraft departed Ulyanovsk on a cargo flight to Leninakan, carrying 5 passengers, 10 crew members and a load of 37,2 tons of construction materials and tools. The crew was cleared to descend to 3,300 meters then ATC transmitted the airport pressure being 637 mm Hg. The crew misunderstood this pressure value and the altimeters were mistakenly set at 736 mm Hg. This caused a gap of 1,100 meters and the aircraft continued the approach with a vertical speed of 10 meters per seconds. After passing below the glide in limited visibility due to the night, while at an altitude of 270 meters, the GPWS alarm sounded. The flight engineer realized the mistake and informed the captain 19 seconds after the first alarm sounded. For unknown reasons, the pilot failed to initiate any corrective action and 10 seconds later, the aircraft struck the mountain at a speed of 440 km/h and disintegrated on impact. All 15 occupants were killed. ", "probable_cause": "The accident was the consequence of the following factors:\r\n- Wrong altimeter setting on part of the crew with a value of 736 mm Hg pressure instead of the actual 637 mm Hg, causing the aircraft to descend below MDA,\r\n- Failure to use the radio altimeters, which deprived the crew of additional information about their descent below MDA,\r\n- Failure of the crew to respond to the recommendation by the flight engineer to climb and to initiate appropriate corrective actions,\r\n- This was the instructor captain's first flight into Leninakan and the student pilot's (in the right hand seat) first flight on an Il-76,\r\n- Poor crew resource management,\r\n- Lack of crew training regarding the actions to be taken in case of a GPWS warning."}