{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hp57-halifax-ii-welsh-bicknor-11-killed", "date": "Jun 7, 1942", "type": "Handley Page H.P.57 Halifax II", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Defford - Defford", "msn": null, "yom": null, "flight_number": null, "city": "Welsh Bicknor", "zone": "Herefordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was involved in a test flight on behalf of the Telecommunications Research Establishment (TRE) of the Royal Air Force and left RAF Defford in the day with a crew of five and six engineers on board. En route, the engine number four caught fire. The captain attempted an emergency landing when at an altitude of 500 feet, a portion of the right wing broke away. Out of control, the aircraft crashed in a field at a speed of 150 mp/h and was destroyed. All 11 occupants were killed, among them the famous British engineer Alan Blumlein. His death was officially announced three years later as the mission was highly secret: test and development of the H2S airborne radar system.\nCrew:\nP/O D. J. D.Berrington, pilot,\nF/O A. M. Phillips, pilot,\nF/Sgt G. Millar, observer, \nLAC B. D. C. Dear, flight engineer, \nAC2 B. C. F. Bicknell, wireless operator and air gunner.\nPassengers: \nS/L R. J. Sansom, attached to TRE,\nP/O C. E. Vincent, attached to TRE, \nMr. G. S. Hensby, engineer by TRE,\nMr. A. D. Blumlein, engineer by EMI,\nMr. C. O. Browne, engineer by EMI,\nMr. F. Blythen, engineer by EMI.", "probable_cause": "After the RAF investigative board completed its report on the Halifax crash on 1 July 1942, it was distributed to a restricted list of approved recipients, but not publicly divulged. In the interests of wartime secrecy, the announcement of Blumlein's death was not made for another three years. The investigative board, headed by AIB Chief Inspector Vernon Brown (who later also investigated the postwar Star Tiger and Star Ariel disappearances) found that the Halifax bomber crash was caused by engine fire, attributed to the unscrewing of a tappet nut on the starboard outer engine, which had been improperly tightened by a RAF engine fitter while inspecting the engine some three hours prior to the crash. The loosened nut caused excessive valve clearance and a fracture of the valve stem which resulted pumping ignited fuel outboard of the rocker cover and along the outside of the engine, causing a fire in the engine nacelle. Constantly fueled by the broken intake, the fire burned rapidly along the wing and fuselage, eventually causing a large section of the wing to separate from the fuselage at approximately 350 feet of altitude. With the loss of all control over level flight, the rest of the plane rolled inverted and struck the ground at approximately 150 mph."}