{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-6-buenos-aires", "date": "May 26, 1967 at 1143 LT", "type": "Convair CV-240", "operator": "Lineas-Aereas-Paraguayas-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Asunción – Buenos Aires", "msn": "72", "yom": 1948, "flight_number": null, "city": "Buenos Aires-Ezeiza-Ministro Pistarini", "zone": "Buenos Aires City", "country": "Argentina", "region": "South America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 18, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4958, "captain_hours_type": 780, "copilot_hours": 1800, "copilot_hours_type": 600, "aircraft_hours": 18502, "circumstances": "The aircraft was on a scheduled international flight and was carrying eighteen passengers. It was coming in to land and was lined up with and about to touchdown on runway 10 when it suddenly underwent an abrupt change of attitude and crashed to the ground. After a series of bounces which commenced on the left wing causing it to break off together with the left power unik, the aircraft slewed round and came to rest upside down on a heading practically opposite to that of landing some 250 metres from the runway end. The pilot stated that during approach and when he was approximately 20 metres above and some 50 metres away from the runway threshold, and had just finished It calling to the co-pilot eighteen inches, reduce to idle\", that is to say, when the aircraft was practically touching down, he heard the characteristic sound of propellers reversing (on both engines). At the very same moment, according to his statement, the mechanic reported this occurrence to him, and since the aircraft was nosing down and tilting to the left at the same time. he applied right rudder and tried to correct the attitude by nosing up. The aircraft, however, did not respond in spite of application of power to supplement the control manoeuvres. The aircraft nosed down and struck the runway surface. Both engines and the left wing were torn off, the aircraft went out of control, veered off runway and came to rest upside down in a grassy area. All 24 occupants were injured while the aircraft was destroyed.\r\nCrew:\r\nRené Ferreira, pilot,\r\nPablo Romero, copilot,\r\nZacarías Soto, flight engineer,\r\nMarcial Quiñónez, radio operator, \r\nNéstor Arrúa, purser,\r\nElodia González, stewardess.\r\nPhotos via http://aeronauticapy.com/", "probable_cause": "The conclusion set forth above is based on the fact that the electro-mechanical reverse safety device installed on the landing gear is so designed that whec the left landing gear strut is compressed it closes an electric circuit and frees the throttle lock. Therefore, the aircraft must touch down and roll for some distance in order to lose some lift through decrease in speed, The full weight of the aircraft is then on the landing gear and it is possible to move the levers manually and place the throttles into the proper position to reverse the propellers and then to give more throttle to gain more reverse thrust, All this requires some time and some ground roll distance after touchdown, which may or my not have some effect on the estimated distance for braking the aircraft or discontinuing the landing.  The fact that the reverse lock safety system was inoperative was considered a deficiency in maintenance, even in the assumption that it had been intentionally so adjusted by the crew or during overhauls in the aviation workshops. The confirmed abnormality explains why in this particular case the levers could be moved back and the propeller reversing system operated. In accordance with the above findings and conclusions, it was considered that the statements by the crew members should be disregarded because, as brought out by the evidence, the accident was due to premature operation of the reversing system, when the aircraft was on final approach at a height of 20 metres, thereby causing it to go into a stall, This, together with the fact that the reverse safety mechanism was not: operating as it should have been, led to operation of the reversing system before the landing gear had made contact with the runway an essential requirement for operation of the propeller reversing system, barring any irregularities in the operation of the equipment. It is furthermore considered that the pilot-in-command acted incorrectly and imprudently in prematurely operating the propeller reversing system during the final approach instead of following the required procedure of applying reverse propellers during the landing run, when the weight of the aircraft is firmly on the landing gear. Consequently, the accident -- which was classified as serious -- was attributed to sudden loss of lift of the aircraft when it was about to land, which caused it to drop to the ground, slew round and turn over as a result of premature application of the propeller reversing system. An unofficial report stated that a paper cup was placed on the center console by the crew. On final approach, the content of this cup poured on the gear levers, causing an electrical short-circuit that caused the activation of the thrust reversers."}