{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-1160-near-tamaurunui-1-killed", "date": "Aug 13, 1968 at 1117 LT", "type": "Fletcher FU-24", "operator": "Robertson%20Air%20Service", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": null, "msn": "19", "yom": 1955, "flight_number": null, "city": "Taumarunui", "zone": "Manawatu-Wanganui (Horizons Regional Council)", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The single engine airplane was engaged in an aerial topdressing operation on a farm near Taumarunui. On the 43rd sortie of the day the aircraft failed to return to the airstrip as expected and a search found the crashed and burning Fletcher about mid-way between the sowing area and the airstrip. The aircraft was destroyed by impact forces and the fire was largely confined to the engine bay and cockpit. The pilot Robert Neville Scott was dead. Evidence showed that the pilot had made a 90 degree turn back towards the airstrip and had commenced jettisoning the 20 hundredweight ( 2,240 pounds, 995 kg ) superphosphate hopper load. The aircraft collided with the terrain on a 15 degree rising grassy slope at a low forward speed and high rate of descent. About 15 hundredweight of the load was still in the hopper. Both fuel tanks had been ruptured in the crash and there was an absence of Avtur odour on the ground around the LH tank. The engine was producing high rotational energy at the time of impact. There was no evidence of mechanical failure prior to impact. An autopsy of the pilot produced no evidence that the fire had begun in the air. \n", "probable_cause": "The following findings were reported:\r\n- An in-flight emergency arose and influenced the pilot either to initiate a return to the airstrip or to make an immediate forced landing,\r\n- The evidence suggests but does not conclusively prove that insufficient fuel flow resulting in partial loss of engine power influenced the pilot so to act,\r\n- The emergency arose at a time when fuel quantity was marginal for continued operation without refuelling."}