{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-43-tokyo-64-killed", "date": "Mar 4, 1966 at 2015 LT", "type": "Douglas DC-8", "operator": "CP%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hong Kong – Tokyo – Vancouver", "msn": "45761", "yom": 1965, "flight_number": "CP402", "city": "Tokyo-Haneda", "zone": "Kantō", "country": "Japan", "region": "Asia", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 62, "pax_fatalities": 54, "other_fatalities": 0, "total_fatalities": 64, "captain_hours": 26564, "captain_hours_type": 4089, "copilot_hours": 19789, "copilot_hours_type": 3071, "aircraft_hours": 1792, "circumstances": "Flight 402 was a scheduled international flight from Hong Kong to Tokyo and Vancouver. It took off from Hong Kong at 1614 hours Japan Standard Time and was routed via Taipei, Kagoshima and Ohshima. At 1908 hours it flew over \"Spencer Victor\" at 25 000 ft and started to descend gradually; at 1912 hours it crossed \"Rice Victor\" at 18 000 it and two minutes later entered the Kisarazu holding pattern at 14 000 ft where it waited for an improvement of the weather conditions at Tokyo International Airport (TIA). At 1942 hours the flight notified Tokyo air traffic control that if the weather conditions failed to improve within 15 minutes, it would divert to Taipei (alternate airport). Ten minutes later, at 1952 hours the flight was advised by Tokyo ATC that the RVR was 2 400 ft and the pilot then asked for a clearance for approach and landing. The approach clearance was given and the aircraft proceeded to descend to 3 000 ft, in the holding pattern. However, the weather conditions at TIA worsened and the aircraft did not proceed with the approach. The pilot requested a clearance to divert to Taipei at 1958 hours and commenced climbing. At 2005 hours, while heading for Tateyama en route to Taipei the flight was advised by Tokyo air traffic control that visibility at TIA had improved to 4 mile with RVR 3 000 ft. Consequently, the pilot requested a clearance to return to Kisarazu and began descending from 11 500 ft. At 2011 hours the aircraft arrived over Kisarazu at 3 000 ft and began another approach under instructions of the GCA. At this time the flight was quite normal. When the aircraft was 8 NM from touchdown at an altitude of 1 500 ft, it was advised that there was a light tailwind 150015 kt and was cleared to land on runway 33R. The rate of descent for final approach was begun about 5.3 NM from touchdown at approximately 2012:58 hours. The aircraft was on course and on the glide path with a ground speed of approximately 174 kt, gradually decreasing to approximately 140 kt at 2 NM and 114 kt after passing 1 NM. When the aircraft reached one mile from touchdown, the GCA final controller noted that the aircraft was slightly below the GCA glide path and advised \"20 ft low, level off momentarily\". Nevertheless, the aircraft continued its approach 20 ft below and in parallel with the GCA glide path. After the aircraft passed the P.M. (precision minimum), the aircraft requested the intensity of the lights to be reduced. Shortly thereafter, the aircraft made a sharp descent and its main landing gear wheel struck No. 14 approach light 2 800 ft from touch- down point approximately in an attitude of level flight. Following this first contact, the aircraft struck the approach lights one by one until No. 3 damaging or destroying them, and at approximately 2015 hours crashed against the sea wall with the bottom of the fore-fuselage. Then, the aircraft was thrown over near the end of runway 33R, destroyed and caught fire. All 10 crew members and 54 passengers were killed while eight others were injured. ", "probable_cause": "The pilot misjudged landing approach under unusually difficult weather conditions. The visibility at Tokyo International Airport was reduced at the time of landing to less than half a mile by fog and smoke, RVR was in the order of 3 000 it. The aircraft carried out a GCA approach to runway 33R under very difficult conditions. It was considered that the approach was normal until a point located between 3 900 and 3 600 ft before the touchdown point. It then entered a steep rate of descent between 3 900 and 3 600 it before the touchdown point, it first struck an approach light 2 800 ft from the touchdown point in an attitude of level flight, then broke several approach light piers and crashed against the sea wall of the airport. The wreckage was thrown over the sea wall near the runway threshold and completely destroyed by the ensuing fire. The steep rate of descent was considered to be the result of an intentional manoeuvre of the aircraft by the pilot-in-command with a view to executing a final approach at a lower altitude than normal. Although no certain cause for the excessive descent which led to striking the approach lights could be determined, it was considered that the poor visibility due to illusive fog conditions that night misled the pilot-in-command in his judgement. "}