{"url": "https://www.baaa-acro.com/crash/crash-vickers-739a-viscount-langenbruck-48-killed", "date": "Aug 9, 1968 at 1304 LT", "type": "Vickers Viscount", "operator": "British-Eagle-Airways", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "London-Heathrow - Innsbruck", "msn": "394", "yom": 1958, "flight_number": "EG802", "city": "Langenbruck", "zone": "Bavaria", "country": "Germany", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 44, "pax_fatalities": 44, "other_fatalities": 0, "total_fatalities": 48, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 18658, "circumstances": "While cruising at an altitude of 21,000 feet south of Ingolstadt, the pilot informed ATC that a fire erupted on board, declared an emergency and requested the permission to divert to Munich Airport. The crew immediately started an emergency descent when control was lost. The airplane entered a dive, partially disintegrated in the air and eventually crashed in flames on a highway. Debris were found in an open field and the main wreckage on the Munich - Nuremberg highway. The tail was found about three km from the main wreckage. Rescue teams were hampered in their mission and it was really difficult to reach the crash site as the highway was totally jammed by cars from people living on holidays. None of the 48 occupants survived the crash. At the time of the accident, weather conditions were considered as good despite broken clouds from 800 feet till 15,000 feet.", "probable_cause": "It was determined that the main generator failed in flight, causing a major power failure and probably an electrical short-circuit. This caused several systems and onboard instruments to fail such as the gyrocompas. While cruising in poor visibility due to clouds, the crew was unable to maintain a proper attitude and the aircraft went out of control. During the descent, aerodynamic forces exceeded the certification of the tail and the wings that were torn off. Then, the aircraft impacted ground at a speed of 310 knots. The accident was unsurvivable. The exact cause of the generator failure could not be determined with certainty. "}