{"url": "https://www.baaa-acro.com/crash/crash-avro-652-anson-i-rosedale-1-killed", "date": "Feb 24, 1945", "type": "Avro 652 Anson", "operator": "Royal-Australian-Air-Force-3", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Bairnsdale - Bairnsdale", "msn": null, "yom": null, "flight_number": null, "city": "Rosedale", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Low on fuel while conducting a night training mission in poor weather conditions, the aircraft crashed 2 miles north of Rosedale. A crew members was killed while three others were injured. Sgt. D.J. McLeod parachuted at low altitude and died.\r\nTestimony from the pilot:\r\nThe cause of the crash (which the Court of Enquiry called a phenomenon of the weather) was a low cloud bank, right down to the deck, up to about 2000 feet which rolled in from the sea enveloping our base at Bairnsdale, which is near the coast. The 13 aircraft engaged in this night navigation exercise were out at sea. My crash was caused by the lack of fuel. I was the first to take off that night and was about 100 miles from the coast when I sent a signal to base reporting that weather conditions prevented some parts of the navigation procedures being carried out. Base notified all aircraft to return to base. Probably about half of them were able to land at Bairnsdale. After exploring every option available to me the only hope was to bail out because Eastern Victoria was completely covered. So I was about to climb to 5000 feet when we saw a hole in the clouds and a row of lights which could have been a flare path. After checking the fuel and the time we had been in the air I calculated that I still had 30 minutes of fuel which was sufficient to investigate. The lights proved to be a stationary train. I immediately started to climb out when the starboard motor cut at about 2000 feet above sea level. The crew managed to bail out just before the port motor cut. I went into crash landing procedure hitting four trees and losing a large section of one wing and a portion of the other. The aircraft was a write off.\r\nCrew:\r\nF/Sgt Kevin M. Moloney, pilot,\r\nSgt D. J. McLeod, †\r\nG. S. Liles,\r\nP/O A. M. Ward.\r\nSource: http://www.ozatwar.com/ozcrashes/vic141.htm", "probable_cause": null}