{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-dk-pickle-lake-2-killed", "date": "May 11, 1987 at 1800 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Northland%20Air%20Manitoba", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Big Trout Lake - Pickle Lake", "msn": "14879/26324", "yom": 1944, "flight_number": null, "city": "Pickle Lake", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 20284, "circumstances": "Douglas DC-3C C-FADD was returning to Pickle Lake from Big Trout Lake following delivery of a cargo of fuel. This was the third similar and last operation of the day. As the aircraft approached Pickle Lake, the pilot informed the company dispatch office that, prior to landing, he intended to carry out some local training for the benefit of the co-pilot who was scheduled to be upgraded to captain status the following month. The captain, a company training pilot, occupied the right seat. The aircraft entered a west to east holding pattern at the airport's NDB, descending in stages from 8,500 feet asl to 2,700 feet asl, the appropriate altitude for an instrument approach. The pilot transmitted that they would execute an NDB approach and subsequently reported during the procedure turn inbound to the airfield. About three minutes later, two other pilots flying in the vicinity observed the aircraft in a descent with the left wing folded upwards. The aircraft continued descending in an inverted attitude until it struck the ground.", "probable_cause": "It was determined that the left wing failed under normal flight loads as a result of a fatigue crack in the centre section lower wing skin. Anomalies in the radiographs taken during mandatory non-destructive testing inspections were not correctly interpreted."}