{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-charlottetown-3-killed", "date": "Jun 5, 2001 at 1621 LT", "type": "Piper PA-31-310 Navajo", "operator": "846234 Ontario", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Gander – Charlottetown – Natuashish", "msn": "31-7712004", "yom": 1977, "flight_number": null, "city": "Charlottetown", "zone": "Prince Edward Island", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2085, "captain_hours_type": 185, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight took off on Runway 22 at Gander, Newfoundland and Labrador, at 1428 Newfoundland daylight time with the pilot and four passengers on board. Their destination was Sango Bay, Newfoundland and Labrador, with an intermediate stop in Charlottetown, Newfoundland and Labrador, to drop off one of the passengers. Radar data show that, on departure from Gander, the aircraft climbed at about 500 feet per minute at 125 knots ground speed to 2500 feet, then descended and proceeded en route to Charlottetown at 1900 feet and 150 knots. The aircraft landed at Charlottetown at 1615. After a brief stop, the flight continued to Sango Bay. The pilot broadcast his intention to take off on Runway 10, taxied the aircraft to the threshold of the runway, and commenced the take-off roll. Part-way down the runway, the pilot aborted the take-off. He then broadcast his intention to take off on Runway 28. Both radio broadcasts were acknowledged by a local pilot who was approaching the airport to land. Upon reaching the threshold of Runway 28, the aircraft turned and accelerated, without stopping, on the take-off roll. The aircraft lifted off shortly before the runway end and remained near treetop height until disappearing from view. After lift-off, the stall warning horn sounded intermittently until impact. The aircraft was unable to climb above the hilly terrain and struck the road 1.5 nautical miles from the departure end of the runway. A passing motorist spotted the downed aircraft and notified firefighters and medical personnel who were then dispatched to the scene. The accident occurred at about 1621 during daylight hours, at 58°45' N, 55°66' W, at 440 feet above sea level.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The aircraft was over the maximum allowable take-off weight throughout its journey, reducing aircraft performance: the pilot apparently did not complete weight and balance calculations for\r\neither of the flights.\r\n2. The pilot did not use the proper short field take-off technique, and the aircraft was forced into the air before reaching sufficient flying speed.\r\n3 The best angle of climb speed was not attained.\r\n4. The unsecured cargo, some of which was found on top of the back of the rear passenger seat, most probably contributed to the severity of the injuries to the passenger in this seat."}