{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47-dl-yakutat-13-killed", "date": "Nov 27, 1947 at 0317 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Columbia Air Cargo", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Anchorage – Yakutat", "msn": "6065", "yom": 1942, "flight_number": null, "city": "Yakutat", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": 4300, "captain_hours_type": 1000, "copilot_hours": 4000, "copilot_hours_type": 2000, "aircraft_hours": 3756, "circumstances": "The flight departed from Anchorage at 0020, November 27, 1947, carrying 11 revenue passengers and 600 gallons of fuel. At 0238 the flight reported that it was over Yakataga, Alaska, at 6,000 feet, and that it was proceeding in accordance with instrument flight rules to Yakutat, estimating arrival there at 0320. Twenty-eight minutes later at 0306 the flight called Yakutat Radio, stating that it was leaving the 6,000-foot altitude and making an approach \"straight in.\" The CAA communicator acknowledged and transmitted the Yakutat weather \"Indefinite ceiling, 500-foot overcast visibility 3 miles, light drizzle, temperature and dew point 43 degrees, wind from the east-southeast at 10 miles per hour, altimeter setting 30.17.\" Yakutat Radio again called the flight at approximately 0316, requesting that it report the height of the ceiling when it descended into the clear. This was acknowledged by, \"Okay Yakutat.\" No further communication was received from the flight. Shortly after the last transmission the airplane was heard to fly at a low altitude over a residence which was located approximately 300 feet south of the CAA Yakutat Radio station, and seconds later the occupants in the residence heard an explosion.", "probable_cause": "The Board determines that the probable cause of this accident was failure to follow the approved instrument approach procedures while making an initial approach to Yakutat at an altitude insufficient to clear trees along the flight path."}