{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-500b-ennis-2-killed", "date": "Jan 10, 1998 at 1427 LT", "type": "Rockwell Aero Commander 500", "operator": "MGS Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lancaster - Laredo", "msn": "500-1625-215", "yom": 1966, "flight_number": null, "city": "Ennis", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1550, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8081, "circumstances": "After departing on an IFR flight in VFR conditions, the flight had been cleared to climb from 3,000 to 4,000 feet, when the right engine lost power. The pilots diverted toward an uncontrolled airport, secured the right engine, & cancelled their IFR clearance. They made an approach to land on runway 15, then attempted a single engine go-around. During the go-around, the airplane yawed/rolled to the right in what the passenger believed was a VMC roll. It then struck power lines & crashed in a right wing low attitude. Investigation revealed that both pilots held multi-engine ratings. The owner said the pilot (PIC) had flown the airplane for a short time on 12/21/98; however, no other record was found to verify that either the pilot or copilot had flight experience in this make/model of airplane. Examination of the wreckage revealed evidence that the flaps were retracted, the landing gear was in transit, the left propeller was operating with power, & the right propeller was feathered. The airplane had a history of fuel flow fluctuations in the right engine. The diaphragm (P/N 364446) in the right engine distributor valve assembly was found ruptured. It was an old style diaphragm, which was colored black. Bendix Service Bulletin RS-76, issued 11/15/80, called for replacement of the black diaphragm with a red fluorosilicone diaphragm (P/N 245088) at overhaul. The engine was overhauled in June 1992. During maintenance in December 1997, both fuel system injectors & nozzles were tested; however, the distributor valve assembles were not tested. Calculations showed the airplane was loaded 116.3 lbs over the maximum allowable gross weight & 1.3 inches forward of the allowable CG range. ", "probable_cause": "failure of the flight crew to maintain minimum control speed (VMC) during go-around from a single-engine approach, which resulted in loss of control and collision with power lines and the ground. Related factors were: a ruptured diaphragm in the distributor valve (flow divider) of the right engine's fuel injector system, which resulted in loss of power in the right engine; inadequate maintenance; a failure to comply with Bendix Service Bulletin RS-76; the airplane's excessive gross weight and forward center-of-gravity (CG); and both pilots' lack of experience in this make and model of airplane. "}