{"url": "https://www.baaa-acro.com/crash/crash-iai-1124-westwind-sundance-2-killed", "date": "Mar 18, 2019 at 1531 LT", "type": "IAI 1124 Westwind", "operator": "Sundance Airport FBO", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Panama City - Sundance", "msn": "232", "yom": 1978, "flight_number": null, "city": "Sundance", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5872, "captain_hours_type": null, "copilot_hours": 5259, "copilot_hours_type": null, "aircraft_hours": 11030, "circumstances": "The two commercial pilots were conducting a personal, cross-country flight. A video surveillance camera at the airport captured their airplane’s approach. Review of the video revealed that, as the airplane approached the approach end of the landing runway, it began to climb, rolled left, became inverted, and then impacted terrain. The left thrust reverser (T/R) was found open and unlatched at the accident site. An asymmetric deployment of the left T/R would have resulted in a left roll/yaw. The lack of an airworthy and operable cockpit voice recorder, which was required for the flight, precluded identifying which pilot was performing pilot flying duties, as well as other crew actions and background noises, that would have facilitated the investigation. Postaccident examination of the airplane revealed that it was not equipped, nor was required to be equipped, with a nose landing gear (NLG) ground contact switch intended to preclude inflight operation of the thrust reverser (T/R). The left T/R door was found unlatched and open, and the right T/R door was found closed and latched. Further, electrical testing of the T/R left and right stow microswitches within the cockpit throttle quadrant revealed that the left stow microswitch did not operate within design specifications. Disassembly of the left and right stow microswitches revealed evidence of arc wear due to aging. Based on this information, it is likely that the airplane’s lack of an NLG ground contact switch and the age-related failure of the stow microswitches resulted in an asymmetric T/R deployment while on approach and a subsequent loss of airplane control. Also, there were additional T/R system components that were found to unairworthy that would have affected the control of the T/R system. Operational testing of the T/R system could not be performed due to the damage the airplane incurred during the accident. Toxicology testing results of the pilot’s specimens indicated that the pilot had taken diazepam, which is considered impairing at certain levels. However, the detected amounts of both diazepam and its metabolite nordiazepam were at subtherapeutic levels, and given the long half-life of these compounds, it appears that the medication was taken several days before the accident; therefore, it is unlikely that the pilot was impaired at the time of the accident and thus that his use of diazepam was a not factor in the accident.", "probable_cause": "The airplane’s unairworthy thrust reverser (T/R) system due to inadequate maintenance that resulted in an asymmetric T/R deployment during an approach to the airport and the subsequent loss of airplane control."}