{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-35-dk-southend", "date": "Jun 3, 1971 at 1325 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Moormanair", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Southend – Amsterdam", "msn": "16605/33353", "yom": 1945, "flight_number": null, "city": "Southend-on-Sea", "zone": "Essex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 32, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4663, "captain_hours_type": 1750, "copilot_hours": 3247, "copilot_hours_type": 230, "aircraft_hours": 6372, "circumstances": "The aircraft was engaged in a charter flight from Southend to Amsterdam, carrying 32 supporters of the Ajax football team back to The Netherlands. Following a fall in manifold pressure and the discovery of an oil leak in the starboard engine soon after a night takeoff, the pilot decided to return to Southend Airport for an emergency landing. In order to avoid an overshoot, he positioned the flaps to a 15° angle for the landing which resulted in a higher than normal airspeed at touchdown. The aircraft touched down about half-way down the runway in use, overran the paved area and collided with an earth bank. Of the 32 passengers and four crew on board, two passengers were injured. The aircraft was damaged beyond repair.", "probable_cause": "The accident was due to a late touchdown and inappropriate use of the flaps. Insufficient braking efficiency resulted in a higher speed of overrun than would have otherwise occurred. The following factors were reported:\r\n- The documentation of the aircraft was not in order, \r\n- The number of persons on board was in excess of the number for which seating capacity and safety  belts were provided, and the aircraft weight at take-off was 335 kg in excess of the authorised maximum, \r\n- Following an engine failure in the air, the aircraft made an emergency landing at Southend Airport at a weight 560 kg in excess of its regulated landing weight, \r\n- The approach and landing was made with 15° of flap extended, full flap was not used, \r\n- Touchdown occurred approximately half way down the runway, \r\n- The aircraft wheels brakes were worn to the extent that their efficiency would have been impaired and oil may have reduced the grip of the starboard tyre, \r\n- The aircraft overran the paved area and collided with an earth bank on the aerodrome boundary. "}