{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-gwinner", "date": "Sep 23, 2004 at 2345 LT", "type": "Cessna 208B Grand Caravan", "operator": "Eagle Air Cargo", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fergus Falls – Gwinner", "msn": "208B-0045", "yom": 1987, "flight_number": null, "city": "Gwinner-Roger Melroe Field", "zone": "North Dakota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17420, "captain_hours_type": 50, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11945, "circumstances": "The airplane was substantially damaged when it impacted an open field about 1-1/2 miles south of the destination airport. The pilot had executed an instrument approach and was circling to land when the accident occurred. Night instrument meteorological conditions prevailed at the time. The area south and east of the airport was sparsely populated. The pilot reported that he obtained the Automated Weather Observing System (AWOS) broadcast for the destination via the aircraft radio while en route. He stated the reported visibility was above that required for the Non-Directional Beacon (NDB) approach, however, the ceiling was below the minimum descent altitude (MDA). He reported that he attempted to contact air traffic control (ATC) with the intention of diverting. He was not able to contact ATC and elected to continue to the destination. The pilot reported that he flew the entire NDB approach and stated: \"When I arrived at the MDA, I saw the runway, directly below and a little to my left. My plan, at the time, was to circle left and land.\" He stated after that point he had no further recollection of the events surrounding the accident. The pilot reported that there were no failures or malfunctions associated with the aircraft. Two witnesses reported seeing lights from an airplane near the airport. One recalled that the weather was \"foggy and a heavy mist.\" The other witness stated: \"When I saw the plane it was very low but I thought it was going around for the landing because it looked like the plane had its right wing higher, and I could see part of the belly of the plane, which made it look like it was banking around.\" Flight control continuity was confirmed during a post-accident examination. The airport AWOS recorded an overcast sky at 400 feet above ground level (agl). The MDA for the instrument approach as 694 feet above field elevation.", "probable_cause": "The pilot's failure to maintain altitude during the circling maneuver. Contributing factors were the pilot's improper decision to execute the approach when weather conditions were below minimums and the low light (dark night) conditions."}