{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-355c-ostend", "date": "Nov 14, 1998 at 0544 LT", "type": "Boeing 707", "operator": "IAT%20Cargo", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ostend - Lagos", "msn": "19664", "yom": 1968, "flight_number": "VGO302", "city": "Ostend", "zone": "West Flanders", "country": "Belgium", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 67790, "circumstances": "The aircraft departed Ostend Airport at 0328LT on a cargo flight to Lagos, carrying five crew members and a load of 35 tons of electronics. About 20 minutes into the flight, while cruising at an altitude of 24,000 feet over the border between Brussels and Paris ARTCC, the crew informed ATC about severe turbulences. Few seconds later, he reported the loss of the engine n°3 that separated and elected to return to Ostend. After being cleared, the crew started a circuit and while descending to Ostend Airport, the hydraulic systems failed. The crew completed a holding pattern to burn fuel and was later cleared to land on runway 26. After touchdown, the aircraft was unable to stop within the remaining distance, overran, lost its undercarriage, slid for few dozen metres and eventually came to rest near the localizer antenna. All five crew members escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "Laboratory analyses revealed the presence of a fatigue crack on the inner mid spar fitting of the engine n°3. The crack has been present for a reasonable time. The Airworthiness Directive 93-11-02 asks the replacement of the fittings by improved model at least for July 97. The fittings of engine n°3 were from the old design. Due to the non application of AD 93-11-02, the aircraft was in a non-airworthy condition."}