{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-366c-geneva", "date": "Oct 17, 1982 at 1220 LT", "type": "Boeing 707", "operator": "Egyptair", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cairo - Geneva - Zurich", "msn": "20342", "yom": 1970, "flight_number": "MS771", "city": "Geneva-Cointrin", "zone": "Geneva", "country": "Switzerland", "region": "Europe", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 174, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12564, "captain_hours_type": 4239, "copilot_hours": 3000, "copilot_hours_type": 350, "aircraft_hours": 39002, "circumstances": "The four engine aircraft was performing a schedule service MS771 from Cairo to Zurich with an intermediate stop in Geneva, carrying 174 passengers and a crew of 10. Following an uneventful flight from Cairo-Intl, the crew was cleared to descent for an ILS approach to Geneva-Cointrin Airport runway 23. On short final, the captain failed to realize his altitude was insufficient when the right main gear struck an ILS antenna. Few seconds later, the airplane landed 35 meters short of runway threshold. While contacting the concrete runway, all three landing gear were torn off. The airplane slid on its belly for about 900 meters then made a left turn and lost its right wing before coming to rest. A fire erupted on the right side of the airplane but was quickly extinguished. All 184 occupants were evacuated, two passengers were seriously injured during the evacuation. The aircraft was destroyed. ", "probable_cause": "The accident was the consequence of the followings:\r\n- Lack of decision on part of the pilot-in-command (captain) who failed to initiate a go-around procedure following a wrong approach configuration after the aircraft passed below 1,000 feet or at least after passing over the outer marker, \r\n- Insufficient work coordination in the cockpit, after the crew failed to follow the approach checklist and all instructions relative to approach and landing controls, lack of a clear distribution of tasks as well as surveillance and mutual assistance (doublecheck / crosscheck), \r\n- Stubbornness to land once the ground in sight despite a wrong approach configuration (airbrakes deployed) with an excessive rate of descent. \r\nThe following contributing factors were reported:\r\n- Omission of a correct approach and landing planing,\r\n- Late increase of engine power during the last portion of the approach, \r\n- A possible inadvertent deployment of the interior airbrakes shortly before impact."}