{"url": "https://www.baaa-acro.com/crash/crash-cessna-421a-golden-eagle-i-little-falls-1-killed", "date": "Jun 1, 1998 at 1831 LT", "type": "Cessna 421A Golden Eagle I", "operator": "George Fortier III", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Little Falls - Little Falls", "msn": "421A-0161", "yom": 1968, "flight_number": null, "city": "Little Falls-Morrison County", "zone": "Minnesota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6000, "captain_hours_type": 1500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A witness reported the airplane did not climb above 200 feet and reported seeing the airplane 'wobbling up and down' as it attempted to climb. He reported the airplane went into a sharp left bank and nose dived down. The airplane burned upon impact. The wreckage was located in a wooded area about 3/4 mile from the approach end of runway 30. Numerous open farm fields were located near the airplane's flight path. The winds were reported at 240 degrees at 22 knots gusting to 29 knots. The wreckage path was on a 040 heading and covered about 190 feet from initial tree impact to the location of the main wreckage. The engine inspection did not reveal any anomalies to either engine. The flight was the first maintenance check flight after the airplane had not been flown for 14 months. During maintenance the pilot had put about 100 gallons of water in the left main and left auxiliary fuel tanks to locate a fuel leak. A plug was installed in the left auxiliary fuel drain valve and the fuel tank could not be checked during preflight for fuel contamination without removing the plug. ", "probable_cause": "The pilot's continued operation with a known deficiency in equipment. "}