{"url": "https://www.baaa-acro.com/crash/crash-convair-b-36d-25-cf-peacemaker-near-perkins-13-killed", "date": "Apr 27, 1951 at 1341 LT", "type": "Convair B-36 Peacemaker", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Carswell - Carswell", "msn": "115", "yom": 1949, "flight_number": null, "city": "Perkins", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 17, "crew_fatalities": 13, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Aircraft Commander Major Charles Crecelius, Pilot Major William Apgar, and Co-pilot Captain Harold Barry, a crew of thirteen, and a civilian observer took off from Carswell AFB in B-36D, 49-2658 of the 436th Bomb Squadron of the 7th Bomb Wing at 8:00 A.M. on April 27, 1951. 49-2658 was an element in a flight of three B-36Ds. Their mission included bombing practice at the Midland, Texas bombing range followed by gunner training with a simulated air attack by North American F-51D Mustangs near Oklahoma City. Four Mustangs from the 185th Tactical Reconnaissance Squadron took off from Will Rogers Field in Oklahoma City at 1:20 in the afternoon. They climbed to 20,000 feet altitude to intercept the bombers. They made a series of passes by the bombers to give their gunners practice tracking real airplanes. Training began with a series of high side passes. Then the B-36D reversed course for a series of high frontal passes. Major Crecelius flew the B-36D straight and level at 20,000 feet altitude. One of the regular gunners was back at Carswell AFB occupied by other duties, so Crew Chief M/Sgt William Blair was invited back to the rear compartment to man the lower left gunner station. Each Mustang flew past the B-36D, headed the same direction as the bomber, and then made a 180 degree turn to approach it from the front. The gunners aboard the B-36D tracked the F-51Ds with their General Electric manufactured gun sighting mechanisms, shooting pictures instead of bullets. A flight of two Mustangs piloted by Captain Robinson Risner and 1st Lt Fred Black made a high frontal pass on the bomber. The gunners estimated that Captain Risner's Mustang passed less than 100 feet below the wing of the B-36D. Radio Operator T/Sgt Albert Wolf commented over the intercom, \"Man, he nearly hit the props\". In the rear compartment, Crew Chief M/Sgt William Blair exclaimed, \"He went between the props, didn't he?\" As Lt Black approached in his F-51D, Wolf asked, \"What's this guy going to do?\" The gunners in the rear compartment never saw Lt. Black's Mustang, but they felt the collision. The F-51D hit the fuselage of the B-36D on the top left about nine feet back from the nose. The Mustang broke into two big pieces and lots of small chunks and burst into flames. The three surviving Mustang pilots saw two flaming objects tumble away from the B-36D. The B-36D porpoised for several seconds and pitched up into a steep climb. Then it fell off to the left into a spiral dive. Flight Engineer 1st Lt. Elroy Melberg manned the lower left gunner's station in the rear compartment. His first attempt to head for the exit hatch was thwarted by the web safety straps that connected his parachute harness to the floor. Precious seconds passed as he struggled to unclip his parachute harnesses from the safety straps. He had to use both hands to unfasten the clips as the pitching of the B-36D kept throwing him off balance. Gunner T/Sgt Milton Hewitt was in the lower right gunner's station across from 1st Lt Melberg. T/Sgt Hewitt refused to wear his parachute pack and had ridiculed crew members who wore them. His first impulse was to get to the bunk where he had left his parachute pack. Crew Chief M/Sgt William Blair was giving Gunner T/Sgt Milton Hewitt a replacement gun film canister when the collision occurred. M/Sgt. Blair injured his left leg as he was thrown against the bunks by the impact. He grabbed the exit hatch, but it would not open against the compartment pressurization. M/Sgt Blair called to T/Sgt. Hewitt to open the emergency pressure dump valve, but Hewitt was trying to get to his bunk to retrieve his parachute pack. They ran into each other as Blair reached for the pressure dump valve. Gunner T/Sgt Dick Thrasher occupied the upper left gunner's station. He had been aboard B-36B, 44-92075 when the crew was forced to bail out over Vancouver Island on February 13, 1950. Gunner T/Sgt Ellis Maxon sat across from T/Sgt. Thrasher in the upper right gunner's station. They climbed down the ladders to the exit hatch as the gyrations of the crippled bomber flung them about. M/Sgt. Blair dumped the pressure in the compartment and T/Sgt Thrasher pulled open the exit hatch. T/Sgt Thrasher lay down on his left side next to the exit hatch, grabbed the edge of the hatch and rolled himself headfirst out through the narrow opening. Having never bailed out of an airplane before, M/Sgt Blair paid careful attention to T/Sgt Thrasher's method of egress, intending to copy his moves. M/Sgt Blair assisted 1st Lt Melberg to release his parachute harness from the safety straps. He found the exit hatch blocked by the seven-foot long wooden dip stick that was used to measure the amount of fuel in the tanks. He moved the dip stick out of the way, but it fell across the hatch again. He injured the fingers of his right hand in the effort to get out the hatch. He crawled under the dipstick and stuck his head out the hatch. At that moment, the tail section of the B-36D ripped away from the rest of the fuselage from the bottom to the top at the forward bulkhead of the rear crew compartment. T/Sgt Maxon, 1st Lt Melberg, and M/Sgt Blair were thrown from the rear crew compartment as it ripped open. T/Sgt Hewitt was last seen trying to get his parachute pack from his bunk, but he did not survive the crash. The air around the survivors was filled with falling metal debris. One of the turret bay doors struck the shroud lines of M/Sgt Blair and the tail section tumbled past him on the way down. 1st Lt Melberg's parachute shroud lines struck him in the throat as his parachute opened. His disorientation and the nausea from the pain caused him to vomit repeatedly during the descent. The chest strap and quick release button of TSgt. Maxon's parachute hit him in the face and throat as his parachute opened, but he was too relieved to have escaped from the airplane to notice any pain. None of the twelve men in the forward compartment were able to escape from the falling bomber as it spun to the ground:\r\nMaj Charles Crecelius, pilot,\r\nMaj William Apgar, copilot,\r\nCpt Harold Barry, copilot,\r\nMaj Aurther Burmeister, navigator, \r\nMaj Robert Renner, radar observer,\r\nCpt William Walsh, radar observer,\r\nCpt William Zurivitza, radar observer,\r\nErnest Cox Jr., flight engineer, \r\nT/Sgt Nathan Fetters, radio operator, \r\nT/Sgt Albert Wolf, radio operator, \r\nT/Sgt Edward Ennis, radar mechanic, \r\nBenedict O'Conner, civilian observer. \r\nWreckage from the B-36D fell across 3-1/2 miles of Oklahoma pasture land, ten miles south of the town of Perkins, Oklahoma and 37 miles north northeast of Tinker AFB at 1:41 P.M. CST. The F-51D impacted 12 miles south of Stillwater with 1st Lt Fred Black still in the cockpit. The four survivors saw several other empty parachutes descending with them. They were unable to control the oscillation of their parachutes. Each of them hit the ground in an uncontrolled fashion. T/Sgt Maxon landed in a 3-foot deep ditch and injured the medial meniscus of both knees. As he was dragged a short distance by his parachute, he suffered abrasions to his right knee, contusions to his left thumb and the left side of his neck, and a laceration to his scalp. M/Sgt Blair's parachute dragged him a few feet after landing, and he suffered additional abrasions on his leg, abdomen, and lower left eyelid. T/Sgt Thrasher and 1st Lt Melberg also suffered rough landings. M/Sgt Blair landed just 100 yards from the home of a civilian oil company employee. The civilian got his company car and drove Blair to the place where T/Sgt Maxon and 1st Lt Melberg had come down. Melberg looked pretty beat up, so the civilian took him and Blair to the doctor in Perkins, Oklahoma. T/Sgt Thrasher and T/Sgt Maxon were picked up by officers of the Oklahoma Highway Patrol and were also transported to the doctor in Perkins. The fuel tanks in the wings of the B-36D ruptured when it hit the ground. The gasoline erupted in flames, but a large portion of the fuel drained down the hill away from the crash. The resulting grass fire burned about 8 acres. It burned itself out before emergency vehicles from Tinker AFB arrived at the crash site approximately two hours after the crash. The parachute and billfold of one of the deceased crew members on the B-36D were found 40 miles northeast of the main crash site.\r\nSource & photos:\r\nhttp://www.air-and-space.com/b-36 wrecks.htm#49-2658", "probable_cause": null}