{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-222-sanyi-110-killed", "date": "Aug 22, 1981 at 1000 LT", "type": "Boeing 737-200", "operator": "Far%20Eastern%20Air%20Transport-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Taipei - Kaohsiung", "msn": "19939", "yom": 1969, "flight_number": "FE103", "city": "Sanyi", "zone": "Miaoli County (苗栗縣)", "country": "Taiwan", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 104, "pax_fatalities": 104, "other_fatalities": 0, "total_fatalities": 110, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed Taipei-Songshan Airport bound for Kaohsiung. Fourteen minutes later, while cruising at FL220, radar contact was lost with the airplane and the crew did not send any distress message. The airplane entered an uncontrolled descent, suffered an explosive cabin decompression, partially disintegrated in the air and crashed in Sanyi, in the Miaoli County. Debris scattered on a large area (10 km2) and all 110 occupants were killed, among them the Japanese writer Kuniko Mukōda. ", "probable_cause": "Extensive corrosion damage in the lower fuselage structures, and at a number of locations there were corrosion penetrated through pits, holes and cracks due to intergranular corrosion and skin thinning exfoliation corrosion, and in addition, the possible existence of undetected cracks because of the great number of pressurization cycles of the aircraft (a total of 33,313 landings), interaction of these defects and the damage had so deteriorated that rapid fracture occurred at a certain flight altitude and pressure differential resulting rapid decompression and sudden break of passenger compartment floor beams and connecting frames, cutting control cables and electrical wiring. And eventually loss of power, loss of control, midair disintegration."}