{"url": "https://www.baaa-acro.com/crash/crash-douglas-ts-62-skvoritsy-7-killed", "date": "Oct 5, 1952 at 1602 LT", "type": "Douglas DC-3", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Leningrad – Minsk", "msn": "16973/34233", "yom": 1945, "flight_number": "SU381", "city": "Skvoritsy", "zone": "Leningrad oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4042, "circumstances": "The TS-62 took off from Leningrad-Shosseynaya Airport and its crew received the permission to climb to the altitude of 2,700 meters via the corridor number two. While climbing into clouds, the airplane collided with an Aeroflot Ilyushin II-12 that was approaching the same Airport. Inbound from Minsk, the II-12 was registered CCCP-L1328 and was carrying 19 passengers and a crew of five. Its pilot obtained the permission from ATC to descend to the altitude of 1,200 meters via the same corridor number two. At the altitude of 1,200 meters, both aircraft collided, dove into the ground and crashed in a field located near the village of Skvoritsy, about 23 km southwest of Leningrad-Shosseynaya Airport. Both wreckage were found 1,200 meters from each other and all 31 occupants were killed.", "probable_cause": "It was determined that the collision was caused by an error on part of the ATC services. Despite the fact that both aircraft were tracked on radar screens, ATC based at Leningrad-Shosseïnaya Airport failed to take appropriate actions to ensure a minimum safe separation between both airplanes and failed to realize that they were flying in the same corridor in an opposite direction and at the same altitude. Investigations revealed that the collision was the result of successive errors on part of the ATC who failed to ensure an efficient radar surveillance and transmitted to both crews inappropriate instructions that led both aircraft on the same track."}