{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-136-new-york", "date": "Dec 20, 1995 at 1136 LT", "type": "Boeing 747-100", "operator": "Tower%20Air.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York - Miami", "msn": "20271", "yom": 1971, "flight_number": "FF041", "city": "New York-JFK", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 17, "crew_fatalities": 0, "pax_on_board": 451, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16455, "captain_hours_type": 2905, "copilot_hours": 17734, "copilot_hours_type": 4804, "aircraft_hours": 90456, "circumstances": "The captain initiated a takeoff on runway 04L, which was covered with patches of ice and snow. The wind was from 330 degrees at 11 knots. Before receiving an 80-knot call from the 1st officer, the airplane began to veer to the left. Subsequently, it went off the left side of the runway and collided with signs and an electric transformer. Investigation revealed evidence that the captain had overcontrolled the nosewheel steering through the tiller, then applied insufficient or untimely right rudder inputs to effect a recovery. The captain abandoned an attempt to reject the takeoff, at least temporarily, by restoring forward thrust before the airplane departed the runway. The current Boeing 747 operating procedures provide inadequate guidance to flightcrews regarding the potential for loss of directional control at low speeds on slippery runways with the use of the tiller. Current Boeing 747 flight manual guidance was inadequate about when a pilot should reject a takeoff following some indication of a lack of directional control response. Improvements in the slippery runway handling fidelity of flight simulators used for Boeing 747 pilot training were considered to be both needed and feasible.", "probable_cause": "The captain's failure to reject the takeoff in a timely manner when excessive nosewheel steering tiller inputs resulted in a loss of directional control on a slippery runway. Inadequate Boeing 747 slippery runway operating procedures developed by Tower Air, Inc., and the Boeing Commercial Airplane Group and the inadequate fidelity of B-747 flight training simulators for slippery runway operations contributed to the cause of this accident. The captain's reapplication of forward thrust before the airplane departed the left side of the runway contributed to the severity of the runway excursion and damage to the airplane. "}