{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-florida-4-killed", "date": "Sep 13, 1976 at 0954 LT", "type": "Cessna 414 Chancellor", "operator": "Ruel Insurance", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Miami - Fort Lauderdale - Tallahassee", "msn": "414-0254", "yom": 1971, "flight_number": null, "city": "Brighton-Grass Field", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 798, "captain_hours_type": 266, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine airplane departed Fort Lauderdale bound for Tallahassee with three passengers and a pilot on board. While cruising at an altitude of 12,500 feet in good weather conditions, the airplane collided with a USAF Douglas F-4E Phantom II registered 67-0255. Engaged in a routine exercise with two other F-4, the fighter departed Homestead AFB with two pilots on board under call sign 'Reed 11' and was descending to enter a restricted area for low-level gunnery practice. Both planes collided outside the boundaries of restricted airspace. The Cessna dove into the ground and crashed in the Brighton Indian Reserve, killing all four occupants. A pilot onboard the F-4E was killed while the second pilot ejected successfully and was injured. Both aircraft were destroyed upon impact. ", "probable_cause": "Failure of the pilots of the 'Reed 11' flight to maintain adequate vigilance in order to see and avoid the light aircraft. Base Supplement 1 to Tactical Air Command Manual 55-4 which allowed a VFR descent into the Avon Park gunnery range and Air Force Regulation 60-16 which required all flights to be conducted under IFR conditions unless to do so would result in contributing to the accident was the inconsistency between Homestead Air Force unacceptable mission derogation."}