{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-62-athens-14-killed", "date": "Oct 7, 1979 at 2116 LT", "type": "Douglas DC-8", "operator": "Swissair", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Zurich – Geneva – Athens – Bombay – Beijing", "msn": "45919/312", "yom": 1967, "flight_number": "SR316", "city": "Athens-Ellinikon", "zone": "Attica / Αττική", "country": "Greece", "region": "Europe", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 144, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 8988, "captain_hours_type": 2637, "copilot_hours": 3817, "copilot_hours_type": 805, "aircraft_hours": 46418, "circumstances": "The approach to runway 15L was unstable. At an excessive speed of 150 knots, the four engine airplane landed about 800-900 meters down the runway 15L, on a wet surface. The crew failed to use all available braking systems and unable to stop within the remaining distance, the airplane overran at a speed of 40 knots, went through a perimeter fence and descended a ravine before coming to rest in flames. 20 passengers were injured while 120 other occupants escaped uninjured. Unfortunately, 14 passengers were killed. The aircraft was totally destroyed by a post crash fire. ", "probable_cause": "It was determined that the accident was the consequence of a succession of errors on part of the flying crew, among them:\r\n- The aircraft was unstable on final approach, \r\n- The crew landed too far down the runway with a touchdown point estimated 800 to 900 meters past the runway threshold, \r\n- The aircraft's speed at touchdown was excessive (150 knots),\r\n- The crew failed to apply brakes according to published procedures, especially the wheel brakes in known adverse weather conditions, \r\n- Wrong approach configuration, \r\n- The crew has been informed prior to landing that the braking coefficient was medium to poor,\r\n- The runway surface was wet due to recent rain falls. "}