{"url": "https://www.baaa-acro.com/crash/crash-boeing-kc-135a-bn-stratotanker-greenwood-27-killed", "date": "Mar 19, 1982 at 2110 LT", "type": "Boeing KC-135 Stratotanker", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Sawyer - Chicago", "msn": "17776/246", "yom": 1959, "flight_number": null, "city": "Greenwood", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 23, "pax_fatalities": 23, "other_fatalities": 0, "total_fatalities": 27, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9249, "circumstances": "The four engine airplane departed Kenneth Ingalls Sawyer AFB on a flight to Chicago-O'Hare Airport, carrying 23 passengers and a crew of four. After being cleared to descend from 22,000 feet to 8,000 feet, the crew reduced his speed when at an altitude of 13,700 feet, at a speed of 313 knots, the airplane suffered an in-flight explosion. Both wings detached, all four engines separated as well as the stabs and out of control, the airplane dove into the ground and crashed in an open field located in Greenwood, about 37 miles northwest of Chicago Airport. The aircraft was totally destroyed and all 27 occupants were killed. ", "probable_cause": "The exact cause of the accident could not be determined with certainty. Considered as 'most probable' was an over-pressurization under the cargo floor, an area that houses fuel and other potential sources of ignition. An explosion caused by the ignition of accumulated combustible vapors occurring in that area could, in fact, rapidly propagate to adjacent areas where fuel is present. There was also 'strong evidence' of explosive over-pressures in the forward, aft and upper fuel tank areas. Significantly, investigation showed that were the walls or fittings of the rubber bladder cells containing the volatile liquid to fail, fuel or vapor could be released into the tank cavity and in turn migrate to other part of the aircraft. "}