{"url": "https://www.baaa-acro.com/crash/crash-aerospatiale-caravelle-durrenasch-80-killed", "date": "Sep 4, 1963 at 0622 LT", "type": "Sud-Aviation SE-210 Caravelle", "operator": "Swissair", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Zurich - Geneva - Rome", "msn": "147", "yom": 1962, "flight_number": "SR306", "city": "Dürrenäsch", "zone": "Aargau", "country": "Switzerland", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 74, "pax_fatalities": 74, "other_fatalities": 0, "total_fatalities": 80, "captain_hours": 7600, "captain_hours_type": 380, "copilot_hours": 6000, "copilot_hours_type": 380, "aircraft_hours": 3400, "circumstances": "Flight SR-306 was a scheduled international flight from Zürich to Rome, with an intermediate stop at Geneva. Dense fog was existing at the time of departure and at 0600 hours the flight was informed that the RVR was 180 m for runway 34 and 60 m for runway 16, and that there was a light northerly wind (1 to 2 kt). At 0604 hours the flight was authorized to taxi to runway 34 behind an accompanying vehicle. At 0605 the crew reported that they will taxi half way down runway 34 to inspect the fog condition and then return to takeoff position. This was done, using at times considerable engine power probably in an attempt to disperse the fog: Around 0612 hours the aircraft was back to the threshold of runway 34 and permission to takeoff was granted. The flight took off at 0613 hours and started to climb to flight level 150, its cruising altitude. Four minutes later witnesses on the ground noticed a whitish trail of smoke on the left side of the aircraft and suddenly a long flame from the left wing-root. Around 0620 hours the aircraft reached an altitude of approximately 2700 m, it then began to lose height, entered a gentle left turn loosing height more rapidly and finally went into a steep dive. Parts of the aircraft became detached and at 0621 hours a \"MAYDAY\" message was received. At 0622 hours the aircraft crashed into the ground on the outskirts of Dürrenäsch, at an elevation of 559 m, approximately 35 km from Zürich-Kloten Airport. The aircraft disintegrated on impact, causing a huge crater at the point of impact and all 80 occupants were killed, among them 43 habitants of the small village of Humlikon (200 habitants in total). Farmers specialized in milk business, they were flying to Geneva to visit a milk-farm. ", "probable_cause": "The crash was due to the destruction of essential structural parts of the aircraft by a fire caused by overheating of the brakes during the taxiing phase."}