{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-e20-lukla-2-killed", "date": "May 27, 2017 at 1404 LT", "type": "Let L-410", "operator": "Summit-Air-Nepal", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kathmandu – Lukla", "msn": "14 29 17", "yom": 2014, "flight_number": "GO409", "city": "Lukla-Tenzing-Hillary", "zone": "Sagarmatha", "country": "Nepal", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 9687, "captain_hours_type": 1897, "copilot_hours": 1311, "copilot_hours_type": 1028, "aircraft_hours": 2550, "circumstances": "On May 27, 2017 9N-AKY, LET 410 UVP-E20 of Goma Air (now Summit Air), a domestic carrier of Nepal had a published program to operate 5 flights to Lukla from Kathmandu. The first flight departed Kathmandu at 0026 UTC. By the time 0647 UTC they had completed 4 flights. The fifth and the last flight departed Kathmandu at 0744 UTC for Lukla as call sign Goma Air 409. Goma Air 409 was the cargo flight carrying 1680 kg cargo for Lukla. There were two cockpit crews, one cabin crew and no passengers on board the flight. It was pre-monsoon period. Lukla weather on that particular day was cloudy since morning. But ceiling and visibility were reported OK. However, CCTV footage shows rapidly deteriorating weather condition before and after the crash. Automatic VHF recorder of Lukla Tower and CVR recording showed Tower was regularly updating pilots of deteriorating weather. All the pre-and post-departure procedure of the flight was completed in normal manner. Before departure from Kathmandu Pilots were found to have obtained latest weather of Lukla, Phaplu and Rumjatar. PIC decided to remain south of track to avoid the terrain and cloud. When Goma 409 was about 11 miles East from Kathmandu they were informed that Lukla was having heavy rain and airport closed. By that time air traffic congestion in TIA was slowly developing. Traffics were holding in the air and in the ground as well. So Goma 409 continued for Lukla. However, after crossing 26 miles from Kathmandu, they were again informed that the rain had ceased and airport was open. An AS350 helicopter, 9N AGU which departed Lukla at 0803 UTC for Kathmandu had reported unstable wind on final Runway 06. Enroute weather reported by 9N AGU upon request of Lukla Tower was good beyond the Lukla valley. However, it was apprehended that for fixed wing, weather might be difficult to enter valley. Lukla Tower relayed all available information when Goma Air 409 had first established contact at time 0810 UTC. Later, Goma Air and 9N AGY, two reciprocal traffics were also in contact each other. 9N AGY relayed the actual weather status to GOMA AIR. Lukla valley's ceiling and visibility was OK for VFR until 0812UTC ( 6 minutes before crash). Weather started to deteriorate very fast. Mountain Ridges were visible through thin layer of foggy cloud until 0814 UTC. After one minute (approx.) Right Base for Runway 06, was covered up and cloud from left base was moving towards final. Duty ATS Officer of Lukla Tower was regularly up dating pilots about deteriorating weather condition. However, Tower was found to be failed to close the runway as per SOP in spite of rapidly deterioratingweather. Pilots ventured to continue though the weather was marginal. Aircraft reported entering valley at 0816. CVR record showed that First Officer sighted the runway at 0817 (64 seconds before the impact). Instantly PIC acknowledged he had also the runway in sight. Aircraft was at 9100 ft (approx.) when the cockpit crews sighted the runway. It maintained 9000 feet (approx.) for further 21 seconds. At time 0817:12i.e. 48 seconds before the impact Tower gave the latest wind as Westerly 04 knots and runway was clear. PIC was still in doubt and asked whether there was rain. Upon confirmation of having no rain from the Tower the aircraft started to descend further. The PIC, who was also the PF, found to have lost situational awareness deviated to the right with continued descend. At 0817:35 (25 seconds before impact) when the flight was descending through 8650 ft First Officer warned PIC that they were too low. PIC did not respond the F/O's call-out and continued descend. On reaching 8500 ft. F/O again warned PIC in panic. Then PIC asked in panic where the runway was. F/O directed towards the runway. But it was already too low and too late. There was initially two short stall warning sound. Then a continuous stall warning sounded till the impact, which lasted for 13 seconds. The last words in CVR records was \"w]/ gtfg \" (Do not pull too much). Abrupt change in aircraft attitude in an attempt to climb and reach threshold height at 8900 ft. (on Kathmandu QNH) in a landing configuration, with landing gears down and on full flaps, created excessive drag resulting the aircraft to stall. Subsequently, its left wing first hit a small tree branch 180 ft. short of the threshold. Then impacted the sloppy terrain 100ft. short of the runway. After the crash aircraft engine was reported to be running for about a minute. But there was no postcrash fire. Aircraft was totally damaged by the impact. \r\nCrew:\r\nParas Kumar Rai, pilot, †\r\nSrijan Manandhar, copilot, †\r\nPragya Maharjan, cabin crew. ", "probable_cause": "The Commission concludes that the probable cause of this accident was aircraft stall as a result of excessive drag created by sudden increase in angle of attack of the aircraft supplemented by low speed (below Vref) in an attempt to initiate immediate climb on a landing configuration (full flap and landing gear down) warranted by the critical situation of the final phase of flight.\r\nContributing factors:\r\n- Critical terrain and rapidly deteriorating weather condition.\r\n- Pilot's loss of situational awareness.\r\n- Improper pilot response to stall warning including failure to advance power lever to maximum at appropriate time.\r\n- Violation of SOP by the ATS and Pilot as well. \n"}