{"url": "https://www.baaa-acro.com/crash/crash-antonov-32b-kinshasa-298-killed", "date": "Jan 8, 1996 at 1243 LT", "type": "Antonov AN-32", "operator": "African Air", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "City", "schedule": "Kinshasa - Kahemba", "msn": "2301", "yom": 1989, "flight_number": null, "city": "Kinshasa-Ndolo", "zone": "Kinshasa City Province", "country": "Democratic Republic of Congo", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 297, "total_fatalities": 298, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was completing a cargo flight from Kinshasa to Kahemba, carrying two passengers, four crew members and a load of food and basic necessities. During the takeoff roll, at a speed of 204 km/h, the pilot-in-command pulled up the control column to start the rotation but the aircraft failed to respond. The crew decided to abort the take off procedure but this decision was taken too late. Unable to stop within the remaining distance (the runway is 1,700 metres long), the aircraft overran, rolled for about 240 metres and came to rest in the district of Simbazikita, bursting into flames. A crew member was killed while five other occupants were injured. On ground, at least 297 people were killed while 253 others were injured, some seriously. ", "probable_cause": "It was determined that the aircraft was unable to take off because its total weight at the time of the accident was well above the MTOW. Due to lack of evidences, investigations were unable to determine the exact value of the excess mass, probably between 2 and 7 tons. Nevertheless, the decision of the crew to abort the takeoff procedure was taken too late and the runway length was insufficient. It was also reported that the aircraft was operated by African Air and leased from Moscow Airways. The flight was operated illegally on behalf of Scibe-Airlift which was not concerned about such operation. The certificate of airworthiness expired last December and the aircraft was not authorized to fly. "}