{"url": "https://www.baaa-acro.com/crash/crash-cessna-401-plymouth", "date": "Jun 19, 2010 at 1703 LT", "type": "Cessna 401", "operator": "Oasis Flight Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Topographic", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Plymouth - Plymouth", "msn": "401-0180", "yom": 1971, "flight_number": null, "city": "Plymouth", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3500, "captain_hours_type": 1200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2004, "circumstances": "The airplane was returning from a 3-hour aerial mapping mission and was lined up for a straight-in, 5-mile final approach for landing. About 3 miles out on final approach, and prior to performing the before-landing check, both engines stopped producing power in sequence, one almost immediately after the other. The pilot said that by the time he completed his remedial actions the airplane had descended to about 200 feet above the ground and the engines would not restart. The auxiliary fuel tank gauges were bouncing between 2-5 gallons and the main tanks were bouncing around at 25 gallons per side. The pilot then selected a forced landing site between two large trees and landed the airplane in heavily wooded terrain. A detailed examination of the wreckage revealed no evidence of preimpact mechanical anomalies. According to information contained in the aircraft manufacturer’s owner's manual, the auxiliary fuel tanks are designed for cruising flight and are not equipped with pumps; operation near the ground (below 1000 feet) using auxiliary fuel tanks is not recommended. The first step in the before-landing check was to select the main fuel tanks on both the left and right fuel selectors, respectively. The pilot indicated that he should have selected the main tanks sooner and performed the before-landing check earlier in the approach.\n", "probable_cause": "A total loss of engine power during final approach due to fuel starvation as a result of the pilot’s delayed configuration of the airplane for landing.\n"}