{"url": "https://www.baaa-acro.com/crash/crash-learjet-25b-portland", "date": "Nov 17, 2010 at 1553 LT", "type": "Learjet 25", "operator": "Premier-Jet", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Boise - Portland", "msn": "25-111", "yom": 1973, "flight_number": null, "city": "Portland-Hillsboro", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6000, "captain_hours_type": null, "copilot_hours": 652, "copilot_hours_type": 10, "aircraft_hours": 8453, "circumstances": "The airplane was flying a VOR/DME-C approach that was on an oblique course about 40 degrees to the runway 30 centerline; the wind conditions produced an 8-knot tailwind for landing on runway 30. Despite the tailwind, the captain elected to land on the 6,600-foot-long runway instead of circling to land with a headwind. Moderate to heavy rain had been falling for the past hour, and the runway was wet. The crew said that the airplane was flown at the prescribed airspeed (Vref) for its weight with the wing flaps fully extended on final approach, and that they touched down just beyond the touchdown zone. The captain said that he extended the wings' spoilers immediately after touchdown. He tested the brakes and noted normal brake pedal pressure. However, during rollout, he noted a lack of deceleration and applied more brake pressure, with no discernible deceleration. The airplane's optional thrust reversers had been previously rendered non-operational by company maintenance personnel and were therefore not functional. The captain stated that he thought about performing a go-around but believed that insufficient runway remained to ensure a safe takeoff. While trying to stop, he did not activate the emergency brakes (which would have bypassed the anti-skid system) because he thought that there was insufficient time, and he was preoccupied with maintaining control of the airplane. He asked the first officer to apply braking with him, and together the crew continued applying brake pedal pressure; however, when the airplane was about 2,000 feet from the runway's end, it was still traveling about 100 knots. As the airplane rolled off the departure end on runway 30, which was wet, both pilots estimated that the airplane was still travelling between 85 and 90 knots. The airplane traveled 618 feet through a rain-soaked grassy runway safety area before encountering a drainage swale that collapsed the nose gear. As the airplane was traversing the soft, wet field, its wheels partially sank into the ground. While decelerating, soil impacted the landing gear wheels and struts where wiring to the antiskid brake system was located. The crew said that there were no indications on any cockpit annunciator light of a system failure or malfunction; however, after the airplane came to a stop they observed that the annunciator light associated with the antiskid system for the No. 2 wheel was illuminated (indicating a system failure). The other three annunciator lights (one for each wheel) were not illuminated. During the approach, the first officer had completed the landing data card by using a company-developed quick reference card. The quick reference card’s chart, which contained some data consistent with the landing charts in the Airplane Flight Manual (AFM), did not have correction factors for tailwind conditions, whereas the charts in the AFM do contain corrective factors for tailwind conditions. The landing data prepared by the first officer indicated that 3,240 feet was required to stop the airplane on a dry runway in zero wind conditions, with a wet correction factor increasing stopping distance to 4,538 feet. The Vref speed was listed as 127 knots for their landing weight of 11,000 pounds, and the first officer’s verbal and written statements noted that they crossed the runway threshold at 125 knots. During the investigation, Bombardier Lear calculated the wet stopping distances with an 8-knot tailwind as 5,110 feet. The touchdown zone for runway 30 is 1,000 feet from the approach end. The crew’s estimate of their touchdown location on the runway is about 1,200 feet from the approach end, yielding a remaining runway of 5,400 feet. On-duty controllers in the tower watched the landing and said that the airplane touched down in front of the tower at a taxiway intersection that is 1,881 feet from the approach end, which would leave about 4,520 feet of runway to stop the airplane. The controllers observed water spraying off the airplane’s main landing gear just after touchdown. Post accident testing indicated that the brake system, including the brake wear, was within limits, with no anomalies found. No evidence of tire failure was noted. The antiskid system was removed from the airplane for functional tests. The control box and the left and right control valves tested within specifications. The four wheel speed sensors met the electrical resistance specification. For units 1, 2 and 3, the output voltages exceeded the minimum specified voltages for each of the listed frequencies. Unit 4 was frozen and could not be rotated and thus could not be tested. Sensors 1 and 2 exceeded the specified 15% maximum to minimum voltage variation limit. Sensor 3 was within the limit and 4 could not be tested. Based on all the evidence, it is likely that the airplane touched down on the water-contaminated runway beyond the touchdown zone, at a point with about 600 feet less remaining runway than the performance charts indicated that the airplane required for the wet conditions. Since a reverted rubber hydroplaning condition typically follows an encounter with dynamic hydroplaning, the reverted rubber signatures on the No. 2 tire indicate that the airplane encountered dynamic hydroplaning shortly after touchdown, and the left main gear wheel speed sensor anomalies allowed the left tires to progress to reverted rubber hydroplaning. This, along with postaccident testing, indicates that the anti-skid system was not performing optimally and, in concert with the hydroplaning conditions, significantly contributed to the lack of deceleration during the braking attempts.", "probable_cause": "The failure of the flight crew to stop the airplane on the runway due to the flying pilot’s failure to attain the proper touchdown point. Contributing to the accident was an anti-skid system that was not performing optimally, which allowed the airplane to encounter reverted rubber hydroplaning, and the company-developed quick reference landing distance chart that did not provide correction factors related to tailwind conditions.\n"}