{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-lummi-island-1-killed", "date": "Oct 9, 2000 at 0951 LT", "type": "Cessna 208B Grand Caravan", "operator": "FedEx", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Bellingham – Eastsound", "msn": "208B-0192", "yom": 1989, "flight_number": "FDX665", "city": "Lummi Island", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 8705, "captain_hours_type": 4500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3526, "circumstances": "With a reported ceiling of 500 feet and visibility of 2 miles, the pilot requested and received a Special Visual Flight Rules (VFR) clearance to depart the Bellingham airport. He then took off and called clear of Bellingham's Class D airspace. A witness reported seeing the aircraft flying very low over water near the accident site, appearing to go in and out of clouds, and subsequently seeing it turn toward rising wooded terrain and disappear into the clouds. The aircraft crashed shortly thereafter. Witnesses reported very low ceilings and fog in the accident area at the time. Pieces of the aircraft's left wing and left horizontal stabilizer, along with a felled treetop, were found between the location of the witness's sighting and the main crash site, on or near the crest of a hill about 1/4 mile from the main crash site. These pieces exhibited leading-edge and primary structure damage, and leading-edge-embedded plant material, consistent with the pieces separating from the aircraft upon contact with trees. Wreckage and impact signatures at the main crash site were indicative of an uncontrolled impact with the ground. Investigators found no evidence of any aircraft malfunctions or cargo anomalies occurring prior to the apparent tree strikes. ", "probable_cause": "The pilot's attempted flight into known adverse weather conditions, and his subsequent failure to maintain altitude above, or clearance with, trees. Factors contributing to the accident included low ceilings, fog, the pilot's low-altitude flight, rising terrain, and trees. "}