{"url": "https://www.baaa-acro.com/crash/crash-cessna-207-skywagon-milford-sound-6-killed", "date": "Jan 19, 2002 at 1000 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Air%20Fiordland", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Te Anau - Milford Sound", "msn": "207-0204", "yom": 1971, "flight_number": null, "city": "Milford Sound", "zone": "Southland Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 635, "captain_hours_type": 13, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On Saturday, 19 January 2002, at 0931, ZK-SEV, a Cessna 207, took off from Te Anau Aerodrome for Milford Sound Aerodrome. At about 1000 the aircraft collided with the side of a mountainous valley, approximately 4400 feet above sea level and 500 metres southeast of Gertrude Saddle, some 11 kilometres from Milford Sound. The pilot and 5 passengers on board died in the collision. The aircraft probably had not reached a suitable altitude to safely cross over Gertrude Saddle, and the pilot probably left his decision too late to turn back in the valley in order to gain more height. ", "probable_cause": "Findings:\r\nFindings and safety recommendations are listed in order of development and not in order of priority.\r\n- The pilot was appropriately qualified, fit and authorised to conduct the flight.\r\n- The aircraft records indicated the aircraft was properly maintained and airworthy. The aircraft was appropriate for the purpose and was approved for air transport operations.\r\n- The weather conditions were suitable for the flight.\r\n- The aircraft was probably too low to safely cross Gertrude Saddle, and the pilot probably elected to use his escape option of a left reverse turn after recognising that he would be unable to safely cross the saddle. This was left too late to safely complete the manoeuvre.\r\n- Had the aircraft reached a suitable height to safely cross Gertrude Saddle prior to entering Gertrude Valley, the accident may have been averted.\r\n- The pilot may have misjudged the strength of the tailwind and thus the aircraft ground speed, and the strength of any downdraughts, as he approached Gertrude Saddle. Consequently, the\r\nclosing speed with the saddle and the low height of the aircraft may have caught the pilot by surprise.\r\n- The pilot’s delayed action in initiating a reverse turn away from Gertrude Saddle was probably a prime contributing factor to the accident.\r\n- Pilot inexperience may have contributed to the accident. \r\n- The current aeroplane pilot training requirements are not sufficient to ensure pilots are suitably equipped to handle the demanding flying challenges that mountainous environments can present."}