{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-piqua-1-killed", "date": "Aug 24, 2001 at 0640 LT", "type": "Beechcraft 200 Super King Air", "operator": "Middletown Corporate Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dayton – Piqua", "msn": "BB-900", "yom": 1981, "flight_number": null, "city": "Piqua", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7100, "captain_hours_type": 2400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10821, "circumstances": "The airline transport rated pilot was attempting to land under visual flight rules for a scheduled passenger pick-up and subsequent charter flight. The pilot was communicating with a pilot at the airport, who was utilizing a hand held radio. The accident pilot reported he was not able to see the runway lights due to ground fog and continued to circle the airport for about 20 minutes. The pilot on the ground stated the airplane appeared to be about 1,500 feet above the ground when it circled, and then entered a downwind for runway 26. He was not able to hear or see the airplane as it flew away from the airport. He then began to hear the airplane during its final approach. The airplane's engines sounded normal. He then heard a \"terrible sound of impact,\" followed by silence. When he arrived at the accident site, the airplane was fully engulfed in flames. The airplane impacted trees about 80-feet tall, located about 2,000 feet from, and on a 240 degree course to the approach end of runway 26. Several freshly broken tree limbs and trunks, up to 15-inches in diameter, were observed strewn along a debris path, which measured 370 feet. Examination of the wreckage did not reveal any pre-impact malfunctions. The weather reported at an airport about 19 miles south-southeast of the accident site, included a visibility of 1 3/4 miles, in mist, with clear skies and a temperature and dew point of 17 degrees Celsius. Witnesses in the area of the accident site generally described conditions of \"thick fog\" and a resident who lived across from the accident site stated visibility was \"near zero\" and he could barely see across the road.", "probable_cause": "The pilot's improper decision to attempt a visual landing under instrument meteorological conditions and his failure to maintain adequate altitude/clearance, which resulted in an inflight collision with trees. A factor in this accident was the ground fog."}