{"url": "https://www.baaa-acro.com/crash/crash-learjet-36a-amman-4-killed", "date": "Sep 23, 1977 at 0729 LT", "type": "Learjet 36", "operator": "Arab-Wings-2", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Amman - Beirut", "msn": "36-020", "yom": 1976, "flight_number": null, "city": "Amman-Marka", "zone": "Amman City District", "country": "Jordan", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 2289, "captain_hours_type": null, "copilot_hours": 974, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 22 September this aircraft, with the same crew and passengers, arrived on a charter flight Beirut - Amman at 1515 GMT. Although originally scheduled for departure at 0900 GMT on the 23rd, further planning advanced the departure to 0700 GMT and this crew volunteered to make the flight as the scheduled crew could not be notified of the change in timing. The aircraft was topped off with 260 U.S. gal of fuel at 1830 GMT, making the fuel load equivalent to 4,500 lb. There was approximately 200 lb of fuel in the fuselage tank. The fuelling top-off on the 22nd and morning departure were supervised by a licensed Arab Wing mechanic. The first officer undertook an outside pre-flight inspection and then called the tower for take-off data. The right-hand engine was started at approximately 0700. Start-up clearance was requested and at 0703 the crew were notified that start-up clearance would be at 0715. When the tower advised the crew they could start up, the captain requested taxi clearance, and during taxi-out was advised to slow down. Owing to coordination of traffic beyond the borders of Jordan, the crew were informed that take-off clearance would be 0729 or later. At 0724 request for take-off was again made and the tower advised that clearance was 0729. At 0729 the aircraft was cleared by the tower for take-c~ff and after this was acknowledged, no further voice communication was carried out from the aircraft. The time lapse from acknowledgement of clearance to \"Mayday\" call from a taxiing Academy aircraft was 55 seconds.The referenced aircraft was seen after take-off from runway 24 to suddenly drop the left wing while in climb attitude, make a recovery to wings level and then continue in a slow roll to the right beginning descent. During this descending roll the nose of the aircraft was observed tu oscillate once or twice as if forward stick pressure was being exerted. Recovery was not effected and the aircraft impacted on the cockpit area in an inverted position on hard ground approximately 8 ft north of the parallel taxiway. Disintegration began at this point with the aircraft separating into three major sections; cockpit and cabin, aft fuselage from fuel tank bulkhead to vertical and horizontal stabilizer, and wings with gear extended. Fuel ignition was generated at ground impact of the right wing tip tank and fire contributed to damage to the aft fuselage as well as to wing leading edges. The cockpit and cargo floor came to rest approximately 350 ft along the ground path with the aft fuselage section being stopped by a tree 375 ft along the ground path. The wings landed inverted at a distance of 573 ft with leading edge facing towards the main wreckage. The accident was not survivable owing to the impact forces experienced. ", "probable_cause": "The highest probability centres around a possible fuel imbalance at the time of take-off. As the aircraft was observed dropping a left wing very rapidly with an eventual recovery still in climb attitude, the actual cause of continuing right roll cannot be explained unless gyroscopic forces were assisted by the use of right rudder. Although not conclusive, tests were carried out by a senior flight crew member of Arab Wings in a Lear Jet simulator set up with the data applicable to the aircraft and field conditions at the time of the accident. Using maximum fuel imbalance condition the test crew experienced similar results and loss of control through right roll owing to inability to centre rudder control after wings level, as stated by the pilot of the simulated flight.  "}