{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-8-202-tarakigne", "date": "Nov 19, 2009 at 1514 LT", "type": "De Havilland DHC-8-200 (Dash-8)", "operator": "Win%20Win%20Aviation", "flight_phase": "Flight", "flight_type": "Government", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Nouakchott - Bamako", "msn": "500", "yom": 1997, "flight_number": null, "city": "Tarakigné", "zone": "Koulikoro", "country": "Mali", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Before take off at Nouakchott, two fuel trucks arrived to the airplane but captain declined and calculated that the reserve he has was sufficient to fly to Bamako. While approaching Bamako, right engine failed due to fuel exhaustion, followed by the left engine five minutes later. Crew elected to divert to Kolokani, a small airstrip located 19 km from Bamako. Eventually, crew was forced to make an emergency landing off airport. On landing, aircraft lost its undercarriage while the right wing was sheared off. All nine occupants were uninjured while the aircraft was destroyed. Flight was performed on behalf of the 524th Special Operations Squadron, for the USAF and Africom, a military mission in Africa. ", "probable_cause": "The Accident Investigation Board (AIB) President found by clear and convincing evidence that the cause of this mishap was the mishap aircraft running out of fuel due to the mishap aircraft commander’s and mishap copilot’s failure to properly fuel plan and then refuel the mishap aircraft at Nouakchott with a sufficient amount to reach their destination. Once airborne, despite indications of a fuel shortage, the mishap crew did not divert to a suitable alternate airport early enough in the sortie to avoid this mishap. The AIB President also found sufficient evidence to conclude the following factors substantially contributed to the mishap: insufficient mission and flight planning; faulty decision-making; complacency; task misprioritization; channelized attention; and the mishap crew pressing to meet mission demands."}