{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-moorhead", "date": "Nov 23, 2016 at 1759 LT", "type": "Beechcraft 200 Super King Air", "operator": "Flight Development", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Baudette - Moorhead", "msn": "BB-370", "yom": 1978, "flight_number": null, "city": "Moorhead", "zone": "Minnesota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5630, "captain_hours_type": 89, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The commercial pilot was conducting an on-demand passenger flight at night in instrument meteorological conditions that were at/near straight-in approach minimums for the runway. The pilot flew the approach as a non precision LNAV approach, and he reported that the approach was stabilized and that he did not notice anything unusual. A few seconds after leveling the airplane at the missed approach altitude, he saw the runway end lights, the strobe lights, and the precision approach path indicator. He then disconnected the autopilot and took his hand off the throttles to turn on the landing lights. However, before he could turn on the landing lights, the runway became obscured by clouds. The pilot immediately decided to conduct a missed approach and applied engine power, but the airplane subsequently impacted terrain short of the runway in a nose-up level attitude. The pilot reported that there were no mechanical anomalies with the airplane that would have precluded normal operation. It is likely the pilot lost sight of the runway due to the visibility being at/near the straight-in approach minimums and that the airplane got too low for a missed approach, which resulted in controlled flight into terrain. A passenger stated that he and the pilot were not wearing available shoulder harnesses. The passenger said that he was not informed that the airplane was equipped with shoulder harnesses or told how to adjust the seats. The pilot sustained injuries to his face in the accident.", "probable_cause": "The pilot's failure to attain a positive climb rate during an attempted missed approach in night instrument meteorological conditions that were at/near approach minimums, which resulted in controlled flight into terrain."}