{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226t-merlin-iiib-teterboro", "date": "May 31, 2005 at 1130 LT", "type": "Swearingen SA226T Merlin III", "operator": "Maci Leasing Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nantucket – Teterboro", "msn": "T-317", "yom": 1979, "flight_number": null, "city": "Teterboro", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2676, "captain_hours_type": 1400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4698, "circumstances": "During takeoff from the departure airport, as the pilot advanced the throttles, the aircraft made a \"sudden turn to the right.\" The pilot successfully aborted the takeoff, performed an engine run-up, and then took off without incident. The pilot experienced no anomalies during the second takeoff or the flight to the destination airport. As he reduced the power while in the traffic pattern, at the destination airport, the left engine accelerated to 60 percent power. The pilot reported to the tower that he had \"one engine surging and another engine that seems like I lost control or speed.\" The pilot advanced and retarded the throttles and the engines responded appropriately, so he continued the approach. As the pilot flared the airplane for landing, the left engine surged to 65 percent power with the throttle lever in the \"idle\" position. The airplane immediately turned to the right; the right wing dropped and impacted the ground. Disassembly of the engines revealed no anomalies to account for surging, or for an uncommanded increase in power or lack of throttle response. Functional testing of the fuel control units and fuel pumps revealed the flight idle fuel flow rate was 237 and 312 pounds per hour (pph), for the left and right engines, respectively. These figures were higher than the new production specification of 214 pph. According to the manufacturer, flight idle fuel flow impacts thrust produced when the power levers are set to the flight idle position and differences in fuel flow can result in an asymmetrical thrust condition.", "probable_cause": "The pilot's improper decision to depart with a known deficiency, which resulted in a loss of control during landing at the destination airport. A factor was the fuel control units' improper flight idle fuel flow rate."}