{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-850-near-calabogie-1-killed", "date": "Oct 8, 2012 at 1219 LT", "type": "Socata TBM-850", "operator": "Lorenzo Girones", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Carp - Goderich", "msn": "621", "yom": 2012, "flight_number": null, "city": "Calabogie", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 19200, "captain_hours_type": 700, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 64, "circumstances": "The privately owned SOCATA TBM 700N (registration C-FBKK, serial number 621) departed from Ottawa/Carp Airport, Ontario, on an instrument flight rules flight plan to Goderich, Ontario. Shortly after takeoff, the pilot and sole occupant altered the destination to Wiarton, Ontario. Air traffic control cleared the aircraft to climb to flight level 260 (FL260). The aircraft continued climb through FL260 and entered a right hand turn, which quickly developed into a spiral dive. At approximately 1219 Eastern Daylight Time, the aircraft struck the ground and was destroyed. Small fires broke out and consumed some sections of the aircraft. The pilot was fatally injured. The 406 MHz emergency locator transmitter on board the aircraft was damaged and its signal was not sensed by the search and rescue satellite-aided tracking (SARSAT) system.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The pilot lost control of the aircraft for undetermined reasons and the aircraft collided with terrain.\r\nFindings as to Risk:\r\n1. Operating an aircraft above 13 000 feet asl without an available emergency oxygen supply increases the risk of incapacitation due to hypoxia following depressurization.\r\nOther Findings:\r\n1. The avionics system had the capability to record data essential to the accident investigation but the recording medium was destroyed in the accident."}