{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu24-ii-waiomatatini-1-killed", "date": "Oct 1, 1974 at 1430 LT", "type": "Fletcher FU-24", "operator": "Cookson%20Airspread", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Waiomatatini - Waiomatatini", "msn": "153", "yom": 1969, "flight_number": null, "city": "Waiomatatini", "zone": "Gisborne District Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane took off on the 64th sortie of the day. The loader driver saw the aircraft make a topdressing run along the side of a ridge facing the airstrip. Moments later he saw a cloud of superphosphate dust rising from behind the same ridge. Noticing that the plane's engine noise had ceased the driver ran several hundred yards and found the aircraft had crashed and the pilot appeared to be dead. The Fletcher had been destroyed by impact forces. Fire did not occur. This was not a survivable accident. The position of the accident indicated that the pilot was making a \" cleaning up \" run across the end of the ridge and while turning steeply to the left through about 270° had the port wing tip strike a spur running off the ridge. The plane pivoted about its wing tip, with the nose impacting the slope heavily and the engine separating from the airframe. The aircraft then dropped about 15 metres in a level attitude into a hollow beyond the spur while travelling backward and coming to rest in a few metres. ", "probable_cause": "The pilot, comparatively inexperienced in agricultural flying operations, misjudged the turning radius of his aircraft which during a steep turn collided with a hillside. Examination of the wreck showed no pre-impact defects or failures. The engine was delivering power at the time of impact. The flying conditions were good with only a light breeze and no low cloud to affect the operation."}