{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-31-huntington-75-killed", "date": "Nov 14, 1970 at 1936 LT", "type": "Douglas DC-9", "operator": "Southern%20Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kinston - Huntington", "msn": "47245/510", "yom": 1969, "flight_number": "SO932", "city": "Huntington-Tri-State-Milton J. Ferguson", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 71, "pax_fatalities": 71, "other_fatalities": 0, "total_fatalities": 75, "captain_hours": 18557, "captain_hours_type": 2194, "copilot_hours": 5872, "copilot_hours_type": 1196, "aircraft_hours": 3667, "circumstances": "The airplane departed Kinston-Stallings Field, North Carolina, at 1838LT on a charter flight to Huntington, West Virginia, carrying players and fans of the Marshall University Football Team based in Huntington. Following an uneventful flight, the crew contacted Huntington Approach Control at 1923LT and was cleared for a runway 11 localizer approach. At 1934LT, the airplane passed the Outer Marker and the crew was cleared to land. In marginal weather conditions (mist and rain), the airplane descended below the minimum descent altitude and the crew failed to realize his altitude was too low when the aircraft struck trees and crashed in flames on the slope of a hill located one mile short of runway 11 threshold. The aircraft was totally destroyed by impact forces and a post crash fire and none of the 75 occupants survived the crash. At the time of the accident, there were scattered clouds at 300 feet, broken overcast at 500 feet and solid overcast at 1,000 feet. Among the 75 occupants were 36 players, nine coaches and administrators, 26 fans and four crew members. ", "probable_cause": "The descent below Minimum Descent Altitude during a non precision approach under adverse weather conditions, without visual contact with the runway environment. The Board has been unable to determine the reason for this descent, although the two most likely explanations are: a) improper use of cockpit instrument data; or b) an altimetry system error."}