{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-7b-sunland-7-killed", "date": "Jan 31, 1957 at 1118 LT", "type": "Douglas DC-7", "operator": "Douglas%20Aircraft%20Corporation", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "City", "schedule": "Santa Monica - Santa Monica", "msn": "45192", "yom": 1957, "flight_number": null, "city": "Sunland", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 3, "total_fatalities": 7, "captain_hours": 11757, "captain_hours_type": 598, "copilot_hours": 7115, "copilot_hours_type": 287, "aircraft_hours": 1, "circumstances": "On January 31, at 1015, N8210H took off tram runway 03 of the Santa Monica, California, Airport. The aircraft was a new DC-7B being flown for the first time for the purpose of functionally checking the aircraft and its components in flight following production. The flight crew were Douglas Aircraft employees consisting of Pilot William G. Carr; Copilot Archie R. Twitchell; Flight Engineer Waldo B. Adams; and Radio Operator Roy Nakazawa. The aircraft had been subject to many regular inspections during its manufacture and numerous inspections which were required after production preceding the first flight. Accordingly, it was presumed the DC-7B was in airworthy condition. Preparations for the flight by its crew were routine, Departure was on a local VFR flight plan filed with the operations office of the company. The plan showed six hours of fuel aboard end that the flight duration wee estimated as 2 hours 15 minutes. It also showed the gross takeoff night of N8210H was 88,000, pounds, well under the maximum allowable. The load was properly distributed with respect to center of gravity limitations. According to routine procedure the flight switched to the Douglas company radio frequency after takeoff and made periodic progress reports. At 1030 the crew reported over the Catalina intersection, 9,000 feet, routine, and thereafter, at 1106, over Ontario, 25,000 feet, routine. At 1050 that morning, the Northrop operated F-89J, 52-1870, took off from runway 25 of the Palmdale, California, Airport, accompanied by another F-89J, 53-25 6A. The flight of 52-1870 was one of a series of functional flight checks following the completion of IRAN (inspection and repair as necessary), an overhaul project performed under contract by Northrop Aircraft for the United States Air Force. The specific flight was in accordance with provisions of the contract and its purpose was to check the radar fire control systems of both of the all-weather interceptors. The two-member flight crew of 52-1870 consisted of Pilot Roland E. Owen and Radar Operator Curtiss A. Adams, both employees of Northrop. Preparations for the operation were routine and departure was in accordance with a local VFR flight plan filed with the flight department of the company. The plan indicated the estimated duration of the operation as one hour with sufficient fuel aboard for approximately 1 hour and 45 minutes, considering afterburner time, altitude, and power settings for the mission. The F-89's took off individually, using afterburners, with a separation interval, of 20 seconds. In a wide starboard orbit the pilots utilized radar in a “snake climb” to 25,000 feet. At that altitude, a predetermined scissoring flight pattern was utilized which positioned the F-89's, without ground radar control, for simulated all-weather interceptor attacks on each other, during which the operation of airborne radar equipment could be checked. Radio transmissions, on company frequency, were recorded by ground facilities. These were routine commands between the pilots as they executed the radar check pattern and intercepts. At 1118 activity in the Douglas radio roan was interrupted by an emergency transmission from N 8210H. The voices were recognized by radio personnel familiar with the crew members. Pilot Cart first transmitted, “Uncontrollable,\" Copilot Twitchell then said, “We‘re a midair collision - midair collision, 10 How (aircraft identification using phonetic How for H) we are going in-uncontrollable - uncontrollable - we are . . . we've had it boy - poor jet too - told you we should take chutes - say goodbye to everybody.” Radio Operator Nakazawa’s voice was recognized and he concluded the tragic message with, \"We are spinning In the valley.” This final transmission from the flight is presented because it contained important information relative to the accident investigation. It not only establishes the midair collision but also indicates the DC-7 was rendered uncontrollable. It further indicates that Mr. Twitchell at least recognized the aircraft with which they collided as a jet. Further, the DC-7 spun during its descent to the ground. All four crew members on board the DC-7 were killed plus three people on the ground. Seventy others have been injured. Weather conditions in the area at the time of the accident were reported by the Weather Bureau as clear, visibility 50 miles. Winds aloft at 25,000 were approximately 30 knots from 320 degrees.", "probable_cause": "The Board determines that the probable cause of this midair collision was the high rate of near head-on closure at high altitude which, together with physiological limitations, resulted in a minimum avoidance opportunity during which the pilots did not see the other’s aircraft. The following findings were reported:\r\n- The flights were operated in clear weather conditions and in accordance with the provisions of local VFR flight plans,\r\n- Under VFR weather conditions and VFR flight plans collision avoidance rested in visual separation, a pilot responsibility,\r\n- The DC-7 and F-89 collided in flight on approximately west and east headings, respectively. They were at 25,000 feet over a non-congested area between one and two miles northeast of the Hansen Dam Spillway,\r\n- At impact the F-89 was rolled about 30 degrees left, both aircraft were about level in the pitch plane, and the convergence angle was about five degrees from head-on,\r\n- Both aircraft tell out of control and the DC-7 crashed in a populated area,\r\n- From visual range, estimated at 3.5 miles, the closure speed between the two aircraft was 700 knots and over the probable flight paths the tine to collision from visual range was about 15 seconds,\r\n- The nature and purpose of the flights did not prevent all pilots from maintaining a lookout for other aircraft,\r\n- There was no evidence found to indicate that any malfunction or failure of the aircraft or their components was a factor in the accident."}