{"url": "https://www.baaa-acro.com/crash/crash-douglas-r4d-1-barrancabermeja-19-killed", "date": "Aug 23, 1962 at 1557 LT", "type": "Douglas DC-3", "operator": "Taxader", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Barrancabermeja – Bucaramanga", "msn": "4551", "yom": 1942, "flight_number": null, "city": "Barrancabermeja", "zone": "Santander", "country": "Colombia", "region": "South America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 29, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 19, "captain_hours": 9532, "captain_hours_type": 2007, "copilot_hours": 6295, "copilot_hours_type": 1500, "aircraft_hours": null, "circumstances": "The DC-3 took off from Barrancabermeja runway 03 at 15:57. After 250 m the aircraft began veering to the left of the centreline and then swerved to the right. At 490 m into the takeoff, the DC-3 left the runway, corrected direction, crossed the centreline again and traversed the left-hand safety strip. The pilot corrected to avoid a collision with the T wind indicator and the aircraft entered the parking apron. The pilot applied full power as he altered direction to align with the aircraft parallel with the main runway. The starboard wing grazed the apron surface, and the aircraft bounced several times. The pilot decided to takeoff from the apron and attempted after a run of another 258 m to lift the aircraft without the necessary speed. The wingtip struck two helicopters (one of the two being a Hiller UH-12, HK-781E) on the ground, and the tail skid and cone struck a fuel tank at the edge of the apron. The aircraft cartwheeled 180° to port and fell into a depression 30 m deep and 120 m from the northern edge of the apron.", "probable_cause": "The main cause of the accident was faulty piloting in the form of poor flight technique during take-off, with overcontrol of the aircraft throughout the 1169.70 m covered. The pilot used faulty judgement in trying to take-off outside the main runway 03 in use at the time. A contributing factor was faulty dispatching of the aircraft whose centre of gravity was outside the aft limit for take-off with maximum load at Barrancabermeja Airport."}