{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-near-taos-4-killed", "date": "Mar 5, 1995 at 1355 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Brown's Aircraft Sales", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Oklahoma City - Taos", "msn": "421C-0605", "yom": 1979, "flight_number": null, "city": "Taos", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 809, "captain_hours_type": 195, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot obtained a weather briefing for the IFR flight to Taos, New Mexico, and was advised of forecast conditions for light to moderate rime icing and moderate turbulence at his destination. During descent, about 30 nm east of the Taos VOR, at 15,200 feet, the pilot reported 'light rime icing' and 3 minutes later 'freezing rain.' The airplane was cleared for the VOR DME-B approach to the Taos Airport, and radar services were terminated. The airplane impacted the ground in a steep nose down attitude 7 nm southeast of the VOR and 1 nm right of the inbound approach course. Weather data indicated that the airplane entered clouds about 6 nm east of where 'light rime' was reported and remained in the clouds until it descended below 10,000 feet. Meteorological investigation indicated that the freezing level was about 10,700 feet. Radar data revealed cyclic variations in the airplane's ground speed from 120 to 190 knots, as it crossed the high mountain range east of taos. There was a pirep of severe turbulence on the eastern slope of the mountain range. All four occupants were killed. ", "probable_cause": "The pilot's decision to continue flight into known adverse weather conditions and the ensuing inadvertent stall due to airframe ice. Factors were the weather conditions."}