{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-55f-near-maskeliya-191-killed", "date": "Dec 4, 1974 at 2211 LT", "type": "Douglas DC-8", "operator": "Martinair%20Holland.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Surabaya - Colombo - Jeddah", "msn": "45818/242", "yom": 1966, "flight_number": "MP138", "city": "Maskeliya", "zone": "Central Province (மத்திய மாகாணம்)", "country": "Sri Lanka", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 182, "pax_fatalities": 182, "other_fatalities": 0, "total_fatalities": 191, "captain_hours": 26770, "captain_hours_type": 4000, "copilot_hours": 2480, "copilot_hours_type": 47, "aircraft_hours": 35613, "circumstances": "The airplane was completing a charter flight (hadj flight) from Surabaya to Jeddah with an intermediate stop in Colombo, carrying 182 Indonesian pilgrims on behalf of Garuda Indonesian Airways, and a crew of nine (seven Dutch citizens and two Indonesian). The descent to Colombo-Bandaranaike Airport was initiated by night and marginal weather conditions. The crew was cleared to descent to 5,000 feet and must report once the altitude of 8,000 feet was reached on descent. Then the crew was cleared to descent to 2,000 feet in view of a landing on runway 04. In poor visibility, the airplane struck the slope of Mt Anjimalai located about 85 km southeast of Bandaranaike Airport, near the city of Maskeliya. The wreckage was found few hours later in a quite unreachable area. The aircraft was totally destroyed and all 191 occupants have been killed. ", "probable_cause": "Collision with rising terrain as the crew descended the aircraft below safe altitude owing to incorrect identification of their position vis-a-vis the airport. The investigation is of the opinion that this was the result of dependence on Doppler and Weather Radar Systems on board PH-MBH which left room for misinterpretation. The following findings were reported:\r\n- The captain has no recent experience on this route, \r\n- No proper route check had been carried out prior to permitting the captain to fly on this route; certain provisions of chapter 9 section 4 of annex 6 to the convention on international civil aviation had not been strictly complied with, \r\n- The copilot had little experience on the type in general and no experience on PH-MPH in particular, \r\n- The copilot had no previous experience on the route, \r\n- The doppler computer system was off-standard to the Martinair DC-8 fleet and left room for misinterpretation of the 'distance-to-go' presentation by the crew,\r\n- The weather radar system was off-standard to the Martinair DC-8 fleet and no instruction had been included regarding this in the aircraft operations manual, thus leaving room for misinterpretation of the range-markings on the screen by the crew,\r\n- There are indications that the crew relied for the greater part on the doppler system to determine their 'distance-to-go',\r\n- There were shortcomings on the part of Martinair in the maintenance of technical records pertaining to aircraft, and to cockpit personnel in respect of route qualification, \r\n- The officers responsible for the organization at Surabaya pertaining to this flight displayed a certain degree of negligence in that they failed to retain copies of maintenance records and navigational documentation relevant to this flight,\r\n- The captain/copilot were unaware of the correct reporting points in the Colombo Flight Information Region,\r\n- There are no indications of a major pre-crash failure of the aircraft or of its systems, nor of any pre-crash fire. "}