{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-fort-myers-1-killed", "date": "Nov 1, 1989 at 0205 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Transcontinental Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Miami – Fort Myers", "msn": "61-0382-225", "yom": 1977, "flight_number": null, "city": "Fort Myers-Southwest Regional", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1400, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1881, "circumstances": "The aircraft departed Miami at night on an on-demand, air taxi flight to Fort Myers, FL. During arrival at the destination, the flight encountered IFR conditions. The pilot obtained clearance for an ILS runway 06 approach and was told to report at the outer marker (om). At 0152:25 est, he reported to Miami center that he was over the om. This was his last transmission to an ATC facility. At about 0203 est, he made a transmission on unicom frequency to inform airport operations personnel that he could not get the approach lights to operate. He was asked if he had used the proper frequency and had keyed the mike the required number of times. The pilot indicated that he had properly keyed the mike; however, unicom personnel did not hear any keying of the mike except for 2 clicks. The aircraft contacted the ground in a nearly level attitude and with the gear extended, approximately 1.5 mile short of runway 06. It then skidded about 90 feet and hit a tree before coming to rest. No preimpact part failure/malfunction was found with the aircraft, engine or approach/runway lights. The 0149 est weather at Fort Myers was in part: sky obscured, visibility 1/4 mile with fog. While the pilot was seriously injured, the passenger was killed. ", "probable_cause": "Failure of the pilot to properly follow the IFR procedure and to identify the decision height. Factors related to the accident were: the adverse weather conditions, darkness, the pilot's lack of visual perception without the approach lights, and tree(s) in the accident area."}