{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-gii-new-york", "date": "Mar 25, 1997 at 0510 LT", "type": "Gulfstream GII", "operator": "PAB Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Allentown - New York", "msn": "229", "yom": 1978, "flight_number": null, "city": "New York-LaGuardia", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9900, "captain_hours_type": 3860, "copilot_hours": 21000, "copilot_hours_type": 4000, "aircraft_hours": 6743, "circumstances": "All positions at LaGuardia Tower were combined to the local control position from 0011 EST until after the accident. At about 0430 EST, ground personnel in 'Vehicle 1277' (communicating on ground control frequency), were cleared on runway 13/31 to perform 'lighting maintenance.' Later, during repair of centerline lights and while N117FJ was inbound to the airport, Vehicle 1277 stalled on runway 13/31. Personnel of Vehicle 1277 attempted to restart the vehicle, but were unable, so they shut off all vehicle lights to reduce electrical load, and again attempted to restart the vehicle, but to no avail. At 0507 (during darkness), N117FJ made initial call to the tower for landing. The controller acknowledged the call, scanned runway 13/31, did not see Vehicle 1277, and cleared N117FJ to land on runway 31. At 0510, personnel of Vehicle 1277 observed N117FJ in the approach/landing phase and radioed ground controller that they were stuck on the runway. The controller then radioed, 'go-around, aircraft on the runway go-around, aircraft on the runway go-around, seven fox juliet go-around.' Moments later, N117FJ impacted Vehicle 1277. The FAA ATC Handbook stated, 'Ensure that the runway to be used is clear of all known ground vehicles, equipment, and personnel before a departing aircraft starts takeoff or a landing aircraft crosses the runway threshold.' ", "probable_cause": "The tower controller's inadequate service by clearing the airplane to land on the same runway, where he had previously cleared a maintenance vehicle to perform maintenance to the runway centerline lights. Factors related to the accident were: darkness, partial failure of the runway centerline lights, the electric maintenance vehicle's loss of engine power, and a failure to have adequate emergency backup lighting."}