{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-4h6-lahore", "date": "Nov 3, 2015 at 0926 LT", "type": "Boeing 737-400", "operator": "Shaheen-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Karachi – Lahore", "msn": "27166/2410", "yom": 1992, "flight_number": "NL142", "city": "Lahore-Allama Muhammad Iqbal", "zone": "Punjab (پنجاب)", "country": "Pakistan", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 114, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 19302, "captain_hours_type": 4859, "copilot_hours": 2076, "copilot_hours_type": 410, "aircraft_hours": 51585, "circumstances": " On 03rd November 2015, M/s Shaheen Air International Flight NL-142, Boeing 737-400 aircraft Reg # AP-BJO, was on a scheduled passenger flight from Karachi to Lahore. The flight landed on Runway 36L as Runway 36R was not available due to ILS CAT-III up-gradation. After touchdown, both main landing gears broke one after the other. Subsequently, the aircraft departed runway while resting on both engines and stopped 8302 ft from Runway Threshold (RWT), 197ft left of runway centreline. The nose landing gear, however, remained intact. All the passengers were safely evacuated through emergency procedure. ", "probable_cause": "The accident took place due to:\r\n- Cockpit crew landing the aircraft through unstabilized approach (high ground speed and incorrect flight path).\r\n- Low sink rate of left main landing gear (LMLG) as it touched down and probable presence of (more than the specified limits) play in the linkages of shimmy damper mechanism. This situation led to torsional vibrations / breakage of shimmy damper after touchdown. The resultant torsional excitation experienced by the LMLG due to free pivoting of wheels (along vertical axis) caused collapse of LMLG.\r\n- The RMLG collapsed due to overload as the aircraft moved on unprepared surface."}