{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-mt-bajaja-10-killed", "date": "Oct 2, 2015 at 1451 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Aviastar%20Mandiri2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Masamba – Makassar", "msn": "741", "yom": 1981, "flight_number": "VIT7503", "city": "Mt Bajaja", "zone": "South Sulawesi", "country": "Indonesia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 2911, "captain_hours_type": 2911, "copilot_hours": 4035, "copilot_hours_type": 4035, "aircraft_hours": 45242, "circumstances": "On 2 October 2015, a DHC-6 Twin Otter, registered PK-BRM, was being operated by PT. Aviastar Mandiri as a scheduled passenger flight with flight number MV 7503. The aircraft departed from Andi Jemma Airport, Masamba (WAFM)1 with the intended destination of Sultan Hasanuddin International Airport, Makassar (WAAA) South Sulawesi, Indonesia. On board the flight were 10 persons consisting of two pilots and eight passengers, including one company engineer. The previous flights were from Makassar – Tana Toraja – Makassar – Masamba – Seko - Masamba and the accident flight was from Masamba to Makassar which was the 6th sector of the day. The aircraft departed from Masamba at 1425 LT (0625 UTC2 ) with an estimated time of arrival at Makassar of 0739 UTC. The Pilot in Command (PIC) acted as Pilot Flying (PF) while the Second in Command (SIC) acted as Pilot Monitoring (PM). The flight was conducted under the Visual Flight Rules (VFR) and cruised at an altitude of 8,000 feet. At 0630 UTC, the pilot reported to Ujung Pandang Information officer that the aircraft passed an altitude of 4,500 feet and was climbing to 8,000 feet. The Ujung Pandang Information officer requested the pilot of the estimate time of aircraft position at 60 Nm out from MKS VOR/DME. At 0632 UTC, the pilot discussed about the calculation of estimate time to reach 60 Nm out from MKS and afterward the pilot informed Ujung Pandang Information officer that the estimate at 60 Nm was at 0715 UTC. At 0633 UTC, the Ujung Pandang Information officer informed the pilot to call when reaching 8,000 feet and was acknowledged by the pilot. At 0636 UTC, the pilot informed the Ujung Pandang Information officer that the aircraft had reached 8,000 feet and requested the squawk number (ATC transponder code). The Ujung Pandang Information officer acknowledged and gave the squawk number of A5616, which was acknowledged by the pilot. At 0637 UTC, the pilots discussed to fly direct to BARRU. BARRU is a town located at about 45 Nm north of Makassar. Both pilots agreed to fly direct and the SIC explained the experience of flying direct on the flight before. At 0651 UTC, the PIC told the SIC that he wanted to climb and one second later the CVR recorded the sound of impact.", "probable_cause": "The following findings were identified:\r\n1. The aircraft had valid Certificate of Airworthiness prior to the accident and was operated within the weight and balance envelope.\r\n2. Both pilots had valid licenses and medical certificates.\r\n3. The accident flight from Masamba (WAFM) to Makassar (WAAA) was the 6th sector for the aircraft and the crew that day. The PIC acted as Pilot Flying and the\r\nSIC acted as Pilot Monitoring.\r\n4. The satellite image published by BMKG at 0700 UTC showed that there were cloud formations at the accident area. The local villagers stated that the weather\r\non the accident area was cloudy at the time of the accident.\r\n5. The aircraft departed Masamba at 0625 UTC (1425 LT), conducted under VFR with cruising altitude of 8,000 feet and estimated time of arrival Makassar at 0739 UTC.\r\n6. After reached cruising altitude, at about 22 Nm from Masamba, the flight deviated from the operator visual route and directed to BARRU on heading 200° toward the area with high terrain and cloud formation based on the BMKG satellite image\r\n7. The pilots decision making process did not show any evidence that they were concerned to the environment conditions ahead which had more risks and required correct flight judgment.\r\n8. The CVR did not record EGPWS aural caution and warning prior to the impact. The investigation could not determine the reason of the absence of the EGPWS.\r\n9. The CVR data and cut on the trees indicated that the aircraft was on straight and level flight and there was no indication of avoid action by climb or turn.\r\n10. The SAR Agency did not receive any crashed signal from the aircraft ELT most likely due to the ELT antenna detached during the impact.\r\n11. Regarding to the operation of the EGPWS for the flight crew, a special briefing was performed however there was no special training.\r\n12. The operational test of TAWS system was not included in the pilot checklist.\r\n13. The investigation could not determine the installation and the last revision of TAWS terrain database.\r\n14. The investigation could not find the functional test result document after the installation of the TAWS.\r\n15. Some of the DHC-6 pilots have not been briefed for the operation of the TAWS and EGPWS.\n\r\nContributing Factors:\r\nDeviation from the company visual route without properly considering the elevated risks of cruising altitude lower than the highest terrain and instrument meteorological condition in addition with the absence of the EGPWS warning resulted in the omission of avoidance actions."}