{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-436-prestwick", "date": "Mar 17, 1977 at 0849 LT", "type": "Boeing 707", "operator": "British%20Airtours", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Prestwick - Prestwick", "msn": "17712/164", "yom": 1960, "flight_number": null, "city": "Prestwick", "zone": "Ayrshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10180, "captain_hours_type": 1500, "copilot_hours": 2093, "copilot_hours_type": 4, "aircraft_hours": 53180, "circumstances": "March 17, 1977 was the fourth day of a Boeing 707-436 conversion base training programme at Glasgow-Prestwick Airport (PIK). On the day of the accident the trainee first officer was in the right hand pilot's seat and was flying the first detail. The commander was in the left hand pilot's seat, and the captain under training was acting as flight engineer, being supervised by the fourth crew member, a supervisory first officer who was seated behind the commander. After completing all the necessary checks and the engine starting procedure the commander gave the trainee first officer a comprehensive briefing on cross wind takeoff techniques with reference to the local weather forecast, which gave a surface wind of 190° /18 knots gusting to 35 knots. In particular he emphasised the need for into-wind aileron, demonstrating the amount required, and for opposite rudder. At 08:42 the aircraft was cleared to taxi to runway 13. While taxiing, the 'taxiing checklist' was completed. At the light aircraft weights used for training, standardized takeoff airspeeds were used as follows: V1 - 125 knots, VR - 135 knots and V2 - 145 knots. Based on the prevailing conditions and actual aircraft takeoff weight of 94,580 kg, the true takeoff airspeeds were: V1 - 125 knots, VR - 125 knots and V2 - 142 knots; the VMCG and the VMCA were 125 knots and 119 knots respectively. After receiving ATC clearance, the aircraft entered the active runway from the fast turnoff for runway 31. From this position the takeoff run available was approximately 2,388 metres; the takeoff run required was 1,433 metres. On entering the runway the commander handed over control to the trainee first officer and the aircraft commenced its takeoff run, from a rolling start, shortly after 08:48. The Tower passed a surface wind of 220° /15 knots and the trainee applied about 15° to 20° of into-wind aileron (ie right wing down) and some left rudder. Full power was then applied and the V1 and VR airspeeds were called by the flight engineer. As the aircraft was being rotated to a pitch attitude of 4 1/2° the commander simulated a No. 1 engine failure by retarding the appropriate thrust lever, and calling out \"number one engine's failed.\" After the aircraft became airborne it climbed away in a normal manner to a height of approximately 20 to 30 feet when suddenly the left wing dropped about 20° and the No. 1 engine nacelle struck the left edge of the runway. The aircraft then began to yaw and roll to the right and to sink to the ground. The yaw/roll continued until No. 4 nacelle struck the runway and the aircraft then tracked sideways down the runway, with the engines and other parts of the structure breaking away and the landing gear collapsing. It came to a stop almost at the intersection of runway 03/21. The distance from the start of the takeoff roll to this point was approximately 2,230 metres. A fire erupted. The external fire was rapidly dealt with but the internal fire was not extinguished for some 50 minutes.", "probable_cause": "A loss of control which resulted from a delay in taking full corrective action during a simulated outboard engine failure exercise during take-off. "}