{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-07-01-lodestar-white-plains-2-killed", "date": "Dec 18, 1954 at 1342 LT", "type": "Lockheed 18 LodeStar", "operator": "Sangamo-Electric-Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Groton – White Plains", "msn": "2091", "yom": 1941, "flight_number": null, "city": "White Plains-Westchester County", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1336, "circumstances": "The twin engine aircraft was completing a flight from Groton-New London Airport (CT) to White Plaines with a crew of two on board and one passenger, a daughter of the company's Executive Vice-President. At 1341LT, the flight reported to Westchester Tower that it was over the outer marker, inbound, at 2,500 feet. Approximately two minutes later it crashed between the outer and inner markers of the Westchester 115. The aircraft began clipping trees about 800 feet before it struck the ground on a 680-foot knoll located on the ILS approach path. Both crew members were killed. The passenger, who sustained only minor injuries, stayed with the aircraft until approximately 1630LT, then walked out and located help. She stated that she had flown quite a bit in this same airplane with the same crew and that the subject flight was the roughest she had ever encountered; that during the approach the weather was so “soupy” she could not see the numbers on the aircraft and that she heard the pilot say to the copilot, “Keep your eyes peeled.” Weather conditions, as reported by Westchester County Airport operations personnel, were: ceiling 300 feet and visibility 1 mile. The aircraft was owned and operated by Sangamo Electric Company, Springlfield, Illinois.", "probable_cause": null}