{"url": "https://www.baaa-acro.com/crash/crash-antonov-24b-rostov-don-4-killed", "date": "Jan 25, 1974 at 2142 LT", "type": "Antonov AN-24", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Rostov-on-Don - Ufa", "msn": "77303610", "yom": 1967, "flight_number": null, "city": "Rostov-on-Don", "zone": "Rostov oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11277, "circumstances": "Following a heavy maintenance program at the Rostov-on-Don Manufacture Plant, the aircraft was on its way back to Ufa, carrying a crew of four. The departure from Rostov Airport was initiated at night and poor visibility due to thick fog. After a normal takeoff roll, the pilot-in-command started the rotation at a speed of 200 km/h and continued to climb in zero visibility. At an altitude of about 220 meters, a first turn to the left was initiated when the airplane rolled left to an angle of 25-30°. At a speed of 325 km/h, flaps were selected up when inconsistent actions occurred between the PIC and the copilot. The copilot elected to reduce the roll to acceptable values, as a result, the rudder trim was positioned to the right hand limit but the airplane seems to become unstable. At this time, the crew reduced the engine operation to nominal values when the noticed a discrepancy between the readings of the left and right artificial horizons. The crew tried to determine which artificial horizon gives the wrong readings when the airplane entered a left turn and crashed at a speed of 430 km/h in an open field located 1,750 meters past the runway end, 17 seconds after liftoff. The aircraft was totally destroyed and all four occupants were killed. ", "probable_cause": "It was determined that the loss of control that occurred during initial climb was the result of an anomaly in the Captain's artificial horizon, either because of a misreading on his part or because of a problem with the power supply system. Investigators stated that the accident occurred through visibility below minimums and that the crew's decision to fly by night under such conditions was unjustified. Also, it was noted that the crew failed to prepare the flight according to published procedures and that he precipitated the departure, which remains a contributing factor insofar as certain procedures were neglected."}