{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90b-king-air-ipumirim-1-killed", "date": "Sep 15, 2018 at 1200 LT", "type": "Beechcraft 90 King Air", "operator": "Grupo%20Gambatto", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Florianópolis – Chapecó", "msn": "LJ-1546", "yom": 1999, "flight_number": null, "city": "Ipumirim", "zone": "Santa Catarina", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot departed Florianópolis-Hercílio Luz Airport at 1100LT on a flight to Chapecó. Following an uneventful flight, the pilot initiated the descent to Chapecó-Serafim Enoss Bertasco Airport but encountered marginal weather conditions with limited visibility. While descending under VFR mode, the aircraft collided with trees and crashed in a dense wooded area located in Ipumirim, some 50 km east of Chapecó Airport, bursting into flames. The aircraft was destroyed by impact forces and a post crash fire and the pilot, sole occupant, was killed. ", "probable_cause": "Controlled flight into terrain.\r\nContributing factors.\r\n- Attitude - contributed\r\nThe fact that the pilot continued the descent visually, not performing the instrument approach according to the IFR flight plan, denoted disregard of the real risks of this action. Thus, his attitude contributed to the inappropriate approach that culminated in the collision with the ground.\r\n- Adverse weather conditions - contributed\r\nDespite the aerodrome presenting ceiling and visibility conditions favorable for visual flight at the time of the accident, it was verified that there was dense fog covering the entire region near the impact site and, therefore, the IFR rules, which determined a minimum altitude of 5,000 ft, should have been observed.\r\n- Emotional state - undetermined\r\nSome events in the pilot's personal life were negatively affecting his emotional state. In addition, the pilot appeared to be more introspective in the period leading up to the accident.\r\nThus, it is possible that his performance was impaired due to his emotional state.\r\n- External influences - undetermined\r\nThe pilot was possibly experiencing difficult events in his personal life. These events could have negatively affected his emotional state.\r\nThus, the pilot's way of thinking, reacting and performance at work may have been impacted by factors external to work.\r\n- Motivation - undetermined\r\nThe pilot intended to return home because he would be celebrating his birthday and that of his stepdaughter.\r\nThe audio recording of the pilot's telephony with the GND-FL, shows that he insisted to accelerate his take-off, denoting a possible high motivation focused on fulfilling his eagerness to accomplish the flight. This condition may have influenced the flight performance.\r\n- Decision making process - contributed\r\nThe choice to continue the descent without considering the IFR rules, based on an inadequate judgment of the meteorological conditions, revealed the pilot's difficulties to perceive, analyze, choose alternatives and act adequately in that situation."}