{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-tanana-1-killed", "date": "Jun 11, 1999 at 0723 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Larry%27s-Flying-Service", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Fairbanks – Tanana – Galena", "msn": "31-8352017", "yom": 1983, "flight_number": "LFS1604", "city": "Tanana", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3227, "captain_hours_type": 861, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15229, "circumstances": "A twin-engine airplane on a scheduled passenger/cargo flight, departed a rural airport located along the north shore of the Yukon River with only the pilot aboard. The airplane appeared to depart normally, but remained low, flying over the river, about 200 feet above the ground. About five minutes after departure, the pilot contacted a local weather observation facility on the common traffic advisory frequency (CTAF), and reported he was having a problem with the airplane, stating he may have to ditch. He did not describe the nature of the problem. The pilot then said he was clipping trees, and was attempting to return to the runway. The airplane collided with several trees located on a gravel bar in the Yukon River, separating the outboard end of the left wing. The airplane then collided with the river and sank, about 1.5 miles south of the airport. A fast river current, and silty water conditions hampered recovery efforts, but the left wing, the left engine, and the fuselage were recovered from the river. The left engine propeller appeared to be feathered. The right wing and the right engine were not recovered. Postaccident examination of the left engine disclosed no evidence that it was producing power upon impact, or any evidence of any preimpact mechanical malfunction. Inspection of the airframe disclosed no evidence of any preimpact mechanical malfunction. ", "probable_cause": "The exact cause of the accident could not be determined. "}