{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-tatum-1-killed", "date": "Apr 19, 2021 at 1346 LT", "type": "Cessna 340", "operator": "William J. Weatherspoon", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Henderson - Henderson", "msn": "340A-0312", "yom": 1977, "flight_number": null, "city": "Tatum", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On April 19, 2021, about 1346 central daylight time, a Cessna 340A airplane, N801EC, was destroyed when it was involved in an accident near Tatum, Texas. The pilot was fatally injured. The airplane was operated as a Title 14 Code of Federal Regulations Part 91 flight test. According to information provided by a Fixed Base Operator (FBO) at the East Texas Regional Airport (GGG), the intention of the flight was to do a functional test of a newly upgraded autopilot system. Automatic Dependent Surveillance – Broadcast (ADS-B) data showed that the airplane took off from runway 13 at GGG about 1340. According to preliminary Air Traffic Control (ATC) information provided by the Federal Aviation Administration (FAA), the controller cleared the pilot to operate under Visual Flight Rules (VFR) to the east of the airport and to remain in class C airspace. Communications between ground control, tower control, and the pilot were normal during the ground taxi, takeoff, and climb-out. Six minutes after takeoff, radio and radar communications were lost and controllers initiated ALNOT procedures. There were no radio distress calls heard from the pilot. After takeoff, ADS-B data showed the airplane in a steady climb to the east of GGG. The airplane climbed to an altitude of 2,750 ft mean sea level (msl) and then descended to 2,675 ft msl. There were no other data points recorded. The accident site was located directly east, about ¾ mile from the last recorded data point. Groundspeeds and headings were consistent throughout the climb, with no abrupt deviations. There were no eyewitnesses to the accident; however, a local resident located about 1 mile from the accident site reported that he was inside his residence when he heard and felt a “boom” that shook the windows. He immediately saw black smoke rise, found the wreckage, and called 911. The accident site was located at an elevation of 361 ft msl. The airplane impacted the vegetated terrain in a nose-down, vertical flight attitude. The fuselage and cabin were embedded into the ground and were mostly consumed from a post-impact fire. The empennage was folded forward over the cabin area. Both left and right wings showed leading edge crushing along their respective spans. Portions of both wings were fire damaged. Both left and right engine nacelles were separated from the wings and the engine and propeller assemblies were embedded in 3-foot-deep craters.", "probable_cause": null}