{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-kalaupapa-1-killed", "date": "Dec 11, 2013 at 1522 LT", "type": "Cessna 208B Grand Caravan", "operator": "Makani-Kai-Air", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Kalaupapa - Honolulu", "msn": "208B-1002", "yom": 2002, "flight_number": null, "city": "Kalaupapa", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 16000, "captain_hours_type": 250, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4881, "circumstances": "The airline transport pilot was conducting an air taxi commuter flight between two Hawaiian islands with eight passengers on board. Several passengers stated that the pilot did not provide a safety briefing before the flight. One passenger stated that the pilot asked how many of the passengers had flown over that morning and then said, “you know the procedures.” The pilot reported that, shortly after takeoff and passing through about 500 ft over the water, he heard a loud “bang,” followed by a total loss of engine power. The pilot attempted to return to the airport; however, he realized that the airplane would not be able to reach land, and he subsequently ditched the airplane in the ocean. All of the passengers and the pilot exited the airplane uneventfully. One passenger swam to shore, and rescue personnel recovered the pilot and the other seven passengers from the water about 80 minutes after the ditching. However, one of these passengers died before the rescue personnel arrived. Postaccident examination of the recovered engine revealed that multiple compressor turbine (CT) blades were fractured and exhibited thermal damage. In addition, the CT shroud exhibited evidence of high-energy impact marks consistent with the liberation of one or more of the CT blades. The thermal damage to the CT blades likely occurred secondary to the initial blade fractures and resulted from a rapid increase in fuel flow by the engine fuel control in response to the sudden loss of compressor speed due to the blade fractures. The extent of the secondary thermal damage to the CT blades precluded a determination of the cause of the initial fractures. Review of airframe and engine logbooks revealed that, about 1 1/2 years before the accident, the engine had reached its manufacturer-recommended time between overhaul (TBO) of 3,600 hours; however, the operator obtained a factory-authorized, 200-hour TBO increase. Subsequently, at an engine total time since new of 3,752.3 hours, the engine was placed under the Maintenance on Reliable Engines (MORE) Supplemental Type Certificate (STC) inspection  program, which allowed an immediate increase in the manufacturer recommended TBO from 3,600 to 8,000 hours. The MORE STC inspection program documents stated that the MORE STC was meant to supplement, not replace, the engine manufacturer’s Instructions for Continued Airworthiness and its maintenance program. Although the MORE STC inspection program required more frequent borescope inspections of the hot section, periodic inspections of the compressor and exhaust duct areas, and periodic power plant adjustment/tests, it did not require a compressor blade metallurgical evaluation of two compressor turbine blades; however, this evaluation was contained in the engine maintenance manual and an engine manufacturer service bulletin (SB). The review of the airframe and engine maintenance logbooks revealed no evidence that a compressor turbine metallurgical evaluation of two blades had been conducted. The operator reported that the combined guidance documentation was confusing, and, as a result, the operator did not think that the compressor turbine  blade evaluation was necessary. It is likely that, if the SB had been complied with or specifically required as part of the MORE STC inspection program, possible metal creep or abnormalities in the turbine compressor blades might have been discovered and the accident prevented. The passenger who died before the first responders arrived was found wearing a partially inflated infant life vest. The autopsy of the passenger did not reveal any significant traumatic injuries, and the autopsy report noted that her cause of death was “acute cardiac arrhythmia due to hyperventilation.” Another passenger reported that he also inadvertently used an infant life vest, which he said seemed “small or tight” but “worked fine.” If the pilot had provided a safety briefing, as required by Federal Aviation Administration regulations, to the passengers that included the ditching procedures and location and usage of floatation equipment, the passengers might have been able to find and use the correct size floatation device.\n", "probable_cause": "The loss of engine power due to the fracture of multiple blades on the compressor turbine wheel, which resulted in a ditching. The reason for the blade failures could not be determined due to secondary thermal damage to the blades.\n"}