{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-685-monterrey-5-killed", "date": "Dec 14, 2004 at 1230 LT", "type": "Rockwell Aero Commander 685", "operator": "Hercules", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Monterrey – McAllen – Houston", "msn": "685-12058", "yom": 1974, "flight_number": null, "city": "Monterrey-Del Norte", "zone": "Nuevo León", "country": "Mexico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On December 14, 2004 at 1230 central standard time, an Aero Commander AC-685 twin-engine airplane, Mexican registration XB-GSG, was destroyed upon impact with terrain following a loss of control while maneuvering near Apodaca, State of Nuevo Leon, in the Republic of Mexico. The two commercial pilots and 3 passengers were fatally injured. The airplane, serial number 12058, was registered to a private individual. The flight originated from the Monterrey Del Norte Airport, near Monterrey, State of Nuevo Leon, Mexico, approximately 1225 and was en route to the McAllen-Miller International Airport (MFE), near McAllen, Texas, with Houston, Texas, as its final destination. Visual meteorological conditions prevailed for the business flight for which an instrument flight rules (IFR) flight plan was filed. According to local authorities the airplane was attempting to return to the airport when the accident occurred. The wreckage of the airplane was located on the 350-degree radial from the Monterrey VOR (ADN), for 2.3 nautical miles. A post-impact fire destroyed the aircraft. A post-impact fire consumed the aircraft.", "probable_cause": null}