{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-horn-island-1-killed-0", "date": "Feb 24, 2011 at 0800 LT", "type": "Rockwell Shrike Commander 500", "operator": "Flightech", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Cairns - Horn Island", "msn": "3060", "yom": 1970, "flight_number": null, "city": "Horn Island", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4154, "captain_hours_type": 209, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17545, "circumstances": "At 0445 Eastern Standard Time on 24 February 2011, the pilot of an Aero Commander 500S, registered VH-WZU, commenced a freight charter flight from Cairns to Horn Island, Queensland under the instrument flight rules. The aircraft arrived in the Horn Island area at about 0720 and the pilot advised air traffic control that he intended holding east of the island due to low cloud and rain. At about 0750 he advised pilots in the area that he was north of Horn Island and was intending to commence a visual approach. When the aircraft did not arrive a search was commenced but the pilot and aircraft were not found. On about 10 October 2011, the wreckage was located on the seabed about 26 km north-north-west of Horn Island.", "probable_cause": "The ATSB found that the aircraft had not broken up in flight and that it impacted the water at a relatively low speed and a near wings-level attitude, consistent with it being under control at impact. It is likely that the pilot encountered rain and reduced visibility when manoeuvring to commence a visual approach. However, there was insufficient evidence available to determine why the aircraft impacted the water. \r\nSeveral aspects of the flight increased risk. The pilot had less than 4 hours sleep during the night before the flight and the operator did not have any procedures or guidance in place to minimize the fatigue risk associated with early starts. In addition, the pilot, who was also the operator’s chief pilot, had either not met the recency requirements or did not have an endorsement to conduct the types of instrument approaches available at Horn Island and several other locations frequently used by the operator."}