{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-blackbushe-5-killed", "date": "Dec 23, 2000 at 1351 LT", "type": "Beechcraft 200 Super King Air", "operator": "Videovision%20Broadcast", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Blackbush - Palma de Mallorca", "msn": "BB-1519", "yom": 1995, "flight_number": null, "city": "Blackbushe", "zone": "Hampshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 2664, "captain_hours_type": 1243, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft, with the pilot and four passengers on board, departed Blackbushe from Runway 08 in fog with a visibility of less than 500 metres. As the aircraft reached the upwind end of the runway it was seen to bank to the left before disappearing from view. It crashed 13 seconds later into a factory complex where a major fire ensued. All on board were fatally injured. A substantial amount of the aircraft structure was consumed by fire. Engineering examination of that which remained showed that there was no malfunction found within the engines, propellers or controls that would have affected the flight. Analysis of the cockpit voice recorder however showed a reduction in one of the propellers rpm as the aircraft rotated that would have led to thrust asymmetry. Through a combination of lack of visual reference, confusion as to the cause of the power reduction and possible disorientation the pilot lost control of the aircraft and although he may have realised the situation seconds before impact with the ground there was insufficient height available to effect a safe recovery.", "probable_cause": "Whilst the CVR does not provide any comments by the pilot as to the problems he was experiencing, spectral analysis of the CVR recording indicates that a significant difference in propeller rpm occurred at rotation when the pilot would normally have removed his right hand from the power levers. There was no evidence of a malfunction in either engine or the propeller control systems thus it is probable that migration of a power lever(s) occurred due to insufficient friction being set on the power lever friction control. The fiction control had been slackened during recent maintenance and it was possible that it was not adjusted sufficiently by the pilot during his checks prior to takeoff. His simulator training had included engine failures but as far as could be established, the pilot had not encountered or been trained for the situation of power lever(s) migration during takeoff. With his level of experience the pilot should have controlled the resultant asymmetric thrust and in reasonable conditions continued the takeoff to a safe height where analysis of the problem could have been carried out. In the event the takeoff was carried out in extremely low visibility conditions leading to the pilot's total loss of any ground references within seconds of lift off. Having controlled the aircraft initially the lack of visual reference with the ground, possible confusion with attitude instrument bank angle display, physical disorientation brought about by cockpit activity and confusion as to the exact nature of the problem led the pilot to lose control of the aircraft at a low altitude. The unusual attitude developed by the aircraft and the reason for the power asymmetry may have been recognised by the pilot several seconds before impact however there was insufficient height available for him to effect a safe recovery. The transition from visual to instrument flight in the low visibility conditions existing at the time of departure was considered to be a major contributory factor in this accident. "}