{"url": "https://www.baaa-acro.com/crash/crash-consolidated-pby-5a-catalina-macao-25-killed", "date": "Jul 17, 1948 at 1800 LT", "type": "Consolidated PBY Catalina", "operator": "Cathay-Pacific-21", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Macau – Hong Kong", "msn": null, "yom": null, "flight_number": null, "city": "Macau", "zone": "Macau", "country": "China", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 23, "pax_fatalities": 22, "other_fatalities": 0, "total_fatalities": 25, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff from Macau, a hijacker came into the cockpit and killed the captain with a gun. The copilot lost control of the aircraft christened 'Miss Macau' that crashed into the Zhujiang River Estuary, between Macau and Hong Kong. A passenger was seriously injured while all 25 other occupants were killed. This event was considered as the first official hijacking of a commercial aircraft in the Civil Aviation History. \r\nIt was later reported that lone survivor, Huang Yu, was the admitted leader of the hijacking plot. He survived by jumping out the emergency exit just before the crash. He was brought to court by the Macau Police, but the Macau court suggested that the prosecution should be brought in Hong Kong instead, since the plane was registered in Hong Kong and most of the passengers were from there. However, the British colonial government in Hong Kong stated that the incident happened over Chinese territory in which the British have no jurisdiction. Since no state claimed authority to try him, Huang was released without trial from Macau prison on 11 June 1951, and was then deported to China.", "probable_cause": "Sudden loss of control by the pilot as a result of being incapacitated by an armed passenger. The police authorities in Macau were in possession of certain evidence which appeared to establish beyond reasonable doubt that the crew of the aircraft were subjected to armed attack by certain passengers shortly after takeoff from Macau for Hong Kong."}