{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-grakhovo-4-killed", "date": "Nov 2, 1958 at 1620 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Stalino – Kharkov – Voronezh – Penza – Kazan – Izhevsk", "msn": "184 280 01", "yom": 1951, "flight_number": null, "city": "Grakhovo", "zone": "Republic of Udmurtia", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13175, "circumstances": "The crew departed Stalino on a cargo flight to Izhevsk with intermediate stops at Kharkov, Voronezh, Penza and Kazan, carrying a load of bottles of zinc nitrate for a total of 2,250 kilos. On the last leg from Kazan to Izhevsk, while in cruising altitude, the crew informed ATC that a fire erupted in the cabin and requested the permission to divert to the nearest airport. An emergency was declared and the captain decided to reduce his altitude and to attempt an emergency landing in a field when the airplane struck the ground, exploded and crashed. The aircraft was totally destroyed upon impact and all four crew members were killed. ", "probable_cause": "It was determined that some bottles of zinc nitrate broke in flight, causing the fluid to leak in the heating system and to ignite when the heating system was turn ON by the crew (the ignition point of zinc nitrate is  36° C). A fire erupted in the cabin, forcing the crew to attempt an emergency landing. Upon touchdown, several bottles broke and exploded, causing a major explosion of the aircraft that was uncontrollable and crashed in flames. Investigations were able to determine that the Chemical Company in charge to ship the load from Stalino to Izhevsk failed to secure the bottles properly. Also, the operator (Aeroflot) has not been notified of the content of the shipping and thus, the crew was not aware of the nature of the load. Doing so, the Chemical Company violated all dangerous goods procedures. "}