{"url": "https://www.baaa-acro.com/crash/crash-learjet-25d-salina", "date": "Jun 12, 2001 at 1300 LT", "type": "Learjet 25", "operator": "Avcon%20Industries", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Newton - Salina", "msn": "25-262", "yom": 1978, "flight_number": null, "city": "Salina", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 19000, "captain_hours_type": 1500, "copilot_hours": 5168, "copilot_hours_type": 470, "aircraft_hours": 8419, "circumstances": "During a test flight, the airplane encountered an elevator system oscillation while in a high speed dive outside the normal operating envelope. The 17 second oscillation was recorded on the cockpit voice recorder and had an average frequency of 28 Hz. The aft elevator sector clevis (p/n 2331510-32) fractured due to reverse bending fatigue caused by vibration, resulting in a complete loss of elevator control. The flight crew reported that pitch control was established by using horizontal stabilizer pitch trim. The flightcrew stated that during final approach to runway 17 (13,337 feet by 200 feet, dry/asphalt) the aircraft's nose began to drop and that the flying pilot was unable to raise the nose using a combination of horizontal stabilizer trim and engine power. The aircraft landed short of the runway, striking an airport perimeter fence and a berm. The surface winds were from the south at 23 knots, gusting to 32 knots. ", "probable_cause": "The PIC's delayed remedial action during the elevator system oscillation, resulting in the failure of the aft elevator sector clevis due to reverse bending fatigue caused by vibration, and subsequent loss of elevator control. Factors contributing to the accident were high and gusting winds, the crosswind, the airport perimeter fence, and the berm."}