{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-gubin-2-killed", "date": "Nov 2, 2010 at 1107 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Karlsruhe – Cottbus", "msn": "46-36168", "yom": 1998, "flight_number": null, "city": "Gubin", "zone": "Lubusz Voivodeship (Lubuskie)", "country": "Poland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1315, "captain_hours_type": 645, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1720, "circumstances": "At the day of the accident, the pilot, accompanied by his wife, planned to fly from Karlsruhe/Baden-Baden Airport to the Cottbus-Drewitz Special Airfield under Instrument Flight Rules (IFR) with a Piper PA 46-350P. Prior to the flight he refueled 400 liters and submitted a flight plan. According to the radar recording of the responsible air traffic control center, the airplane started at 0923 hrs1 and flew the planned route at Flight Level (FL) 190 to Cottbus-Drewitz, following the flight plan. The airplane started to descend at approx. 1044 hrs. The Initial Approach Fix (IAF) Cottbus-Drewitz NDB (DRW) was overflown in an altitude of approx. 3,900 ft AMSL with a Ground Speed (GS) of approx. 170 kt, at approx. 1104 hrs, and the descent was continued for the approach NDB-RWY-25. After flying over the intermediate approach fix in approx. 2,800 ft AMSL with a GS of approx. 190 kt, the airplane flew a turn to the left in order to intercept the final approach. The radar recording ended at 1107:34 hrs. At that time the airplane was turning into the final approach in an altitude of 2,400 ft AMSL with a GS of approx. 200 kt. According to radar recordings of the German Federal Armed Forces, the airplane was captured several more times within the turn radius: at 1107:50 hrs in an altitude of 1,200 ft AMSL, at 1108:01 hrs in an altitude of 2,700 ft AMSL, and finally in 1,700 ft AMSL and 1,000 ft AMSL. The recording ended at 1108:21 hrs in an altitude of 600 ft AMSL. The airplane crashed into a field south of the Polish city of Gubin and caught fire. Both occupants lost their lives. ", "probable_cause": "The accident is caused by a loss of control, when the aircraft changed from visual to instrument flight conditions during landing approach.\r\nThe following contributing factors were:\r\n- the loss of visual reference in the turn,\r\n- the change form automatic to manual flight control during a bank attitude,\r\n- the permanently high speed during the landing approach."}