{"url": "https://www.baaa-acro.com/crash/ground-fire-tupolev-tu-154b-2-veshchevo-afb-9-killed", "date": "Mar 8, 1988 at 1910 LT", "type": "Tupolev TU-154", "operator": "Aeroflot-3", "flight_phase": "Parking", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Irkutsk - Kurgan - Leningrad", "msn": "80A413", "yom": 1980, "flight_number": "SU3739", "city": "Veshchevo AFB", "zone": "Leningrad oblast", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 1, "pax_on_board": 76, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11411, "circumstances": "At 1453LT, while in cruising altitude over Vologda on a flight from Irkutsk to Leningrad via Kurgan, a group of 11 hijackers (all from the same Oveshkin Family) informed the cabin crew that a bomb was on board and requested to be flown to London. The captain explained that he did not have sufficient fuel to fly to UK and proposed to make a stopover in Finland. In accordance with the authorities and his corporate, the captain eventually landed at the Veshchevo Airbase located 105 km northwest of Leningrad, near the Finnish border. After landing, hijackers realized they were not in Finland and open fire in the cabin. As a door could be open by a crew member, police officers entered the cabin and open fire as well. When the hijackers realized their hijacking attempt failed, two of them committed suicide. The aircraft was partially destroyed by fire and nine people were killed, five hijackers, one stewardess and three passengers. 19 other people were injured in the event. ", "probable_cause": "It was determined that the group of 11 hijackers were all from the same family Oveshkin, members of the jazz band christened 'Seven Simeons'. After several concerts in Japan, they were making a tour in the Soviet Union but wanted to escape to Europe. Investigations determined that one of the band bag containing a double bass was too big to be brought in the cabin but the passengers convinced the personnel at the airport to have it in the cabin. Visual and tactile controls performed by the ground security personnel was inadequate, so they failed to realize that few hand grenades and two sawed shotguns were placed in the double bottom of the double bass bag. "}