{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-near-gamvik-15-killed", "date": "Mar 11, 1982 at 1327 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Wideroe_1", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Kirkenes – Vadsø – Vardø – Båtsfjord – Berlevåg – Mehamn – Honningsvåg – Alta", "msn": "568", "yom": 1977, "flight_number": "WF933", "city": "Gamvik", "zone": "Finnmark", "country": "Norway", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 13, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": 8474, "captain_hours_type": 5011, "copilot_hours": 1830, "copilot_hours_type": 918, "aircraft_hours": 9925, "circumstances": "The twin engine airplane departed Kirkenes on a regular schedule service (flight WF933) to Alta with intermediate stops in Vadsø, Vardø, Båtsfjord, Berlevåg, Mehamn and Honningsvåg. The aircraft departed Berlevåg Airport at 1319LT and the crew reported to Mehamn Aerodrome Flight Information Service (AFIS) at 1322 that he was at an altitude of 2,000 feet over the Tanafjord with an ETA in Mehamn at 1333LT. Mehamn AFIS called flight 933 at 1335 but did not receive any answer. As the aircraft failed to arrive in Mehamn, SAR operations were initiated. The wreckage was located two days later in the Tanafjord mouth, at a depth of 40 meters, about 6 km southeast of Gamvik. All 15 occupants were killed.", "probable_cause": "The exact cause of the accident could not be determined with certainty. However, it is believed that the accident was the consequence of a loss of control in-flight after the vertical stabilizer failed due to the combination of altitude turbulences, strong winds, unfavorable atmospheric currents and inappropriate reaction on part of the flying crew. \n\r\nThe accident occurred during a NATO military exercise, within a self-declared no-fly zone for allied military aircraft. A report in 1987 that radar had observed an unidentified aircraft which was on a collision course with the Twin Otter caused a second investigation to be started. It was concluded that the existence of other aircraft in the area could be ruled out; and that no other airborne objects could have caused the accident. The debate about the accident resurfaced in 1997 when several sources claimed there was new or overlooked evidence of the involvement of NATO aircraft. The Accident Investigation Board Norway (AIBN) decided in 1997 to investigate the new claims and concluded that there was no evidence to support these claims. The accident was ordered investigated again in November 2002 after a retired Norwegian air traffic controller said one of the Harrier pilots, involved in a mission about the time of the accident, had requested an immediate landing because of technical problems. The report was published on 20 September 2005. It fully supported the findings of all three previous reports and found no evidence for an impact with a Harrier or any other aircraft."}