{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-lehman-3-killed", "date": "Jun 18, 2014 at 1635 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Flying Lazy", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Aspen - Brenham", "msn": "46-8508088", "yom": 1985, "flight_number": null, "city": "Lehman", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2258, "captain_hours_type": 188, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4799, "circumstances": "The private pilot was conducting a personal flight during day, instrument flight rules (IFR) conditions. The pilot checked in with an air route traffic control center, and, after radar data showed multiple changes in altitude that were not in accordance with the assigned altitudes, an air traffic controller queried the pilot about the altitude changes. The pilot reported an autopilot problem and then later requested clearance to deviate around weather at a higher altitude. The airplane passed through several sectors and controllers, and it was understood that the pilot was aware of the adverse weather due to the deviation information in the flight strip. The air traffic controller did not provide additional adverse weather information and updates to the pilot, as required by a Federal Aviation Administration order; however, general broadcasts of this weather information were recorded on the frequency the pilot was using before the accident. Multiple weather resources showed rapidly developing multicellular to supercell-type convective activity with cloud tops near 48,000 ft. Forecasts and advisories warned of potential strong to severe thunderstorms with the potential for moderate-to-severe turbulence, hail, lightning, heavy rains, and high wind. Radar data indicated that the pilot turned into the intense weather cells instead of away from them as he had requested. The pilot declared a \"mayday\" and reported that he had lost visual reference and was in a spin. Damage to the airplane and witness marks on the ground were consistent with the airplane impacting in a level attitude and a flat spin. No mechanical anomalies were noted that would have precluded normal operation before the loss of control and impact with the ground. The investigation could not determine if there was an anomaly with the autopilot or if the rapidly developing thunderstorms and associated weather created a perception of an autopilot problem. The autopsy identified coronary artery disease. Although the coronary artery disease could have led to an acute coronary syndrome with symptoms such as chest pain, shortness of breath, palpitations, or fainting, it was unlikely to have impaired the pilot's judgment following a preflight weather briefing or while decision-making en route. Thus, there is no evidence that a medical condition contributed to the  accident. The toxicology testing of the pilot identified zolpidem in the pilot's blood and tetrahydrocannabinol and its metabolite in the pilot's cavity blood, which indicated that he was using two potentially impairing substances in the days to hours before the accident. It is unlikely that the pilot's use of zolpidem contributed to the accident; however, the investigation could not determine whether the pilot's use of marijuana contributed to the cause of the accident.", "probable_cause": "The pilot's improper decision to enter an area of known adverse weather, which resulted in the loss of airplane control. Contributing to the accident was the air traffic controller's failure to provide critical weather information to the pilot to help him avoid the storm, as required by Federal Aviation Administration directives."}