{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-sellafield-2-killed", "date": "Jan 13, 1993 at 0820 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Titan-Airways-2", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Southend - Glasgow", "msn": "110-391", "yom": 1982, "flight_number": null, "city": "Sellafield", "zone": "Cumbria", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2063, "captain_hours_type": 271, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Southend at 06:59 UTC, about one hour before sunrise, on a Special VFR clearance. The aircraft flew to Wallasey via Daventry, White gate and the Liverpool Special Rules Zone at 2,400 feet. It could not be determined why the commander chose to fly this route however, some two weeks before the accident he had spent a short holiday at Haverigg which is close to the direct track from Wallasey to Glasgow. On leaving Wallasey, the aircraft tracked north towards Glasgow and, at 08:01 hrs, the crew called Warton aerodrome stating that they were descending to 1,000 feet and requesting a 'Radar Service'. At 08:10 hrs, an aircraft that had just taken off from Blackpool reported a cloud base of between 2,500 and 3,000 feet and a visibility greater than 20 km. At this time the radar transponder on the aircraft was operating but the height encoding facility had not been selected. Recordings of the Great Dunn Fell and the St Anne's ATC radar heads indicated that the aircraft had left Wallasey on a track of 007°M which was maintained until radar contact was lost at 08:13 hrs at a position one mile to the south west of Walney Island airfield near Barrow in Furness. Consideration of the obscuration due to terrain between the radar heads and the aircraft indicated that, at the time of loss of radar contact, the aircraft would have been no higher than 350 feet amsl and possibly lower. At 08:09 hrs, the time of local sunrise, the crew had called Walney Island stating that they were nine miles south of the airfield at 1,000 feet and requesting overflight of the airfield. At 08:12 hrs, the controller at Walney Island sighted the aircraft abeam the airfield at an estimated height of 800 feet and asked the crew to report at Millom which is about eight miles north of Walney Island. At about the same time, a witness on the beach near the airfield saw the aircraft heading north in and out of cloud at a height estimated to be not above 400 feet. The aircraft did not make the requested position report at Millom and, at 08:16 hrs, the controller advised the crew to call London Information for further service. There was no reply to this call. The last person to see the aircraft reported that it was flying steadily north towards Ponsonby Fell and that the cloud in the area of the Fell was covering the ground at 500 feet above sea level. At about 08:15 hrs a farmer, who was some 600 metres from the crash site, heard a bang from the direction of Ponsonby Fell. He stated that at the time that he heard the bang the weather was very bad with a strong wind, rain and mist covering the fell. The aircraft had flown into ground about 15 metres below the top of Ponsonby Fell. The aircraft was destroyed upon impact and both occupants were killed.", "probable_cause": null}