{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-orebro-9-killed", "date": "Jul 8, 2021 at 1921 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Kalle David Flyg", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Örebro - Örebro", "msn": "1629RB17", "yom": 1966, "flight_number": null, "city": "Örebro", "zone": "Närke", "country": "Sweden", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 1049, "captain_hours_type": 556, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14538, "circumstances": "The intention of the flight was to drop eight parachutists from an altitude of 1,500 metres. It was the twelfth and planned to be the last flight of the day. The weather conditions were good. The parachutist bench to the right of the pilot had been replaced with a pilot's seat to distance the parachutists from the pilot as a Covid-19 precautionary measure. The pilot had no ability to perform a mass and balance calculation with the available information. After take-off, the aircraft climbed to an altitude of 400 to 500 feet above ground before changing course 180 degrees to the left. The aircraft turned around quickly in a descending turn with a high bank angle. During the final phase, the aircraft dived steeply and then slightly levelled off before impact. Upon impact, the landing gear was teared off, after which the aircraft skidded on its belly 48 metres straight ahead and caught fire. All nine persons on board sustained fatal injuries.", "probable_cause": "Control of the aircraft was likely lost in connection with the wing flaps being retracted in a situation where the stick forces were high due to an abnormal elevator trim position, while the aircraft was unstable due to being tail-heavy and abnormally trimmed. The low altitude was not sufficient to regain control of the aircraft. The cause of the accident was that several safety slips occurred in the operation, which resulted in that the safety margin was too small for a safe flight."}