{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-skwentna-2-killed", "date": "Sep 15, 2006 at 1620 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Alex T. Stack", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Galena - Anchorage", "msn": "604", "yom": 1954, "flight_number": null, "city": "Skwentna", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2700, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 34896, "circumstances": "The private pilot and the sole passenger were in the first of two airplanes of a flight of two, operating as a personal flight under Title 14, CFR part 91. The pilot of the second airplane reported that both airplanes were in radio contact, and the accident airplane was about one mile ahead as they entered a mountain pass along the intended flight route. As the flight progressed, both airplanes descended due to deteriorating weather conditions as they neared the narrowest part of the pass. The second pilot said that visibility deteriorated to a point that it was difficult to discern topographical features, and he told the accident pilot that he was uncomfortable with the lack of visibility and was turning around. The second pilot stated that the accident pilot responded by saying, in part: \"Turn around if you can... I am not able to.\" The second pilot indicated that the last time he saw the accident airplane was as it entered a cloudbank. During the accident pilot's final radio transmission, prompted by the second pilot's inquiry about how he was doing, he responded that he was just trying to get through the pass. No further radio communications were received from the accident airplane. There was no ELT signal, and the search for the airplane was unsuccessful until three days later. The  wreckage was located at the 3,100-foot level of the mountain pass, in an area of steep terrain. Impact forces and a post crash fire had destroyed the airplane. During the IIC's on-site examination of the wreckage, no pre accident mechanical anomalies were discovered.  ", "probable_cause": "The pilot's continued VFR flight into instrument meteorological conditions, which resulted in an in-flight collision with mountainous terrain. A factor associated with the accident was a low cloud ceiling.\n"}