{"url": "https://www.baaa-acro.com/crash/crash-aero-spacelines-377mgt-mini-guppy-edwards-afb-4-killed", "date": "May 12, 1970 at 0719 LT", "type": "Aero Spacelines 377MGT Mini Guppy", "operator": "Aero%20Spacelines", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Edwards - Edwards", "msn": "0001", "yom": 1970, "flight_number": null, "city": "Edwards AFB", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 6827, "captain_hours_type": 34, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Aero Spacelines 377MGT was a converted Boeing Stratoliner. Prototype N111AS first flew on March 13, 1970. In the following period flight testing was carried out, a.o. at Edwards AFB. The accident occurred during the sixth takeoff of Flight Number 12 following the scheduled shutdown of the engine number one at about 109 knots IAS. The takeoff was being made on runway 22 and the wind was from approximately 200 degrees at about 10 knots. Rotation occurred at about 114 knots and several seconds after rotation, according to one witness, the aircraft turned and rolled to the left, settling as it did so. The left wingtip subsequently contacted the ground, causing a severe yaw. The forward fuselage struck the ground, causing the flight deck to be destroyed. The test flight was under FAR Part 25 certification program.\r\nSource: http://www.allaboutguppys.com", "probable_cause": "The exact cause of the accident could not be determined. However, examination of the Rudder System revealed the the Rudder Bell Crank Arm Assembly, Boeing P/N 15-23765 and the Rudder Boost Control Link Assembly, Boeing P/N 6-38900 were broken. The broken assemblies were removed and forwarded to the NTSB Metallurgist for fracture analysis. The fractures were typical of bending overload breaks. "}