{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-pahokee-3-killed", "date": "Dec 8, 1998 at 1902 LT", "type": "Cessna 402", "operator": "Bimini%20Island%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Fort Lauderdale - Pahokee", "msn": "402B-1312", "yom": 1978, "flight_number": null, "city": "Pahokee", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1440, "captain_hours_type": 8, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7940, "circumstances": "The flight departed Fort Lauderdale's Executive Airport (FXE) at about 1833 on a northwesterly heading for the co-located Pahokee VOR/airport (PHK) on the second training session of the day for the 2 front seat occupants. This particular flight had a dual purpose, in that the left seat occupant/new-hire was getting a 'pre-check ride' by the right seat occupant/instructor/PIC, and the instructor was being observed by the air taxi's director of operations in anticipation of an endorsement for an FAA designation as a company check airman. The flight was not in contact with any ATC facility and was squawking a transponder code consistent with non-controlled, VMC flight. At 1902, the Miami ARTCC lost radar contact at the 334 degree radial/12 nmi from the PHK VOR at 1,300 feet agl. Eight days later, the wreckage with its 3 occupants still inside, was located and recovered from the lake bottom. The location roughly corresponds with the radial of the PHK VOR that would have to be tracked while performing the VOR Runway 17 approach. The wreckage was intact except for 2 nacelle doors, the nose cone, and the left propeller, and revealed no engine, airframe, or component failure or malfunction. There was no evidence of a bird strike. Evidence revealed that both engines were developing power and the airplane was wings level in the approach configuration and attitude at water contact. ", "probable_cause": "The pilot's failure to maintain adequate altitude during the approach. "}