{"url": "https://www.baaa-acro.com/crash/crash-boeing-777-2h6er-indian-ocean-239-killed", "date": "Mar 8, 2014 at 0130 LT", "type": "Boeing 777-200", "operator": "Malaysia%20Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Kuala Lumpur – Beijing", "msn": "28420/404", "yom": 2002, "flight_number": "MH370", "city": "Indian Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 12, "crew_fatalities": 12, "pax_on_board": 227, "pax_fatalities": 227, "other_fatalities": 0, "total_fatalities": 239, "captain_hours": 18423, "captain_hours_type": 8559, "copilot_hours": 2813, "copilot_hours_type": 39, "aircraft_hours": 53471, "circumstances": "The Boeing 777-2H6ER took off from Kuala Lumpur Airport runway 32R at 0041LT bound for Beijing. Some 40 minutes later, while reaching FL350 over the Gulf of Thailand, radar contact was lost. At this time, the position of the aircraft was estimated 90 NM northeast of Kota Bharu, some 2 km from the IGARI waypoint. More than 4 days after the 'accident', no trace of the aircraft has been found. On the fifth day of operation, several countries were involved in the SAR operations, in the Gulf of Thailand, west of China Sea and on the Malacca Strait as well. All operations are performed in coordination with China, Thailand, Vietnam, Malaysia and Philippines. No distress call or any kind of message was sent by the crew. The last ACARS message was received at 0107LT and did not contain any error, failure or technical problems. At 0119LT was recorded the last radio transmission with the crew saying \"All right, good night\". At 0121LT, the transponder was switched off and the last radar contact was recorded at 0130LT. Several hypothesis are open and no trace of the aircraft nor the occupant have been found up to March 18, 2014. It is now understood the aircraft may flew several hours after it disappeared from radar screens, flying on an opposite direction from the prescribed flight plan, most probably to the south over the Indian Ocean. No such situation was ever noted by the B3A, so it is now capital to find both CVR & DFDR to explain the exact circumstances of this tragic event. Considering the actual situation, all scenarios are possible and all hypothesis are still open. On Mar 24, 2014, the Malaysian Prime Minister announced that according to new computations by the British AAIB based on new satellite data, there is no reasonable doubt that flight MH370 ended in the South Indian Ocean some 2,600 km west of Perth. Given the situation, the Malaysian Authorities believe that there is no chance to find any survivors among the 239 occupants.\n\r\n***************************\n\r\nAccording to the testimony of 6 Swiss Citizens making a cruise between Perth and Singapore via Jakarta, the following evidences were spotted on March 12 while approaching the Sunda Strait: \r\n1430LT - latitude 6° S, longitude 105° E, speed 17,7 knots: \r\nlife jacket, food trays, papers, pieces of polystyrene, wallets,\r\n1500LT: \r\na huge white piece of 6 meters long to 2,5 meters wide with other debris,\r\n1530LT:\r\ntwo masts one meter long with small flags on top, red and blue,\r\n2030LT - latitude 5° S, longitude 107° E, speed 20,2 knots.\n\r\nThis testimony was submitted by these 6 Swiss Citizens to the Chinese and Australian Authorities.\n\r\nOn April 21, 2016, it was confirmed that this testimony was recorded by the Swiss Police and transmitted to the Swiss Transportation Safety Investigation Board (STSB), the State authority of the Swiss Confederation which has a mandate to investigate accidents and dangerous incidents involving trains, aircraft, inland navigation ships, and seagoing vessels. The link to the STSB is http://www.sust.admin.ch/en/index.html.\n\r\n***************************\n\r\nOn July 29, 2015, a flaperon was found on a beach of the French Island of La Réunion, in the Indian Ocean. It was quickly confirmed by the French Authorities (BEA) that the debris was part of the Malaysian B777. Other debris have been found since, in Mozambique and South Africa. \n\r\nOn May 12, 2016,  Australia's TSB reported that the part has been identified to be a \"the decorative laminate as an interior panel from the main cabin. The location of a piano hinge on the part surface was consistent with a work-table support leg, utilised on the exterior of the MAB Door R1 (forward, right hand) closet panel\". The ATSB reported that they were not able to identify any feature on the debris unique to MH-370, however, there is no record that such a laminate is being used by any other Boeing 777 customer.\n\r\n***************************\n\r\nOn September 15, 2016, the experts from the Australian Transportation Safety Bureau (ATSB) have completed their examination of the large piece of debris discovered on the island of Pemba, off the coast of Tanzania, on June 20, 2016. Based on thorough examination and analysis, ATSB with the concurrence of the MH370 Safety Investigation Team have identified the following: \r\n- Several part numbers, along with physical appearance, dimensions, and construction confirmed the piece to be an inboard section of a Boeing 777 outboard flap. \r\n- A date stamp associated with one of the part numbers indicated manufacture on January 23, 2002, which was consistent with the May 31, 2002 delivery date for MH370,\r\n- In addition to the Boeing part number, all identification stamps had a second 'OL' number that were unique identifiers relating to part construction,\r\n- The Italian part manufacturer has confirmed that all numbers located on the said part relates to the same serial number outboard flap that was shipped to Boeing as line number 404, \r\n- The manufacturer also confirmed that aircraft line number 404 was delivered to Malaysian Airlines and registered as 9M-MRO (MH370)\n\r\nAs such, the experts have concluded that the debris, an outboard flap originated from the aircraft 9M-MRO, also known as flight MH370. Further examination of the debris will continue, in hopes that further evidence may be uncovered which may provide new insight into the circumstances surrounding flight MH370. ", "probable_cause": "Due to lack of evidences the exact cause of the accident could not be determined. "}