{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049h-super-constellation-miami-9-killed", "date": "Dec 15, 1973 at 2353 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "Aircraft Pool Leasing Corporation", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Miami - Caracas", "msn": "4815", "yom": 1957, "flight_number": null, "city": "Miami-Intl", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 6, "total_fatalities": 9, "captain_hours": 11550, "captain_hours_type": 1087, "copilot_hours": 2500, "copilot_hours_type": 650, "aircraft_hours": 28905, "circumstances": "A Lockheed L-1049H Super Constellation, N6917C, was destroyed when it crashed shortly after takeoff from Miami International Airport, FL (MIA). All three crew members were killed. The airplane struck several houses as it came down, killing six people on the ground. The airplane was carrying a cargo of Christmas trees to Venezuela. The main cabin was completely filled with trees. Bundles of trees were also loaded into the forward and aft belly compartments. Departure time was planned at 14:15 but the flight engineer noted that the aircraft's batteries were missing. After replacement batteries were purchased, charged , and installed in the aircraft, the three-member crew began preparing for departure. At 22:56, after overcoming some difficulty starting the engines, the flight contacted Miami Ground Control (GC) and requested taxi clearance. N6917C was cleared to taxi to runway 09L and an en route clearance was given to the crew at 23:07. The airplane proceeded to the ramp adjacent to runway 09L and remained there until 23:22. The crew then advise the tower that they would like to return to the ramp. The crew requested some assistance because they couldn't properly close the crew compartment door. At 23:41, the crew re-established radio contact with Miami GC, and the flight was cleared to taxi back to runway 09L. At 23:51, upon clearance, a rolling takeoff was started. According to tower controllers, the aircraft became airborne abruptly 4,800 feet from the start of the takeoff, and it assumed an unusually nose-high attitude of 20-30 degrees nose up. It reached an altitude of 100-120 feet before it began to lose altitude. After striking high tension wires and a tree, the aircraft crashed into a parking lot, after which it collided with several homes and other property before stopping.", "probable_cause": "Over rotation of the aircraft at lift-off resulting in flight in the aerodynamic region of reversed command, near the stall regime, and at too low an altitude to effect recovery. The reasons for the aircraft's entering this adverse flight condition could not be determined. Factors which may have contributed to the accident include: (a) improper cargo loading; (b) a rearward movement of unsecured cargo resulting in a shift of the center of gravity aft of the allowable limit and (c) deficient crew coordination."}