{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-379c-abidjan-50-killed", "date": "Jan 3, 1987 at 0145 LT", "type": "Boeing 707", "operator": "Varig.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Abidjan - Rio de Janeiro", "msn": "19822", "yom": 1968, "flight_number": "RG797", "city": "Abidjan", "zone": "Lagunes", "country": "Ivory Coast", "region": "Africa", "crew_on_board": 12, "crew_fatalities": 12, "pax_on_board": 39, "pax_fatalities": 38, "other_fatalities": 0, "total_fatalities": 50, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "About 20 minutes after takeoff from Abidjan-Port-Bouet Airport, while cruising over the Atlantic Ocean, the fire alarm on engine n°1 sounded. As the fuel temperature was abnormally high, it was decided to shut down the engine. The captain declared an emergency and was cleared to return. On approach, he was cleared to land on runway 03 but preferred to land on runway 21 that was equipped with an ILS system. After completing a back circuit by night but in relative good visibility, the airplane passed over the Abidjan VOR then the pilot-in-command initiated a left turn when the stall warning sounded. While completing a left turn in a flaps and landing gear up configuration, the airplane banked left, stalled and crashed in the forest of Akakro located about 10 km northeast of Abidjan Airport, near the city of Bingerville. A passenger was seriously injured while 50 other occupants were killed. ", "probable_cause": "It was determined that the fire alarm on engine n°1 also sounded during the first leg from Rio to Abidjan. A check was conducted by Air Afrique technicians who confirmed this was a false alarm. During the last turn completed by a moonless night and without any visual contacts with the ground, the pilot-in-command lost control of the airplane after suffering a spatial disorientation. "}