{"url": "https://www.baaa-acro.com/crash/crash-dornier-do328-110-mannheim", "date": "Mar 19, 2008 at 1745 LT", "type": "Dornier DO328", "operator": "Cirrus%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Berlin - Mannheim", "msn": "3107", "yom": 1999, "flight_number": "RUS1567", "city": "Mannheim", "zone": "Baden-Württemberg", "country": "Germany", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 24, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5000, "captain_hours_type": 1700, "copilot_hours": 320, "copilot_hours_type": 130, "aircraft_hours": 13029, "circumstances": "Following an uneventful flight from Berlin-Tempelhof Airport, the crew started a LOC/DME approach to runway 27 at Mannheim Airport. The copilot was the pilot-in-command and reported to the captain he has difficulties to land in Mannheim. On approach, the aircraft descended below the prescribed altitude of 5,000 feet. At an altitude of 3,800 feet, some 100 feet below the Minimum Sector Altitude (MSA), the captain instructed the copilot to arrest the descent and climb back to 5,000 feet. After he was established on the localizer, the crew continued the approach. Shortly before landing, the aircraft floated over the runway and the touchdown zone and landed too far down the runway, about 530 metres past the runway threshold. After touchdown, the aircraft encountered difficulties to decelerate and was unable to stop within the remaining distance of 480 metres. It overran at a speed of 50 knots, lost its left main gear and came to rest against an embankment. All 27 occupants evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": " The following findings were identified:\r\n- The throttle, after placement by the PIC (PF), could not be moved into 'ground idle' or reverse,\r\n- The landing was not aborted after the plane had flown over the touchdown zone,\r\n- The crew failed to initiate a go-around procedure, \r\n- During the flare for landing, the engine throttles were not selected to 'flight idle', which was not noted by both pilots,\r\n- The flight crew flew the approach not in accordance with SOPs, and thereby pushing and even exceeding the limits.\r\nThe following factors contributed to the accident:\r\n- Many non-precision approaches and landings at Mannheim City were not performed according to air carriers OMs,\r\n- The TRs and FOIs of the aircraft manufacturer were not incorporated into the OM/B and D of the air carrier,\r\n- The practical training of the flight crew by the air carrier was inadequate in terms of preventing an erroneous operation of the throttle control on the basis of the manufacturer of the Do 328-100 issued instructions,\r\n- The flight crew conducted a non-precision approach, which did not meet the procedural requirements of the OM of the air carrier and the AIP,\r\n- The design of the power lever was not forgiving enough,\r\n- The risks of existing problems in the operation of the power levers were not correctly identified and eliminated by by the relevant authorities and the relevant type certificate holder, in spite of several relevant events and various safety recommendations,\r\n- The touchdown zone in Mannheim was not marked,\r\n- The size and design of the safety area at the end of runway 27 was not sufficient to guarantee the operation of the flight within the safety levels set by ICAO and the legislator."}