{"url": "https://www.baaa-acro.com/crash/crash-armstrong-whitworth-aw650-argosy-222-piacenza", "date": "Jul 4, 1965 at 2023 LT", "type": "Armstrong Whitworth AW.650 Argosy", "operator": "BEA", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Mountains", "schedule": "London – Milan", "msn": "6800", "yom": 1964, "flight_number": null, "city": "Piacenza", "zone": "Emilia-Romagna", "country": "Italy", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9823, "captain_hours_type": 778, "copilot_hours": 3144, "copilot_hours_type": 101, "aircraft_hours": null, "circumstances": "The aircraft took off from London Airport (Heathrow) at 1627 hours GMT on a scheduled international freight flight to Milan-Linate Airport, Italy, and the flight proceeded normally as far as the boundary of Milan TMA (Monteceneri NDB). Control of the aircraft was transferred to Milan ACC from Zurich ACC at FL 170, and after the first air- ground communication the aircraft was cleared to Linate Airport via Saronno and Linate NDB at 1844: 30 hours GMT. Before reaching Saronno VOR the pilot asked for and was given permission to make a slight diversion to the south-west in order to avoid a considerable thunderstorm formation which, as forecast, arrived over the area of Milan CTR at 1952 hours. At the pilot's request, the ATC cleared the descent with a clearance limit of 6 000 ft, confirming the previous clearance for descent. The pilot confirmed that he had received the clearance and reported that he was south-west of Saronno on a heading of 1800. At 1855 hours, the pilot reported that he was still maintaining a heading of 180° to avoid the thunderstorm area; the estimate for Linate NDB was however 1904-1905 hours. Following this communication, the control at Milan ACC amended the previous descent clearance, limiting it to FL 130 in order to safeguard other air traffic south of the CTR. At 1903 hours, the pilot unexpectedly reported that he was heading for Voghera VOR, without having been cleared for this by Control. After a few seconds he reported that he was over Voghera VOR at FL 130 and asked far further descent clearance which he was not given, in view of the unexpected and unorthodox position reported. He was asked to maintain FL 130 until he reached Linate NDB. At 1909 hours, the pilot reported that he was close to Linate NDB at FL 130-135 in a severe thunderstorm. After 30 seconds he reported his position over Linate NDB with certainty and was therefore cleared to descend to holding pattern down to 6 000 ft. At 1911 hours, Approach control gave clearance for the descent to be continued down to 2 000 f t, the minimum safe altitude over Linate NDB. At 1917 hours the pilot, speaking in a slightly agitated manner and sometimes with words which were incomprehensible, said repeatedly that he was not in fast certain of his actual position in relation to Linate NDB, that he was aligned with Linate ILS but that ha was not able to establish his exact position in relation to the radio beacon, the Latter being subject to considerable interference from the heavy electrical discharges due to the thunderstorm. The pilot also stated that he could not hear the ILS Outer Marker. At 1919 hours, the pilot confirmed his uncertainty regarding his position and asked to maintain 4 000 ft for another holding pattern; he was again given the QFE and at 1922 hours reported that he had come down to 2 000 ft, that he was inbound and that he would call over the Outer Marker. After he had been given the clearance, there were no further communications and no reply to the repeated calls from Milan Approach Control. It was subsequently found that the aircraft, which was aligned with the ILS localizer, struck the top of a hill at an altitude of 675 m, 35 NM from the threshold of runway 36, between 1923 and 1925 hours. A crew member was injured while the second was killed. ", "probable_cause": "The Commission considered that the cause of the accident was a navigational error arising from the following omissions:\r\n- The failure to take the necessary bearings for a reliable determination of the aircraft's position in view of the particularly unfavourable weather conditions,\r\n- The failure to make the fullest possible use of the services of the copilot. "}