{"url": "https://www.baaa-acro.com/crash/crash-cessna-208a-caravan-i-bairro-guriri", "date": "Oct 18, 1997 at 0545 LT", "type": "Cessna 208A Caravan", "operator": "TAM%20Brasil-2_0", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Vitória – São Paulo", "msn": "208A-0064", "yom": 1985, "flight_number": null, "city": "Bairro Guriri", "zone": "Rio de Janeiro", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11000, "captain_hours_type": 600, "copilot_hours": 800, "copilot_hours_type": 400, "aircraft_hours": 9633, "circumstances": "The crew was completing a cargo flight from Vitória to São Paulo-Guarulhos Airport. About forty minutes after departure from Vitória, while cruising over the ocean at an altitude of 8,000 feet, the engine failed. The crew heard a metallic noise when oil spread from the engine on the windshield. The crew reduced his altitude and attempted to reach the coast but due to clouds and limited visibility, he eventually decided to attempt an emergency landing on a beach. The aircraft crash landed and came to rest. The copilot escaped uninjured while the captain was slightly injured. ", "probable_cause": "It was determined that the engine failure was probably caused by the failure of a blade on the high-pressure compressor, possibly as a result of a manufacturing defect. The following contributing factors were identified:\r\n- The crew failed to feather the propeller after the engine failure, \r\n- The flaps were lowered at an angle that caused a speed reduction, \r\n- Lack of crew coordination, \r\n- The crew failed to follow strictly the checklist and missed certain points, \r\n- The fact that the crew was flying under IFR mode at the time the engine failed aggravated the situation, making it difficult to carry out the planned procedures and ruling out an early choice of an emergency landing site,\r\n- The poor visibility due to the night impeded a proper choice and planning of the emergency landing procedure. "}