{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-t-1a-jayhawk-biloxi", "date": "Aug 16, 2003 at 2221 LT", "type": "Beechcraft T-1 Jayhawk", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Del Rio - Biloxi", "msn": "TT-34", "yom": null, "flight_number": null, "city": "Biloxi", "zone": "Mississippi", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Mishap Student pilot (MSP) was flying an Instrument Landing System (ILS) approach to runway 21 at Keesler AFB. They were in Visual Meteorological Conditions (VMC) at night and the runway was wet. After some deviations on the approach, they arrived over the threshold on a normal glide slope and faster (about 114 kts) than the computed approach speed of 108 kts. The aircraft touched down approximately 1500 feet down the runway. The Mishap Instructor Pilot (MIP) actuated the speed brakes/spoilers switch and the student began to immediately apply brake pressure. After 4-5 seconds, the instructor recognized that the aircraft was not decelerating and declared that she was taking control of the aircraft. The instructor immediately applied maximum braking with no perceived deceleration. She then grabbed the glare shield in an attempt to gain additional leverage on the brakes and again felt no perceived deceleration. At this point, the aircraft was rapidly running out of available runway. The instructor selected the emergency brakes just prior to arriving at the departure end threshold and the brakes locked resulting in a hydroplane skid. The aircraft departed the prepared surface and came to a halt 190 feet later. As a result of the runway departure, the right main and nose gear collapsed, and the forward fuselage and both wings were heavily damaged.", "probable_cause": "Based on clear and convincing evidence, the Board President determined that this mishap was caused by a combination of several factors during the landing sequence. First, the Mishap Student Pilot (MSP) flew faster than the computed approach and landing speeds. Additionally she maintained higher than idle thrust for the first few seconds after touchdown. Because of these factors, the aircraft did not settle completely on the runway after touchdown-as the struts were not completely compressed. This put the aircraft systems in the \"AIR\" mode meaning that the speed brakes/spoilers could not deploy. Finally, the runway was wet; and the crew was inexperienced and thus did not recognize the anti-skid cycling at high speeds on the wet runway."}