{"url": "https://www.baaa-acro.com/crash/crash-beriev-be-103-straubing-1-killed", "date": "Apr 29, 1999 at 1833 LT", "type": "Beriev Be-103", "operator": "TANTK - Taganrog ANTK", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Straubing - Straubing", "msn": "30 02", "yom": 1996, "flight_number": null, "city": "Straubing", "zone": "Bavaria", "country": "Germany", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A testflight for the purpose of vibration measurements on the propellers was to be carried out with the a.m. aircraft. The Beriev BE103 is the prototype of a 6 seater, twin engine amphibious aircraft of russian design. It was powered by two piston engines Teledyne Continental IO-360 E5 which operated hydraulic variable pitch propellers. In the course of the russian type certification the vibration behavior and the stiffness of the propeller blades had to be proven. Therefore a test propeller, fitted with wire strain gauges was attached to the L/H engine at the propeller manufacturer’s facilities in Straubing. The transducers and transmitters were fitted instead of the spinner by means of special brackets. The data recording system was installed in the aircraft’s cabin. As during the testflights a maximum of 105% of the maximum allowable rpm had to be achieved the L/H propeller governor was adjusted to 2940 rpm. Furthermore the R/H propeller and governor were changed from prototypes to the serial components. After these modifications several engine test runs were carried out for calibration of the test equipment and data recording. The testflight was recorded on a camcorder. The film showed that the pilot in command taxied to the far end of the 940 m long pavement runway, adjusted the engines while standing and thereafter commenced his take-off run which should have been approx. 300 m long with view to the aircraft weight according to information gained from the a/c manufacturer. The a/c, however, taxied far beyond the ½ marking of the runway, rotated fairly long and went airborne after approx. 700 m with a high angle of attack. After gaining 10 to 15 m of altitude the pilot in command retracted the landing gear. Right after that the a/c entered a shallow descend in a nose-up attitude and turned to the left before it left the camera view some seconds before the impact. During the entire flight a constant and normal engine noise was audible. Approx. 600 m behind the runway end the aircraft hit the bank of a street and caught fire. The pilot in command was fatally injured, the aircraft was destroyed by the impact and the post impact fire.", "probable_cause": "The accident was caused by the pilot in command trying to depart at an extremely reduced power setting and not aborting the take-off in time. Technical causes were not determined. The wrong power setting was related to a misinterpretation of the function and procedures in connection with the constant speed propeller system. Although these are part of the basic knowledge of a pilot on aircraft of this category they were explained to him by employees of the propeller manufacturer and the aircraft manufacturer’s test flight engineer as part of the preflight briefing. With a high probability the pilot did not understand these explanations in all details. The service of an interpreter was refused by him. The planned testflights wouldn’t have led to a power reduction when accomplished properly."}