{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-i-gunnison", "date": "Dec 4, 2016 at 1853 LT", "type": "Cessna 500 Citation", "operator": "Yatish Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Jose – Pueblo", "msn": "500-0332", "yom": 1975, "flight_number": null, "city": "Gunnison-Crested Butte", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2267, "captain_hours_type": 142, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5218, "circumstances": "The commercial pilot of the jet reported that he initially requested that 100 lbs of fuel be added to both fuel tanks. During the subsequent preflight inspection, the pilot decided that more fuel was needed, so he requested that the airplane's fuel tanks be topped off with fuel. However, he did not confirm the fuel levels or check the fuel gauges before takeoff. He departed on the flight and did not check the fuel gauges until about 1 hour after takeoff. He stated that, at that time, the fuel gauges were showing about 900-1,000 lbs of fuel per side, and he realized that the fuel tanks had not been topped off as requested. He reduced engine power to conserve fuel and to increase the airplane's flight endurance while he continued to his destination. When the fuel gauges showed about 400-500 lbs of fuel per side, the low fuel lights for both wing fuel tanks illuminated. The pilot reported to air traffic control that the airplane was low on fuel and diverted the flight to the nearest airport. The pilot reported that the airplane was high and fast on the visual approach for landing. He misjudged the height above the ground and later stated that the airplane \"landed very hard.\" The airplane's left main landing gear and nose gear collapsed and the airplane veered off the runway, resulting in substantial damage to the left wing. The pilot reported no preaccident mechanical malfunctions or failures with the airplane that would have precluded normal operation. ", "probable_cause": "The pilot's failure to fly a stabilized approach and his inadequate landing flare, which resulted in a hard landing. Contributing to the accident was the pilot's failure to ensure that the airplane was properly serviced with fuel before departing on the flight. "}