{"url": "https://www.baaa-acro.com/crash/crash-learjet-25c-near-iguape-6-killed", "date": "Jul 28, 1992 at 0911 LT", "type": "Learjet 25", "operator": "Crasa Taxi Aéreo", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Curitiba - Rio de Janeiro", "msn": "25-099", "yom": 1972, "flight_number": null, "city": "Iguape", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 6520, "captain_hours_type": 9, "copilot_hours": 1950, "copilot_hours_type": 9, "aircraft_hours": 5655, "circumstances": "The twin engine aircraft departed Curitiba-Afonso Pena Airport at 0850LT on an 'on demand' taxi flight to Rio de Janeiro, carrying four passengers and two pilots. Once the assigned altitude of 33,000 feet was reached, the crew failed to reduce the engine power when, 3 minutes and 10 seconds later, the stick puller activated. The aircraft climbed to 33,900 feet then entered an uncontrolled descent. With a rate of descent of 18,000 feet per minute, the aircraft crashed in a near vertical attitude in a field. All six occupants were killed. ", "probable_cause": "The exact cause of the accident could not be determined with certainty. However, the following findings were reported:\r\n- a. Human Factor\r\n(1) Undetermined Physiological Aspect\r\nGiven the characteristics of the accident, which resulted in the destruction of the bodies, making it impossible to carry out examinations, it cannot be specified whether it contributed or not. However one cannot rule out the possibility that one of the crew members has been affected by a sudden illness (2nd Hypothesis of the Analysis).\r\n(2) Psychological Aspect - Undetermined\r\nIt may have influenced, to the extent that the commander was operating an aircraft in which he had little experience and little knowledge, and which was demonstrated by the insecurity in the operation, reported to other pilots.\r\nb. Material Factor\r\n(1) Design Deficiency - Undetermined\r\nDespite the information provided by representatives of Learjet Corp. who participated in the investigations, that the compensator engine ('pitch trim') with which this aircraft was equipped, had already undergone the modifications determined by the Federal Aviation Administration (FAA), one cannot help but wonder about a possible firing and locking of the 'pitch trim' engine in the extreme position (3rd Hypothesis of the Analysis). This aspect was hampered as the destruction suffered by the aircraft made a detailed analysis of the pitch trim system impossible.\r\nc. Operational Factor\r\n(1) Disabled Instruction - Contributed.\r\nThe commander and the co-pilot received a less than desired instruction, in quantitative and qualitative terms. As a result, the pilots did not acquire the full technical conditions necessary for the proper operation of the aircraft. The failure to perform the standard procedure to be followed in the emergency that led to the accident, i.e. the lowering of the landing gear, attests to the poor instruction given.\r\n(2) Deficient Application of Controls: - Contributed\r\nThe pilots did not adjust the engine power properly after leveling and, after the aircraft started to abruptly descend, as a result, the 'overspeed' occurred, they could not avoid the loss of control.\r\n(3) Weak Cockpit Coordination - Contributed.\r\nThe pilots made inadequate use of the aircraft's resources for its operation.\r\n(4) Forgetfulness - Contributed.\r\nThis aspect is in accordance with the previous one, since the lowering of the undercarriage is part of the standard procedure to be performed in cases of overspeed.\r\n(5) Little Flight Experience in the Aircraft - Contributed\r\nThe captain, despite having 6,500 hours of flight time, had already intended to fly another jet plane, but had flown little on Learjet. The other pilot, in turn, had had less experience in jet flying as a co-pilot, and in the Learjet, specifically, flew less than the commander.\r\nAs a result, when they were faced with an emergency that required rapid identification in order to take the necessary measures to remedy it, they lacked the necessary experience.\r\n(6) Deficient Supervisor - contributed.\r\nThe air taxi company, to which the pilots belonged, was in a hurry to train this new crew. This resulted in inadequate operational training for the pilots, which demonstrates poor supervision of the company. The Civil Aviation System, through the regional body that deals directly with general aviation, failed to carry out proper oversight, as it did not detect the errors in the statements of instruction, and allowed the checks of the captain and the co-pilot to be carried out without reaching the minimum amount of flight hours and landings on that aircraft."}