{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-islander-saidor-gap-1-killed", "date": "Dec 23, 2017 at 1010 LT", "type": "Britten-Norman Islander", "operator": "North%20Coast%20Aviation-2", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Derim - Lae", "msn": "227", "yom": 1970, "flight_number": null, "city": "Saidor Gap", "zone": "Morobe", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1982, "captain_hours_type": 139, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 32232, "circumstances": "On 23 December 2017, at 00:10 UTC (10:10 local), a Britten Norman BN-2A Islander aircraft, registered P2-ISM (ISM), owned and operated by North Coast Aviation, impacted a ridge, at about 9,500 ft (6°11'29\"S, 146°46'11\"E) that runs down towards the Sapmanga Valley from the Sarawaget Ranges, Morobe Province. The pilot elected to track across the Sarawaget ranges (See figure 1), from Derim Airstrip to Nadzab Airport, Morobe Province, not above 10,000 ft. The track flown from Derim was to the northwest 6.5 nm (12 km) to a point 0.8 nm (1.5 km) westsouthwest of Yalumet Airstrip where the aircraft turned southwest to track to the Saidor Gap. GPS recorded track data immediately prior to the last GPS fix showed that the aircraft was on a shallow descent towards the ridge. The aircraft impacted the ridge about 150 m beyond the last fix. There were no reports of a transmission of an ELT distress signal. During the search for the aircraft, what appeared to be the right aileron was found hanging from a tree near the top of the heavily-timbered, densely-vegetated ridge. The remainder of the wreckage was found about 130 m from the aileron along the projected track. The aircraft impacted the ground in a steep nose-down, right wing-low attitude. The majority of the aircraft wreckage was contained at the ground impact point. The aircraft was destroyed by impact forces. The pilot, the sole occupant, who initially survived, was reported deceased by the rescue team on 27 December 2017 at 22:10. The pilot had made contact with one of the operator’s pilots at 16:15 on 23 December. The pilot’s time of death, recorded on the Death Certificate, was 10:40 am local on 24 December. Rescuers felled trees on the steep heavily timbered, densely vegetated slope about 20 metres from the wreckage and constructed a helipad. ", "probable_cause": "Cloud build up along the pilot’s chosen route may have forced him to manoeuvre closer than normal to the ridge, in order to avoid flying into the cloud. The aircraft’s right wing struck a tree protruding from the forest canopy during controlled flight into terrain. It is likely that the right aileron mass balance became snagged on the tree and rapidly dislodged the aileron from the wing. The loss of roll control, and the aerodynamic differential, forced the aircraft to descend steeply through the forest and impacted terrain."}