{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-26a-marquise-san-antonio-2-killed", "date": "Jan 22, 2000 at 1433 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "BTC Saratoga", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "San Antonio - Tucson", "msn": "386", "yom": 1978, "flight_number": null, "city": "San Antonio", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2000, "captain_hours_type": 21, "copilot_hours": 950, "copilot_hours_type": 5, "aircraft_hours": 3717, "circumstances": "Witnesses reported that during the airplane's takeoff roll they heard a heard a series of repeated sounds, which they described as similar to a \"backfire\" or \"compressor stall.\" Several witnesses reported seeing the airplane's right propeller \"stopped.\" One witness reported that as the airplane lifted off the ground, he heard \"a loud cracking sound followed by an immediate prop wind down into feather.\" He continued to watch the airplane, as the gear was retracted and the airplane entered a climb and right turn. Subsequently, the airplane pitched up, entered a \"Vmc roll-over,\" followed by a 360-degree turn, and then impacted the ground. Radar data indicated the airplane took off and climbed on runway heading to a maximum altitude of about 200 feet agl. The airplane than entered a right turn and began to lose altitude. A radar study revealed that the airplane's calibrated airspeed was 97 knots when the last radar return was recorded. According to the flight manual, minimum controllable airspeed (Vmc) was 93 knots. Examination of the accident site revealed that the airplane impacted the ground in a near vertical attitude. A post-crash fire erupted, which destroyed all cockpit instruments and switches. Examination of the propellers revealed that neither of the\r\npropellers were in the feathered position at the time of impact. Examination of the left engine revealed signatures consistent with operation at the time of impact. Examination of the right engine revealed that the second stage impeller shroud exhibited static witness marks indicating that the engine was not operating at the time of impact. However, rotational scoring was also observed through the entire circumference of the impeller shroud. The static witness marks were on top of the rotational marks. Examination of the right engine revealed no anomalies that would have precluded normal operation. The left seat pilot had accumulated a total flight time of about 950 hours of which 16.9 hours were in an MU-2 flight simulator and 4.5 hours were in the accident airplane. Although he had started an MU-2 Pilot-Initial training course, he did not complete the course. The right seat pilot had accumulated a total flight time of about 2,000 hours of which 20.0 hours were in an MU-2 flight simulator and 20.6 hours were in the accident airplane. He had successfully completed an MU-2 Pilot-Initial training course one month prior to the accident.", "probable_cause": "The pilot's failure to maintain the minimum controllable airspeed following a loss of engine power during the initial takeoff climb. Contributing factors to the accident were both pilot's lack of total experience in the make and model of the accident airplane and the loss of right engine power for an undetermined reason.\n"}