{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-31-uruapan-18-killed", "date": "Nov 9, 1999 at 1903 LT", "type": "Douglas DC-9", "operator": "TAESA2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tijuana – Guadalajara – Uruapan – Mexico City", "msn": "47418", "yom": 1970, "flight_number": "TEJ725", "city": "Uruapan-General Ignacio López Rayón", "zone": "Michoacán", "country": "Mexico", "region": "Central America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 13, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 58000, "circumstances": "The aircraft was completing a service from Tijuana to Mexico City with intermediate stops in Guadalajara and Uruapan, carrying 13 passengers and a crew of five. It departed Uruapan-General Ignacio López Rayón Airport runway 20 at 1859LT on the last leg to Mexico City. After liftoff, the crew was cleared to climb to 5,000 feet and while at an altitude of about 1,000 metres, the aircraft adopted a high angle of attack then stalled, entered a dive and crashed in an avocado plantation located 5,3 km from the airport. The aircraft disintegrated on impact and all 18 occupants were killed. ", "probable_cause": "The accident was the consequence of an over-rotation on takeoff and a climb with a very pronounced angle, which caused the loss of control, with spatial disorientation (loss of the horizon), in a flight operation by instruments (IFR), in which, according to the crew, there was a possible failure of asymmetry indication in the leading edge flaps (slats), with the crew neglecting to control the flight of the aircraft. \r\nThe following contributing factors were identified: \r\n- Inadequate preparation of information for instrument take-off (IFR) from Uruapan airport and failure to adhere to the operating procedures of the Aeronautical Information Publication (AIP) Manual.\r\n- Failure to perform checklist procedures for the operation of the aircraft in its different phases.\r\n- Loss of external vision (spatial disorientation), aggravated by turning on the cockpit lights, before the takeoff run.\r\n- Inadequate procedure for the rotation of the aircraft during take-off, dragging the tail skid on the runway\r\n- Angle of climb greater than that established in the aircraft Operations Manual.\r\n- Lack of cockpit resource management (CRM)."}