{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-3z6-muang-khon-kaen-6-killed", "date": "Mar 30, 1993", "type": "Boeing 737-300", "operator": "Royal-Thai-Air-Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bangkok - Muang Khon Kaen", "msn": "24480", "yom": 1989, "flight_number": "KAT333", "city": "Muang Khon Kaen", "zone": "Khon Kaen (ขอนแก่น)", "country": "Thailand", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During the days prior to the accident, various problems with the pitch-trim system and the horizontal stabilizers were noticed and reported. Repairs were conducted by technicians from the Royal Thai Air Force but apparently, not according to the Boeing published procedures, so a Boeing engineer was dispatched in Thailand to proceed to controls and tests. On approach to Muang Khon Kaen Airport, the aircraft started to pitch up and down then stalled. The crew increased engine power and regained control for few seconds when the aircraft stalled a second time few seconds later. The crew elected to regain control and to reduce the rate of descent when the aircraft entered an uncontrolled descent and crashed in a rice paddy field located few km from the airport. The aircraft was destroyed and all six occupants were killed. The aircraft has the dual registration 33-333 (military) and HS-TGQ (civil). ", "probable_cause": "The loss of control occurred when the crew retracted the flaps and increased engine power, probably following a technical problems with the pitch-trim control system. Investigations were unable to determine the exact cause of the pitch control system malfunction."}