{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3c-vresovice-5-killed", "date": "Nov 30, 1952 at 1958 LT", "type": "Douglas DC-3", "operator": "Czech%20Air%20Force-2_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Prague – Brno", "msn": "19474", "yom": 1944, "flight_number": null, "city": "Vřesovice", "zone": "South Moravian Region (Jihomoravský kraj)", "country": "Czech Republic", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4789, "circumstances": "The crew was performing a cargo flight in Czechoslovakia, carrying a load of newspapers on behalf of the national career CSA Czech Airlines. While on a night approach to Brno-Tuřany Airport, the aircraft hit the slope of Mt Bradlo (548 meters high) located in the Chriby Mountain Range, about 2,5 km northwest of Vřesovice. The wreckage was found 35 km east of Tuřany Airport and all five crew members were killed. \r\nCrew:\r\nVětroň Antonín,\r\nAntal Viliam,\r\nDvořák Jiří, \r\nGregr František,\r\nKoval Vlastimil.", "probable_cause": "Following several errors, the flying crew started the descent prematurely. At the time of the accident, the aircraft was at an insufficient altitude of 550 meters instead of the minimum altitude fixed at 1,800 meters in this area. Low visibility caused by night and marginal weather conditions prevented the crew to see the mountain, which was considered as a contributory factor. The Czech Authorities confirmed that the flight should normally be scheduled by the national career CSA but due to poor weather conditions, the CSA crew refused to fly. Thus, a military crew was engaged for this flight despite his lack of training in such weather conditions. "}