{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-36n-near-palembang-104-killed", "date": "Dec 19, 1997 at 1613 LT", "type": "Boeing 737-300", "operator": "Silkair.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Jakarta - Singapore", "msn": "28556", "yom": 1997, "flight_number": "MI185", "city": "Palembang", "zone": "South Sumatra", "country": "Indonesia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 97, "pax_fatalities": 97, "other_fatalities": 0, "total_fatalities": 104, "captain_hours": 7173, "captain_hours_type": 3614, "copilot_hours": 2501, "copilot_hours_type": 2311, "aircraft_hours": 2238, "circumstances": "On 19 December 1997, a SilkAir Boeing B737-300 aircraft, registration 9V-TRF, was on a scheduled commercial international passenger flight under Instrument Flight Rules (IFR), routing Singapore – Jakarta – Singapore. The flight from Singapore to Jakarta operated normally. After completing a normal turnaround in Jakarta the aircraft departed Soekarno-Hatta International Airport for the return leg. At 08:37:13 (15:37:13 local time) the flight (MI185) took off from Runway 25R with the Captain as the handling pilot. The flight received clearance to climb to 35,000 feet (Flight Level 350) and to head directly to Palembang. At 08:47:23 the aircraft passed FL245. Ten seconds later, the crew requested permission to proceed directly to PARDI2. The air traffic controller instructed MI 185 to standby, to continue flying directly to Palembang and to report when reaching FL350. At 08:53:17, MI185 reported reaching FL350. Subsequently, the controller cleared MI185 to proceed directly to PARDI and to report when abeam Palembang. At 09:05:15.6, the cockpit voice recorder (CVR) ceased recording. According to the Jakarta ATC transcript, at 09:10:18 the controller informed MI 185 that it was abeam Palembang. The controller instructed the aircraft to maintain FL350 and to contact Singapore Control when at PARDI. The crew acknowledged this call at 09:10:26. There were no further voice transmissions from MI 185. The last readable data from the flight data recorder (FDR) was at 09:11:27.4. Jakarta ATC radar recording showed that MI185 was still at FL350 at 09:12:09. The next radar return, eight seconds later, indicated that MI185 was 400 feet below FL350 and a rapid descent followed. The last recorded radar data at 09:12:41 showed the aircraft at FL195. The empennage of the aircraft subsequently broke up in flight and the aircraft crashed into the Musi river delta, about 50 km (30 nm) north-northeast of Palembang at about 09:13. The accident occurred in daylight and in good weather conditions. All 104 occupants were killed. The accident was not survivable. ", "probable_cause": "- The NTSC investigation into the MI 185 accident was a very extensive, exhaustive and complex investigation to find out what happened, how it happened, and why it happened. It was an extremely difficult investigation due to the degree of destruction of the aircraft resulting in highly fragmented wreckage, the difficulties presented by the accident site and the lack of information from the flight recorders during the final moments of the accident sequence.\r\n- The NTSC accident investigation team members and participating organizations have done the investigation in a thorough manner and to the best of their conscience, knowledge and professional expertise, taking into consideration all available data and information recovered and gathered during the investigation.\r\n- Given the limited data and information from the wreckage and flight recorders, the NTSC is unable to find the reasons for the departure of the aircraft from its cruising level of FL350 and the reasons for the stoppage of the flight recorders.\r\n- The NTSC has to conclude that the technical investigation has yielded no evidence to explain the cause of the accident."}