{"url": "https://www.baaa-acro.com/crash/ground-fire-boeing-767-281sf-san-francisco", "date": "Jun 28, 2008 at 2218 LT", "type": "Boeing 767-200", "operator": "ABX-Air", "flight_phase": "Parking", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Francisco – Wilmington", "msn": "23432/145", "yom": 1986, "flight_number": "ABX1611", "city": "San Francisco", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On June 28, 2008, about 2215 Pacific daylight time, an ABX Air Boeing 767-200, N799AX, operating as flight 1611 from San Francisco International Airport, San Francisco, California, experienced a ground fire before engine startup. The captain and the first officer evacuated the airplane through the cockpit windows and were not injured, and the airplane was substantially damaged. The cargo flight was operating under the provisions of 14 Code of Federal Regulations Part 121. At the time of the fire, the airplane was parked near a loading facility, all of the cargo to be transported on the flight had been loaded, and the doors had been shut. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was the design of the supplemental oxygen system hoses and the lack of positive separation between electrical wiring and electrically conductive oxygen system components. The lack of positive separation allowed a short circuit to breach a combustible oxygen hose, release oxygen, and initiate a fire in the supernumerary compartment that rapidly spread to other areas. Contributing to this accident was the Federal Aviation Administration’s (FAA) failure to require the installation of nonconductive oxygen hoses after the safety issue concerning conductive hoses was initially identified by Boeing. "}