{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-west-dover-1-killed", "date": "Dec 2, 2006 at 1245 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Robert B. North Jr.", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "White Plains – West Dover", "msn": "61-0432-160", "yom": 1977, "flight_number": null, "city": "West Dover-Deerfield Valley", "zone": "Vermont", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 14000, "captain_hours_type": 2600, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2953, "circumstances": "On the day of the accident, the pilot was returning to his home airport, after dropping off friends at a different airport. No weather briefing or flight plan was filed with Flight Service for either flight. A witness and radar data depicted the accident airplane on a straight-in approach for runway 1, in a landing configuration, at a ground speed of approximately 120 knots. The last radar target was recorded about 1/4 mile from the runway threshold, at an altitude of approximately 150 feet agl. The wreckage was later found about 1/2 mile east of the runway threshold. Review of weather information revealed general VFR conditions along the route of flight, and at reporting stations near the accident site. Gusty winds, low-level wind shear, and moderate to severe turbulence also prevailed at the time of the accident. In addition, weather radar depicted scattered light snow showers in the vicinity of the accident site, and possibly a snow squall. Examination of the wreckage did not reveal any preimpact mechanical malfunctions. The pilot had a total flight experience of 14,000 hours, with 8,500 hours in multiengine airplanes, including 2,600 hours in the same make and model as the accident airplane. He also had 4,100 hours of instrument flight experience.", "probable_cause": "A loss of control during approach for undetermined reasons, which resulted in a collision with trees."}