{"url": "https://www.baaa-acro.com/crash/crash-fairchild-f27-calgary", "date": "Aug 24, 1963 at 2355 LT", "type": "Fairchild F27", "operator": "West%20Coast%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Spokane – Calgary", "msn": "032", "yom": 1959, "flight_number": "WC794", "city": "Calgary", "zone": "Alberta", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 12, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 19687, "captain_hours_type": 3219, "copilot_hours": 4230, "copilot_hours_type": 488, "aircraft_hours": null, "circumstances": "West Coast Airlines Flight 794 left Spokane, WA at 22:38 hours on a scheduled international flight to Calgary. The route flown was Spokane direct to Cranbrook. British Columbia. thence via Blue 3 to Calgary. At 23:33 hours Flight 794 reported to Calgary Terminal Control at 17 000 feet. The flight was then cleared to the Calgary VOR station at 13000 feet and requested to report by the Dyson Inter section. This was acknowledged and on request the latest Calgary weather was provided to the flight together with the altimeter setting (30.07 in Hg) and the runway to be used (28). Flight 794 reported by Dyson at 23:38 and was cleared to maintain 10000 feet. They were offered and accepted radar vectors to the localizer serving runway 28 and were then cleared for an approach. The flight was given a vector of 040 and advised it was south of the VOR station. At 23:46 hours the flight was advised it was 14 miles south of the localizer. Following successive vectors of 350° and 310° the flight was advised at 23:51 hours it was 1-1/2 miles south of the localizer and clearance was issued for a straight-in approach on interception of the localizer. Thirty-three seconds later the flight was informed it was 2 miles from the outer marker intersection and then at 2352 hours that it was over the outer marker intersection at which time it was requested to call the control tower. The flight called the control tower and reported over the intersection following which it was cleared to land on runway 28 and provided with wind information. An acknowledgement of this at 23:52 hours was the last transmission from the aircraft. It was determined subsequently that the aircraft struck the ground about 8000 feet before the threshold of runway 28 and 420 feet to the right of the centreline of that runway. It slid for a distance of about 800 feet before coming to rest. At the time of impact the aircraft was approximately in a 5° nose-down attitude. Four occupants were slightly injured while 11 others were unhurt. The aircraft was damaged beyond repair.", "probable_cause": "The pilot in command failed to maintain the approved minimum altitude on approach. The failure of the co-pilot to monitor the final stages of the approach is considered to be a contributing factor."}