{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-20c-el-paso", "date": "Aug 28, 1998 at 0650 LT", "type": "Dassault Falcon 20", "operator": "Reliant%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Addison - El Paso - Memphis", "msn": "126", "yom": 1968, "flight_number": "RLT126", "city": "El Paso-Intl", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3700, "captain_hours_type": 1850, "copilot_hours": 3636, "copilot_hours_type": 124, "aircraft_hours": 16602, "circumstances": "The airplane was dispatched as a cargo flight to pick up a load of 118 boxes of automotive seatbelts. After refueling and loading the cargo on board, the flight crew taxied to runway 22 for a no-flap takeoff, which called for a V1 speed of 141 knots. The first officer was the flying pilot for this leg of the flight. The crew reported that the initial takeoff roll from the 11,009 foot runway was normal. At approximately 120 knots, the flight crew reported hearing a loud bang followed by a vibration. The captain called for the first officer to abort the takeoff. The captain later stated that he believed he saw the #2 engine \"roll back.\" The flight crew  reported that the brakes were not effective in slowing the airplane. A witness stated that the airplane was going west on the runway at a high rate of speed when it \"went up to two feet, then came back down.\" Another witness stated that he saw the airplane \"exit off the end of the runway\" and after about \"seventy-five to one hundred feet, the front wheels lifted off the ground about ten feet.\" The airplane overran the departure end of the runway, went through the airport's chain link perimeter fence, across a 4-lane highway, collided with 3 vehicles on the roadway, and went through a second chain link fence, before coming to rest. The airplane came to rest on its belly, 2,010 feet from the departure threshold of runway 22. The investigation revealed that the flight crew was provided an inaccurate weight for the cargo, and the airplane was found to be 942 pounds over the maximum takeoff weight at the time of the accident. The density altitude was calculated to be 5,614 feet at the time of the accident. Both crewmembers were current and properly certified; however, the captain had upgraded to his present position two months prior to the accident, and the first officer had accumulated a total of 123.8 hours in the Falcon 20 at the time of the accident. Both engines were operated in a test cell and performed within limits. About 90% of the right outboard main landing gear tire's retread was found on the runway approximately 7,200 feet from where the aircraft had commenced its takeoff roll. The operator stated that since the aircraft was over maximum gross weight, the long taxi to the runway could have resulted in the brakes and tires heating more than normal.", "probable_cause": "The captain's decision to abort the takeoff at an airspeed above V1, which resulted in a runway overrun. Contributing factors were: the loading of an excessive amount of cargo by the shipper which resulted in an over gross weight airplane, the high density altitude, the separation of tire retread on takeoff roll, and the flight crew's lack of experience in the accident make and model aircraft."}