{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-116-colina", "date": "Apr 27, 1969 at 2144 LT", "type": "Boeing 727-100", "operator": "LAN-Chile-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Buenos Aires - Santiago", "msn": "19812/532", "yom": 1968, "flight_number": "LA160", "city": "Colina", "zone": "Región Metropolitana de Santiago", "country": "Chile", "region": "South America", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 52, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13591, "captain_hours_type": 826, "copilot_hours": 3284, "copilot_hours_type": 211, "aircraft_hours": 2354, "circumstances": "Flight 160 was a scheduled international flight from Buenos Aires, Argentina to Santiago, Chile. The aircraft took off at 2356 hours GMT from Ezeiza Airport, with an IFR flight plan for airways AJG 82 and UG-14, and left the Buenos Aires terminal area via the Mariana intersection, its route taking it over Junín, Villa Reynolds, El Pencal, Mendoza, Juncal and Tabón. The flight level was 310 (31 000 ft). Before flying over Juncal, the aircraft was cleared by the Mendoza Control Centre to descend and maintain flight level 260 (26 000 ft) and after passing Juncal, it was cleared by the Santiago Control Centre to descend and maintain level 250 (25 000 ft) and to pass the Tab6n NDB at flight level 150. It was also given the Santiago weather report, announcing 4/8 nimbostratus at 450 m and 8/8 altostratus at 2 400 m. At 0135 hours, the aircraft passed over Juncal at flight level 260 and then left this level for FL 150; it gave 0142 hours at its estimated time of passage over Tabón NDB and subsequently reported that it was passing through FL 180 (18 000 ft). At 0141 hours, the aircraft passed Tabón NDB and left FL 150 for FL 70 (7 000 ft) and gave 0142 hours as its estimated time of arrival over Colina NDB. Prior to that, Santiago Centre had cleared the aircraft to FL 70 at the Pudahuel Airport ILS outer marker. The aircraft subsequently reported to the Control Centre that it was passing through FL 70; the Centre acknowledged receipt of the message and cleared the flight to make an ILS approach and to change to frequency 118.1 for communication with the Pudahuel Control Tower. The aircraft passed over Colina NDB at about 5 500 ft and continued to descend intercepting the ILS (glide slope) beam at about 4 500 ft, one min 20 sec after passing FL 70. It continued its descent at a rate of about 1 500/2 000 ft/min and descended below the minimum height of 2 829 ft at the outer marker without either the pilot or the co-pilot noting this and on apparently correct indications from the Flight Director. The aircraft continued descending and passed below the minimum height of 1 749 ft published for Pudahuel Airport when suddenly the warning light on the radio altimeter lit up. At this very moment the aircraft levelled off, but its wheels touched the ground and it landed in a field 2 kms north of the ILS outer marker, suffering heavy damage, but without serious injuries to passengers or crew. The accident occurred at 0144 GMT on 28 April, 2144LT on 27 April. ", "probable_cause": "The investigating commission considered the causes of the accident to be as follows : \r\na) excessive concentration by the crew on the indications given by the Flight Director; \r\nb) the crew erroneously operated the Flight Director equipment on a direct ILS approach; \r\nc) as a result of a) above, the crew did not check the instruments, which indicated: \r\n- descending below the minimum safety altitude; \r\n- rate of descent greater than normal for an ILS approach; \r\n- longitudinal attitude of the aircraft greater than normal for an ILS approach; \r\n- position of the aircraft below the ILS glide path. "}