{"url": "https://www.baaa-acro.com/crash/crash-antonov-26-100-belaya-gora", "date": "Oct 11, 2016 at 1638 LT", "type": "Antonov AN-26", "operator": "Polyarnye%20Avialinii", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yakutsk - Belaya Gora", "msn": "8008", "yom": 1979, "flight_number": "PI203", "city": "Belaya Gora", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 27, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11439, "captain_hours_type": 2697, "copilot_hours": 11142, "copilot_hours_type": 122, "aircraft_hours": 34490, "circumstances": "On final approach to Belaya Gora Airport, the aircraft was too low and hit the ground. On impact, the right main gear and the nose gear collapsed. The aircraft slid for several yards before coming to rest in a snow covered field about 400 meters short of runway threshold and 300 meters to the left of the approach path. The propeller on the right engine was torn off and it appears that the fuselage was bent as well. All 33 occupants were evacuated safely. At the time of the accident, weather conditions were marginal with limited visibility caused by snow falls. It was reported the visibility was about 2,5 km at the time of the accident while the crew needed at least 4 km on an NDB approach. ", "probable_cause": "The accident was caused by the combination of the following factors:\n- Absence of standard operating procedures issued by the operator of how to conduct NDB approaches,\n- Violation of procedures by tower who only transmitted information about snow fall and recommended to perform a low pass over the runway but did not transmit the actual visibility was 1900 meters below required minimum\n- Absence of information that the visibility was below required minimum, the last transmission indicated minimum visibility was present,\n- Presence of numerous landmarks (abandoned ships, ship cranes, fuel transshipment complex, ...) covered by snow within 700-1000 meters from the unpaved runway which could be taken as runway markers by flight crew,\n- Presence of a number of \"bald spots\" due to the transitional period of year where the underlying surface became visible making it difficult to visualize and recognize the unpaved runway covered with snow (it was the first flight into Belaya Gora for the crew in the winter season, they had operated into the aerodrome only in summer so far),\n- Insufficient use of the available nav aid on final approach which led to lack of proper control of the aircraft position relative to the glide path, \n- Lack of possibility for tower to watch the aircraft performing the NDB approach from his work place."}