{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-124-leningrad", "date": "Aug 21, 1963 at 1215 LT", "type": "Tupolev TU-124", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Tallinn – Moscow", "msn": "2 35 07 01", "yom": 1962, "flight_number": null, "city": "Leningrad", "zone": "Leningrad oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 47, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff from Tallinn-Ülemiste Airport at 0855LT, while climbing, the crew encountered technical problems with the undercarriage that could not be raised properly. As there was fog in Tallinn, the crew decided to divert to Leningrad-Pulkovo Airport. The airplane arrived over Leningrad at 1100LT and the crew was authorized to following a holding circuit at an altitude of 500 meters. During the eight circuit, while the fuel jauges indicates a quantity of 750 liters remaining, the left engine stopped. The crew received the permission to land when the right engine failed as well. In such conditions, the captain decided to attempt an emergency landing on the Neva River. On touchdown, the aircraft slid for several yards and came to rest near the riverbank. All 52 occupants were evacuated safely and only two occupants were slightly injured. The aircraft was damaged beyond repair and later used for ground training. ", "probable_cause": "Failure of both engines due to a fuel exhaustion caused by an excessive consumption due to the fact that the flight from Tallinn to Leningrad was performed with the undercarriage down. It was also noted that the settings belonging to the fuel jauges failed to reflect the truth, which was considered as a contributing factor. Also, the crew failed to manage the emergency situation properly. "}