{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-i-hesquiat-lake-2-killed", "date": "Aug 16, 2013 at 1023 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Air-Nootka1", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Hesquiat Lake - Gold River", "msn": "871", "yom": 1956, "flight_number": null, "city": "Hesquiat Lake", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 17000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 1015 Pacific Daylight Time, the de Havilland DHC-2 (Beaver) floatplane (registration CGPVB, serial number 871), operated by Air Nootka Ltd., departed Hesquiat Lake, British Columbia, with the pilot and 5 passengers for Air Nootka Ltd.’s water aerodrome base near Gold River, British Columbia. Visibility at Hesquiat Lake was about 2 ½ nautical miles in rain, and the cloud ceiling was about 400 feet above lake and sea level. Approximately 3 nautical miles west of the lake, while over Hesquiat Peninsula, the aircraft struck a tree top at about 800 feet above sea level and crashed. Shortly after the aircraft came to rest, a post-crash fire developed. All 6 persons on board survived the impact, but the pilot and 1 passenger died shortly after. A brief 406 megahertz emergency locator transmitter signal was transmitted, and a search and rescue helicopter recovered the survivors at about 1600.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. The pilot flew just above the tree tops into instrument meteorological conditions and rising terrain, and the aircraft struck a tree that was significantly taller than the others.\r\n2. The pilot and 1 passenger did not exit the aircraft before it was consumed in the postimpact fire.\r\n3. Air Nootka did not have effective methods to monitor its pilots’ in-flight decision making and associated practices. As a result, Air Nootka had no way to detect and correct unsafe behavior or poor decision making such as occurred on this flight. \r\nFindings as to risk:\r\n1. If aircraft are not fitted with technology to reduce fuel leakage or to eliminate ignition sources, the risk of post-impact fire is increased.\r\n2. If aircraft are not equipped with shoulder harnesses for all seating positions then there is an increased risk of injuries.\r\n3. If aircraft are not equipped with some alternate means of escape such as push-out windows, then there is a risk that post-crash structural deformation will jam doors shut and restrict exit for the occupants.\r\n4. If companies operating under self-dispatch do not monitor their operations, they risk not being able to identify unsafe practices that are a hazard to flight crew and passengers.\r\n5. If flight data recordings are not available to an investigation, this may preclude the identification and communication of safety deficiencies to advance transportation safety."}