{"url": "https://www.baaa-acro.com/crash/crash-fairchild-hiller-fh-227b-andes-mountains-29-killed", "date": "Oct 13, 1972 at 1530 LT", "type": "Fairchild-Hiller FH-227", "operator": "TAMU", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Montevideo - Santiago du Chili", "msn": "572", "yom": 1968, "flight_number": "URUGUAY571", "city": "Chile", "zone": "All Chile", "country": "Chile", "region": "South America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 41, "pax_fatalities": 25, "other_fatalities": 0, "total_fatalities": 29, "captain_hours": 5117, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 792, "circumstances": "The airplane departed Montevideo on a charter flight to Santiago de Chile under callsign Uruguay 571, carrying members of the rugby team 'Old Christians', en route to Chile to take part to a tournament. All passengers were players, supporters and members of their family. While in cruising altitude in marginal weather conditions, the crew encountered altitude turbulences due to the mountain proximity and clouds. Despite the pilot increased full power on both engines, the airplane was unable to maintain a safe altitude when, at a speed of 350 km/h, the right wing struck a rocky ridge and was torn off. Few seconds later, the airplane struck a second ridge, causing the left wing and the tail to be torn off. The aircraft planed for few seconds before it crashed in a snow covered area located at an altitude of 3,900 meters in the Chilean Andes. Few passengers were injured while eight others were killed. Some survivors elected to contact rescuers but the VHF system was out of order. A day after the accident, the pilot of a Chilean Air Force trainer made a pass over the area but failed to sea the wreckage due to clouds. After three days, SAR operations were suspended by the authorities. After 72 days by extreme low temperatures, three survivors walked away and found help in a village. On December 22, 1972, two helicopters of the Chilean Air Force arrived on the scene and were able to evacuate 16 survivors while 29 other occupants died from their injuries, cold or of hunger.", "probable_cause": null}