{"url": "https://www.baaa-acro.com/crash/crash-airspeed-as10-oxford-i-margaret-hill-1-killed", "date": "Oct 23, 1943 at 1200 LT", "type": "Airspeed AS.10 Oxford", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": "Wheaton Aston - Wheaton Aston", "msn": null, "yom": null, "flight_number": null, "city": "Glossop", "zone": "Derbyshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 20:45pm on the 18th October 1943 P/O Denis Kyne took off from Wheaton Aston, which is between Stafford and Telford, for a solo night cross country navigation flight along with several other aircraft (this was his first solo night flight), all of which were taking different routes.  P/O Denis Kyne was to have flown WSW to Condover then NNE to Shawbury and then ESE to return to Wheaton Aston, a route of a little over 50 miles. The weather was rapidly deteriorating and at 21:45pm it was decided to re-call all of the aircraft flying that night, the re-call was acknowledged by all but one of the aircraft, this being LX518. When the aircraft failed to return by ten past midnight it was reported as overdue, it was known that the aircraft could no-longer be airborne as there was only 2 1/2 hours of fuel onboard, with the hope that P/O Kyne may have landed elsewhere. Five days later on the 23rd October the missing aircraft was found on Margary Hill in the north-east of the Peak District, some 56 miles NNE of Wheaton Aston, it was concluded that P/O Kyne must have become lost shortly after he took off.  He had radioed to say he was proceeding to his first way point which he may have reached and turned towards Shawbury, which had he done so he would have missed as their beacon had failed shortly after 9pm.  After missing the Shawbury beacon P/O Kyne could have continued in a north-easterly direction until he became hopelessly lost.\r\nCrew (21st AFU):\r\nP/O Denis Patrick Kyne.\r\nSource: \r\nhttp://www.peakdistrictaircrashes.co.uk/pages/peakdistrict/peakdistrictlx518.htm", "probable_cause": null}