{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh114-heron-2n-mt-hummelfjell-2-killed", "date": "Nov 7, 1956 at 0950 LT", "type": "De Havilland DH.114 Heron", "operator": "Braathens2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Trondheim – Oslo", "msn": "14093", "yom": 1956, "flight_number": null, "city": "Mt Hummelfjell", "zone": "Hedmark", "country": "Norway", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 10, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Vaernes Airport, Trondheim, at 0830LT on a scheduled flight to Oslo, carrrying a crew of two and ten passengers. The aircraft entered clouds at 2,500 feet right after take-off and did not have visual contact with the ground thereafter. The copilot later stated that between Vaernes and Tolga when the aircraft reached cruising altitude, normal cruise power was set up but the resultant indicated airspeed was 20 knots below normal. The aircraft reported that at 0912 hours it had passed Tolga radio beacon at 8 000 feet (2,438 m), and that it was experiencing light icing. This was the last radio contact with the aircraft. From this point on it appears that the icing increased rapidly and the aircraft started to lose altitude, even though the de-icing system for wing and tail planes was in use. At 0925 hours it was decided to return to Vaernes Airport.The aircraft, when approximately abeam Tolga and to the east, altered its course 25 to 30 degrees northeast. This maneuver, carried out by the captain, was interpreted by the co-pilot to mean that he had decided to divert to Rhos. The controls were taken over by the copilot while the captain continued to try to establish radio contact with the ground on frequency 126,7 mc/s. No signals were picked up. At approximately 0950 hours the aircraft hit Hummelfjell at a height of approximately 1,350 metres. At the time of the crash the aircraft was in heavy fog, with cockpit window covered with ice to an extent which drastically reduced the crew's visibility. The force of the impact was somewhat reduced in that the aircraft touched down in a bowl in the terrain and made two bounces on the snow, which covered the mountain to a depth of 40 cm, before settling down. The captain and one passenger died instantly. ", "probable_cause": "The accident was due to the unusually heavy icing which the aircraft encountered. Severe downdraft immediately prior to the crash may have been a contributing factor. "}