{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-10-dc-skymaster-near-missoula-12-killed", "date": "Oct 28, 1960 at 1139 LT", "type": "Douglas C-54 Skymaster", "operator": "Northwest%20Airlines2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Portland – Yakima – Spokane – Missoula", "msn": "10320", "yom": 1944, "flight_number": "NW104", "city": "Missoula", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 11620, "captain_hours_type": 8070, "copilot_hours": 3221, "copilot_hours_type": 446, "aircraft_hours": 36842, "circumstances": "On October 28, 1960, at 1139 m. s. t., a Douglas C-54A-DC, N 48762, operated by Northwest Airlines, Inc., as Flight 104, crashed and burned approximately 13 nautical miles northwest of the Missoula, Montana Airport. The captain, first officer, two hostesses and all eight passengers died in the crash. The flight took off from Spokane, Washington, on an instrument flight plan. En route radio reports were routine and indicated the flight was on schedule, and in no difficulty. The aircraft was observed from the ground flying on course toward Missoula in and along the Clark Fork Valley within six nautical miles west of the scene of the crash. The engines were running and the aircraft was descending as if on an approach to a landing. As the aircraft descended deeper into the valley, flight visibility became restricted by light snow showers, and the tops of the mountains surrounding the valley were obscured by the overcast. The aircraft entered a steep left banking turn and the nose was raised in an apparent attempt to turn and climb out through an intersecting valley; however, the aircraft continued to sink toward the ground, rolled to the left and crashed inverted. The Board believes the accident was caused by the failure of the pilot to continue in accordance with his IFR flight plan by attempting a VFR approach during instrument weather conditions.", "probable_cause": "The probable cause of this accident was the failure of the pilot to continue in accordance with his IFR flight plan by attempting a VFR approach during instrument weather conditions."}