{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-32-mt-sumagaya-104-killed", "date": "Feb 2, 1998 at 1100 LT", "type": "Douglas DC-9", "operator": "Cebu%20Pacific-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Manila – Tacloban – Cagayán de Oro", "msn": "47069", "yom": 1967, "flight_number": "5J387", "city": "Mt Sumagaya", "zone": "Misamis Oriental", "country": "Philippines", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 99, "pax_fatalities": 99, "other_fatalities": 0, "total_fatalities": 104, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 73784, "circumstances": "The aircraft departed Manila-Ninoy Aquino Airport at 0916LT on a regular schedule flight to Cagayán de Oro. The crew made an unscheduled stop at Tacloban Airport to deliver spare tires for another Cebu aircraft. It took off from Tacloban Airport at 1002LT and continued to Cagayán de Oro at FL115. While descending in marginal weather conditions, the aircraft struck the slope of Mt Sumagaya (2,234 metres high) located about 54 km northeast of Cagayán de Oro Airport. First rescuers arrived on site about 24 hours later and the wreckage was found in an isolated area about 150 metres below the summit. The aircraft disintegrated on impact and all 104 occupants were killed, among them five foreigners including one Swiss citizen. At the time of the accident, weather conditions were marginal with clouds and strong winds.  ", "probable_cause": "It was determined that the aircraft was off track by three km at the time of the accident. The following findings were reported:\r\n- Poor operational controls by Cebu Air, \r\n- Pilot training and practices were inadequate and unacceptable, \r\n- The operator was non compliant with crew training procedures, \r\n- More than half of the 17 procedures analyzed by the operator were deficient,\r\n- Aircraft components were still in use after their expiration date."}