{"url": "https://www.baaa-acro.com/crash/crash-partenavia-p68-observer-ii-sant-pere-de-vilamajor-2-killed", "date": "Jun 23, 2009 at 1045 LT", "type": "Partenavia P.68", "operator": "Gavina", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "City", "schedule": "Sabadell - Sabadell", "msn": "421-21-OB2", "yom": 2003, "flight_number": null, "city": "Sant Pere de Vilamajor", "zone": "Catalonia", "country": "Spain", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5686, "captain_hours_type": 155, "copilot_hours": 6689, "copilot_hours_type": 9, "aircraft_hours": null, "circumstances": "The airplane, a Vulcan Air PA68 Observer 2, registration EC-IPG, had taken off from Sabadell airport to conduct a local flight. Onboard were the instructor and a pilot who was being tested for a CRI (SPA) (Class Rating Instructor). As they were flying over the town of Sant Pere de Vilamajor (Barcelona), the aircraft  plunged to the ground, falling within the property limit of a private dwelling (a chalet). Several eyewitnesses reported that they stopped hearing the engine noise and that they then saw the airplane spinning in a nose down attitude. The front part of the airplane (cockpit) impacted the ground first. The crash resulted in a fire, the flames from which reached a part of the aircraft and an arbor next to the house, but not the house itself, though it was affected by the smoke. The two occupants perished immediately and were trapped inside the airplane. They were extracted by emergency personnel. The aircraft was destroyed by the impact and subsequent fire. The post-accident inspection did not reveal any signs of a fault or malfunction of any aircraft component. It has been determined that the accident resulted from a stall caused by flying the aircraft at a low speed. It has also been concluded that there were three contributing factors: the low altitude,  the very likely possibility that the crew did not establish guidelines for action prior to the flight and the absence of an authority gradient between the crew members.", "probable_cause": "The accident was caused when the aircraft stalled during the performance of a slow flying maneuver with the right engine stopped. Factors that contributed to the accident were the low altitude, the possibility that the crew did not define the responsibilities of each prior to the flight and which may have  resulted in a lack of coordination when faced with the circumstances in the final moments of the flight, and the lack of an authority gradient between the crew members."}