{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-76td-dushanbe", "date": "Dec 30, 2004 at 0348 LT", "type": "Ilyushin II-76", "operator": "Airline%20Transport", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Billund – Baku – Kaboul", "msn": "00334 48390", "yom": 1983, "flight_number": "RIN922", "city": "Dushanbe", "zone": "Districts of Republican Subordination", "country": "Tajikistan", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Ilyushin 76 was chartered to fly a consignment of 28938 kg of humanitarian aid from Billund, Denmark to Kabul, Afghanistan. The airplane departed Billund at 18:00 and landed at Baku, Azerbaijan for a refueling stop. Visibility at Kabul was reported as 3000 m, and forecast worsening to 1200 m between 00:00 and 06:00 h due to snow and haze. Minima for Kabul airport however were a visibility of 5000 m and a cloud base at 450 m. The captain nevertheless departed Baku. While approaching Kabul the weather was reported to be: wind 340 degrees at 4 kts, visibility 2000 m, 1-2 octas clouds at 480 m, 5-7 octas clouds at 3000 m and a QNH of 1020 hPa. During the approach low clouds were moving in from the north. The visibility was limited to 500 m in fog and the wind direction changed. The crew of the Ilyushin were not informed of these changed values. The approach was continued and flaps and gear were selected down. At decision height the spoilers were extended and the descent was continued. The captain ordered the spoilers to be retracted, but this command was not carried out. At a height of 310 m, 4230 m short of the runway 29 threshold, the flaps were selected down to 43 degrees. The Il-76 was at that stage 365 m to the right of the extended centreline. The flight descended below the glideslope until it contacted the ground 910 m short of the runway threshold, at a speed of 230 km/h. The left undercarriage was destroyed and separated from the aircraft. The lower aft fuselage and cargo door were severely damaged and the pressure in the no. 1 and no. 2 hydraulic systems fell. The crew applied takeoff power, retracted the spoilers and selected flaps back to 30 degrees. The aircraft climbed away and the captain decided to head for Termez, Uzbekistan, but this airport was closed due to fog. It was decided to continue to Dushanbe, Tajikistan. The airplane made a low pass over the field so the air traffic controllers could observe the nature of the damage. A forced landing was then carried out.", "probable_cause": "The following findings were identified:\r\n- Disturbance in the work of the command-supervisory composition of the \"Airline Transport Incorporation\" company, that led to the failure to present the crew with AIP information of the Republic of Afghanistan about the Kabul Airport minima and the special features of the approach to this airport, as presented in the \"Jeppesen\", valid on 30.12.04;\r\n- Decision making by crew and the decision to carry out an approach under below-minima conditions; unsatisfactory crew interaction during the final stage of the approach, which led to the loss of height, the failure to retract the spoilers, the descent below the established glide path, the collision of aircraft with a ground-based structure and the late spool-up of the engines to takeoff power;\r\n- Deficiencies in the weather support of the flight, in that the crew were not given a visibility forecast, which did not allow crew to estimate the level of hazard of a change in the meteorological conditions."}