{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-53-evansville-29-killed", "date": "Dec 13, 1977 at 1922 LT", "type": "Douglas C-53 Skytrooper (DC-3)", "operator": "National%20Jet", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Indianapolis - Evansville - Nashville", "msn": "4837", "yom": 1941, "flight_number": "Air Indiana 216", "city": "Evansville-William H. Dress", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 26, "pax_fatalities": 26, "other_fatalities": 0, "total_fatalities": 29, "captain_hours": 9100, "captain_hours_type": 4600, "copilot_hours": 1330, "copilot_hours_type": 80, "aircraft_hours": 19777, "circumstances": "The airplane was engaged in a charter flight from Indianapolis to Nashville with an intermediate stop at Evansville Airport, carrying members of the University of Evansville basketball team and associated personnel. Takeoff from runway 18 was completed in marginal weather conditions with mist and light rain. After rotation, the pilot-in-command initiated a turn to the left when the airplane struck two trees located to the east of the airfield. Then the aircraft rolled to the right and crashed about a mile southeast from runway 18 threshold. The aircraft was totally destroyed upon impact and all 29 occupants were killed. ", "probable_cause": "An attempted take-off with the rudder and right aileron control locks installed, in combination with a rearward centre of gravity, which resulted in the aircraft's rotating to a nose-high attitude immediately after take-off, and entering the region of reversed command from which the pilot was unable to recover. Contributing to the accident was the failure of the flight crew to ensure that the passenger baggage was loaded in accordance with the configuration contained on the load manifest. Their failure resulted in a rearward centre of gravity that was aft of the optimum range, but forward of the rearmost limit."}