{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-rocksprings-2-killed", "date": "Feb 9, 2007 at 1715 LT", "type": "Cessna 414 Chancellor", "operator": "Drilling%20Structures%20International", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Houston – Rocksprings", "msn": "414-0637", "yom": 1975, "flight_number": null, "city": "Rocksprings", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2212, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5466, "circumstances": "The 2,212-hour instrument rated commercial pilot collided with terrain while circling to land after completing an instrument approach to an uncontrolled non-towered airport. The airport had two instrument approaches to Runway 14; a VOR and a RNAV(GPS). The published minimums for a circling approach to Runway 32 are a 500 foot ceiling and one mile visibility (VOR14) and a 700 foot ceiling and one mile visibility for RNAV(GPS) to Runway 14. The weather at the airport at the time of the accident was reported as 300 overcast, visibility of 3/4 of a mile in mist, with winds from 020 degrees at 10 knots gusting to 14 knots. Two witnesses reported that the airplane circled over the airport and then descended straight to the ground. Radar data revealed that after the airplane made the instrument approach to Runway 14, at approximately 2,800 feet mean sea level (msl), the airplane initiated a circling turn to the left and a slight descent. The last radar hit showed the airplane at 2,600 feet at a groundspeed of 186 knots. A post impact fire consumed some of the airframe. The pilot's logbooks were not located during the course of the investigation and his instrument experience and currency could not be determined. The pilot was reported to be very familiar with the airport and the 2 instrument approaches. A detailed examination of the wreckage of the airplane failed to reveal any anomalies with the airframe, structure, or systems. Flight control continuity was established at the accident site. The engines were examined, and no mechanical anomalies were found. The propellers were shipped to the manufacturer's facility for examination and teardown. Both propellers were rotating at the time of ground impact. Neither of the two propellers was found in the feathered position. Blade damage was consistent with both propellers operating under power at the time of impact. No mechanical defects were noted with either propeller.\n", "probable_cause": "The pilot's failure to maintain clearance with terrain. Contributing factors were the below approach/landing minimums weather and the drizzle/mist weather conditions."}