{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950-near-kaitaia-1-killed", "date": "Mar 31, 2006 at 1345 LT", "type": "Fletcher FU-24", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Mountains", "schedule": "Kaitaia - Kaitaia", "msn": "238", "yom": 1977, "flight_number": null, "city": "Kaitaia", "zone": "Northland Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1347, "captain_hours_type": 864, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11230, "circumstances": "On Friday 31 March 2006 the pilot intended to carry out topdressing on properties near a steep hill range nine kilometres to the south-west of Kaitaia. The day’s activities commenced at approximately 0600 hours when the pilot and loaderdriver met at Kaitaia aerodrome. The pilot and loader-driver flew in the aircraft from the aerodrome to a farm airstrip located on the back of a hill range near the Pukepoto Quarry where the fertiliser-loading truck had been parked overnight. The topdressing operation began in the morning with spreading approximately 25 tonnes of superphosphate on nearby farmland which was stored in the fertiliser bins next to the airstrip. As the last of the superphosphate was being spread, a consignment of fresh lime was delivered by a trucking contractor. The topdressing operation continued with the spreading of the lime on another property near the base of the hill range, about three kilometres from the airstrip. At around 1000 hours, while waiting on another delivery of lime by the trucking contractor, the pilot and loader-driver flew in the aircraft to another airstrip about 20 km to the south-east near Broadwood. They repositioned a fertiliser-loading truck located at this airstrip to another airstrip near Pawarenga, in anticipation of the next day’s topdressing. The pilot and loader-driver then flew back to the original farm airstrip near the Pukepoto Quarry, arriving at approximately 1100 hours. At about this time the pilot received a cell phone call from his supervising Chief Pilot. During the conversation he asked the Chief Pilot for his advice about the best direction for spreading lime on the land that he was currently working on. The pilot also commented about how the lime was ‘hanging up’ and not flowing easily from the aircraft’s hopper. The Chief Pilot cautioned the pilot about the poor flow properties of new lime and advised him to spread the lime in line with the hill range, not up the slope. The topdressing operation then resumed until all the lime in the fertiliser bin had been used. The pilot and loader-driver then stopped for lunch during which time the aircraft was refuelled and another truckload of lime was delivered. The pilot had commented to the loader-driver during lunch that the lime was still hanging up in the aircraft’s hopper. He was finding that he needed to complete about two passes to clear the entire load from the hopper. Just before starting the afternoon’s topdressing flights, the pilot had a conversation on his cell phone with a bank manager in Auckland. The conversation concerned the financial position of his topdressing business. The loader-driver reported that the pilot became very agitated during the conversation, but appeared to calm down prior to beginning the afternoon’s flying. The farm-owner observed the aircraft on its first flight of the afternoon as it completed the first two passes. He was aware that the aircraft had flown further away after these two passes and assumed the aircraft was returning to the airstrip for a second load of lime. He did not notice anything abnormal about the aircraft. Other witnesses reported that the aircraft flew parallel with a plantation of 30-40 metre high trees towards the rising hill range. The closest eye witness reported seeing what appeared to be fertiliser dropping from the aircraft as it flew along the tree line up the slope. The dropping of the fertiliser then stopped at which point the aircraft was seen entering a steep right hand turn away from the slope whilst descending towards the ground. The aircraft disappeared in to tall bush on the hillside and witnesses heard the aircraft impact the ground. A large smoke-like cloud was then seen rising up through the bush. On hearing the impact, the farm-owner and a local share-milker from a nearby farm searched the hillside for the aircraft. The aircraft was obscured by the tall bush and was initially difficult to locate. The share-milker made his way down the hillside through the bush to the aircraft. He quickly realised that the pilot was deceased. The farmer-owner went to alert the emergency services, however another property owner who had heard the aircraft strike the ground and seen the smoke had already telephoned the New Zealand Police. The accident occurred in daylight, at approximately 1345 hours NZDT, 9 km south-west of Kaitaia at an elevation of 880 feet AMSL. Latitude: S 35° 10' 26.1\", longitude: E 173° 11' 29.4\"; grid reference: NZMS 260 N05 283698. \n", "probable_cause": "Conclusions:\r\n- The pilot was appropriately licensed and was being supervised as required by Civil Aviation Rules.\r\n- The aircraft had been maintained in accordance with the requirements of Civil Aviation Rules, and had a valid airworthiness certificate.\r\n- There was no evidence that the aircraft had suffered any mechanical problem which may have contributed to the accident.\r\n- The probable initiator of the accident was a hung load of lime which would have limited the climb performance of the aircraft. Factors contributing to the accident were the steep rising terrain and a high tree line which restricted the turning options for the pilot.\r\n- The pilot flew the aircraft into a situation where he had limited recovery options. Due to his limited agricultural flying experience, he may not have appreciated his predicament until it was too late or taken recovery action early enough. The aircraft appears to have aerodynamically stalled during a right hand turn from which there was insufficient height to recover.\r\n- In addition, the pilot’s decision making ability and concentration may have been impaired to some degree by various distractions and fatigue.\r\n- The accident was not survivable.\r\n- The standard sight (observation) window installed on Fletcher aircraft is an impractical method for pilots to monitor the upper level of the hopper contents during flight, particularly with a product like lime which has a higher relative density compared to other fertiliser products. "}