{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690a-lansing-2-killed", "date": "Sep 27, 1993 at 1123 LT", "type": "Rockwell Grand Commander 690", "operator": "Midwest Flying Service", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Lansing - Battle Creek", "msn": "690-11219", "yom": 1974, "flight_number": null, "city": "Lansing-Capital Region", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8790, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4373, "circumstances": "The airplane departed in IMC conditions on an IFR flight plan. Shortly after takeoff the pilot told the departure controller he had '...a problem.' The airplane's flight path was a series of left hand turns while performing descents and ascents. Reports of engine sounds varied from high rpm to low rpm. Many witnesses reported the airplane descending out of, and climbing into, clouds. The airplane was observed in a 45° angle descent, right wing low, as it collided with trees and the ground. The on-scene investigation found an intermittent electric gyro system inverter, a broken filament on the inverter power 'out' light bulb, electrically powered gyro's rotors did not have rotational damage, and a vacuum powered attitude indicator rotor with rotational damage. The pilot's toxicology report stated 45 mg/dl of ethanol detected in his muscle tissue. ", "probable_cause": "The pilot-in-command not maintaining aircraft control during the intermittent operation of the electrically operated attitude gyro. Factor's associated with this accident are an fluctuating (intermittent) electrical system inverter and the pilot-in-command not performing remedial action by using the vacuum powered attitude gyro and other flight instruments once the airplane was making a series of climbs, descents, and heading changes. "}