{"url": "https://www.baaa-acro.com/crash/crash-cessna-525-citationjet-cj1-coupeville", "date": "Jul 22, 2003 at 1015 LT", "type": "Cessna 525 CitationJet CJ1", "operator": "Tango Corporation", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Victoria - Boise", "msn": "525-0147", "yom": 1996, "flight_number": null, "city": "Coupeville", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8500, "captain_hours_type": 2689, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 590, "circumstances": "The corporate jet airplane experienced a loss of elevator trim control (runaway trim) that resulted in an uncommanded nose-low pitch attitude. The pilot reported that following the loss of elevator trim authority the airplane was extremely difficult to control and the elevator control forces were extremely high. The pilot continued to maneuver the airplane, but eventually ditched it into a nearby marine cove. The runaway trim condition was not immediately recognized by the pilot and he stated that, by that point in the event sequence, the control forces were so great that he had little time to troubleshoot the system and elected to continue on his established heading and ditch the airplane. Pulling the circuit breaker, which is called for by the checklist in the event of a trim  runaway, would have arrested the trim movement. Post accident examination and functional testing of the airplane's electric pitch trim printed circuit board (PCB) showed a repeatable fault in the operation of the PCB's K6 relay, resulting in the relay contacts remaining closed. This condition would be representative of the autopilot pitch trim remaining engaged, providing an electrical current to drive continuous nose-down trim to the elevator trim motor. Examination of the airplane's maintenance records showed that the PCB was removed and replaced in conjunction with the\r\nphase inspection prior to the accident. Further examination of the airplane's maintenance records revealed that the replacement PCB was originally installed in an airplane that experienced an \"electric trim runaway on the ground.\" Following the trim runaway, the PCB was removed and shipped to the manufacturer. After receiving the PCB the manufacturer tested the board and no discrepancies were noted. The unit was subsequently approved for return to service and later installed on the accident airplane. The investigation revealed a single-point failure of trim runaway (failed K6 relay) and a latent system design anomaly in the autopilot/trim disconnect switch on the airplane's pitch trim PCB. This design prohibited the disengagement of the electric trim motor during autopilot operation. As a result of the investigation, the FAA issued three airworthiness directives (AD 2003-21-07, AD 2003-23-20, and AD 2004-14-20), and the pitch trim printed circuit board was redesigned and evaluated for compliance with safety requirements via system safety assessment. ", "probable_cause": "The loss of airplane pitch control (trim runway and mistrim condition) resulting from a failure in the airplane's electric pitch trim system. Factors that contributed to the accident were the manufacturer's inadequate design of the pitch trim circuitry that allowed for a single-point failure mode, and the absence of an adequate failure warning system to clearly alert the pilot to the pitch trim runaway condition in sufficient time to respond in accordance with the manufacturer's checklist instructions."}