{"url": "https://www.baaa-acro.com/crash/crash-tupolev-ps-41bis-oktyabrskaya-1-killed", "date": "Feb 13, 1941 at 1505 LT", "type": "Tupolev ANT-40 (PS-40/PS-41)", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Postal (mail)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Leningrad - Moscow", "msn": "2/300", "yom": 1940, "flight_number": null, "city": "Oktyabrskaya", "zone": "Leningrad oblast", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 260, "circumstances": "Prior to takeoff from Leningrad, the pilot was informed about weather conditions and instructed to fly not above 600 metres. The airplane departed Leningrad Airport at 1320LT on a mail flight to Moscow with two crew members on board. Shortly after takeoff, the pilot was forced to return due to an oil leak on the right tank. After repairs, the airplane took off again at 1435LT. The pilot continued at an altitude of 500-600 metres when the airplane entered clouds. Due to turbulence, the pilot decided to climb until 2,500 metres then 3,000 metres. Later, while descending, the airplane' speed increased from 270 km/h to 400 km/h and it became unstable. The flight engineer has been shaken from left to right and tried to get a radio contact with the pilot. As this was unsuccessful, he abandoned the airplane and bailed out. He was later found uninjured. The airplane continued its descent and the pilot also attempted to bail out but this was too late. His parachute failed to open in time and he was killed. The airplane crashed in a wooded area located in Oktyabrskaya, some 100 km east of Leningrad and was destroyed.", "probable_cause": "Lack of discipline on part of the pilot who disregarded the instructions related to the max altitude to respect and his decision to fly against the published procedures. "}