{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90a-king-air-idaho-falls", "date": "Sep 19, 2013 at 1553 LT", "type": "Beechcraft 90 King Air", "operator": "We Fly", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pocatello – Idaho Falls", "msn": "LJ-1223", "yom": 1989, "flight_number": null, "city": "Idaho Falls", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3975, "captain_hours_type": 2500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4468, "circumstances": "The airplane was equipped with two main fuel tanks (132 usable gallons each) and two nacelle fuel tanks (60 usable gallons each). In normal operation, fuel from each nacelle tank is supplied to its respective engine, and fuel is automatically transferred from each main tank to its respective nacelle tank. While at the airplane's home airport, the pilot noted that the cockpit fuel quantity gauges indicated that the nacelle tanks were full, and he believed that the main tanks had fuel sufficient for 30 minutes of flight. The pilot did not verify by any other means the actual fuel quantity in any of the tanks. Thirty gallons of fuel were added to each main tank; they were not topped off. The airplane, with two passengers, then flew to an interim stop about 45 miles away, where a third passenger boarded. The airplane then flew to its destination, another 165 miles away. The pilot reported that, at the destination airport, he noted that the cockpit fuel quantity gauges indicated that the nacelle tanks were full; he surmised that the main fuel tanks were not empty but did not note the actual quantity of fuel. Forty gallons of fuel were added to each main tank. Again, the main tanks were not topped off, and the pilot did not verify by any other means the actual fuel quantity in any of the tanks. The return flight to the interim stop was uneventful. The third passenger deplaned there, and the airplane departed for its home airport. While on final approach to the home airport, both engines stopped developing power, and the pilot conducted a forced landing to a field about 1.2 miles short of the runway. The pilot later reported that, at the time of the power loss, the fuel quantity gauges indicated that there was still fuel remaining in the airplane. Postaccident examination of the airplane revealed that all four fuel tanks were devoid of fuel. The examination did not reveal any preimpact mechanical anomalies, including fuel leaks, that would have precluded continued flight. The airplane manufacturer conducted fuel-consumption calculations for each of the two city pairs. Because the pilot did not provide any information regarding flight routes, altitudes, speeds, or times for any of the flight segments, the manufacturer's calculations were based on direct routing in zero-wind conditions, nominal airplane and engine performance, and assumed cruise altitudes and speeds. Although the results are valid for these input parameters, variations in any of the input parameters can significantly affect the calculated fuel requirements. As a result, although the manufacturer's calculations indicated that the round trip would have burned less fuel than the total available fuel quantity that was derived from the pilot-provided information, the lack of any definitive information regarding the actual flight parameters limited the utility of the calculated value and the comparison. The manufacturer's calculations indicated that the accident flight leg (from the interim airport to the home airport) would have consumed about 28.5 gallons total. Given that the airplane was devoid of fuel at the accident site, the pilot likely departed the interim airport with significantly less than the manufacturer's minimum allowable departure fuel quantity of about 39.5 gallons per side. The lack of any observed preimpact mechanical problems with the airplane, combined with the lack of objective or independently substantiated fuel quantity information, indicates that the airplane's fuel exhaustion was due to the pilot's inadequate and improper pre- and inflight fuel planning and procedures. ", "probable_cause": "The pilot's inadequate preflight fuel planning, which resulted in departure with insufficient fuel to complete the flight, and consequent inflight power loss due to fuel exhaustion."}