{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-novopokrovskoye-2-killed", "date": "Jun 30, 2016 at 0604 LT", "type": "PZL-Mielec AN-2", "operator": "KKLUGA", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Novopokrovskoye - Novopokrovskoye", "msn": "1G228-12", "yom": 1988, "flight_number": null, "city": "Novopokrovskoye", "zone": "Saratov oblast", "country": "Russia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4398, "captain_hours_type": 2140, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3370, "circumstances": "The airplane was engaged in a crop spraying mission, carrying a load of herbicides, one passenger and one pilot. In the early morning, while completing a seventh low pass, at a height of about 20-40 metres, the pilot initiated a left turn when the aircraft descended to the ground and crashed at a speed of 140 km/h in an open field, bursting into flames. The aircraft was destroyed by impact forces and a post crash fire and both occupants were killed. ", "probable_cause": "Fatal accident with Аn-2 RA-33462 agricultural aircraft occurred during aerial works on crop-dusting and was caused most probably by the piloting error consisting in unintentional descent when performing a turn for the next crop-dusting round which resulted in the aircraft controlled flight into terrain.  \r\nMost probably, the following factors contributed to the accident:\r\n- The PIC not trained for crop-dusting flight without first officer,\r\n- The PIC conducting the flight with a passenger on first-officer’s seat,\r\n- The presence of alcohol in PIC's and the passenger's bodies,\r\n- A possible transfer of the aircraft control from PIC to the passenger (former An-2 pilot) made by PIC,\r\n- Violations of An-2 AFM and FAR-128 requirements on maintaining heights, bank angles during turns and flight speed while crop-dusting,\r\n- Krasny Kut Civil Aviation Flight School management not controlling crop-dusting operations at the fields."}